{
  "word": "horn",
  "etymologies": [
    {
      "description": [
        "From Middle English horn, horne, from Old English horn, from Proto-West Germanic *horn, from Proto-Germanic *hurną. Compare West Frisian hoarn, Dutch hoorn, Low German Hoorn, horn, German Horn, Danish and Swedish horn, Gothic 𐌷𐌰𐌿𐍂𐌽 (haurn).",
        "Ultimately from Proto-Indo-European *ḱr̥h₂-nó-m, from *ḱerh₂- (“head, horn”). Compare Breton kern (“horn”), Latin cornū, Ancient Greek κέρας (kéras), Proto-Slavic *sьrna, Old Church Slavonic сьрна (sĭrna, “roedeer”), Hittite [script needed] (surna, “horn”), Persian سر‎ (sar), Sanskrit शृङ्ग (śṛṅga, “horn”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "horn (countable and uncountable, plural horns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A hard growth of keratin that protrudes from the top of the head of certain animals, usually paired.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any similar real or imaginary growth or projection such as the elongated tusk of a narwhal, the eyestalk of a snail, the pointed growth on the nose of a rhinoceros, or the hornlike projection on the head of a demon or similar.",
                  "examples": [
                    "But nowhere are there queerer waters than in our own parish of Caulds, at the place called the Sker Bay, where between two horns of land a shallow estuary receives the stream of the Sker."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An antler.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The hard substance from which animals' horns are made, sometimes used by man as a material for making various objects.",
                  "examples": [
                    "Synonym: keratin",
                    "an umbrella with a handle made of horn"
                  ]
                }
              ]
            },
            {
              "group": "An object whose shape resembles a horn, such as cornucopia, the point of an anvil, or a vessel for gunpowder or liquid.",
              "entries": [
                {
                  "meaning": "The high pommel of a saddle; also, either of the projections on a lady's saddle for supporting the leg.",
                  "examples": []
                },
                {
                  "meaning": "(architecture) The Ionic volute.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) The outer end of a crosstree; also, one of the projections forming the jaws of a gaff, boom, etc.",
                  "examples": []
                },
                {
                  "meaning": "(carpentry) A curved projection on the fore part of a plane.",
                  "examples": []
                },
                {
                  "meaning": "One of the projections at the four corners of the Jewish altar of burnt offering.",
                  "examples": [
                    "Joab  […]  caught hold on the horns of the altar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any of several musical wind instruments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, music) An instrument resembling a musical horn and used to signal others.",
                  "examples": [
                    "hunting horn"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, automotive) A loud alarm, especially one on a motor vehicle.",
                  "examples": [
                    "Synonyms: hooter, klaxon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly sports) A sound signaling the expiration of time.",
                  "examples": [
                    "The shot was after the horn and therefore did not count."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A conical device used to direct waves.",
                  "examples": [
                    "Synonym: funnel",
                    "antenna horn",
                    "loudspeaker horn"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, music, countable) Generally, any brass wind instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, countable, from the horn-shaped earpieces of old communication systems that used air tubes) A telephone.",
                  "examples": [
                    "Synonyms: blower (UK), dog and bone (Cockney rhyming slang), phone",
                    "Get him on the horn so that we can have a discussion about this."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, vulgar, slang, definite article) An erection of the penis.",
                  "examples": [
                    "Synonyms: boner (US), hard-on, stiffy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, geography) A peninsula or crescent-shaped tract of land.",
                  "examples": [
                    "Synonym: peninsula",
                    "to navigate around the horn"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A diacritical mark that may be attached to the top right corner of the letters o and u when writing in Vietnamese, thus forming ơ and ư.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) An incurved, tapering and pointed appendage found in the flowers of the milkweed (Asclepias).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) In naval mine warfare, a projection from the mine shell of some contact mines which, when broken or bent by contact, causes the mine to fire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "horn (third-person singular simple present horns, present participle horning, simple past and past participle horned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of an animal) To assault with the horns.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with horns.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, obsolete) To cuckold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}