{
  "word": "lavatory",
  "etymologies": [
    {
      "description": [
        "From Middle English lavatorie, from Late Latin lavātōrium, from Latin lavāre (“to wash”) + -ium (forming places related to an activity). Doublet of lavatorium. As a place to pan gold, via Spanish lavadero. See also lave."
      ],
      "adjectives": [
        {
          "description": "lavatory (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Washing, or cleansing by washing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lavatory (plural lavatories)",
          "definitionGroups": [
            {
              "group": "A vessel or fixture for washing, particularly:",
              "entries": [
                {
                  "meaning": "A laver: a washbasin.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) A bathtub.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A piscina: the basin used for washing communion vessels.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A lavabo: the basin used for washing one's hands before handling the Eucharist.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity, usually figurative) A baptismal font: the basin used for baptism, used figuratively for the washing away of sins.",
                  "examples": []
                },
                {
                  "meaning": "(construction, interior design) A plumbing fixture used for washing: a sink.",
                  "examples": [
                    "Their 'bathroom' included a toilet and a lavatory but no bath."
                  ]
                }
              ]
            },
            {
              "group": "Handwashing as an act, particularly",
              "entries": [
                {
                  "meaning": "(Christianity) The lavabo: the ritual washing of hands before handling the eucharist.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) The ritual washing of hands after using the piscina to clean the communion vessels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A liquid used in washing; a lotion; a wash; a rinse.",
                  "examples": [
                    "They must be wasshed wyth wyne or wyth some other lauatorye."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A washroom: a room used for washing the face and hands.",
                  "examples": [
                    "Even the lavatory, a vestibule to the refectory through which the novices would pass on their way to the recreation room, boasted a painting cycle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) A room containing a toilet: a bathroom (US) or WC (UK).",
                  "examples": [
                    "Americans don't know 'WC' and Brits mock 'bathroom' but everyone usually understands 'toilet' or 'lavatory'."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, New England) A plumbing fixture for urination and defecation: a toilet.",
                  "examples": [
                    "In a traditional German lavatory, the hole in which shit disappears after we flush water is way in front, so that the shit is first laid out for us to sniff at and inspect for traces of some illness; in the typical French lavatory, on the contrary, the hole is in the back - that is, the shit is supposed to disappear as soon as possible; finally, the Anglo-Saxon (English or American) lavatory presents a kind of synthesis, a mediation between these two opposed poles - the basin is full of water so that the shit floats in it - visible, but not to be inspected."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A place to wash clothes: a laundry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A place where gold is panned.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A paved room in a mortuary where corpses are kept under a shower of disinfecting fluid.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}