{
  "word": "oath",
  "etymologies": [
    {
      "description": [
        "From Middle English ooth, oth, ath, from Old English āþ (“oath”), from Proto-West Germanic *aiþ (“oath”), from Proto-Germanic *aiþaz (“oath”), from Proto-Indo-European *h₁óytos (“oath”).",
        "Cognate with Scots aith, athe (“oath”), North Frisian ith, iss (“oath”), West Frisian eed (“oath”), Dutch eed (“oath”), German Eid (“oath”), Swedish ed (“oath”), Icelandic eið (“oath”), Latin ūtor (“use, employ, avail”), Old Irish óeth (“oath”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "oath (plural oaths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A solemn pledge or promise that invokes a deity, a ruler, or another entity (not necessarily present) to attest the truth of a statement or sincerity of one's desire to fulfill a contract or promise.",
                  "examples": [
                    "take an oath",
                    "swear an oath",
                    "break one's oath"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A statement or promise which is strengthened (affirmed) by such a pledge.",
                  "examples": [
                    "After taking the oath of office, she became the country's forty-third premier.",
                    "The generals swore an oath of loyalty to the country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light, irreverent or insulting appeal to a deity or other entity.",
                  "examples": [
                    ""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A curse, a curse word.",
                  "examples": [
                    "The farther from the Senator's office, the darker and older the furniture, the freer fly four-letter oaths, the higher the heaps of unfiled and unattended papers culminating in a frenzy of pulp in the press section […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "oath (third-person singular simple present oaths, present participle oathing, simple past and past participle oathed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To pledge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}