{
  "word": "chalk",
  "etymologies": [
    {
      "description": [
        "From Middle English chalk, chalke, from Old English ċealc, from Proto-West Germanic *kalk, borrowed from Latin calx (“limestone”), again borrowed from Ancient Greek χάλιξ (khálix, “pebble”). Doublet of calx and cauk."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chalk (countable and uncountable, plural chalks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A soft, white, powdery limestone (calcium carbonate, CaCO3).",
                  "examples": [
                    "chalk cliffs are not recommended for climbing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A piece of chalk, or nowadays processed compressed gypsum (calcium sulfate, CaSO4), that is used for drawing and for writing on a blackboard (chalkboard).",
                  "examples": [
                    "the chalk used to write on the blackboard makes a squeaky sound"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Tailor's chalk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, climbing, gymnastics) A white powdery substance used to prevent hands slipping from holds when climbing, or losing grip in weight-lifting or gymnastics, sometimes but not always limestone-chalk, often magnesium carbonate (MgCO3).",
                  "examples": [
                    "when working out your next move, it's a good idea to get some more chalk from the bag"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, countable) A platoon-sized group of airborne soldiers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, sports, chiefly basketball, horseracing) The favorite in a sporting event.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, sports, chiefly basketball) The prediction that there will be no upsets, and the favored competitor will win.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chalk (third-person singular simple present chalks, present participle chalking, simple past and past participle chalked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To apply chalk to anything, such as the tip of a billiard cue.",
                  "examples": [
                    "chalk your hands before climbing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To record something, as on a blackboard, using chalk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use powdered chalk to mark the lines on a playing field.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To record a score or event, as if on a chalkboard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To manure (land) with chalk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make white, as if with chalk; to make pale; to bleach.",
                  "examples": [
                    "Let a bleak paleness chalk the door."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}