{
  "word": "savour",
  "etymologies": [
    {
      "description": [
        "From Middle English savour, from Old French savour, from Latin sapor (“taste, flavor”), from sapiō (“taste of, have a flavor of”). Doublet of sapor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "savour (plural savours) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The specific taste or smell of something.",
                  "examples": [
                    "Little disappointed, then, she turned attention to \"Chat of the Social World,\" gossip which exercised potent fascination upon the girl's intelligence. She devoured with more avidity than she had her food those pretentiously phrased chronicles of the snobocracy  […]  distilling therefrom an acid envy that robbed her napoleon of all its savour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distinctive sensation.",
                  "examples": [
                    "Why is not my life a continual joy, and the savour of heaven perpetually upon my spirit?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sense of smell; power to scent, or trace by scent.",
                  "examples": [
                    "beyond my savour"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pleasure; appreciation; relish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English savour, from Old French savourer, from savour, or possibly Late Latin sapōrāre, present active infinitive of sapōrō, from sapor (“taste, flavor”), from sapiō (“taste of, have a flavor of”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "savour (third-person singular simple present savours, present participle savouring, simple past and past participle savoured) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To possess a particular taste or smell, or a distinctive quality.",
                  "examples": [
                    "I have rejected everything that savours of party."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To appreciate, enjoy or relish something.",
                  "examples": [
                    "He closed his eyes so he could really savour his dessert."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To season.",
                  "examples": [
                    "[…]  divers sorts of fish; some baked in bread, some broiled on the coals, some seethed, some in gravy savoured with spices, and all with condiments so cunning that it caused him delight."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}