{
  "word": "recover",
  "etymologies": [
    {
      "description": [
        "From Middle English recoveren, rekeveren, from Anglo-Norman recoverer and Old French recovrer, from Latin recuperāre, from earlier reciperāre. Doublet of recuperate and recoup."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "recover (plural recovers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Recovery. [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A position of holding a firearm during exercises, whereby the lock is at shoulder height and the sling facing out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) The forward movement in rowing, after one stroke to take another (recovery)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "recover (third-person singular simple present recovers, present participle recovering, simple past and past participle recovered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To get back, to regain (a physical thing; in astronomy and navigation, sight of a thing or a signal).",
                  "examples": [
                    "After days of inquiries, he finally recovered his lost wallet.",
                    "For days telescopes surveyed the skies to recover the small asteroid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to salvage, to extricate, to rescue (a thing or person)",
                  "examples": [
                    "They recovered three of the explorers very much alive, then another, wracked with severe hypothermia, who was taken to hospital."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To replenish to, resume (a good state of mind or body).",
                  "examples": [
                    "At the top of the hill I asked to stop for a few minutes to recover my strength."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, law) To obtain a positive judgement; to win in a lawsuit.",
                  "examples": [
                    "The plaintiff recovered in his suit, being awarded declaratory relief and a clearing of his name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To gain as compensation or reparation, usually by formal legal process",
                  "examples": [
                    "to recover damages in trespass; to recover debt and costs in a legal action or that is owing",
                    "to recover lands in ejectment or common recovery"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To reach (a place), arrive at.",
                  "examples": [
                    "Except he could recover one of the Cities of Refuge he was to die."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To restore to good health, consciousness, life etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To make good by reparation; to make up for; to retrieve; to repair the loss or injury of.",
                  "examples": [
                    "to recover lost time"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To regain one's composure, balance etc.",
                  "examples": [
                    "Spinning round, he caught a stone with his ankle, but recovered quickly before turning to face me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, followed by \"from\" to show what caused the bad feeling) To get better, to regain health or prosperity.",
                  "examples": [
                    "I was hurt, but I knew I’d recover, given time.",
                    "Without calling in Business Recovery experts, the company saw trade and investor confidence recover sharply in the wake of the crisis.",
                    "I lost out in the deal, but I quickly recovered financially",
                    "It takes time and good health to recover from injury, surgery, a bereavement and emotional turmoil"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, without \"from\") to recover from",
                  "examples": [
                    "To the end of his days, he never fully recovered his daughter's death."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "re- +‎ cover."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "recover (third-person singular simple present recovers, present participle recovering, simple past and past participle recovered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover again.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(roofing) To add a new roof membrane or steep-slope covering over an existing one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}