{
  "word": "demon",
  "etymologies": [
    {
      "description": [
        "From Middle English demon, a borrowing from Medieval Latin dēmōn, daemōn (“lar, familiar spirit, guardian spirit”), from Ancient Greek δαίμων (daímōn, “dispenser, god, protective spirit”). Doublet of daimon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "demon (plural demons)",
          "definitionGroups": [
            {
              "group": "An evil supernatural spirit.",
              "entries": [
                {
                  "meaning": "An evil spirit resident in or working for Hell; a devil. [from 10th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now chiefly historical) A false god or idol; a Satanic divinity. [from 10th c.]",
                  "examples": []
                },
                {
                  "meaning": "A very wicked or malevolent person; also (in weakened sense) a mischievous person, especially a child. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "A source (especially personified) of great evil or wickedness; a destructive feeling or character flaw. [from 17th c.]",
                  "examples": [
                    "The demon of stupidity haunts me whenever I open my mouth."
                  ]
                },
                {
                  "meaning": "(in the plural) A person's fears or anxieties. [from 19th c.]",
                  "examples": [
                    "After a short spell on an adult psychiatric ward, she decided to find her own way to deal with her demons."
                  ]
                }
              ]
            },
            {
              "group": "A neutral supernatural spirit.",
              "entries": [
                {
                  "meaning": "A person's inner spirit or genius; a guiding or creative impulse. [from 14th c.]",
                  "examples": [
                    "“You saw her. And I picked her up,” Lyra said, blushing, because of course it was a gross violation of manners to touch something so private as someone else's dæmon."
                  ]
                },
                {
                  "meaning": "(Greek mythology) A tutelary deity or spirit intermediate between the major Olympian gods and mankind, especially a deified hero or the entity which supposedly guided  Socrates, telling him what not to do. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "A spirit not considered to be inherently evil; a (non-Christian) deity or supernatural being. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A hypothetical entity with special abilities postulated for the sake of a thought experiment in philosophy or physics.",
                  "examples": [
                    "Let the orders now be that each demon is to stop all molecules from crossing his area in either direction except 100 coming from A, arbitrarily chosen to be let pass into B, and a greater number, having among them less energy but equal momentum, to cross from B to A."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone with great strength, passion or skill for a particular activity, pursuit etc.; an enthusiast. [from 19th c.]",
                  "examples": [
                    "He’s a demon at the card tables."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A type of patience or solitaire (card game) played in the UK and/or US. [from 19th c.]",
                  "examples": [
                    "Coordinate term: Canfield"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various hesperiid butterflies of the genera Notocrypta and Udaspes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}