{
  "word": "possess",
  "etymologies": [
    {
      "description": [
        "From Middle English possessen (“to have, own; to obtain possession of; to inhabit, occupy”) [and other forms], from Middle French possesser, possessier, Old French possesser, possessier (“to have, own, possess; to dominate”), from Latin possessus (“possessed; seized”), the perfect passive participle of possideō (“to have, hold, own, possess; to have possessions; to take control or possession of, occupy, seize; to abide, inhabit, occupy; to dominate”), from potis (“able, capable, possible”) (from Proto-Indo-European *pótis (“master; ruler; husband”)) + sedeō (“to sit; to be seated; to be established, hold firm”) (ultimately from Proto-Indo-European *sed- (“to sit”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "possess (third-person singular simple present possesses, present participle possessing, simple past and past participle possessed)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To have (something) as, or as if as, an owner; to have, to own.",
                  "examples": [
                    "Synonym: inhold",
                    "He does not even possess a working telephone."
                  ]
                },
                {
                  "meaning": "Of an idea, thought, etc.: to dominate (someone's mind); to strongly influence.",
                  "examples": []
                },
                {
                  "meaning": "Of a supernatural entity, especially one regarded as evil: to take control of (an animal or person's body or mind).",
                  "examples": [
                    "They thought he was possessed by evil spirits."
                  ]
                },
                {
                  "meaning": "(also reflexive, chiefly literary and poetic) Of a person: to control or dominate (oneself or someone, or one's own or someone's heart, mind, etc.).",
                  "examples": []
                },
                {
                  "meaning": "To dominate (a person) sexually; to have sexual intercourse with (a person).",
                  "examples": []
                },
                {
                  "meaning": "(archaic)",
                  "examples": [
                    "What on earth possessed you to go walking by the quarry at midnight?"
                  ]
                },
                {
                  "meaning": "To cause an idea, thought, etc., to strongly affect or influence (someone); to inspire, to preoccupy.",
                  "examples": [
                    "What on earth possessed you to go walking by the quarry at midnight?"
                  ]
                },
                {
                  "meaning": "To occupy the attention or time of (someone).",
                  "examples": []
                },
                {
                  "meaning": "(also literary) To obtain or seize (something); to gain, to win.",
                  "examples": []
                },
                {
                  "meaning": "(also reflexive) Chiefly followed by of or with: to vest ownership of something in (oneself or someone); to bestow upon, to endow.",
                  "examples": [
                    "Synonym: seise",
                    "Antonyms: dispossess, unpossess"
                  ]
                },
                {
                  "meaning": "(law) To have control or possession of, but not to own (a chattel or an interest in land).",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To give (someone) information or knowledge; to acquaint, to inform.",
                  "examples": []
                },
                {
                  "meaning": "To have the ability to use, or knowledge of (a language, a skill, etc.)",
                  "examples": []
                },
                {
                  "meaning": "To inhabit or occupy (a place).",
                  "examples": []
                },
                {
                  "meaning": "Chiefly followed by that: to convince or persuade (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To dominate sexually; to have sexual intercourse with.",
                  "examples": []
                },
                {
                  "meaning": "To inhabit or occupy a place.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}