{
  "word": "beagle",
  "etymologies": [
    {
      "description": [
        "Origin uncertain, possibly a corruption of beadle in the sense of \"constable, detective\" (for the change of /dəl/ to /ɡəl/, compare turkle, dialectal variant of turtle); or alternatively from Middle French beegueule (“gaping throat, noisy person, whiner”), from Old French beer (variation of Old French bayer) + Old French gueule. The French bigle is from the English."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "beagle (plural beagles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small short-legged smooth-coated scenthound, often tricolored and sometimes used for hunting hares. Its friendly disposition makes it suitable as a family pet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who snoops on others; a detective.",
                  "examples": [
                    "[…] whereas burying a body in the wooded area beyond the backyard was the quickest way to make a Nassau County Police Department beagle look good."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bailiff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small kind of shark.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "beagle (third-person singular simple present beagles, present participle beagling, simple past and past participle beagled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hunt with beagles.",
                  "examples": [
                    "[…]  reading men who beagled for fresh air and exercise, impecunious hunting men who beagled for economy […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To search.",
                  "examples": [
                    "[…] Pope clapped his hand to his forehead and beagled like a maniac; he had clean forgotten Thorofare Gap."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}