{
  "word": "judge",
  "etymologies": [
    {
      "description": [
        "From Middle English juge, jugge, borrowed from Old French juge, from Latin iūdex. Displaced native Old English dēma."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "judge (plural judges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A public official whose duty it is to administer the law, especially by presiding over trials and rendering judgments; a justice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who decides the fate of someone or something that has been called into question.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person officiating at a sports event, a contest, or similar.",
                  "examples": [
                    "At a boxing match, the decision of the judges is final."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who evaluates something or forms an opinion.",
                  "examples": [
                    "She is a good judge of wine.",
                    "They say he is a poor judge of character considering all the unreliable friends he has made."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, biblical) A shophet, a temporary leader appointed in times of crisis in ancient Israel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English jugen, borrowed from Anglo-Norman juger, from Old French jugier, from Latin iūdicāre.",
        "Mostly displaced native deem."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "judge (third-person singular simple present judges, present participle judging, simple past and past participle judged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sit in judgment on; to pass sentence on (a person or matter).",
                  "examples": [
                    "A higher power will judge you after you are dead."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To sit in judgment, to act as judge.",
                  "examples": [
                    "Justices in this country judge without appeal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To judicially rule or determine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To sentence to punishment, to judicially condemn.",
                  "examples": [
                    "He was judged to die for his crimes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To award judicially; to adjudge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form an opinion on; to appraise.",
                  "examples": [
                    "I judge a man’s character by the cut of his suit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To constitute a fitting appraisal or criterion of; to provide a basis for forming an opinion on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To arbitrate; to pass opinion on something, especially to settle a dispute etc.",
                  "examples": [
                    "We cannot both be right: you must judge between us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have as an opinion; to consider, suppose.",
                  "examples": [
                    "I judge it safe to leave the house once again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To form an opinion; to infer.",
                  "examples": [
                    "I judge from the sky that it might rain later."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To criticize or label another person or thing.",
                  "examples": [
                    "There's something wrong with the world today; the light bulb's getting dim.",
                    "There's meltdown in the sky.",
                    "If you can judge a wise man by the color of his skin,",
                    "Mister, you're a better man than I"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To govern as biblical judge or shophet (over some jurisdiction).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}