{
  "word": "translative",
  "etymologies": [
    {
      "description": [
        "From Latin translativus (“that is to be transferred”). Compare French translatif."
      ],
      "adjectives": [
        {
          "description": "translative (comparative more translative, superlative most translative)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, or relating to the movement of a person or thing from one place to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, or relating to the translation of language.",
                  "examples": [
                    "Which suiting the case so well, you’ll forgive me, Sir, for popping down in English metre, as the translative impulse (pardon a new word, and yet we scholars are not fond of authenticating new words) came upon me uncalled for:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Of, or relating to the translative case.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) In the form of a trope; figurative.",
                  "examples": [
                    "But properly and in his principall vertue Allegoria is when we do speake in sence translatiue and wrested from the owne signification, neuerthelesse applied to another not altogether contrary, but hauing much conueniencie with it as before we said of the metaphore: as for example if we should call the common wealth, a shippe; the Prince a Pilot, the Counsellours mariners, the stormes warres, the calme and [hauen] peace, this is spoken in allegorie  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "translative (plural translatives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The translative case.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A word in the translative case.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}