{
  "word": "aim",
  "etymologies": [
    {
      "description": [
        "The verb is from Middle English amen, aimen, eimen (“to guess at, to estimate, to aim”), borrowed from Old French esmer, aesmer, asmer, from Latin ad- plus aestimare (“to estimate”), the compound perhaps being originally formed in Medieval Latin (adaestimare), perhaps in Old French.\nThe noun is from Middle English ame, from Old French aesme, esme."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "aim (plural aims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The pointing of a weapon, as a gun, a dart, or an arrow, or object, in the line of direction with the object intended to be struck; the line of fire; the direction of anything, such as a spear, a blow, a discourse, a remark, towards a particular point or object, with a view to strike or affect it.",
                  "examples": [
                    "Take time with the aim of your gun.",
                    "to take aim"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The point intended to be hit, or object intended to be attained or affected.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Intention or goal",
                  "examples": [
                    "My number one aim in life is to make money to make my parents, siblings and kids happy.",
                    "Synonyms: purpose, design, scheme"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability of someone to aim straight; one's faculty for being able to hit a physical target",
                  "examples": [
                    "The police officer has excellent aim, always hitting the bullseye in shooting practice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Conjecture; guess.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "aim (third-person singular simple present aims, present participle aiming, simple past and past participle aimed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To point or direct a missile, or a weapon which propels as missile, towards an object or spot with the intent of hitting it",
                  "examples": [
                    "He aimed at the target, but the arrow flew straight over it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To direct the intention or purpose; to attempt the accomplishment of a purpose; to try to gain; to endeavor;—followed by at, or by an infinitive",
                  "examples": [
                    "to aim at a pass",
                    "to aim to do well in life"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To direct or point (e.g. a weapon), at a particular object; to direct, as a missile, an act, or a proceeding, at, to, or against an object",
                  "examples": [
                    "to aim an arrow at the deer",
                    "She aimed a punch at her ex-boyfriend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To direct (something verbal) towards a certain person, thing, or group",
                  "examples": [
                    "to aim a satirical comment at Communists in general"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To guess or conjecture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "aim",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Initialism of America Online. AIM; AOL Instant Messenger.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}