{
  "word": "spruce",
  "etymologies": [
    {
      "description": [
        "From Middle English Spruce, an alteration of Pruce (“Prussia”), from Medieval Latin, from a Baltic language, probably Old Prussian; for more, see Prussia. Spruce, spruse (1412), and Sprws (1378) were terms for commodities brought to England by Hanseatic merchants (beer, wood, leather). The tree with this name was also believed to have been native to Prussia. The adjective and verb senses (\"trim, neat\" and \"to make trim, neat\") are attested from 1594, and originate with spruce leather (1466), which was used to make a popular style of jerkins in the 1400s that was considered smart-looking."
      ],
      "adjectives": [
        {
          "description": "spruce (comparative sprucer, superlative sprucest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Smart, trim, and elegant in appearance; fastidious (said of a person).",
                  "examples": [
                    "He had great neatness of person, and he continued to wear his spruce black coat and his bowler hat, always a little too small for him, in a dapper, jaunty manner."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "spruce (countable and uncountable, plural spruces or spruce)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various large coniferous evergreen trees or shrubs from the genus Picea, found in northern temperate and boreal regions; originally and more fully spruce fir.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The wood of a spruce.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(used attributively) Made of the wood of the spruce.",
                  "examples": [
                    "That spruce table is beautiful!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Prussian leather; pruce.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spruce (third-person singular simple present spruces, present participle sprucing, simple past and past participle spruced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with up) To arrange neatly; tidy up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, usually with up) To make oneself spruce (neat and elegant in appearance).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To tease.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}