{
  "word": "drown",
  "etymologies": [
    {
      "description": [
        "From Middle English drownen, drounen, drunen (“to drown”), of obscure and uncertain origin.",
        "The OED suggests an unattested Old English form *drūnian . Harper 2001 points to Old English druncnian, ġedruncnian (> Middle English drunknen, dronknen (“to drown”)), \"probably influenced\" by Old Norse drukkna (cf. Icelandic drukkna, Danish drukne (“to drown”)) . Funk & Wagnall's has 'of uncertain origin'. It has been theorised (see e.g. ODS)  that it may represent a direct loan of Old Norse drukkna, but this is described by the OED as being \"on phonetic and other grounds [...] highly improbable\" , unless one considers the possibility of an unattested variant in Old Norse *drunkna."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "drown (third-person singular simple present drowns, present participle drowning, simple past and past participle drowned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To die from suffocation while immersed in water or other fluid.",
                  "examples": [
                    "When I was a baby, I nearly drowned in the bathtub."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To kill by suffocating in water or another liquid.",
                  "examples": [
                    "The car thief fought with an officer and tried to drown a police dog before being shot while escaping."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be flooded: to be inundated with or submerged in (literally) water or (figuratively) other things; to be overwhelmed.",
                  "examples": [
                    "We are drowning in information but starving for wisdom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To inundate, submerge, overwhelm.",
                  "examples": [
                    "He drowns his sorrows in buckets of chocolate ice cream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative, usually passive) To obscure, particularly amid an overwhelming volume of other items.",
                  "examples": [
                    "The answers intelligence services seek are often drowned in the flood of information they can now gather."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}