{
  "word": "asperity",
  "etymologies": [
    {
      "description": [
        "From Middle English asprete, asperite, from Old French aspreté, from Latin asperitās, from asper (“rough”). Doublet of asperitas."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "asperity (countable and uncountable, plural asperities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality of being harsh or severe in the way one speaks or behaves toward people.",
                  "examples": [
                    "Synonyms: acerbity, harshness, severity, sharpness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality of being difficult or unpleasant to experience.",
                  "examples": [
                    "Synonyms: harshness, rigour, severity",
                    "the asperity of Maine’s winter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality of having a rough or uneven surface.",
                  "examples": [
                    "Synonyms: bumpiness, roughness, ruggedness, unevenness",
                    "Antonym: smoothness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something that is harsh and difficult to endure.",
                  "examples": [
                    "Whence comes it, that in Christendome there has been, almost from the time of the Apostles, such justling of one another out of their places, both by forraign, and Civill war? such stumbling at every little asperity of their own fortune, and every little eminence of that of other men?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An area that protrudes from a surface.",
                  "examples": [
                    "Synonyms: bump, protuberance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, geology) A section of a fault line with high friction, such that there is no movement along this part of the fault except during an earthquake. [since 1981]",
                  "examples": [
                    "We inferred that the locking of asperities did cause higher stresses associated with earthquake cycle itself to occur in areas adjacent to asperities, both updip and downdip from them, and that such stressing has been much less pronounced  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}