{
  "word": "grapnel",
  "etymologies": [
    {
      "description": [
        "From Middle English grapnel, from Anglo-Norman, from Old French grapil, grapin. Compare modern French grappin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grapnel (plural grapnels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A small anchor, having more than two flukes, used for anchoring a small vessel.",
                  "examples": [
                    "At dawn of day we got on shore, and tracked the boat into shelter; for the wind blowing fresh without, and the ground being rocky, I was afraid to trust her at a grapnel, lest she might be blown to sea: I was, therefore, obliged to let her ground in the course of the ebb."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device with a multiple hook at one end and attached to a rope, which is thrown or hooked over a firm mooring to secure an object attached to the other end of the rope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A grappling iron.",
                  "examples": [
                    "[…]  the wind dying away, the signal was made for casting anchor, when both ships came to in 26 fathom water; but the Resolution expecting to come to with her small stream anchor, let the whole run out, and lost both anchor and hauser, besides the ship’s grapnel in looking for it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grapnel (third-person singular simple present grapnels, present participle grapnelling, simple past and past participle grapnelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To connect (ships) with a grapnel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}