{
  "word": "abate",
  "etymologies": [
    {
      "description": [
        "From Middle English abaten, from Anglo-Norman abatre, from Late Latin abbattere, from Latin battere.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "abate (countable and uncountable, plural abates) (obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Abatement; reduction; (countable) an instance of this. [15th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Deduction; subtraction; (countable) an instance of this. [17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "abate (third-person singular simple present abates, present participle abating, simple past and past participle abated)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To lessen (something) in force or intensity; to moderate. [from 14th c.]",
                  "examples": [
                    "Synonyms: alleviate, assuage, diminish, lower, mitigate, relax, remit, temper",
                    "Antonyms: aggravate, amplify, augment, enhance, foment, increase, intensify, magnify, raise"
                  ]
                },
                {
                  "meaning": "To reduce (something) in amount or size. [from 14th c.]",
                  "examples": [
                    "Synonyms: decrease, lessen",
                    "Antonyms: enlarge, increase"
                  ]
                },
                {
                  "meaning": "To cut away or hammer down (material from metalwork, a sculpture, etc.) in such a way as to leave a figure in relief.",
                  "examples": []
                },
                {
                  "meaning": "To lower (something) in price or value. [from mid 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(archaic)",
                  "examples": []
                },
                {
                  "meaning": "To demolish or level to the ground (a building or other structure). [from early 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "To give no consideration to (something); to treat as an exception. [from late 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(chiefly figuratively) To dull (an edge, point, etc.); to blunt. [from mid 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(law)",
                  "examples": [
                    "to abate a writ"
                  ]
                },
                {
                  "meaning": "To make (a writ or other legal document) void; to nullify. [from late 15th c.]",
                  "examples": [
                    "to abate a writ"
                  ]
                },
                {
                  "meaning": "To put an end to (a nuisance).",
                  "examples": [
                    "She was ordered by the court to abate the nuisance."
                  ]
                },
                {
                  "meaning": "(chiefly US) To dismiss or otherwise bring to an end (legal proceedings) before they are completed, especially on procedural grounds rather than on the merits.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": [
                    "Synonyms: cut short, stop, suppress, terminate",
                    "To order restrictions to abate an emergency."
                  ]
                },
                {
                  "meaning": "To curtail or end (something); to cause to cease. [14th–17th c.]",
                  "examples": [
                    "Synonyms: cut short, stop, suppress, terminate",
                    "To order restrictions to abate an emergency."
                  ]
                },
                {
                  "meaning": "To give (someone) a discount or rebate; also, to relieve (someone) of a debt. [15th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "To bring down (someone) mentally or physically; to lower (someone) in status. [14th–17th c.]",
                  "examples": [
                    "Synonyms: abase, depress, humble"
                  ]
                },
                {
                  "meaning": "Chiefly followed by from, of, etc.: to omit or remove (a part from a whole); to deduct, to subtract. [15th–19th c.]",
                  "examples": [
                    "We will abate this price from the total."
                  ]
                },
                {
                  "meaning": "Chiefly followed by of: to deprive (someone or something of another thing). [15th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To decrease in force or intensity; to subside. [from 14th c.]",
                  "examples": [
                    "Synonyms: decline, ebb, slacken, soften, wane"
                  ]
                },
                {
                  "meaning": "To decrease in amount or size. [from mid 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "To lower in price or value; (law) specifically, of a bequest in a will: to lower in value because the testator's estate is insufficient to satisfy all the bequests in full. [from early 18th c.]",
                  "examples": [
                    "Bequests and legacies are liable to be abated entirely or in proportion, upon a deficiency of assets."
                  ]
                },
                {
                  "meaning": "(archaic, chiefly figuratively) Of an edge, point, etc.: to become blunt or dull. [from mid 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(law)",
                  "examples": [
                    "The writ has abated."
                  ]
                },
                {
                  "meaning": "(chiefly historical) Of a writ or other legal document: to become null and void; to cease to have effect. [from late 15th c.]",
                  "examples": [
                    "The writ has abated."
                  ]
                },
                {
                  "meaning": "(chiefly US) Of legal proceedings: to be dismissed or otherwise brought to an end before they are completed, especially on procedural grounds rather than on the merits.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To give a discount or rebate; to discount, to rebate. [16th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "To bow down; hence, to be abased or humbled. [14th–17th c.]",
                  "examples": []
                },
                {
                  "meaning": "Chiefly followed by of: to deduct or subtract from. [15th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Anglo-Norman abatre, probably an alteration of Anglo-Norman and Middle French embatre, enbatre (“to drive or rush into; to enter into a tenement without permission”) (compare Late Latin abatare), from Middle French, Old French em-, en- (prefix meaning ‘in, into’) + Middle French, Old French batre (“to beat, hit, strike”) (from Latin battere, battuere, the present active infinitive of battuō (“to beat, hit; to beat up; to fight”); see further at etymology 1). The English word was probably also influenced by the verb abate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "abate (third-person singular simple present abates, present participle abating, simple past and past participle abated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, law, chiefly historical) To enter upon and unlawfully seize (land) after the owner has died, thus preventing an heir from taking possession of it. [from mid 15th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Italian abate (“abbot”), from Latin abbātem, the accusative singular of abbās (“abbot”), from Ancient Greek ἀββᾶς (abbâs), a variant of ἀββᾱ (abbā, “father; title of respect for an abbot”), from Aramaic אַבָּא‎ (’abbā, “father; ancestor; teacher; chief, leader; author, originator”), from Proto-Semitic *ʔabw- (“father”), ultimately imitative of a child’s word for “father”. The English word is a doublet of abbot."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "abate (plural abates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An Italian abbot or other member of the clergy. [from early 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}