{
  "word": "nest",
  "etymologies": [
    {
      "description": [
        "From Middle English nest, nist, nyst, from Old English nest, from Proto-West Germanic *nest, from Proto-Germanic *nestą, from Proto-Indo-European *nisdós (“nest”), literally \"where [the bird] sits down\", a compound of *ni (“down”) (whence also English nether) + the zero-grade of the root *sed- (“to sit”) (whence also English sit)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nest (plural nests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A structure built by a bird as a place to incubate eggs and rear young.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place used by another mammal, fish, amphibian or insect, for depositing eggs and hatching young.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A snug, comfortable, or cosy residence or job situation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A retreat, or place of habitual resort.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hideout for bad people to frequent or haunt; a den.",
                  "examples": [
                    "a nest of thieves",
                    "That nightclub is a nest of strange people!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A home that a child or young adult shares with a parent or guardian.",
                  "examples": [
                    "I am aspiring to leave the nest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A fixed number of cards in some bidding games awarded to the highest bidder allowing him to exchange any or all with cards in his hand.",
                  "examples": [
                    "I was forced to change trumps when I found the ace, jack, and nine of diamonds in the nest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A fortified position for a weapon.",
                  "examples": [
                    "a machine gun nest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A structure consisting of nested structures, such as nested loops or nested subroutine calls.",
                  "examples": [
                    "Our analysis to this point has assumed that in a loop nest, we are only parallelizing a single loop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A circular bed of pasta, rice, etc. to be topped or filled with other foods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) An aggregated mass of any ore or mineral, in an isolated state, within a rock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A collection of boxes, cases, or the like, of graduated size, each put within the one next larger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A compact group of pulleys, gears, springs, etc., working together or collectively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang, now US) The pubic hair near a vulva or a vulva itself.",
                  "examples": [
                    "Synonyms: beav, beaver"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English nesten, nisten, from Old English nistan, nistian, from Proto-West Germanic *nistijan (“to nest, build a nest”). Cognate with Saterland Frisian näästje (“to nest”), Dutch nesten (“to nest”), German Low German nüsten (“to nest”), German nisten (“to nest”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "nest (third-person singular simple present nests, present participle nesting, simple past and past participle nested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of animals) To build or settle into a nest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To settle into a home.",
                  "examples": [
                    "We loved the new house and were nesting there in two days!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To successively neatly fit inside another.",
                  "examples": [
                    "I bought a set of nesting mixing bowls for my mother."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place in, or as if in, a nest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place one thing neatly inside another, and both inside yet another (and so on).",
                  "examples": [
                    "There would be much more room in the attic if you had nested all the empty boxes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hunt for birds' nests or their contents (usually \"go nesting\").",
                  "examples": [
                    "After the first heavy frost, when acorns were falling, I took a friend into partnership and went nesting."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}