{
  "word": "succour",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English socour, interpreted as the singular form of socours (“help; encouragement; remedy; protection; helper, protector”), which is from Anglo-Norman socurs, sucurs and Old French secors, secours, (modern French secours), from Medieval Latin succursus (participle), from Latin succurrēre (“to run to the help of”), from Latin sub- (“from below”) + Latin currere (“run”).",
        "The verb is derived from Middle English socouren (“to help”), from Anglo-Norman socure (compare modern French secourir), also from Latin succurrēre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "succour (countable and uncountable, plural succours) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Aid, assistance, or relief given to one in distress; ministration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, military) Aid or assistance in the form of military equipment and soldiers, especially reinforcements sent to support military action.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete except dialectal) Protection, refuge, shelter; (countable) a place providing such protection, refuge or shelter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "succour (third-person singular simple present succours, present participle succouring, simple past and past participle succoured) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give aid, assistance, or help.",
                  "examples": [
                    "Synonyms: see Thesaurus:help",
                    "Antonyms: see Thesaurus:hurt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To provide aid or assistance in the form of military equipment and soldiers; in particular, for helping a place under siege.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete except dialectal) To protect, to shelter; to provide a refuge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}