{
  "word": "eject",
  "etymologies": [
    {
      "description": [
        "From Middle French éjecter, from Latin ēiectus, perfect passive participle of ēiciō (“to throw out”), or from ēiectō, the frequentative form of the same verb, from ē-, combining form of ex (“out”), + iaciō (“to throw”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "eject (third-person singular simple present ejects, present participle ejecting, simple past and past participle ejected)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To compel (a person or persons) to leave.",
                  "examples": [
                    "Four pairs of women's doubles badminton players, including the Chinese top seeds, have been ejected from the Olympic tournament for trying to throw matches in an effort to secure a more favourable quarter-final draw."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To throw out or remove forcefully.",
                  "examples": [
                    "In other news, a Montreal man was ejected from his car when he was involved in an accident."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, transitive) To compel (a sports player) to leave the field because of inappropriate behaviour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually intransitive) To forcefully project oneself or another occupant from an aircraft (or, rarely, another type of vehicle), typically using an ejection seat or escape capsule.",
                  "examples": [
                    "The pilot lost control of the plane and had to eject.",
                    "As the crippled jet spiralled down, the pilot pulled the escape handle, ejecting first his rear-seater, then himself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (something) to come out of a machine.",
                  "examples": [
                    "Press that button to eject the video tape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come out of a machine.",
                  "examples": [
                    "I can't get this cassette to  eject."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin ēiectum (“(that which is) thrown out”), from ēiciō (“to throw out”) (see Etymology 1). Coined by W. K. Clifford by analogy with subject and object."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "eject (countable and uncountable, plural ejects)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology, countable) an inferred object of someone else's consciousness",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}