{
  "word": "ungodly",
  "etymologies": [
    {
      "description": [
        "From Middle English ungodli [and other forms], from un- (prefix meaning ‘not’), + godli (“belonging to God; resembling God, godlike”). Godli is derived from Old English godlīċ (“divine, godlike; godly”), from god (“god”) (ultimately from Proto-Indo-European *ǵʰew- (“to libate, pour”), in the sense of a liquid offering poured out for a deity) + -līċ (“suffix forming adjectives meaning ‘characteristic of, pertaining to’”). The English word may be analysed as un- +‎ godly, and is cognate with Middle Dutch ongodelijc (modern Dutch ongoddelijk), Middle High German ungötlich (modern German ungöttlich), Old Norse óguðligr (“ungodly”) (Danish ugudelig, Icelandic óguðlegur), Swedish ogudlig."
      ],
      "adjectives": [
        {
          "description": "ungodly (comparative more ungodly or ungodlier, superlative most ungodly or ungodliest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person: lacking reverence for God; of an action: not in accordance with God's will or religious teachings.",
                  "examples": [
                    "Synonyms: impious, irreligious, irreverent",
                    "Antonyms: godly, observant, pious, reverent"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Immoral, sinful, or wicked.",
                  "examples": [
                    "Synonyms: see Thesaurus:evil, Thesaurus:immoral",
                    "Antonyms: see Thesaurus:virtuous",
                    "People often turn to ungodly ideas as an emotional response to trauma."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Extreme; unreasonable.",
                  "examples": [
                    "Synonyms: dreadful, indecent, outrageous",
                    "We had to start our journey at an ungodly hour."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English ungodli (“cruelly, maliciously, wickedly; unfairly, unlawfully, wrongly; discourteously, rudely”) [and other forms], from un- (prefix meaning ‘not’), + godli (“excellently; pleasingly, splendidly; courteously, graciously; gladly, willingly; righteously; properly, rightly; at all, possibly; much”). Godli is probably derived from Old English gōdlīċe (“goodly”), from gōd (“good”) (ultimately from Proto-Indo-European *gʰedʰ- (“to join, unite; to suit”)) + -līċe (suffix forming adverbs); thus, equivalent to un- +‎ good +‎ -ly. The English word is cognate with Middle Dutch ongodelike, ongodlike (modern Dutch ongoddelijk), Middle High German ungöttlich, Swedish ogudelike, ogudlike (both obsolete), ogudligt."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "ungodly (comparative more ungodly, superlative most ungodly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) In an impious, irreverent, or ungodly manner; ungodlily. [16th–17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}