{
  "word": "insist",
  "etymologies": [
    {
      "description": [
        "Partly from Middle French insister, from Latin īnsistere; and partly from a back-formation from insistence."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "insist (third-person singular simple present insists, present participle insisting, simple past and past participle insisted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with on or upon or (that + ordinary verb form)) To hold up a claim emphatically.",
                  "examples": [
                    "The defendant insisted on his innocence.",
                    "I insist that my secretary dresses nicely. (that is, I am defending her and claiming that she does; compare the subjunctive below.)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes with on or upon or (that + subjunctive)) To demand continually that something happen or be done; to reiterate a demand despite requests to abandon it.",
                  "examples": [
                    "The Prime Minister insisted on his Chancellor's resignation.",
                    "The Prime Minister insisted that his Chancellor resign.",
                    "I insist that my secretary dress nicely. (that is, I require her to do so; compare the use of the indicative above.)",
                    "I know I promised to pay you back tomorrow, but it's not very convenient for me. Can we put it off to Friday? —I'm afraid I have to insist on what we agreed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, chiefly geometry) To stand (on); to rest (upon); to lean (upon).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}