{
  "word": "sucker",
  "etymologies": [
    {
      "description": [
        "From Middle English souker, sokere, sukkere, soukere, equivalent to suck (verb) +‎ -er. Compare Saterland Frisian Suuger, West Frisian sûker (“sucker”), Dutch zuiger (“sucker”), German Sauger (“dummy; vacuum”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sucker (plural suckers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or animal that sucks, especially a breast or udder; especially a suckling animal, young mammal before it is weaned. [from late 14th century]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) An undesired stem growing out of the roots or lower trunk of a shrub or tree, especially from the rootstock of a grafted plant or tree. [from 1570s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A parasite; a sponger.",
                  "examples": [
                    "Synonyms: see Thesaurus:scrounger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An organ or body part that does the sucking; especially a round structure on the bodies of some insects, frogs, and octopuses that allows them to stick to surfaces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing that works by sucking something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The embolus, or bucket, of a pump; also, the valve of a pump basket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pipe through which anything is drawn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small piece of leather, usually round, having a string attached to the center, which, when saturated with water and pressed upon a stone or other body having a smooth surface, adheres, by reason of the atmospheric pressure, with such force as to enable a considerable weight to be thus lifted by the string; formerly used by children as a plaything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, colloquial) A suction cup.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An animal such as the octopus and remora, which adhere to other bodies with such organs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ichthyology) Any fish in the family Catostomidae of North America and eastern Asia, which have mouths modified into downward-pointing, suckerlike structures for feeding in bottom sediments. [from 1750s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, informal) A  lollipop; a piece of candy which is sucked. [from 1820s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) A hard drinker.",
                  "examples": [
                    "Synonyms: soaker, suck-pint; see also Thesaurus:drunkard"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, obsolete) An inhabitant of Illinois.",
                  "examples": [
                    "Synonym: Illinoisian"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, obsolete) A migrant lead miner working in the Driftless Area of northwest Illinois, southwest Wisconsin, and northeast Iowa, working in summer and leaving for winter, so named because of the similarity to the migratory patterns of the North American Catostomidae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A person who is easily deceived, tricked or persuaded to do something; a naive or gullible person. [from 1830s]",
                  "examples": [
                    "Synonyms: chump, fall guy, fish, fool, gull, mark, mug, patsy, rube, schlemiel, soft touch; see also Thesaurus:dupe",
                    "One poor sucker had actually given her his life’s savings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A person irresistibly attracted by something specified.",
                  "examples": [
                    "I'm a sucker for ghost stories.",
                    "He must be a sucker for punishment to try to climb that mountain barefoot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, vulgar, British slang) The penis.",
                  "examples": [
                    "Synonyms: see Thesaurus:penis"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sucker (third-person singular simple present suckers, present participle suckering, simple past and past participle suckered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture, transitive) To strip the suckers or shoots from; to deprive of suckers.",
                  "examples": [
                    "to sucker maize"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture, intransitive) To produce suckers; to throw up additional stems or shoots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move or attach oneself by means of suckers.",
                  "examples": [
                    "I am now the octopus, mucus, held together by soft moist membrane, suckering everywhere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To fool someone; to take advantage of someone.",
                  "examples": [
                    "The salesman suckered him into signing an expensive maintenance contract."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal, usually with into) To lure someone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from German Sache (“thing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sucker (plural suckers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, emphatic) Any thing or object.",
                  "examples": [
                    "She's in love with a boy from the rodeo who pulls the rope on the chute when they let those suckers go."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) A person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}