{
  "word": "dight",
  "etymologies": [
    {
      "description": [
        "From Middle English dighten, dihten, (also dyten, from whence dite), from Old English dihtan, dihtian (“to set in order; dispose; arrange; appoint; direct; compose”), from Proto-Germanic *dihtōną (“to compose; invent”), of disputed origin. Possibly from a derivative of Proto-Germanic *dīkaną (“to arrange; create; perform”), from Proto-Indo-European *dʰeyǵ-, *dʰeyǵʰ- (“to knead; shape; mold; build”), influenced by Latin dictāre; or perhaps from Latin dictāre (“to dictate”) itself. See dictate; and also parallel formations in German dichten, Dutch dichten, Swedish dikta."
      ],
      "adjectives": [
        {
          "description": "dight",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Disposed; adorned.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "dight",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Finely.",
                  "examples": [
                    "Synonym: dightly"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "dight (third-person singular simple present dights, present participle dighting, simple past and past participle dight or dighted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To deal with, handle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To dispose, put (in a given state or condition).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive, of facial features) To be formed or composed (of).",
                  "examples": [
                    "[…] nor is there found, in sea or on land, a sweeter or pleasanter of gifts than she; for she is prime in comeliness and seemlihead of face and symmetrical shape of perfect grace; her check is ruddy dight, her brow flower white, her teeth gem-bright, her eyes blackest black and whitest white, her hips of heavy weight, her waist slight and her favour exquisite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To dress, array; to adorn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To make ready, prepare.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}