{
  "word": "tempo",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian tempo, from Latin tempus (“time”). Doublet of tense."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tempo (plural tempos or tempi)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A frequency or rate.",
                  "examples": [
                    "10 calls per hour isn't a bad start, but we'll need to up the tempo if we want to reach our target of selling insurance policies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) A move which is part of one's own plan or strategy and forces, e.g. by means of a check or attacking a piece, the opponent to make a move which is not bad but of no use for him (the player gains a tempo, the opponent loses a tempo), or equivalently a player achieves the same result in fewer moves by one approach rather than another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge) The timing advantage of being on lead, thus being first to initiate a strategy to develop tricks for one's side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The timing of a particular event – earlier or later than in an alternative situation (as in chess example)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The number of beats per minute in a piece of music; also, an indicative term denoting approximate rate of speed in written music (examples: allegro, andante)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling) The steady pace set by the frontmost riders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small truck or cargo van with three or four wheels, commonly used for commercial transport and deliveries (particularly in Asian and African countries): a genericized trademark, originally associated with the manufacturer Vidal & Sohn Tempo-Werke GmbH.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A rapid rate of play by the offense resulting from reducing the amount of time which elapses after one play ends and the next starts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A temporary carport.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}