{
  "word": "chase",
  "etymologies": [
    {
      "description": [
        "From Middle English chacen, from Anglo-Norman chacer, Old French chacier, from Late Latin captiāre, from Latin captāre, frequentative of capere. Compare French chasser (“to hunt”, “to chase”), Spanish cazar (“to hunt”), Portuguese caçar (“to hunt”)\n, see Norwegian skysse (“to hunt”).\nDoublet of catch and related to capture."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chase (countable and uncountable, plural chases)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of one who chases another; a pursuit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hunt; the act of hunting; the pursuit of game.",
                  "examples": [
                    "By-and-by, she wandered away to an unnecessary revelation of her master's whereabouts: gone to help in the search for his landlord, the Sieur de Poissy, who lived at the château just above, and who had not returned from his chase the day before; so the intendant imagined he might have met with some accident, and had summoned the neighbours to beat the forest and the hill-side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A children's game where one player chases another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A large country estate where game may be shot or hunted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything being chased, especially a vessel in time of war.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A wild animal that is hunted.",
                  "examples": [
                    "Synonym: game"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Any of the guns that fire directly ahead or astern; either a bow chase or stern chase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(real tennis) The occurrence of a second bounce by the ball in certain areas of the court, giving the server the chance, later in the game, to \"play off\" the chase from the receiving end and possibly win the point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(real tennis) A division of the floor of a gallery, marked by a figure or otherwise; the spot where a ball falls, and between which and the dedans the adversary must drive the ball in order to gain a point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling) One or more riders who are ahead of the peloton and trying to join the race or stage leaders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A series of brief improvised jazz solos by a number of musicians taking turns.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chase (third-person singular simple present chases, present participle chasing, simple past and past participle chased)",
          "definitionGroups": [
            {
              "group": "(transitive) To pursue.",
              "entries": [
                {
                  "meaning": "(transitive) To follow at speed.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To hunt.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To seek to attain.",
                  "examples": [
                    "The team are chasing their first home win this season."
                  ]
                },
                {
                  "meaning": "(transitive) To seek the company of (a member of the opposite sex) in an obvious way.",
                  "examples": [
                    "He spends all his free time chasing girls."
                  ]
                },
                {
                  "meaning": "(transitive, nautical) To pursue a vessel in order to destroy, capture or interrogate her.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To consume another beverage immediately after drinking hard liquor, typically something better tasting or less harsh such as soda or beer; to use a drink as a chaser.",
                  "examples": [
                    "I need something to chase this shot with."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cricket) To attempt to win by scoring the required number of runs in the final innings.",
                  "examples": [
                    "Australia will be chasing 217 for victory on the final day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To swing at a pitch outside of the strike zone, typically an outside pitch.",
                  "examples": [
                    "Jones chases one out of the zone for strike two."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To produce enough offense to cause the pitcher to be removed.",
                  "examples": [
                    "The rally chased the starter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Perhaps from French châsse (“case”, “reliquary”), from Old French chasse, from Latin capsa."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chase (plural chases)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) A rectangular steel or iron frame into which pages or columns of type are locked for printing or plate-making.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from obsolete French chas (“groove”, “enclosure”), from Old French, from Latin capsa, box. Or perhaps a shortening or derivative of enchase."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chase (plural chases)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A groove cut in an object; a slot: the chase for the quarrel on a crossbow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A trench or channel or other encasement structure for encasing (archaically spelled enchasing) drainpipes or wiring; a hollow space in the wall of a building encasing ventilation ducts, chimney flues, wires, cables or plumbing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a gun in front of the trunnions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cavity of a mold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shipbuilding) A kind of joint by which an overlap joint is changed to a flush joint by means of a gradually deepening rabbet, as at the ends of clinker-built boats.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chase (third-person singular simple present chases, present participle chasing, simple past and past participle chased)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To groove; indent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place piping or wiring in a groove encased within a wall or floor, or in a hidden space encased by a wall.",
                  "examples": [
                    "chase the pipe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut (the thread of a screw).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To decorate (metal) by engraving or embossing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}