{
  "word": "cord",
  "etymologies": [
    {
      "description": [
        "From Middle English corde, from Old French corde, from Latin chorda, from Doric Ancient Greek χορδά (khordá, “string of gut, the string of a lyre”)  (compare Ionic χορδή (khordḗ), from Proto-Indo-European *ǵʰer- (“bowel”)). More at yarn and hernia."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cord (countable and uncountable, plural cords)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, thin, flexible length of twisted yarns (strands) of fiber (rope, for example); (uncountable) such a length of twisted strands considered as a commodity.",
                  "examples": [
                    "The burglar tied up the victim with a cord.",
                    "He looped some cord around his fingers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small flexible electrical conductor composed of wires insulated separately or in bundles and assembled together usually with an outer cover; the electrical cord of a lamp, sweeper ((US) vacuum cleaner), or other appliance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A unit of measurement for firewood, equal to 128 cubic feet (4 × 4 × 8 feet), composed of logs and/or split logs four feet long and none over eight inches diameter. It is usually seen as a stack four feet high by eight feet long.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any influence by which persons are caught, held, or drawn, as if by a cord.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Any structure having the appearance of a cord, especially a tendon or nerve.",
                  "examples": [
                    "spermatic cord; spinal cord; umbilical cord; vocal cords"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dated form of chord: musical sense.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of chord: a cross-section measurement of an aircraft wing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cord (third-person singular simple present cords, present participle cording, simple past and past participle corded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish with cords",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To tie or fasten with cords",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To flatten a book during binding",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To arrange (wood, etc.) in a pile for measurement by the cord.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}