{
  "word": "slice",
  "etymologies": [
    {
      "description": [
        "From Middle English sclise, sklise, from Old French esclice, esclis (“a piece split off”), deverbal of esclicer, esclicier (“to splinter, split up”), from Frankish *slitjan (“to split up”), from Proto-Germanic *slitjaną, from Proto-Germanic *slītaną (“to split, tear apart”), from Proto-Indo-European *sleyd- (“to rend, injure, crumble”). Akin to Old High German sliz, gisliz (“a tear, rip”), Old High German slīzan (“to tear”), Old English slītan (“to split up”), modern French éclisse. More at slite, slit."
      ],
      "adjectives": [
        {
          "description": "slice (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Having the properties of a slice knot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "slice (plural slices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is thin and broad.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin, broad piece cut off.",
                  "examples": [
                    "a slice of bacon; a slice of cheese; a slice of bread",
                    "Jim was munching on a slice of toast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An amount of anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of pizza, shaped like a sector of a circle.",
                  "examples": [
                    "For breakfast, lunch, or dinner, the best Guido meal is a slice and a Coke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A snack consisting of pastry with savoury filling.",
                  "examples": [
                    "I bought a ham and cheese slice at the service station."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broad, thin piece of plaster.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A knife with a thin, broad blade for taking up or serving fish; also, a spatula for spreading anything, as paint or ink.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A salver, platter, or tray.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plate of iron with a handle, forming a kind of chisel, or a spadelike implement, variously proportioned, and used for various purposes, as for stripping the planking from a vessel's side, for cutting blubber from a whale, or for stirring a fire of coals; a slice bar; a peel; a fire shovel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the wedges by which the cradle and the ship are lifted clear of the building blocks to prepare for launching.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) A removable sliding bottom to a galley.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A shot that (for the right-handed player) curves unintentionally to the right. See fade, hook, draw",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, UK) Any of a class of heavy cakes or desserts made in a tray and cut out into squarish slices.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A section of image taken of an internal organ using MRI (magnetic resonance imaging), CT (computed tomography), or various forms of x-ray.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry) A hawk's or falcon's dropping which squirts at an angle other than vertical. (See mute.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) A contiguous portion of an array.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slice (third-person singular simple present slices, present participle slicing, simple past and past participle sliced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut into slices.",
                  "examples": [
                    "Slice the cheese thinly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut with an edge utilizing a drawing motion.",
                  "examples": [
                    "The knife left sliced his arm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clear (e.g. a fire, or the grate bars of a furnace) by means of a slice bar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, badminton) To hit the shuttlecock with the racket at an angle, causing it to move sideways and downwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, golf) To hit a shot that slices (travels from left to right for a right-handed player).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rowing) To angle the blade so that it goes too deeply into the water when starting to take a stroke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, soccer) To kick the ball so that it goes in an unintended direction, at too great an angle or too high.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, tennis) To hit the ball with a stroke that causes a spin, resulting in the ball swerving or staying low after a bounce.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}