{
  "word": "penguin",
  "etymologies": [
    {
      "description": [
        "Unknown; first attested in the 16th century in reference to the auk of the Northern hemisphere; the word was later applied to the superficially similar birds of the Southern hemisphere (as was woggin). Possibly from Welsh pen (“head”) and gwyn (“white”), or from Latin pinguis (“fat”). See citations and the Wikipedia page."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "penguin (plural penguins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several flightless sea birds, of order Sphenisciformes, found in the Southern Hemisphere, marked by their usual upright stance, walking on short legs, and (generally) their stark black and white plumage. [from 16th c.]",
                  "examples": [
                    "Here are also birds cal'd Pen-gwins (white-head in Welch) like Pigmies walking upright, their finns or wings hanging very orderly downe like sleeves  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or historical) An auk (sometimes especially a great auk), a bird of the Northern Hemisphere.",
                  "examples": [
                    "*This last species of penguin, or auk, seems to be the same with the alca cirrhata of Dr. Pallis, Spicileg. Zool. Fasc. v. p. 7. tab. i. & v. fig. 1–3. F."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A nun (association through appearance, because of the often black-and-white habit).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling) A type of catch where the palm of the hand is facing towards the leg with the arm stretched downward, resembling the flipper of a penguin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spiny bromeliad with egg-shaped fleshy fruit, Bromelia pinguin.",
                  "examples": [
                    "These productive patches, and the houses, were each surrounded by a fence, made of a prickly shrub, called the Pinguin, which propagates itself with great rapidity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, military, slang) A member of the air force who does not fly aircraft.",
                  "examples": [
                    "Although it is a permanent R.A.F. station (pre-war, that is), we meander about, even in the Mess, in battle dress and flying boots, sweaters, etc., much to the disgust of some of the more dignified 'penguins'  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}