{
  "word": "stalk",
  "etymologies": [
    {
      "description": [
        "From Middle English stalke, stelke, stalk, perhaps from Old English *stealc, *stielc, *stealuc, from Proto-West Germanic *staluk, *stalik, from Proto-Germanic *stalukaz, *stalikaz, diminutive of Proto-Germanic *stalô, *staluz (“support, stem, stalk”), from Proto-Indo-European *stel- (“to place, stand; be stiff; stud, post, trunk, stake, stem, stalk”). Cognate with Old High German *stelh in wazzarstelh (“wagtail”), Danish stilk (“stalk, stem”), Swedish stjälk (“stalk, stem”), Icelandic stilkur (“stalk, stem”).",
        "Related also to Middle English stale (“ladder upright, stalk”), Old English stalu (“wooden upright”), Middle Low German stal, stale (“chair leg”), Old English stela (“stalk”), Dutch steel (“stalk”), German Stiel (“stalk”), Albanian shtalkë (“crossbeam, board used as a door hinge”), Welsh telm (“frond”), Ancient Greek στέλος (stélos, “beam”), Old Armenian ստեղն (stełn, “trunk, stalk”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stalk (plural stalks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The stem or main axis of a plant, which supports the seed-carrying parts.",
                  "examples": [
                    "a stalk of wheat, rye, or oats;  the stalks of maize or hemp"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The petiole, pedicel, or peduncle of a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something resembling the stalk of a plant, such as the stem of a quill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) An ornament in the Corinthian capital resembling the stalk of a plant, from which the volutes and helices spring.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the two upright pieces of a ladder.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(zoology)",
              "entries": [
                {
                  "meaning": "A stem or peduncle, as in certain barnacles and crinoids.",
                  "examples": []
                },
                {
                  "meaning": "The narrow basal portion of the abdomen of a hymenopterous insect.",
                  "examples": []
                },
                {
                  "meaning": "The peduncle of the eyes of decapod crustaceans.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metalworking) An iron bar with projections inserted in a core to strengthen it; a core arbor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stalken, from Old English *stealcian (as in bestealcian (“to move stealthily”), stealcung (“stalking”)), from Proto-Germanic *stalkōną (“to stalk, move stealthily”) (compare Dutch stelkeren, stolkeren (“to tip-toe, tread carefully”), Danish stalke (“to high step, stalk”), Norwegian dialectal stalka (“to trudge”)), from *stalkaz, *stelkaz (compare Old English stealc (“steep”), Old Norse stelkr, stjalkr (“knot (bird), red sandpiper”)), from Proto-Indo-European *(s)telg, *(s)tolg- (compare Middle Irish tolg (“strength”), Lithuanian stalgùs (“stiff, defiant, proud”)).",
        "Alternate etymology connects Proto-Germanic *stalkōną to a frequentative form of *stelaną (“to steal”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stalk (plural stalks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular episode of trying to follow or contact someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The hunting of a wild animal by stealthy approach.",
                  "examples": [
                    "When the stalk was over (the antelope took alarm and ran off before I was within rifle shot) I came back."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stalk (third-person singular simple present stalks, present participle stalking, simple past and past participle stalked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To approach slowly and quietly in order not to be discovered when getting closer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To (try to) follow or contact someone constantly, often resulting in harassment.Wp",
                  "examples": [
                    "My ex-girlfriend is stalking me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To walk slowly and cautiously; to walk in a stealthy, noiseless manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To walk behind something, such as a screen, for the purpose of approaching game; to proceed under cover.",
                  "examples": [
                    "One underneath his horse, to get a shoot doth stalk."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Attested 1530 in the sense \"to walk haughtily\", perhaps from Old English stealc (“steep”), from Proto-Germanic *stelkaz, *stalkaz (“high, lofty, steep, stiff”); see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stalk (plural stalks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A haughty style of walking.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stalk (third-person singular simple present stalks, present participle stalking, simple past and past participle stalked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To walk haughtily.",
                  "examples": [
                    "With manly mien he stalked along the ground."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}