{
  "word": "leg",
  "etymologies": [
    {
      "description": [
        "From Middle English leg, legge, from Old Norse leggr (“leg, calf, bone of the arm or leg, hollow tube, stalk”), from Proto-Germanic *lagjaz, *lagwijaz (“leg, thigh”), perhaps from Proto-Indo-European *(ǝ)lak-, *lēk- (“leg; the main muscle of the arm or leg”).",
        "Cognate with Scots leg (“leg”), Icelandic leggur (“leg, limb”), Norwegian Bokmål legg (“leg”), Norwegian Nynorsk legg (“leg”), Swedish lägg (“leg, shank, shaft”), Danish læg (“leg”), Lombardic lagi (“thigh, shank, leg”), Latin lacertus (“limb, arm”), Persian لنگ‎ (leng). Upon borrowing, mostly displaced the native Old English term sċanca (Modern English shank)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leg (plural legs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A limb or appendage that an animal uses for support or locomotion on land.",
                  "examples": [
                    "Insects have six legs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In humans, the lower limb extending from the groin to the ankle.",
                  "examples": [
                    "Dan won't be able to come to the party, since he broke his leg last week and is now on crutches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The portion of the lower limb of a human that extends from the knee to the ankle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of garment, such as a pair of trousers/pants, that covers a leg.",
                  "examples": [
                    "The left leg of these jeans has a tear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rod-like protrusion from an inanimate object, such as a piece of furniture, supporting it from underneath.",
                  "examples": [
                    "the legs of a chair or table"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Something that supports.",
                  "examples": [
                    "This observation is an important leg of my argument."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stage of a journey, race etc.",
                  "examples": [
                    "After six days, we're finally in the last leg of our cross-country trip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A distance that a sailing vessel does without changing the sails from one side to the other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) One side of a multiple-sided (often triangular) course in a sailing race.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A single game or match played in a tournament or other sporting contest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) One of the two sides of a right triangle that is not the hypotenuse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) One of the branches of a hyperbola or other curve which extend outward indefinitely.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) The ability of something to persist or succeed over a long period of time.",
                  "examples": [
                    "This proposal has no legs. Almost everyone opposes it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, archaic) A disreputable sporting character; a blackleg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An extension of a steam boiler downward, in the form of a narrow space between vertical plates, sometimes nearly surrounding the furnace and ash pit, and serving to support the boiler; called also water leg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a grain elevator, the case containing the lower part of the belt which carries the buckets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, attributive) Denotes the half of the field on the same side as the batsman's legs; the left side for a right-handed batsman.",
                  "examples": [
                    "Synonym: on; Antonym: off",
                    "Ponsonby-Smythe hit a thumping drive through the leg fielders."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telephony) A branch or lateral circuit connecting an instrument with the main line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical) A branch circuit; one phase of a polyphase system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) An underlying instrument of a derivatives strategy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, military) An army soldier assigned to a paratrooper unit who has not yet been qualified as a paratrooper.",
                  "examples": [
                    "Which was lower than whale shit in the eyes of any paratrooper; it would have been a disgrace to be a leg."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A gesture of submission; a bow or curtsey. Chiefly in phrase make a leg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) A column, as a unit of length of text as laid out.",
                  "examples": [
                    "A leg is one column of a story. It has two legs if it is set in two columns and three legs if it is set in three columns. Avoid legs longer than 10 inches and shorter than 1 inch."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "leg (third-person singular simple present legs, present participle legging, simple past and past participle legged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the legs from an animal carcass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To build legs onto a platform or stage for support.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put a series of three or more options strikes into the stock market.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To apply force using the leg (as in 'to leg a horse').",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [
        {
          "description": "leg (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of leg.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "leg (plural not attested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of leg.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}