{
  "word": "neuter",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English neutre, from Latin neuter, from ne (“not”) +‎ uter (“whether”), a semantic loan from Koine Greek οὐδέτερος (oudéteros); compare English whether and neither."
      ],
      "adjectives": [
        {
          "description": "neuter (not generally comparable, comparative more neuter, superlative most neuter)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now uncommon) Neutral; on neither side; neither one thing nor another.",
                  "examples": [
                    "Synonyms: impartial, neutral"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Having a form which is not masculine nor feminine; or having a form which is not of common gender.",
                  "examples": [
                    "a neuter noun",
                    "the neuter definite article",
                    "a neuter termination",
                    "the neuter gender"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Intransitive.",
                  "examples": [
                    "Synonym: intransitive",
                    "a neuter verb"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Sexless: having no or imperfectly developed sex organs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) Sexless, nonsexual.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "neuter (plural neuters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) An organism, either vegetable or animal, which at its maturity has no generative organs, or but imperfectly developed ones, as a plant without stamens or pistils, as the garden Hydrangea; especially, one of the imperfectly developed females of certain social insects, as of the ant and the common honeybee, which perform the labors of the community, and are called workers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who takes no part in a contest; someone remaining neutral.",
                  "examples": [
                    "But if you should beecome eyther a counterfayt Protestant, or a perverse Papist, or a colde and carelesse newter (which God forbid) the harme could not be expressed which you should do to your native Cuntrie."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The neuter gender.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A noun of the neuter gender; any one of those words which have the terminations usually found in neuter words.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) An intransitive verb or state-of-being verb.",
                  "examples": [
                    "Make one do, or act (to), fare fare, fare agire, with an accusative when the verb is a neuter, and with a dative when otherwise."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "neuter (third-person singular simple present neuters, present participle neutering, simple past and past participle neutered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove sex organs from an animal to prevent it from having offspring; to castrate or spay, particularly as applied to domestic animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To rid of sexuality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To drastically reduce the effectiveness of something.",
                  "examples": [
                    "Congress neutered the bill by adding an exception for big corporations."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}