{
  "word": "saturation",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "saturation (usually uncountable, plural saturations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of saturating or the process of being saturated",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) The condition in which, after a sufficient increase in a causal force, no further increase in the resultant effect is possible; e.g. the state of a ferromagnetic material that cannot be further magnetized",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) The state of a saturated solution",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) The state of an organic compound that has no double or triple bonds",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) The state of the atmosphere when it is saturated with water vapour; 100% humidity",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) The intensity or vividness of a colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(color) Chromatic purity; freedom from dilution with white.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "intense bombing of a military target with the aim of destroying it",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The flooding of a market with all of a product that can be sold",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) An effect on the sound of an electric guitar, used primarily in heavy metal music",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telecommunications) The condition at which a component of the system has reached its maximum traffic-handling capacity, i.e. one erlang per circuit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telecommunications) The point at which the output of a linear device, such as a linear amplifier, deviates significantly from being a linear function of the input when the input signal is increased.",
                  "examples": [
                    "Modulation often requires that amplifiers operate below saturation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}