{
  "word": "victim",
  "etymologies": [
    {
      "description": [
        "From Middle French victime, from Latin victima (“sacrificial animal”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "victim (plural victims)",
          "definitionGroups": [
            {
              "group": "One that is harmed—killed, injured, subjected to oppression, deceived, or otherwise adversely affected—by someone or something, especially another person or event, force, or condition; in particular:",
              "entries": [
                {
                  "meaning": "One who is harmed or killed by a crime or scam.",
                  "examples": [
                    "victims of assault; the murderer's victims",
                    "became another victim of the latest scam"
                  ]
                },
                {
                  "meaning": "One who is harmed or killed by an accident or illness.",
                  "examples": [
                    "a fundraiser for victims of AIDS; a victim of a car crash"
                  ]
                },
                {
                  "meaning": "One who is harmed or killed as a result of other people's biases, emotions or incompetence, or their own.",
                  "examples": [
                    "a victim of his own pride; a victim of her own incompetence",
                    "the newcomer never managed to make friends, a victim of the town's deep distrust of outsiders",
                    "a victim of sexism; victims of a racist system"
                  ]
                },
                {
                  "meaning": "One who is harmed or killed as a result of a natural or man-made disaster or impersonal condition.",
                  "examples": [
                    "relief efforts to help victims of the hurricane",
                    "victim of an optical illusion; victim of a string of bad luck",
                    "local businesses were the main victims of the economic downturn"
                  ]
                }
              ]
            },
            {
              "group": "A living being which is slain and offered as a sacrifice, usually in a religious rite.",
              "entries": [
                {
                  "meaning": "(by extension, Christianity) The transfigured body and blood of Christ in the Eucharist.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}