{
  "word": "citizen",
  "etymologies": [
    {
      "description": [
        "From Middle English citeseyn, citezein, borrowed from Anglo-Norman citesain (“burgher; city-dweller”), citezein etc., probably a variant of cithein under influence of deinzein (“denizen”), from Anglo-Norman and Old French citeain etc. and citaien, citeien etc. (\"burgher\"; modern French citoyen), from cité (\"settlement; cathedral city, city\"; modern French cité) + -ain or -ien (“-an, -ian”). See city and hewe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "citizen (plural citizens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A resident of a city or town, especially one with legally-recognized rights or duties. [from 14th c.]",
                  "examples": [
                    "Synonyms: burgess, burgher, cityite, freeman",
                    "Hyponyms: citess, (female) citizeness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A legally-recognized member of a state, with associated rights and obligations; a person considered in terms of this role. [from 14th c.]",
                  "examples": [
                    "Assistant: You'll meet with the managing director and Dr Sinita Brahmachari, the engineer who designed the chair.Peter Mackenzie: Indian, is he?Assistant: She is a British citizen, Minister. Born in Coventry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inhabitant or occupant: a member of any place. [from 14th c.]",
                  "examples": [
                    "Diogenes reckoned himself a citizen of the world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A resident of the heavenly city or (later) of the kingdom of God: a Christian; a good Christian. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A civilian, as opposed to a police officer, soldier, or member of some other specialized (usually state) group. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An ordinary person, as opposed to nobles and landed gentry on one side and peasants, craftsmen, and laborers on the other. [17th–19th c.]",
                  "examples": [
                    "[W]ould Mr. Delvile, who hardly ever spoke but to the high-born, without seeming to think his dignity somewhat injured, deign to receive for a daughter in law the child of a citizen and tradesman?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical, usually capitalized) A term of address among French citizens during the French Revolution or towards its supporters elsewhere; (later, dated) a term of address among socialists and communists. [from 18th c.]",
                  "examples": [
                    "Synonym: (term of address among communists) comrade"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An object.",
                  "examples": [
                    "Hyponyms: first-class citizen, second-class citizen, third-class citizen"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}