{
  "word": "volume",
  "etymologies": [
    {
      "description": [
        "From Middle English volume, from Old French volume, from Latin volūmen (“book, roll”), from volvō (“roll, turn about”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "volume (countable and uncountable, plural volumes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A three-dimensional measure of space that comprises a length, a width and a height. It is measured in units of cubic centimeters in metric, cubic inches or cubic feet in English measurement.",
                  "examples": [
                    "The room is 9x12x8, so its volume is 864 cubic feet.",
                    "The proper products can improve your hair's volume."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Strength of sound; loudness.",
                  "examples": [
                    "Please turn down the volume on the stereo.",
                    "Volume can be measured in decibels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The issues of a periodical over a period of one year.",
                  "examples": [
                    "I looked at this week's copy of the magazine. It was volume 23, issue 45."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bound book.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single book of a publication issued in multi-book format, such as an encyclopedia.",
                  "examples": [
                    "The letter \"G\" was found in volume 4."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, by extension) A great amount (of meaning) about something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A roll or scroll, which was the form of ancient books.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Quantity.",
                  "examples": [
                    "The volume of ticket sales decreased this week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rounded mass or convolution.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics) The total supply of money in circulation or, less frequently, total amount of credit extended, within a specified national market or worldwide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An accessible storage area with a single file system, typically resident on a single partition of a hard disk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bodybuilding) The total of weight worked by a muscle in one training session, the weight of every single repetition summed up.",
                  "examples": [
                    "(key muscle growth stimuli) Coordinate terms: mechanical tension, frequency"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "volume (third-person singular simple present volumes, present participle voluming, simple past and past participle volumed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be conveyed through the air, waft.",
                  "examples": [
                    "[…]  thumping guns and pattering musket-shots, the long big boom of surgent hosts, and the muffled voluming and crash of storm-bells, proclaimed that the insurrection was hot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to move through the air, waft.",
                  "examples": [
                    "We lay leaning over the bows, now looking up at the mist blown in never-ending volumed sheets, now at the sail swelling in the wind before which it fled, and again down at the water through which our boat was ploughing its evanescent furrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To swell.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}