{
  "word": "uncowl",
  "etymologies": [
    {
      "description": [
        "un- +‎ cowl"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "uncowl (third-person singular simple present uncowls, present participle uncowling, simple past and past participle uncowled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To divest or deprive of a cowl (monk's hood or hooded robe).",
                  "examples": [
                    "Can the pope, to say nothing of himself and his cardinals, do away with his four archbishops and ninety-eight bishops? Will he reduce the prodigious number of his priests, who muster as strong as one twenty-eighth of the population? Will he uncowl his monks, two thousand and twenty-three of whom swarm about the streets of Rome alone?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative, archaic) To uncover; to unveil.",
                  "examples": [
                    "I pray you, think us friends—uncowl your face,",
                    "For you seem faint, and the night-breeze blows healing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(instransitive) To remove or pull back one's cowl.",
                  "examples": [
                    "“Monseigneur, it is not often your capuchin uncowls; least of all when he wishes to remain unknown!  […] ”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove the cowl (protective covering) from (an engine).",
                  "examples": [
                    "[…]  uncowling the airplane before each flight is neither practical nor expected. In fact, uncowling such an airplane repeatedly may wear the latching or fastening devices."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}