{
  "word": "tabernacle",
  "etymologies": [
    {
      "description": [
        "From Middle English tabernacle (14th century), from Old French tabernacle, from Latin tabernāculum (“tent, booth, shed”), the diminutive of taberna (“hut, shed”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tabernacle (plural tabernacles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any temporary dwelling; a hut, tent, or booth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biblical) The portable tent used before the construction of the temple, where the shekinah (presence of God) was believed to dwell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The Jewish Temple at Jerusalem (as continuing the functions of the earlier tabernacle).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any portable shrine used in heathen or idolatrous worship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sukkah, the booth or 'tabernacle' used during the Jewish Feast of Sukkot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism) A small ornamented cupboard or box used for the reserved sacrament of the Eucharist, normally located in an especially prominent place in a church.",
                  "examples": [
                    "The tabernacle is to be situated \"in churches in a most worthy place with the greatest honor.\" The dignity, placing, and security of the Eucharistic tabernacle should foster adoration before the Lord really present in the Blessed Sacrament of the altar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally Methodism) A temporary place of worship, especially a tent, for a tent meeting, as with a venue for revival meetings.",
                  "examples": [
                    "It was over these innocent necessary precautions that the local committees always showed their meanness. They liked giving over only one contribution to the evangelist, but they wanted nothing said about it till they themselves had been taken care of--till the rent of the hall or the cost of building a tabernacle, the heat, the lights, the advertising, and other expenses had been paid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any house of worship, especially a Mormon church.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any abode or dwelling place, or especially the human body as the temporary dwelling place of the soul, or life.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A hinged device allowing for the easy folding of a mast 90 degrees from perpendicular, as for transporting the boat on a trailer, or passing under a bridge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tabernacle (third-person singular simple present tabernacles, present participle tabernacling, simple past and past participle tabernacled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dwell; to abide for a time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}