{
  "word": "afterlife",
  "etymologies": [
    {
      "description": [
        "From after- +‎ life."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "afterlife (plural afterlives or (rare, proscribed) afterlifes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conscious existence after death.",
                  "examples": [
                    "Many religious people believe in an afterlife.",
                    "Synonyms: life after death, hereafter, eternal life",
                    "Antonyms: forelife, beforelife"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The place believed to be inhabited by people who have died.",
                  "examples": [
                    "There were human cultures that taught an afterlife of the blessed on mountaintops or in clouds, in caverns or oases, but she could not recall any in which if you were very, very good when you died you went to the beach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) The part of a person's life that follows a particular stage or event; later life.",
                  "examples": [
                    "Synonym: aftercareer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The effects of a person's actions, or their reputation, after death.",
                  "examples": [
                    "[…]  poor poverty and birth, can be no hindrance to natural wit, for natural wit, in a poor Cottage, may spin an after-life, enter-weaving several colour’d fancies, and threeds of opinions, making fine and curious Tapestries to hang in the Chambers of fame,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The events or situations that result from a particular event; the later reception, consumption or reworking of a cultural production such as a film, book, etc.",
                  "examples": [
                    "The 1970s TV show M*A*S*H had a long afterlife in syndication.",
                    "Synonyms: aftercareer, aftermath",
                    "Antonym: history"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}