{
  "word": "flake",
  "etymologies": [
    {
      "description": [
        "From Middle English flake (“a flake of snow”), from Old English flacca and/or Old Norse flak (“loose or torn piece”) (compare Old Norse flakna (“to flake or chip”)), from Proto-Germanic *flaką (“something flat”), from Proto-Indo-European *pleh₂- (“flat, broad, plain”). Cognate with Norwegian flak (“slice, sliver”, literally “piece torn off”), Swedish flak (“a thin slice”), Danish flage (“flake”), German Flocke (“flake”), Dutch vlak (“smooth surface, plain”) and vlok (“flake”), as well as with Latin plaga (“flat surface, district, region”) and Welsh llech (“slate, tablet”). Doublet of plage."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flake (plural flakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose filmy mass or a thin chiplike layer of anything",
                  "examples": [
                    "Synonym: (obsolete except Britain, dialectal) fleak",
                    "There were a few flakes of paint on the floor from when we were painting the walls.",
                    "flakes of dandruff"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A scale of a fish or similar animal",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) A prehistoric tool chipped out of stone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A person who is impractical, flighty, unreliable, or inconsistent; especially with maintaining a living.",
                  "examples": [
                    "She makes pleasant conversation, but she's kind of a flake when it comes time for action."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A carnation with only two colours in the flower, the petals having large stripes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat turn or tier of rope.",
                  "examples": [
                    "Admiral: What mean you by flakes?",
                    "Captain: They are only those several circles or rounds of the roapes or cables, that are quoiled up round."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, law enforcement, slang) A corrupt arrest, e.g. to extort money for release or merely to fulfil a quota.",
                  "examples": [
                    "When police decided to score gamblers, they would most often flake people with gambling slips, then demand $25 or $50 for not arresting them. Other times, they would simply threaten a flake and demand money."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wire rack for drying fish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flake (third-person singular simple present flakes, present participle flaking, simple past and past participle flaked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To break or chip off in a flake.",
                  "examples": [
                    "Synonym: (obsolete, rare) fleak",
                    "The paint flaked off after only a year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) To prove unreliable or impractical; to abandon or desert, to fail to follow through.",
                  "examples": [
                    "He said he'd come and help, but he flaked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(technical) To store an item such as rope or sail in layers",
                  "examples": [
                    "The line is flaked into the container for easy attachment and deployment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, slang) To hit (another person).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, law enforcement, slang) To plant evidence to facilitate a corrupt arrest.",
                  "examples": [
                    "When police decided to score gamblers, they would most often flake people with gambling slips, then demand $25 or $50 for not arresting them. Other times, they would simply threaten a flake and demand money."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lay out on a flake for drying.",
                  "examples": [
                    "flake a fish"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A name given to dogfish to improve its marketability as a food, perhaps from etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flake (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) Dogfish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) The meat of the gummy shark.",
                  "examples": [
                    "Larger shark received about 10%/kg less than those in the 4-6 kg range. Most of the Victorian landed product is wholesaled as carcasses on the Melbourne Fish Market where it is sold to fish and chip shops, the retail sector and through restaurants as ‘flake’."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Compare Icelandic flaki, Icelandic fleki, Danish flage, Dutch vlaak."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flake (plural flakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) A paling; a hurdle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A platform of hurdles, or small sticks made fast or interwoven, supported by stanchions, for drying codfish and other things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A small stage hung over a vessel's side, for workmen to stand on while calking, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Alternative form of fake (“turn or coil of cable or hawser”)",
                  "examples": [
                    "Flake after flake ran out of the tubs, until we were compelled to hand the end of our line to the second mate to splice his own on to."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}