{
  "word": "blotch",
  "etymologies": [
    {
      "description": [
        "Uncertain. Perhaps a blend of blot +‎ botch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blotch (plural blotches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An uneven patch of color or discoloration.",
                  "examples": [
                    "[…]  in healing those Blotches and Tumours which break out in the body  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An irregularly shaped area.",
                  "examples": [
                    "His shirt showed big blotches of moisture, and the sweat was rolling in clear drops along the creases in his brown neck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Imperfection; blemish on one’s reputation, stain.",
                  "examples": [
                    "There never can be equality of rewards or possessions so long as the human plan contains varied talents and differing degrees of industry and thrift, but ours ought to be a country free from the great blotches of distressed poverty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various crop diseases that cause the plant to form spots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bright or dark spot on old film caused by dirt and  loss of the gelatin covering the film, due to age and poor film quality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dark spot on the skin; a pustule.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Blotting paper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blotch (third-person singular simple present blotches, present participle blotching, simple past and past participle blotched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark with blotches.",
                  "examples": [
                    "Upon the whole, the spirit and relief of the figures, with the strength of the colouring, render it a most noble picture; and it is not done in the coarse blotching stile, so common to the pieces which pass under the name of Bassan."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To develop blotches, to become blotchy.",
                  "examples": [
                    "[…]  when a man is going to drive cattle out of the county he has to put a road-brand on them  […]  It is generally made of letters or figures, or something that won’t cross lines, because where they cross they are apt to blotch and then it’s hard to tell what the brand is and who the animal belongs to."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}