{
  "word": "ethnic",
  "etymologies": [
    {
      "description": [
        "From Middle English ethnik, from Latin ethnicus (\"pagan\", \"heathen\"), from Ancient Greek ἐθνικός (ethnikós, “of or for a nation, heathen”), from ἔθνος (éthnos, “a company\", later \"a people or nation, heathens”)."
      ],
      "adjectives": [
        {
          "description": "ethnic (comparative more ethnic, superlative most ethnic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to a group of people having common racial, ancestral, national, religious or cultural origins.",
                  "examples": [
                    "There are many ethnic Indonesians in the Netherlands"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic of a foreign or a minority group's culture.",
                  "examples": [
                    "I like to eat ethnic food"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Representative of a folk or traditional mode of expression.",
                  "examples": [
                    "popular music is usually positioned between classical music on the one hand and folk or ethnic music on the other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Heathen, not Jewish, Christian, or Muslim.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "ethnic (plural ethnics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ethnic person, especially a foreigner or member of an immigrant community.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A heathen, a pagan.",
                  "examples": [
                    "...And the people of God, redeemed and washed with Christ's blood, and dignified with so many glorious titles of saints and sons in the Gospel, are now no better reputed than impure ethnics and lay dogs..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in classical scholarship) The demonym of an Ancient Greek city.",
                  "examples": [
                    "\"Coinage with the ethnic ΑΝΤΙΟΧΕΩΝ ΠΡΟΣ ΕΥΦΡΑΤΗΝ survives from the mid-second century A.D.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}