{
  "word": "further",
  "etymologies": [
    {
      "description": [
        "From Middle English further, forther, from Old English forþor, furþor (“further”, adverb), from Proto-West Germanic *furþer, from Proto-Indo-European *per- (a common preposition), equivalent to fore + -ther (a vestigial comparative ending still present in such words as other, either, whether, and, in altered form, in after); or as sometimes stated, as forth +‎ -er. Cognate with Scots forder, furder, Saterland Frisian foarder, West Frisian fierder, Dutch verder, German fürder."
      ],
      "adjectives": [
        {
          "description": "further (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparative form of far) More distant; relatively distant.",
                  "examples": [
                    "See those two lampposts? Run to the further one.",
                    "He was standing at the further end of the corridor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "More, additional.",
                  "examples": [
                    "I have one further comment to make."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "further (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparative form of far) To, at or over a greater distance in space, time or other extent.",
                  "examples": [
                    "I can run further than you.",
                    "I live a little further out of town.",
                    "How was your company doing ten years further back?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparative form of far) To a greater extent or degree.",
                  "examples": [
                    "Of the two civilisations, this one was further advanced.",
                    "I do not propose to discuss it any further. - Please, let me explain just a little further."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Beyond what is already stated or is already the case.",
                  "examples": [
                    "Chapter 10 further explains the ideas introduced in Chapter 9.",
                    "Don't confuse things further.",
                    "Further, affiant sayeth naught. (A formal statement ending a deposition or affidavit, immediately preceding the affiant's signature.)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(conjunctive) Also; in addition; furthermore; moreover.",
                  "examples": [
                    "It is overlong, and further, it makes no sense."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the phrase 'further to') Following on (from).",
                  "examples": [
                    "Further to our recent telephone call, I am writing to clarify certain points raised.",
                    "This example is further to the one on page 17."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "further (third-person singular simple present furthers, present participle furthering, simple past and past participle furthered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To help forward; to assist.",
                  "examples": [
                    "Upon this he brought me a cotton bag and giving it to me, said, \"Take this bag and fill it with pebbles from the beach and go forth with a company of the townsfolk to whom I will give a charge respecting thee. Do as they do and belike thou shalt gain what may further thy return voyage to thy native land.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To encourage growth; to support progress or growth of something; to promote.",
                  "examples": [
                    "Further the economy.",
                    "to further the peace process"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}