{
  "word": "bail",
  "etymologies": [
    {
      "description": [
        "From Middle English baille, from the Old French verb bailler (“to deliver or hand over”) and noun bail (“lease”), from Latin bāiulāre, present active infinitive of bāiulō (“carry or bear”), from baiulus (“porter; steward”) (English: bailiff)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bail (plural bails)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Security, usually a sum of money, exchanged for the release of an arrested person as a guarantee of that person's appearance for trial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, UK) Release from imprisonment on payment of such money.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, UK) The person providing such payment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bucket or scoop used for removing water from a boat etc.",
                  "examples": [
                    "The bail of a canoe  […]  made of a human skull."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who bails water out of a boat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Custody; keeping.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bail (third-person singular simple present bails, present participle bailing, simple past and past participle bailed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To secure the release of an arrested person by providing bail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To release a person under such guarantee.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To hand over personal property to be held temporarily by another as a bailment.",
                  "examples": [
                    "to bail cloth to a tailor to be made into a garment; to bail goods to a carrier"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive, intransitive) To remove (water) from a boat by scooping it out.",
                  "examples": [
                    "to bail water out of a boat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive) To remove water from (a boat) by scooping it out.",
                  "examples": [
                    "to bail a boat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To set free; to deliver; to release.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From a shortening of bail out, which from above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bail (third-person singular simple present bails, present participle bailing, simple past and past participle bailed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To exit quickly.",
                  "examples": [
                    "With his engine in flames, the pilot had no choice but to bail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, transitive with on) To fail to meet a commitment (to a person).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English beyle, from Old English bīeġels, from bīeġan +‎ -els."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bail (plural bails)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hoop, ring or handle (especially of a kettle or bucket).",
                  "examples": [
                    "I reached across beneath the cow to attach a metal bail to each end of the strap so that the bail hung about 5 inches below the cow's belly. […] While stroking and talking to the cow, I reached under and suspended the machine on the bail beneath the cow, with its four suction cups dangling to one side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stall for a cow (or other animal) (usually tethered with a semi-circular hoop).",
                  "examples": [
                    "More recently, the fixed bail, sometimes called the ‘milking parlour’, with either covered or open yards, has had a certain vogue and some very enthusiastic claims have been made for this method of housing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hinged bar as a restraint for animals, or on a typewriter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia and New Zealand) A frame to restrain a cow during milking or feeding.",
                  "examples": [
                    "But until he had poured enough milk into the vat above the separator, I drove unmilked cows into the bail where he had previously milked and released one. He moved from one bail to the other to milk the next one I had readied. I drove each cow into the empty bail, chained her in, roped the outer hind leg then washed and massaged the udder and teats."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hoop, ring, or other object used to connect a pendant to a necklace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) One of the two wooden crosspieces that rest on top of the stumps to form a wicket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(furniture) Normally curved handle suspended between sockets as a drawer pull. This may also be on a kettle or pail.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bail (third-person singular simple present bails, present participle bailing, simple past and past participle bailed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To secure the head of a cow during milking.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French baillier."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bail (third-person singular simple present bails, present participle bailing, simple past and past participle bailed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) To confine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand) To secure (a cow) by placing its head in a bail for milking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, usually with up) To keep (a traveller) detained in order to rob them; to corner (a wild animal); loosely, to detain, hold up.",
                  "examples": [
                    "The transition over the rooftop would have been quicker if Sellers had not been bailed up by a particularly hostile spiritual presence speaking Swedish."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}