{
  "word": "crumble",
  "etymologies": [
    {
      "description": [
        "From earlier crymble, crimble, from Middle English *crymblen, kremelen, from Old English *crymlan (“to crumble”), from *crymel (“a small crumb; crumble”), diminutive of Old English cruma (“crumb”), equivalent to crumb +‎ -le (diminutive suffix). Compare Dutch kruimelen (“to crumble”), German Low German krömmeln (“to crumble”), German Krümel, diminutive of German Krume, German krümeln, krümmeln (“to crumble”). Alteration of vowel due to analogy with crumb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crumble (countable and uncountable, plural crumbles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dessert of British origin containing stewed fruit topped with a crumbly mixture of fat, flour, and sugar.",
                  "examples": [
                    "blackberry and apple crumble",
                    "Synonyms: crisp, crunch"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crumble (third-person singular simple present crumbles, present participle crumbling, simple past and past participle crumbled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, often figurative) To fall apart; to disintegrate.",
                  "examples": [
                    "The empire crumbled when the ruler's indiscretions came to light."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To break into crumbs.",
                  "examples": [
                    "We crumbled some bread into the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mix (ingredients such as flour and butter) in such a way as to form crumbs.",
                  "examples": [
                    "Using your fingers, crumble the ingredients with the fingertips, lifting in an upward motion, until the mixture is sandy and resembles large breadcrumbs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}