{
  "word": "opponent",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin oppōnēns (“opposing”), present active participle of oppōnō (“I oppose”)."
      ],
      "adjectives": [
        {
          "description": "opponent (comparative more opponent, superlative most opponent)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Opposing; adverse; antagonistic.",
                  "examples": [
                    "[…]  we are to consider enemies as men opponent to peace and justice, and to these they are by warrs to be reduced; And no other ends in the pursuite of enemies by sword and hostile Acts are to be sought for  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Situated in front; opposite.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "opponent (plural opponents)",
          "definitionGroups": [
            {
              "group": "One who opposes another; one who works or takes a position against someone or something; one who attempts to stop the progress of someone or something.",
              "entries": [
                {
                  "meaning": "One who opposes another physically (in a fight, sport, game, or competition).",
                  "examples": [
                    "In the Chariot-Race Achilles is represented as being able to conquer every Opponent  […]"
                  ]
                },
                {
                  "meaning": "One who opposes another in words (in a dispute, argument or controversy).",
                  "examples": [
                    "It is easier to confound than to convince an opponent; the former may be effected by a turn that has more happiness than truth in it."
                  ]
                },
                {
                  "meaning": "One who is opposed or objects (to a policy, course of action or set of ideas).",
                  "examples": [
                    "She was a dedicated opponent of the death penalty."
                  ]
                },
                {
                  "meaning": "(historical) The participant who opens an academic debate by putting forward objections to a theological or philosophical thesis.",
                  "examples": [
                    "We make the argument appere slender, when we receiue it laughyngly, and declare by wordes, euen at the first, that it is nothyng to the purpose, and so abashe the opponent."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}