{
  "word": "breeder",
  "etymologies": [
    {
      "description": [
        "breed +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "breeder (plural breeders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who breeds plants or animals (professionally).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) A person who has had or who is capable of having children; a person who is focussed on the rearing of their own children.",
                  "examples": [
                    "The number of souls in this kingdom being usually reckoned one million and a half, of these I calculate there may be about two hundred thousand couple whose wives are breeders; from which number I subtract thirty thousand couples who are able to maintain their own children, although I apprehend there cannot be so many, under the present distresses of the kingdom; but this being granted, there will remain an hundred and seventy thousand breeders."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gay slang, derogatory) A heterosexual; i.e. one whose sexual intercourse can lead to breeding.",
                  "examples": [
                    "Synonyms: see Thesaurus:heterosexual",
                    "Since the breeders started coming here, you can never tell who likes cock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ellipsis of breeder reactor.; a type of nuclear reactor that creates more fissile material than it consumes, often used for the production of atomic weapons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cellular automata) A pattern that exhibits quadratic growth by generating multiple copies of a secondary pattern, each of which then generates multiple copies of a tertiary pattern.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}