{
  "word": "leaf",
  "etymologies": [
    {
      "description": [
        "From Middle English leef, from Old English lēaf, from Proto-West Germanic *laub, from Proto-Germanic *laubą (“leaf”), from Proto-Indo-European *lowbʰ-o-m, from *lewbʰ- (“leaf, rind”)",
        "See also West Frisian leaf, Low German Loov, Dutch loof, German Laub, Danish løv, Swedish löv, Norwegian Nynorsk lauv, Icelandic lauf; also Irish luibh (“herb”), Latin liber (“bast; book”), Lithuanian lúoba (“bark”), Albanian labë (“rind”), Latvian luba (“plank, board”), Russian луб (lub, “bast”).",
        "(Internet slang: Canadian): In reference to the maple leaf as national symbol."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leaf (countable and uncountable, plural leaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The usually green and flat organ that represents the most prominent feature of most vegetative plants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything resembling the leaf of a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sheet of a book, magazine, etc (consisting of two pages, one on each face of the leaf).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sheet of any substance beaten or rolled until very thin.",
                  "examples": [
                    "gold leaf",
                    "Synonyms: folio, folium"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(advertising, dated) Two pages.",
                  "examples": [
                    "Heretofore advertisers have had to buy and pay for a leaf — two pages."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) Tea leaves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat section used to extend the size of a table.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plural leaves or leafs) A moveable panel, e.g. of a bridge or door, originally one that hinged but now also applied to other forms of movement.",
                  "examples": [
                    "The train car has one single-leaf and two double-leaf doors per side.",
                    "Hyponym: doorleaf",
                    "Meronym: stile"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A foliage leaf or any of the many and often considerably different structures it can specialise into.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, mathematics) In a tree, a node that has no descendants.",
                  "examples": [
                    "The algorithm pops the stack to obtain a new current node when there are no more children (when it reaches a leaf)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The layer of fat supporting the kidneys of a pig, leaf fat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the teeth of a pinion, especially when small.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Cannabis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang, humorous, sometimes pejorative, plural leafs) A Canadian person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "leaf (third-person singular simple present leafs, present participle leafing, simple past and past participle leafed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce leaves; put forth foliage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To divide (a vegetable) into separate leaves.",
                  "examples": [
                    "The lettuce in our burgers is 100% hand-leafed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}