{
  "word": "overlap",
  "etymologies": [
    {
      "description": [
        "over- +‎ lap",
        "Cognate with Dutch overlap."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "overlap (plural overlaps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that overlaps or is overlapped",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby) a situation in the game where an attacking line has more players in it than the defensive line coming to meet it. The attacking side may exploit the overlap by using their superior numbers to break the opposition's defensive line. If attackers outnumber defenders by more than one player this is often termed a two man overlap or three man overlap, etc. If the attacking side fails to break through usually due to poor execution, they are said to waste an overlap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(insurance, pensions) The payment of a spouse's or other dependant's annuity benefits concurrently with the member's benefits, on death of the member during the guarantee period.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "overlap (third-person singular simple present overlaps, present participle overlapping, simple past and past participle overlapped) (transitive, intransitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To extend over and partly cover something.",
                  "examples": [
                    "The mouse-mat overlapped the edge of the desk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have an area, range, character or function in common.",
                  "examples": [
                    "The two maps overlapped at the east and west edges."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Of sets: to have some elements in common.",
                  "examples": [
                    "The set (all men) overlaps the set (vegetarians)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) To have some similar nucleotide sequences.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}