{
  "word": "mummy",
  "etymologies": [
    {
      "description": [
        "From Middle English mummie, from Anglo-Norman mumie, from Middle French momie, from Medieval Latin mumia, from Arabic مُومِيَاء‎ (mūmiyāʔ), from Persian مومیا‎ (mumyâ), from موم‎ (mum, “wax”). Doublet of mumijo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mummy (countable and uncountable, plural mummies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An embalmed human or animal corpse wrapped in linen bandages for burial, especially as practised by the ancient Egyptians and some Native American tribes. [from 17th c.]",
                  "examples": [
                    "[…]  Mr. Pearson proceeds to give a particular description of the very perfect mummy of an Ibis, which forms the chief subject of the present paper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, by extension) A reanimated embalmed human corpse, as a stock character in horror films. [from 20th c.]",
                  "examples": [
                    "For many, mummies fascinate more than repel. Our horrific connotations lie not so much with the mummy itself, but in associated fears. The mummy serves, of course, as a general reminder of our own mortality and our fear of death, but this alone is not enough to make it a monster."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, by extension) Any naturally preserved human or animal body. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, now rare) A brown pigment originally prepared from the ground-up remains of Egyptian animal or human mummies mixed with bitumen, etc. [from 19th c.]",
                  "examples": [
                    "Synonym: mummy brown"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, now rare) A pulp. [from 17th c.]",
                  "examples": [
                    "Going up to him, therefore, he laid hold on his lance, and breaking it, began to thresh him so severely, that, in spite of the resistance of his armour, he was almost beaten into mummy  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, medicine, now historical) A substance used in medicine, prepared from mummified flesh. [from 14th c.]",
                  "examples": [
                    "Yet another scatological medicament was obtained from mummy, the material derived from a dried or embalmed human corpse, the most valuable being that imported from Mizraim (ancient Egypt)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, horticulture, obsolete) A sort of wax used in grafting. [18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mummy (third-person singular simple present mummies, present participle mummying, simple past and past participle mummied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To mummify.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Diminutive of mum, related to mom and mommy, from mother."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mummy (plural mummies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, usually childish) mother.",
                  "examples": [
                    "“Oh, mummy, would you like the loveliest daughter-in-law in the world? Oh, mummy, I must marry Flora Dewsley. But I know I am not nearly good enough, mummy. She knows nothing of the world and its wickedness, and I — Well, mummy, at school, a fellow learns everything. And no man is perfect, is he, mummy? […] ”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}