{
  "word": "sentence",
  "etymologies": [
    {
      "description": [
        "Borrowing from Middle French sentence, from Latin sententia (“way of thinking, opinion, sentiment”), from sentiēns, present participle of sentiō (“to feel, think”), ultimately from Proto-Indo-European *sent- (“to feel”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sentence (plural sentences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) The decision or judgement of a jury or court; a verdict. [from 14th c.]",
                  "examples": [
                    "The court returned a sentence of guilt in the first charge, but innocence in the second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The judicial order for a punishment to be imposed on a person convicted of a crime. [from 14th c.]",
                  "examples": [
                    "The judge declared a sentence of death by hanging for the infamous child rapist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A punishment imposed on a person convicted of a crime.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A saying, especially from a great person; a maxim, an apophthegm. [14th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A grammatically complete series of words consisting of a subject and predicate, even if one or the other is implied, and typically beginning with a capital letter and ending with a full stop or other punctuation. [from 15th c.]",
                  "examples": [
                    "Hypernym: syntagma",
                    "The children were made to construct sentences consisting of nouns and verbs from the list on the chalkboard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) A formula with no free variables. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing theory) Any of the set of strings that can be generated by a given formal grammar. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sense; meaning; significance.",
                  "examples": [
                    "Noght o word spak he moore than was neede,",
                    "And that was seyd in forme and reverence",
                    "And short and quyk and ful of hy sentence ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One's opinion; manner of thinking. [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A pronounced opinion or judgment on a given question. [from 14th c.]",
                  "examples": [
                    "By them [Luther's works] we might pass sentence upon his doctrines."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sentence (third-person singular simple present sentences, present participle sentencing, simple past and past participle sentenced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To declare a sentence on a convicted person; to condemn to punishment.",
                  "examples": [
                    "The judge sentenced the embezzler to ten years in prison, along with a hefty fine.",
                    "Synonym: pass sentence"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially law or poetic) To decree, announce, or pass as a sentence.",
                  "examples": [
                    "“We are empowered to deliver thee to prison; yea, the law commands us to sentence death upon the abettors of this mischief. […] \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To utter sententiously.",
                  "examples": [
                    "Let me heare one wise man sentence it, rather then twenty Fooles, garrulous in their lengthened tattle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}