{
  "word": "privilege",
  "etymologies": [
    {
      "description": [
        "From Middle English privilege, from Anglo-Norman privilege and Old French privilege, from Latin prīvilēgium (“ordinance or law against or in favor of an individual”), from prīvus (“private”) + lēx, lēg- (“law”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "privilege (countable and uncountable, plural privileges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical law, now chiefly historical) An exemption from certain laws granted by the Pope. [from 8th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A particular benefit, advantage, or favor; a right or immunity enjoyed by some but not others; a prerogative, preferential treatment. [from 10th c.]",
                  "examples": [
                    "Synonyms: franchise, (UK dialect) freelage, immunity, prerogative, right",
                    "All first-year professors here must teach four courses a term, yet you're only teaching one! What entitled you to such a privilege?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An especially rare or fortunate opportunity; the good fortune (to do something). [from 14th c.]",
                  "examples": [
                    "I had the privilege to sit near him in the House for a small part of his Commons service and there was an additional device provided to aid his participation in debates."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The fact of being privileged; the status or existence of (now especially social or economic) benefit or advantage within a given society. [from 14th c.]",
                  "examples": [
                    "Synonyms: advantage, foredeal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A right or immunity enjoyed by a legislative body or its members. [from 16th c.]",
                  "examples": [
                    "Synonym: immunity"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, finance, now rare) A stock market option. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A common law doctrine that protects certain communications from being used as evidence in court.",
                  "examples": [
                    "Your honor, my client is not required to answer that; her response is protected by attorney-client privilege."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An ability to perform an action on the system that can be selectively granted or denied to users.",
                  "examples": [
                    "Synonym: permission"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "privilege (third-person singular simple present privileges, present participle privileging, simple past and past participle privileged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To grant some particular right or exemption to; to invest with a peculiar right or immunity; to authorize",
                  "examples": [
                    "to privilege representatives from arrest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To bring or put into a condition of privilege or exemption from evil or danger; to exempt; to deliver.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}