{
  "word": "onager",
  "etymologies": [
    {
      "description": [
        "From Middle English onager, onagir (“wild ass; military catapult”), from Anglo-Norman onager, Middle French onager, onagre, Old French onager, onagre (“wild ass; military catapult”) (modern French onagre), from Late Latin onager (“large siege engine”), Latin onager (“wild ass”), from Hellenistic Ancient Greek ὄναγρος (ónagros, “wild ass”), Byzantine Ancient Greek ὄναγρος (ónagros, “large siege engine”), from ὄνος (ónos, “ass”) + ἄγριος (ágrios, “wild”) (from ᾰ̓γρός (agrós, “countryside; field”) (possibly ultimately from Proto-Indo-European *h₂eǵ- (“to drive”)) + -ῐος (-ios, suffix forming adjectives)).",
        "The “military engine” sense alludes to the strong recoil of the engine, likened to an onager’s kick; see the 2007 quotation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "onager (plural onagers or onagri)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The Asiatic wild ass or hemione (Equus hemionus), an animal of the horse family native to Asia; specifically, the Persian onager, Persian wild ass, or Persian zebra (Equus hemionus onager).",
                  "examples": [
                    "Synonym: (obsolete) hemionus"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) A military engine acting like a sling which threw stones from a bag or wooden bucket powered by the torsion from a bundle of ropes or sinews operated by machinery; a torsion catapult.",
                  "examples": [
                    "Hypernym: catapult",
                    "Coordinate term: mangonel, trebuchet"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}