{
  "word": "utility",
  "etymologies": [
    {
      "description": [
        "From Middle English utilite, from Old French utilite, utilitet (“usefulness”), from Latin ūtilitās, from uti (“to use”). Surface etymology utile +‎ -ity."
      ],
      "adjectives": [
        {
          "description": "utility",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having to do with, or owned by, a service provider.",
                  "examples": [
                    "utility line; utility bill"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Of a building or its components) containing or intended for any of a building’s often-utility-related commodity transport, such as pipes or wires, or converting equipment, such as furnaces, water tanks or heaters, circuit breakers, central air conditioning units, laundry facilities, etc.",
                  "examples": [
                    "utility room; utility corridor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Functional rather than attractive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "utility (countable and uncountable, plural utilities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or condition of being useful; usefulness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is useful.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics) The ability of a commodity to satisfy needs or wants; the satisfaction experienced by the consumer of that commodity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) Well-being, satisfaction, pleasure, or happiness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, finance) A natural or legal areal monopoly distributer of a commodity (less often a service) delivered in continuous flows to multiple consumers from a common physical, infrastructural network, such as an electric company or water company; or, the securities of such a provider.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A software program designed to perform a single task or a small range of tasks, often to help manage and tune computer hardware, an operating system or application software.",
                  "examples": [
                    "I've bought a new disk utility that can recover deleted files."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The ability to play multiple positions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}