{
  "word": "ankle",
  "etymologies": [
    {
      "description": [
        "From Middle English ankel, ancle, ankyll, from Old English ancol (compare anclēow (“ankle”) > Modern English anclef, ancliff, ancley), from Proto-Germanic *ankulaz (“ankle, hip”); akin to Icelandic ökkla, ökli, Danish and Swedish ankel, Dutch enklaauw, enkel, German Enkel, Old Norse akka, Old Frisian anckel, and perhaps Old High German encha, ancha (“thigh”, “shin”), from the Proto-Germanic *ankijǭ (“ankle”, “hip”).",
        "Compare with Sanskrit अङ्ग (aṅga, “limb”), अङ्गुरि (aṅguri, “finger”), Latin angulus. Compare haunch and Greek prefix ἀγκυλο- (ankulo-, “joint, crooked, bent”). Doublet of angulus and angle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ankle (plural ankles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The skeletal joint which connects the foot with the leg; the uppermost portion of the foot and lowermost portion of the leg, which contain this skeletal joint.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ankle (third-person singular simple present ankles, present participle ankling, simple past and past participle ankled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) To walk.",
                  "examples": [
                    "After a while he got up and ankled his way down the corridor and met Penny coming out of the toilet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling) To cyclically angle the foot at the ankle while pedaling, to maximize the amount of work applied to the pedal during each revolution.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}