{
  "word": "reef",
  "etymologies": [
    {
      "description": [
        "From earlier riff, from Middle English rif, from Old Norse rif (“rib, reef”), from Proto-Germanic *ribją (“rib, reef”), from Proto-Indo-European *h₁rebʰ- (“arch, ceiling, cover”). Dutch rif (“reef”), Low German riff, reff (“reef”), German Riff (“reef, ledge”) are also borrowed from Old Norse. Doublet of rib."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reef (plural reefs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chain or range of rocks, sand, or coral lying at or near the surface of the water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, South Africa) A large vein of auriferous quartz; hence, any body of rock yielding valuable ore.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English reef, from Old Norse rif, Middle Dutch rif, rēve, and/or Middle Low German ref. Possibly a figurative use of the word for “rib” in etymology 1 above, in which case all forms must, again, be borrowings from Old Norse. Alternatively it may be a different word related to Old English rift (“curtain, veil”), ārāfian (“to uncoil, wind off”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reef (plural reefs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A portion of a sail rolled and tied down to lessen the area exposed in a high wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reef knot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "reef (third-person singular simple present reefs, present participle reefing, simple past and past participle reefed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To take in part of a sail in order to adapt the size of the sail to the force of the wind.",
                  "examples": [
                    "Be sure the blocks are securely mounted—they carry a fairish load when the sail is reefed.",
                    "If both reefing line and main halyard are led to the cockpit, even singlehanded reefing is a breeze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) To pull or yank strongly, especially in relation to horse riding.",
                  "examples": [
                    "And when the Cup came on he stirred them up ′round the barrier and he flew out of the barrier and he pulled and reefed and pulled and reefed and Lewis didn′t let him settle down until about three furlongs from home and when he did settle the horse was all out of stride and he went back through the field a fair bit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, of paddles) To move the floats of a paddle wheel toward its center so that they will not dip so deeply.",
                  "examples": [
                    "Reef the paddles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To manipulate the lining of a person's pocket in order to steal the contents unnoticed.",
                  "examples": [
                    "This was done by \"reefing.\" He put two fingers just inside the opening and lifted the lining a trifle. Although I watched his hands, I could feel nothing, so gently did his fingers work. Reefing a couple of times, he lifted my handkerchief, as he might have taken out anything else."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English ref, hreof, from Old English hrēof (“rough, scabby, leprous\", also \"a leper”), from Proto-Germanic *hreubaz (“rough, scabby, scrubby”), from Proto-Indo-European *kreup- (“scab, crust”), related to Old English hrēofla (“leprosy, leper”). Cognate with Scots reif (“a skin disease leaving crusts on the skin, the scab”), Old High German riob (“leprous, scabby, mangy”), Icelandic hrjúfur (“scabby, rough”). Compare riffe, dandruff."
      ],
      "adjectives": [
        {
          "description": "reef (comparative reefer or more reef, superlative reefest or most reef)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Scabby; scurvy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "reef (plural reefs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Now chiefly dialectal) The itch; any eruptive skin disorder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Now chiefly dialectal) Dandruff.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}