{
  "word": "bulldog",
  "etymologies": [
    {
      "description": [
        "bull +‎ dog, in reference to bullbaiting."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bulldog (plural bulldogs)",
          "definitionGroups": [
            {
              "group": "A breed of dog developed in England by the crossing of the bullbaiting dog and the Pug to produce a ladies' companion dog, having a very smooth coat, a flattened face, wrinkly cheeks, powerful front legs, and smaller hind legs.",
              "entries": [
                {
                  "meaning": "The original form of this breed, the British bulldog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stubborn or determined person.",
                  "examples": [
                    "We need a lawyer who will fight for our case, a real bulldog.",
                    "His bulldog determination was destined to bring him the opportunity he was seeking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A refractory material used as a furnace lining, obtained by calcining the cinder or slag from the puddling furnace of a rolling mill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Oxford University slang) One of the proctors' officers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(professional wrestling) Any move in which the wrestler grabs an opponent's head and jumps forward, so that the wrestler lands, often in a sitting position, and drives the opponent's face into the mat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, publishing) A bulldog edition.",
                  "examples": [
                    "The bulldog's just gone to press."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various species of African freshwater fish in the genus Marcusenius, a type of elephantfish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bulldog (third-person singular simple present bulldogs, present participle bulldogging, simple past and past participle bulldogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, often with into or through) To force oneself (in a particular direction).",
                  "examples": [
                    "Synonym: bull"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To chase (a steer) on horseback and wrestle it to the ground by twisting its horns (as a rodeo performance).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}