{
  "word": "diligence",
  "etymologies": [
    {
      "description": [
        "Borrowed from French diligence."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "diligence (countable and uncountable, plural diligences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Steady application; industry; careful work involving long-term effort.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The qualities of a hard worker, including conscientiousness, determination, and perseverance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Carefulness, in particular, the necessary care appropriate to a particular task or responsibility.",
                  "examples": [
                    "Before entering, however, upon a particular consideration of the distinctions of the common law, with, a view of ascertaining the precise nature and extent of the obligations of the bailee in the various sorts of bailment, it may be of use to say a few words on the subject of the various degrees of care or diligence, which are recognized in that law. It has been justly said, that there are infinite shades of care or diligence, from the slightest momentary thought to the most vigilant anxiety; but extremes in this case, as in most others, are inapplicable to practice. There may be a high degree of diligence, a common degree of diligence, and a slight degree of diligence ; and these, with a view to the business of life, seem all that are necessary to be brought under review. Common or ordinary diligence is that degree of diligence which men in general exert in respect to their own concerns. It may be said to be the common prudence, which men of business and heads of families usually exhibit, in affairs which are interesting to them. Or, as Sir William Jones has expressed it, it is the care, which every person, of common prudence, and capable of governing a family, takes of his own concerns. It is obvious, that this is adopting a very variable standard ; for it still leaves much ground for doubt, as to what is common prudence, and who is capable of governing a family. . . and low, or slight diligence is that, which persons of less than common prudence, or indeed of any prudence at all, take of their own concerns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A four-wheeled public stage-coach, widely used in France before the general establishment of the railways.",
                  "examples": [
                    "The French diligence is a most curious and unique machine : it is a strange compound of the English stage waggon and coach; and it similarly possesses all the conveniences of each without their defects. It contains six, eight, or ten passengers inside, according to its size; and in front is what is called the cabriolet of the diligence for outside passengers, with leather covers, like the body of our one-horse chaises, to defend both the head and legs from the weather. The (Dutch) Diligence, or Post-Waggon. A Diligence, or, as it is usually called, a post-waggon, is established between the principal towns of Holland. The post-waggon is constructed so as to contain six or eight travellers. Each place has its number, and the name of each passenger is registered. When he pays his fare, he obtains a ticket, with a number which indicates where he is to sit. Here, too, except he be very careful, his trunks will be fastened in such an awkward and negligent manner, that they will be frequently cut to pieces by the shaking, or dropped, or stolen on the road. These waggons are covered with waxed cloth, but are not suspended on springs. They are low and narrow : the seat is not remarkably comfortable; and the passenger is in danger of being suffocated by the smoke of his companions, who, if they are Dutch, light their pipes the instant they enter the waggon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, law) The process by which persons, lands, or effects are seized for debt; process for enforcing the attendance of witnesses or the production of writings.",
                  "examples": [
                    "The precepts against parties, to whose oath of verity any point is referred, do only command them to compear at the term, with certification, that if they compear not, they shall be holden as confessing the point referred to their oath; but precepts against witnesses cannot have that certification, but all that can be done against them, or against the havers of writs, is to compel them to appear, and depone; and therefore these precepts are called executorials, because they are for putting the acts to effect by execution: they are also called compulsitors for the same reason. And they are called diligences, because they excuse the users thereof from negligence, whereby posterior diligences being exacty followed, are preferable to prior diligences being neglected, vigilantibus non dormientibus jura subveniunt, which is founded upon that great interest to hasten pleas to an end. They are also called diligences, because though the effect do not follow, yet the user thereof hath endeavoured what he could, and so is held as in the same case as if he had obtained the command of the precept. These precepts are called executorials before executions be thereupon; but they are only called diligences when they are executed in due time.... Diligences are of three sorts, being either upon precepts before decreets, upon acts, or upon decreets. The last sort of diligences and executorials, viz. those after decreets, which serve for putting of decreets to execution, and making them effectual, are ordinarily horning, caption, poinding, charges to remove, and thereupon letters of possession, (which are granted on all decreets in petitory and possessory actions, but declaratory actions need none,) together with the executory actions upon arrestments, and of adjudications of lands and annualrents.."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}