{
  "word": "salute",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin salūtō (“to greet; to wish health to”), from salūs (“greeting, good health”), related to salvus (“safe”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "salute (plural salutes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An utterance or gesture expressing greeting or honor towards someone, now especially a formal, non-verbal gesture made with the arms or hands in any of various specific positions. [from 15th c.]",
                  "examples": [
                    "The soldiers greeted the dignitaries with a crisp salute."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kiss, offered in salutation. [from 16th c.]",
                  "examples": [
                    "[M]aking an apology which, not suspecting his intention, I did not understand, – he gave me a most ardent salute! I have seldom been more surprised. I had no idea of his taking such a freedom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, nautical) A discharge of cannon or similar arms, as a mark of honour or respect. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pyrotechnic device primarily designed to produce a loud bang.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "salute (third-person singular simple present salutes, present participle saluting, simple past and past participle saluted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make a gesture in honor of (someone or something).",
                  "examples": [
                    "They saluted the flag as it passed in the parade."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act in thanks, honor, or tribute; to thank or extend gratitude; to praise.",
                  "examples": [
                    "I would like to salute the many dedicated volunteers that make this project possible."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, informal) to wave, to acknowledge an acquaintance.",
                  "examples": [
                    "I saluted Bill at the concert, but he didn't see me through the crowd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To address, as with expressions of kind wishes and courtesy; to greet; to hail.",
                  "examples": [
                    "He was saluted by Mr. James Hall, with these words: “Well, brother chip! How many murders have you been committing?”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To promote the welfare and safety of; to benefit; to gratify.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To kiss.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}