{
  "word": "skull",
  "etymologies": [
    {
      "description": [
        "From Middle English sculle, scolle (also schulle, scholle), probably from a dialectal form of Old Norse skalli (“bald head, skull”), itself probably related to Old English sċealu (“husk”). Compare Scots scull, Danish skal (“skull”) and skalle (“bald head, skull”), Norwegian skalle, Swedish skalle and especially dialectal Swedish skulle.",
        "Alternatively, perhaps from Old Norse skoltr, skolptr (“muzzle, snout”), akin to Icelandic skoltur (“jaw”), dialectal Swedish skult, skulle (“dome, crown of the head, skull”), Middle Dutch scolle, scholle, Middle Low German scholle, schulle (“clod, sod”), and Scots skult, skolt. Compare also Old High German sciula, skiula (“skull”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skull (plural skulls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The main bones of the head considered as a unit; including the cranium, facial bones, and mandible.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "These bones as a symbol for death; death's-head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The mind or brain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A crust formed on the ladle, etc. by the partial cooling of molten metal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The crown of the headpiece in armour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A shallow bow-handled basket.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "skull (third-person singular simple present skulls, present participle skulling, simple past and past participle skulled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hit in the head with a fist, a weapon, or a thrown object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, golf) To strike the top of (the ball).",
                  "examples": [
                    "Monte swung so hard at the next ball that he skulled it straight right, into the pond: 8 in, 9 out."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See school (“a multitude”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skull (plural skulls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete form of school (“a multitude”).",
                  "examples": [
                    "A knavish skull of boys and girls did pelt at him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}