{
  "word": "sensible",
  "etymologies": [
    {
      "description": [
        "From Latin sēnsibilis (“perceptible by the senses, having feeling, sensible”), from sentiō (“to feel, perceive”)."
      ],
      "adjectives": [
        {
          "description": "sensible (comparative more sensible, superlative most sensible or sensiblest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Acting with or showing good sense; able to make good judgements based on reason, or reflecting such ability.",
                  "examples": [
                    "They ask questions of someone who thinks he's got something sensible to say on some matter when actually he hasn't."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characterized more by usefulness, practicality, or comfort than by attractiveness, formality, or fashionableness, especially of clothing.",
                  "examples": [
                    "I only wear high heels on formal occasions; otherwise, I prefer sensible shoes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially formally) Able to be sensed by the senses or the psyche; able to be perceived.",
                  "examples": [
                    "Air is sensible to the Touch by its Motion, and by its Resistance to Bodies moved in it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Able to feel or perceive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Liable to external impression; easily affected; sensitive.",
                  "examples": [
                    "a sensible thermometer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Of or pertaining to the senses; sensory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Cognizant; having the perception of something; aware of something.",
                  "examples": [
                    "He cannot think at any time, waking or sleeping, without being sensible of it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "sensible (plural sensibles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sensation; sensibility.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which impresses itself on the senses; anything perceptible.",
                  "examples": [
                    "Aristotle distinguished sensibles into common and proper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which has sensibility; a sensitive being.",
                  "examples": [
                    "This melancholy extends itself not to men only, but even to vegetals and sensibles."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}