{
  "word": "chime",
  "etymologies": [
    {
      "description": [
        "From Middle English chime, chim, chimbe, chymbe, a shortening of chimbelle (misinterpreted as chymme-belle, chimbe-belle), from Old English ċimbala, ċimbal (“cymbal”), from Latin cymbalum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chime (plural chimes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical instrument producing a sound when struck, similar to a bell (e.g. a tubular metal bar) or actually a bell. Often used in the plural to refer to the set: the chimes.",
                  "examples": [
                    "Hugo had a recording of someone playing the chimes against a background of surf noise that she found calming.",
                    "Sylvia was a chime player in the school orchestra."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An individual ringing component of such a set.",
                  "examples": [
                    "Peter removed the C♯ chime from its mounting so that he could get at the dust that had accumulated underneath."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small bell or other ringing or tone-making device as a component of some other device.",
                  "examples": [
                    "The professor had stuffed a wad of gum into the chime of his doorbell so that he wouldn't be bothered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sound of such an instrument or device.",
                  "examples": [
                    "The copier gave a chime to indicate that it had finished printing.",
                    "Chimes sing Sunday morn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small hammer or other device used to strike a bell.",
                  "examples": [
                    "Strike the bell with the brass chime hanging on the chain next to it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chime (third-person singular simple present chimes, present participle chiming, simple past and past participle chimed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make the sound of a chime.",
                  "examples": [
                    "The microwave chimed to indicate that it was done cooking.",
                    "I got up for lunch as soon as the wall clock began chiming noon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to sound in harmony; to play a tune, as upon a set of bells; to move or strike in harmony.",
                  "examples": [
                    "And chime their sounding hammers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To utter harmoniously; to recite rhythmically.",
                  "examples": [
                    "Chime his childish verse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To agree; to correspond.",
                  "examples": [
                    "The other lab's results chimed with mine, so I knew we were on the right track with the research."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a rude correspondence of sounds; to jingle, as in rhyming.",
                  "examples": [
                    "It shall not keep one settled pace of time, In the same tune it shall not always chime"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chime (plural chimes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of chine (“edge of a cask; part of a ship; etc.”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}