{
  "word": "goldbrick",
  "etymologies": [
    {
      "description": [
        "From gold +‎ brick, originally (1850s) an actual gold ingot or brick, later a swindle that consisted of selling a putative gold brick, which was only coated in gold. The swindle is attested from 1879, the sense “to swindle” is attested 1902, and the sense “to shirk” is attested 1914, popularized as World War I armed forces slang. In early 1900s, used to refer to an unattractive young woman – not pretty, nor able to talk or dance (attested 1903), thence to refer to incompetent enlisted troops at the start of World War I, reinforced by the rank insignia of second lieutenants, which was a gold rectangle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "goldbrick (plural goldbricks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something fraudulent or nonexistent offered for sale; a swindle or con.",
                  "examples": [
                    "Experience is the biggest gold brick in the world. All older people have it for sale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) A shirker or malingerer.",
                  "examples": [
                    "Mac, there’s not a confounded thing wrong with you. You are an excellent physical specimen and in good health. You’re nothing but a goldbrick. Now, get your butt out of here and don’t ever come back again unless you’re really sick or need an immunization."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) A swindler.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "goldbrick (third-person singular simple present goldbricks, present participle goldbricking, simple past and past participle goldbricked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) To shirk or malinger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) To swindle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}