{
  "word": "overpass",
  "etymologies": [
    {
      "description": [
        "over- +‎ pass"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "overpass (plural overpasses) (chiefly US, Canada, Philippines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A section of a road or path that crosses over an obstacle, especially another road, railway, etc.",
                  "examples": [
                    "The homeless man had built a little shelter, complete with cook-stove, beneath a concrete overpass."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "overpass (third-person singular simple present overpasses, present participle overpassing, simple past and past participle overpassed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pass above something, as when flying or moving on a higher road.",
                  "examples": [
                    "Gillian watched the overpassing shoppers on the second floor of the mall, as she relaxed in the bench on the ground floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exceed, overstep, or transcend a limit, threshold, or goal.",
                  "examples": [
                    "Marshall was really overpassing his authority when he ordered the security guards to fire their tasers at the trespassers.",
                    "The precocious student had really overpassed her peers, and was reading books written for children several years older."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disregard, skip, or miss something.",
                  "examples": [
                    "“Don’t overpass those cheeses; they’re really quite excellent!” gushed Terry, pointing to the buffet table."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}