{
  "word": "lumber",
  "etymologies": [
    {
      "description": [
        "Exact origin unknown. The earliest recorded reference was to heavy, useless objects such as old, discarded furniture. Perhaps from the verb lumber in reference to meaning \"awkward to move\". Possibly influenced by Lumbar, an obsolete variant of Lombard, the Italian immigrant class known for being pawnbrokers and money-lenders in early England."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lumber (usually uncountable, plural lumbers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) Wood sawn into planks or otherwise prepared for sale or use, especially as a building material. [from 17th c.]",
                  "examples": [
                    "Here they live by fishing on the most plentiful coasts in the world; there they fell trees, by the sides of large rivers, for masts and lumber  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Old furniture or other items that take up room, or are stored away. [from 16th c.]",
                  "examples": [
                    "We made all haste down stairs, and soon threw open the street door, for the reception of as much lumber, of all sorts, as our house would hold, brought into it by several who thought it necessary to move their furniture."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Useless or cumbrous material. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pawnbroker's shop, or room for storing articles put in pawn; hence, a pledge, or pawn. [17th–18th c.]",
                  "examples": [
                    "They put all the little plate they had  […] in the lumber, which is pawning it, till the ships came."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, slang) A baseball bat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) An erect penis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lumber (third-person singular simple present lumbers, present participle lumbering, simple past and past participle lumbered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move clumsily and heavily; to move slowly.",
                  "examples": [
                    "...he was only apprized of the arrival of the Monkbarns division by the gee-hupping of the postilion, as the post-chaise lumbered up behind him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, with with) To load down with things, to fill, to encumber, to impose an unwanted burden on.",
                  "examples": [
                    "They’ve lumbered me with all these suitcases.",
                    "I got lumbered with that boring woman all afternoon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To heap together in disorder.",
                  "examples": [
                    "so much stuff lumberd together"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fill or encumber with lumber.",
                  "examples": [
                    "to lumber up a room"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}