{
  "word": "haha",
  "etymologies": [
    {
      "description": [
        "From Middle English haha, ha ha, from Old English ha ha (interjection), ultimately onomatopoeic. Compare Old Frisian haha (interjection), Middle Low German hahā, hahahā (interjection), Middle High German hahā, haha (interjection), all expressions of joy or of laughter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "haha (third-person singular simple present hahas, present participle hahaing or haha-ing, simple past and past participle hahaed or haha-ed or haha'd)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To laugh.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French haha. The French term attested 1686 in toponyms in New France (present-day Quebec); compare modern Saint-Louis-du-Ha! Ha!. Usual etymology is that an expression of surprise – “ha ha” or “ah! ah!” is exclaimed on encountering such a boundary. In France this is traditionally attributed to the reaction of Louis, Grand Dauphin to encountering such a feature in the gardens of the Château de Meudon. The English term attested 1712, in translation by John James of French La theorie et la pratique du jardinage (1709) by Dezallier d'Argenville:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "haha (plural hahas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Type of boundary to a garden, pleasure-ground, or park, designed not to interrupt the view and to be invisible until closely approached.",
                  "examples": [
                    "The Ha Ha But the capital stroke, the leading step to all that, has followed, was (I believe the first thought was Bridgman's) the destruction of walls for boundaries, and the invention of fosses - an attempt then deemed so astonishing, that the common people called them Ha! Ha's! to express their surprise at finding a sudden and unperceived check to their walk. One of the first gardens planted in this simple though still formal style was my father's at Houghton. It was laid out by Mr. Eyre, an imitator of Bridgman. It contains three-and-twenty acres, then reckoned a considerable portion."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "haha (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large leafy Hawaiian plant, Gunnera petaloidea.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}