{
  "word": "turnpike",
  "etymologies": [
    {
      "description": [
        "From Middle English turnpyke (“spiked barrier across a road”), originally used to block access to such a road until toll was paid. Equivalent to modern turn + pike (“shaft”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "turnpike (plural turnpikes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A frame consisting of two bars crossing each other at right angles and turning on a post or pin, to hinder the passage of animals, but admitting a person to pass between the arms; a turnstile.",
                  "examples": [
                    "I moue vpon my axell, like a turne-pike, / Fit my face to the parties, and become / Straight one of them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gate or bar set across a road to stop carriages, animals, and sometimes people, until a toll is paid,",
                  "examples": [
                    "Synonym: tollgate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A winding stairway.",
                  "examples": [
                    "Ramsay stabbed Ruthven accordingly and James lending his assistance they thrust the wounded man down the turnpike by which Ramsay had ascended Voices and steps were now heard advancing upwards and Ramsay knowing the accents called out to sir Thomas Erskine to come up the turnpike stair even to the head Sir Thomas Erskine was accompanied by sir Hugh Harris the king's physician a lame man and unfit for fighting Near the bottom of the turnpike sir Thomas Erskine in his ascent met Ruthven bleeding in the face and neck and called out Fie strike I this is the traitor l on which Alexander Ruthven was run through the body having only breath remaining to say Alas I had no blame of it"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A beam filled with spikes to obstruct passage; a cheval de frise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) A toll road, especially a toll expressway.",
                  "examples": [
                    "Synonym: pike"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematical economics) A trajectory on a finite time interval that satisfies an optimality criterion which is associated with a cost function.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "turnpike (third-person singular simple present turnpikes, present participle turnpiking, simple past and past participle turnpiked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form (a road, etc.) in the manner of a turnpike road, or into a rounded form, as the path of a road.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}