{
  "word": "delve",
  "etymologies": [
    {
      "description": [
        "From Middle English delven, from Old English delfan (“to dig, dig out, burrow, bury”), from Proto-Germanic *delbaną (“to dig”), from Proto-Indo-European *dʰelbʰ- (“to dig”). Cognate with West Frisian dolle (“to dig, delve”), Dutch delven (“to dig, delve”), Low German dölven (“to dig, delve”), dialectal German delben, telben (“to dig, delve”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "delve (third-person singular simple present delves, present participle delving, simple past delved or (obsolete) dolve, past participle delved or (archaic) dolven)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dig into the ground, especially with a shovel.",
                  "examples": [
                    "Delve of convenient depth your thrashing floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To search thoroughly and carefully for information, research, dig into, penetrate, fathom, trace out",
                  "examples": [
                    "She was intensely eager to delve into the mystery of Mr. Joplin and his brief case."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To dig; to excavate.",
                  "examples": [
                    "And then they made an oratory behind the altar, and would have dolven for to have laid the body in that oratory  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English delve, delf, dælf, from Old English delf, ġedelf (“digging”) and dælf (“that which is dug out, delf, ditch”). More at delf."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "delve (plural delves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A pit or den.",
                  "examples": [
                    "I put the clods on top the delve and gave it all a good thumping down with my feet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}