{
  "word": "out",
  "etymologies": [
    {
      "description": [
        "From Middle English out, oute, from a combination of Old English ūt (“out”, preposition & adverb), from Proto-Germanic *ūt (“out”); and Old English ūte (“outside; without”, adverb), from Proto-Germanic *ūtai (“out; outside”); both from Proto-Indo-European *úd (“upwards, away”).",
        "Cognate with Scots oot, out (“out”), Saterland Frisian uut, uute (“out”), West Frisian út (“out”), Dutch uit (“out”), German Low German ut (“out”), German aus (“out”), Norwegian/Swedish ut, ute (“out; outside”), Danish ud, ude (“out; outside”)."
      ],
      "adjectives": [
        {
          "description": "out (not comparable)",
          "definitionGroups": [
            {
              "group": "Not inside a place one might otherwise be expected to be, especially a place one was formerly or is customarily inside:",
              "entries": [
                {
                  "meaning": "Not at home, or not at one's office or place of employment.",
                  "examples": [
                    "I'm sorry, Mr Smith is out at the moment."
                  ]
                },
                {
                  "meaning": "Not in jail, prison, or captivity; freed from confinement",
                  "examples": [
                    "Sentenced to five years, he could be out in three with good behavior."
                  ]
                },
                {
                  "meaning": "Not inside or within something.",
                  "examples": [
                    "I worked away cleaning the U-bend until all the gunge was out."
                  ]
                },
                {
                  "meaning": "Not fitted or inserted into something.",
                  "examples": [
                    "The TV won't work with the plug out!"
                  ]
                },
                {
                  "meaning": "(sports) Of the ball or other playing implement, falling or passing or being situated outside the bounds of the playing area.",
                  "examples": [
                    "I thought the ball hit the line, but the umpire said it was out."
                  ]
                }
              ]
            },
            {
              "group": "Not (or no longer) acceptable or in consideration, play, availability, or operation:",
              "entries": [
                {
                  "meaning": "(in various games; used especially of a batsman or batter in cricket or baseball) Dismissed from play under the rules of the game.",
                  "examples": [
                    "He bowls, Johnson pokes at it  […]  and  […]  Johnson is out! Caught behind by Ponsonby!"
                  ]
                },
                {
                  "meaning": "(of ideas, plans, etc.) Discarded; no longer a possibility.",
                  "examples": [
                    "Right, so that idea's out. Let's move on to the next one."
                  ]
                },
                {
                  "meaning": "(of options) acceptable, permissible",
                  "examples": [
                    "I've got diabetes so cookies are right out"
                  ]
                },
                {
                  "meaning": "(of certain services, devices, or facilities) Not available; out of service.",
                  "examples": [
                    "Power is out in the entire city.",
                    "My wi-fi is out."
                  ]
                },
                {
                  "meaning": "(of a user of a service) Not having availability of a service, such as power or communications.",
                  "examples": [
                    "Most of the city got service back yesterday, but my neighborhood is still out."
                  ]
                },
                {
                  "meaning": "(of lamps, fires etc.) Not shining or burning.",
                  "examples": [
                    "I called round to the house but all the lights were out and no one was home."
                  ]
                },
                {
                  "meaning": "(of an organization, etc.) Temporarily not in operation, or not being attended as usual.",
                  "examples": [
                    "school is out tomorrow due to snow; when college is out for the summer, I'll head back to my home state",
                    "when school gets out today; after school's out I go to the library until my mom gets off work"
                  ]
                },
                {
                  "meaning": "No longer popular or in fashion.",
                  "examples": [
                    "Black is out this season. The new black is white."
                  ]
                }
              ]
            },
            {
              "group": "Open or public (about something).",
              "entries": [
                {
                  "meaning": "(LGBT) Openly acknowledging that one is LGBT+ (gay, trans, etc).",
                  "examples": [
                    "It's no big deal to be out in the entertainment business."
                  ]
                },
                {
                  "meaning": "(by extension, uncommon) Open, public; public about or openly acknowledging some (usually specified)  identity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Freed from from secrecy.",
                  "examples": [
                    "My secret is out."
                  ]
                }
              ]
            },
            {
              "group": "Available to be seen, or to be interacted with in some way:",
              "entries": [
                {
                  "meaning": "Released, available for purchase, download or other use.",
                  "examples": [
                    "Did you hear? Their newest CD is out!"
                  ]
                },
                {
                  "meaning": "(of flowers) In bloom.",
                  "examples": [
                    "The garden looks beautiful now that the roses are out."
                  ]
                },
                {
                  "meaning": "(of the sun, moon or stars) Visible in the sky; not obscured by clouds.",
                  "examples": [
                    "The sun is out, and it's a lovely day."
                  ]
                },
                {
                  "meaning": "(obsolete) Of a young lady: having entered society and available to be courted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of the tide, at or near its lowest level.",
                  "examples": [
                    "You can walk to the island when the tide's out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Without; no longer in possession of; not having more",
                  "examples": [
                    "Do you have any bread? Sorry, we're out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of calculations or measurements) Containing errors or discrepancies; in error by a stated amount.",
                  "examples": [
                    "Nothing adds up in this report. All these figures are out.",
                    "The measurement was out by three millimetres."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "out (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Away from the inside, centre or other point of reference.",
                  "examples": [
                    "The magician tapped the hat, and a rabbit jumped out.",
                    "Once they had landed, the commandos quickly spread out along the beach.",
                    "For six hours the tide flows out, then for six hours it flows in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Away from home or one's usual place.",
                  "examples": [
                    "Let’s eat out tonight"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Outside; not indoors.",
                  "examples": [
                    "Last night we slept out under the stars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Away from; at a distance.",
                  "examples": [
                    "Keep out!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Into a state of non-operation or non-existence.",
                  "examples": [
                    "Turn the lights out.",
                    "Put the fire out.",
                    "I painted out that nasty mark on the wall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To the end; completely.",
                  "examples": [
                    "I haven’t finished. Hear me out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used to intensify or emphasize.",
                  "examples": [
                    "The place was all decked out for the holidays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of the sun, moon, stars, etc.) So as to be visible in the sky, and not covered by clouds, fog, etc.",
                  "examples": [
                    "The sun came out after the rain, and we saw a rainbow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, baseball) Of a player, so as to be disqualified from playing further by some action of a member of the opposing team (such as being stumped in cricket).",
                  "examples": [
                    "Wilson was bowled out for five runs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "out (plural outs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A means of exit, escape, reprieve, etc.",
                  "examples": [
                    "They wrote the law to give those organizations an out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A state in which a member of the batting team is removed from play due to the application of various rules of the game such as striking out, hitting a fly ball which is caught by the fielding team before bouncing, etc.",
                  "examples": [
                    "The first time I saw Amity we were in front of her house playing work-up, a baseball variation where you move from position to position by outs until you get to bat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A dismissal; a state in which a member of the batting team finishes his turn at bat, due to the application of various rules of the game, such as the bowler knocking over the batsman's wicket with the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) A card which can make a hand a winner.",
                  "examples": [
                    "As a beginner, when you are in a hand, you should practice counting your outs, or those live cards left in the deck that can improve your hand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A trip out; an outing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) One who, or that which, is out; especially, one who is out of office.",
                  "examples": [
                    "Antonym: in"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place or space outside of something; a nook or corner; an angle projecting outward; an open space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) A word or words omitted by the compositor in setting up copy; an omission.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [
        {
          "description": "out",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "From the inside to the outside of; out of. [from 14th c.]",
                  "examples": [
                    "Thy roselips and full blue eyes / Take the heart from out my breast."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [
        {
          "description": "out (third-person singular simple present outs, present participle outing, simple past and past participle outed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To eject; to expel.",
                  "examples": [
                    "a king outed of his country"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come or go out; to get out or away; to become public, revealed, or apparent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reveal (a person or organization) as having a certain secret, such as a being a secret agent or undercover detective.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reveal (a secret).",
                  "examples": [
                    "A Brazilian company outed the new mobile phone design."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, LGBT) To reveal (a person) as LGBT+ (gay, trans, etc).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To kill; to snuff out.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}