{
  "word": "rhapsody",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Latin rhapsōdia (“part of an epic poem suitable for uninterrupted recitation”), from Koine Greek ῥαψῳδία (rhapsōidía, “part of an epic poem suitable for uninterrupted recitation; rigmarole”), Ancient Greek ῥαψῳδία (rhapsōidía, “composition or recitation of Epic poetry”), from ῥαψῳδός (rhapsōidós, “composer or performer of Epic poetry”) + -ῐ́ᾱ (-íā, suffix forming feminine abstract nouns). Ῥαψῳδός (Rhapsōidós) is derived from ῥᾰ́πτω (rháptō, “to sew”) (possibly from Proto-Indo-European *werb- (“to bend; to turn”)) + ᾠδή (ōidḗ, “ode; song”) (ultimately from Proto-Hellenic *awoidā́ (“song”)) + -ος (-os, suffix forming o-grade action nouns).",
        "Sense 2.2 (“instrumental composition of irregular form”) probably developed from sense 2.1 (“exaggeratedly enthusiastic or exalted expression of feeling in speech or writing”), and both of these senses may have been influenced by rapture (“extreme excitement, happiness, or pleasure”), the latter being a quality associated with the senses. Sense 2.3 (“literary composition consisting of miscellaneous works”) is borrowed from Middle French rhapsodie (modern French rhapsodie), from Latin rhapsōdia: see above.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rhapsody (plural rhapsodies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Greece, poetry, historical) An epic poem, or part of one, suitable for uninterrupted recitation.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(sometimes with a negative connotation) An exaggeratedly enthusiastic or exalted expression of feeling in speech or writing.",
                  "examples": []
                },
                {
                  "meaning": "(music) An instrumental composition of irregular form, often incorporating improvisation.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) A random collection or medley; a miscellany; also, a confused string of stories, words, etc.",
                  "examples": []
                },
                {
                  "meaning": "(sometimes with a negative connotation, obsolete) A literary composition consisting of miscellaneous works.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rhapsody (third-person singular simple present rhapsodies, present participle rhapsodying, simple past and past participle rhapsodied)",
          "definitionGroups": [
            {
              "group": "Synonym of rhapsodize",
              "entries": [
                {
                  "meaning": "(transitive)",
                  "examples": []
                },
                {
                  "meaning": "To say (something) with exaggerated or rapturous enthusiasm.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, rare) To perform (a rhapsody (“an epic poem, or part of one, suitable for uninterrupted recitation”))",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) Followed by about, on, over, or upon: to speak with exaggerated or rapturous enthusiasm.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}