{
  "word": "scum",
  "etymologies": [
    {
      "description": [
        "From Middle English scum, scome, skum, skome, scumme, from Middle Dutch schūme (“foam”), from Proto-Germanic *skūmaz (“froth, foam”), from Proto-Indo-European *skew- (“to cover, conceal”). Cognate with Dutch schuim (“foam”), German Schaum (“foam”), Danish and Swedish skum (“foam”). Compare also French écume (“scum”), Italian schiuma (“foam”), Walloon schome (“scum, foam”), Lithuanian šamas (“catfish”) and skanus (“tasty”) from the same Germanic source. Related to skim."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scum (countable and uncountable, plural scums)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A layer of impurities that accumulates at the surface of a liquid (especially molten metal or water).",
                  "examples": [
                    "Synonyms: dross, impurity, impurities, cinder, scoriae, slag",
                    "During smelting, scum rises to the surface and is then removed by the smelter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A greenish water vegetation (such as algae), usually found floating on the surface of ponds",
                  "examples": [
                    "These organisms form scum in large quantities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The topmost liquid layer of a cesspool or septic tank.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, chiefly US) Semen. [from 1960s]",
                  "examples": [
                    "Synonyms: see Thesaurus:semen"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang) A reprehensible person or persons.",
                  "examples": [
                    "Synonyms: bastard; see also Thesaurus:jerk",
                    "People who sell used-up pens are scum, just total low-lives."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scum (third-person singular simple present scums, present participle scumming, simple past and past participle scummed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the layer of scum from (a liquid etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove (something) as scum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To become covered with scum.",
                  "examples": [
                    "Take the smallest Cucumbers you can get, and as free from Spots as possible, put them into a strong Salt and Water for nine or ten Days, or 'till they are quite Yellow, and stir them twice a Day at least, or they will scum over, and grow soft"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To scour (the land, sea, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To gather together, as scum.",
                  "examples": [
                    "A great majority of the members are scummed together from the Jacobinical dregs of former periods of the revolution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, informal) To startscum or savescum.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}