{
  "word": "gerrymander",
  "etymologies": [
    {
      "description": [
        "Blend of Gerry +‎ salamander (named after Elbridge Gerry), from the similarity in shape to a salamander of an electoral district created when Gerry was the governor of Massachusetts. Coined by editors of the Boston Gazette in 26 March 1812, in text likely written by Nathan Hale and Benjamin and John Russell, and accompanying a cartoon by Elkanah Tisdale."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gerrymander (plural gerrymanders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) The act of gerrymandering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A voting district skewed by gerrymandering.",
                  "examples": [
                    "Any citizen looking at a map of district 12 could immediately tell that it was a gerrymander because of the ridiculous way it cut across 4 counties while carving up neighborhoods in half."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gerrymander (third-person singular simple present gerrymanders, present participle gerrymandering, simple past and past participle gerrymandered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, derogatory) To divide a geographic area into voting districts in such a way as to give an unfair advantage to one party in an election.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, derogatory, by extension) To draw dividing lines for other types of districts in an unintuitive way to favor a particular group or for other perceived gain.",
                  "examples": [
                    "The superintendent helped gerrymander the school district lines in order to keep the children of the wealthy gated community in the better school all the way across town."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}