{
  "word": "bloom",
  "etymologies": [
    {
      "description": [
        "From Middle English blome, from Old Norse blóm, from Proto-Germanic *blōmô (“flower”). Doublet of bloom (“spongy mass of metal”); see there for more."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bloom (countable and uncountable, plural blooms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blossom; the flower of a plant; an expanded bud.",
                  "examples": [
                    "the rich blooms and enamelled vegetation of the tropics"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) Flowers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The opening of flowers in general; the state of blossoming or of having the flowers open.",
                  "examples": [
                    "The cherry trees are in bloom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A state or time of beauty, freshness, and vigor; an opening to higher perfection, analogous to that of buds into blossoms.",
                  "examples": [
                    "the bloom of youth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rosy colour; the flush or glow on a person's cheek.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The delicate, powdery coating upon certain growing or newly-gathered fruits or leaves, as on grapes, plums, etc.",
                  "examples": [
                    "The bloom on blueberries is the dusty powder that protects them from the Sun; it does not rinse off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything giving an appearance of attractive freshness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An algal bloom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The clouded appearance which varnish sometimes takes upon the surface of a picture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A yellowish deposit or powdery coating which appears on well-tanned leather.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mineralogy) A bright-hued variety of some minerals.",
                  "examples": [
                    "the rose-red cobalt bloom"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) A white area of cocoa butter that forms on the surface of chocolate when warmed and cooled.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) An undesirable halo effect that may occur when a very bright region is displayed next to a very dark region of the screen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) The increase in bullet spread over time as a gun's trigger is kept held.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bloom (“a blossom”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bloom (third-person singular simple present blooms, present participle blooming, simple past and past participle bloomed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to blossom; to make flourish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bestow a bloom upon; to make blooming or radiant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a plant, to produce blooms; to open its blooms.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) Of a person, business, etc, to flourish; to be in a state of healthful, growing youth and vigour; to show beauty and freshness.",
                  "examples": [
                    "A better country blooms to view, / Beneath a brighter sky."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) To bring out the flavor of a spice by cooking it in oil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cooking, of chocolate) To develop a layer of bloom (white, spotty areas of cocoa butter) due to repeated warming and cooling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English blome, from Old English blōma (“flower; lump of metal”), from Proto-Germanic *blōmô (“flower”). Cognate with West Frisian blom, Dutch bloem, German Blume, Icelandic blóm, Danish blomme, Gothic 𐌱𐌻𐍉𐌼𐌰 (blōma). Related to blow, blade, blead; also related to flower, foil, and belladonna."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bloom (plural blooms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The spongy mass of metal formed in a furnace by the smelting process.",
                  "examples": [
                    "These metallic bodies gradually increasing in volume finally conglomerate into a larger mass, the bloom, which is extracted from the furnace with tongs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}