{
  "word": "overlook",
  "etymologies": [
    {
      "description": [
        "From Middle English overloken; equivalent to over- +‎ look."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "overlook (plural overlooks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vista or point that gives a beautiful view.",
                  "examples": [
                    "Normally a visitor does not participate in one activity to the exclusion of others. One main activity, such as swimming, will be supplemented by other activities and use of other facilities, such as picnicking, hiking, stopping at an overlook, and so forth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "overlook (third-person singular simple present overlooks, present participle overlooking, simple past and past participle overlooked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To offer a view (of something) from a higher position.",
                  "examples": [
                    "Our hotel room overlooks the lake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fail to notice; to look over and beyond (anything) without seeing it.",
                  "examples": [
                    "Synonyms: misheed; see also Thesaurus:fail to notice",
                    "These errors were overlooked by the proofreaders."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pretend not to have noticed (something, especially a mistake or flaw); to pass over (something) without censure or punishment.",
                  "examples": [
                    "Synonyms: take no notice of; see also Thesaurus:ignore",
                    "I’m not willing to overlook such bad behaviour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To look down upon (something) from a place that is over or above.",
                  "examples": [
                    "to overlook a valley from a hill"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To supervise, oversee; to watch over.",
                  "examples": [
                    "to overlook a gang of laborers",
                    "to overlook one who is writing a letter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To observe or watch (someone or something) surreptitiously or secretly.",
                  "examples": [
                    "[…]  you had need cause the party whome you will drawe to sit  […]  without stirring or altering the mouth were it neuer so little: wherefore you shall I beleeue find (a mans face) aboue all other creaturs the most troublesome vnto you: for either they will smile, be ouerlooking your hand, or setting their countenances to seeme gratious and comely, giue you choyse of twentie seuerall faces."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To inspect (something); to examine; to look over carefully or repeatedly.",
                  "examples": [
                    "Synonyms: scrutinize; see also Thesaurus:examine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To look upon with an evil eye; to bewitch by looking upon; to fascinate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}