{
  "word": "hieratic",
  "etymologies": [
    {
      "description": [
        "Latin hieraticus, from Ancient Greek ἱερατικός (hieratikós), from ἱερατεία (hierateía, “priesthood”), from ἱερατεύω (hierateúō, “be a priest”), from ἱερεύς (hiereús, “priest”), from ἱερός (hierós, “sacred”).",
        "Use pertaining to the Egyptian writing system originates with the Greek phrase γράμματα ἱερατικά (grámmata hieratiká, literally “priestly writing”), which was first used by Saint Clement of Alexandria in the 2nd century AD, as at that time hieratic was used only for religious texts, as had been the case for the previous thousand years."
      ],
      "adjectives": [
        {
          "description": "hieratic (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to priests, especially pharaonic priests of Ancient Egypt.",
                  "examples": [
                    "Synonyms: sacerdotal, priestly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to the cursive writing system that developed alongside the hieroglyphic system as its ordinary handwritten counterpart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) Extremely stylized, restrained or formal; adhering to fixed types or methods; severe in emotional import.",
                  "examples": [
                    "Some of the more hieratic sculptures leave the viewer curiously unmoved."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "hieratic (plural hieratics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A writing system used in pharaonic Egypt that was developed alongside the hieroglyphic system, primarily written in ink with a reed brush on papyrus, allowing scribes to write quickly without resorting to the time consuming hieroglyphs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}