{
  "word": "ruin",
  "etymologies": [
    {
      "description": [
        "From Middle English ruyne, ruine, from Old French ruine, from Latin ruīna (“overthrow, ruin”), from ruō (“I fall down, tumble, sink in ruin, rush”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ruin (countable and uncountable, plural ruins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, sometimes in the plural) The remains of a destroyed or dilapidated construction, such as a house or castle.",
                  "examples": [
                    "The Veian and the Gabian towirs shall fall, / And one promiscuous ruin cover all; / Nor, after length of years, a stone betray / The place where once the very ruins lay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The state of being a ruin, destroyed or decayed.",
                  "examples": [
                    "The monastery has fallen into ruin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Something that leads to serious trouble or destruction.",
                  "examples": [
                    "Gambling has been the ruin of many."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of ruining something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A fall or tumble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A change that destroys or defeats something; destruction; overthrow.",
                  "examples": [
                    "the ruin of a ship or an army;  the ruin of a constitution or a government;  the ruin of health or hopes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Complete financial loss; bankruptcy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ruin (third-person singular simple present ruins, present participle ruining, simple past and past participle ruined or (dialectal, nonstandard) ruint)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause the fiscal ruin of; to bankrupt or drive out of business.",
                  "examples": [
                    "With all these purchases, you surely mean to ruin us!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To destroy or make something no longer usable.",
                  "examples": [
                    "He ruined his new white slacks by accidentally spilling oil on them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To upset or overturn the plans or progress of, or to have a disastrous effect on something.",
                  "examples": [
                    "My car breaking down just as I was on the road ruined my vacation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make something less enjoyable or likeable.",
                  "examples": [
                    "I used to love that song, but being assaulted when that song was playing ruined the song for me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reveal the ending of (a story); to spoil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To fall into a state of decay.",
                  "examples": [
                    "Though he his house of polisht marble build, / Yet shall it ruine like the Moth's fraile cell"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, historical) To seduce or debauch, and thus harm the social standing of.",
                  "examples": [
                    "The young libertine was notorious for ruining local girls."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}