{
  "word": "din",
  "etymologies": [
    {
      "description": [
        "From Middle English dynne, dyne, dyn, from Old English dyne, from Proto-West Germanic *duni, from Proto-Germanic *duniz, from Proto-Indo-European *dʰún-is, from *dʰwen- (“to make a noise”).",
        "Cognate with Sanskrit धुनि (dhúni, “sounding”), ध्वनति (dhvánati, “to make a noise, to roar”), Old Norse dynr, Norwegian Nynorsk dynja."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "din (countable and uncountable, plural dins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loud noise; a cacophony or loud commotion.",
                  "examples": [
                    "So many faces Clive had never seen by daylight, and looking terrible, like cadavers jerked upright to welcome the newly dead. Invigorated by this jolt of misanthropy, he moved sleekly through the din, ignored his name when it was called, withdrew his elbow when it was plucked [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English dynnen, from Old English dynnan, from Proto-Germanic *dunjaną, from Proto-Indo-European *dʰwen- (“to make a noise”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "din (third-person singular simple present dins, present participle dinning, simple past and past participle dinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a din, to resound.",
                  "examples": [
                    "For, spite of rumbling of the wheels,",
                    "A welcome greeting he can hear;—",
                    "It is a fiddle in its glee",
                    "Dinning from the CHERRY TREE!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) (of a place) To be filled with sound, to resound.",
                  "examples": [
                    "The room was dinning with the strains of an invisible orchestra and the vocal uproar  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assail (a person, the ears) with loud noise.",
                  "examples": [
                    "She ought in such Cases to exert the Authority of the Curtain Lecture; and if she finds him of a rebellious Disposition, to tame him, as they do Birds of Prey, by dinning him in the Ears all Night long."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To repeat continuously, as though to the point of deafening or exhausting somebody.",
                  "examples": [
                    "This has been often dinned in my Ears."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "din (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Islam) Alternative spelling of deen (“religion, faith, religiosity”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}