{
  "word": "wildcat",
  "etymologies": [
    {
      "description": [
        "From Middle English wyld cat, wylde cat (in the plural as wild cattes, wylde catis, wyle cattes), equivalent to wild +‎ cat. Cognate with Middle Low German wiltkatte, German Wildkatze, Swedish vildkatt.",
        "Its adjectival senses were originally American and derived from the \"wildcat banks\" of Michigan, following its elevation to statehood in 1837. Two laws—one easing the requirements for establishing a new bank and another occasioned by the Panic of 1837 that removed the need for payment in specie—led to the creation and collapse of around 50 banks within two years. The term is apocryphally derived from a wildcat supposedly featured on the currency printed by one of these banks, but more probably derived from the remote locations \"where the wildcats roamed\" chosen by these banks to avoid oversight and minimize redemption of notes."
      ],
      "adjectives": [
        {
          "description": "wildcat (not comparable)",
          "definitionGroups": [
            {
              "group": "(usually derogatory) Of or concerning businesses operating outside standard or legitimate practice, especially:",
              "entries": [
                {
                  "meaning": "(derogatory, dated) Of or concerning irresponsible banks or banking, (particularly) small, independent operations.",
                  "examples": []
                },
                {
                  "meaning": "(oil industry) Of or concerning oil exploration in new areas, (particularly) small, independent operations.",
                  "examples": []
                },
                {
                  "meaning": "Of or concerning actions undertaken by workers without approval or in defiance of the formal leadership of their trade unions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) Of or concerning customized or hand-made cartridges.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unauthorized by the proper authorities.",
                  "examples": [
                    "Jewish settlers have also been active putting up five new wildcat outposts on hilltops in the West Bank to try to thwart their Prime Minister Ariel Sharon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "wildcat (plural wildcats)",
          "definitionGroups": [
            {
              "group": "A cat that lives in the wilderness, specifically",
              "entries": [
                {
                  "meaning": "(UK) Felis silvestris, a common small Old World wild cat somewhat larger than a house cat.",
                  "examples": []
                },
                {
                  "meaning": "(US) A bobcat (Lynx rufus) or other similar New World species of lynx.",
                  "examples": []
                },
                {
                  "meaning": "Any feral cat.",
                  "examples": []
                },
                {
                  "meaning": "(uncommon) Alternative spelling of wild cat, any undomesticated felid, as tigers or lions.",
                  "examples": [
                    "Upon checking it out, we found a total of 13 newborn wildcats: nine newborn tigers and two newborn leopards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A person who acts like a wildcat, (usually) a violent and easily-angered person or a sexually vigorous one.",
                  "examples": [
                    "Anyone who's man enough to have landed a wildcat like you had to be quite a guy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) An offensive formation with an unbalanced line and a snap directly to the running back rather than the quarterback.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A wheel that can be adjusted so as to revolve either with or on the shaft of a capstan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) Clipping of wildcat cartridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) Clipping of wildcat strike, a strike undertaken without authorization from the relevant trade union.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Clipping of wildcat money, notes issued by a wildcat bank.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wildcat (third-person singular simple present wildcats, present participle wildcatting, simple past and past participle wildcatted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(oil industry) To drill for oil in an area where no oil has been found before.",
                  "examples": [
                    "You'd have to be very rich or very desperate to go wildcatting that far east."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}