{
  "word": "wizard",
  "etymologies": [
    {
      "description": [
        "From Middle English wysard, wysarde, equivalent to wise +‎ -ard. A uniquely medieval Anglo-Saxon word with no known cognates in or outside the Germanic family; did not gain distinct sense of \"occultist, magic user\" (as opposed to a philosopher or sage) until circa 1500s, aligning roughly with the starting English Renaissance.",
        "The sense of \"old (male) virgin\" is from a Japanese Internet meme where virgins legendarily gain magical powers upon reaching 30 years of age; popularized ultimately by 4chan and adjacent online spaces."
      ],
      "adjectives": [
        {
          "description": "wizard (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated, Britain) Fine, superb (originally RAF slang).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "wizard (plural wizards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone, usually male, who uses (or has skill with) magic, mystic items, and magical and mystical practices.",
                  "examples": [
                    "You're a wizard, Harry",
                    "Synonyms: conjurer, mage, magician, magic user, mystic, sorcerer, warlock, witch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is especially skilled or unusually talented in a particular field.",
                  "examples": [
                    "He was a financial wizard, capable of predicting the movements of the stock markets.",
                    "Synonyms: expert, genius, prodigy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A computer program or script used to simplify complex operations, often for an inexperienced user.",
                  "examples": [
                    "Use the \"Add Network Connection\" wizard to connect to a network in a series of simple steps.",
                    "Synonym: assistant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) One of the administrators of a multi-user dungeon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A wise man; a sage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang, sometimes humorous) A virgin over the age of 30 (most often male).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wizard (third-person singular simple present wizards, present participle wizarding, simple past and past participle wizarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To practice wizardry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To conjure.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}