{
  "word": "slump",
  "etymologies": [
    {
      "description": [
        "Probably of North Germanic origin: compare Danish slumpe (“to stumble upon by chance”), Norwegian slumpe (“happen by chance”), Swedish slumpa (“to sell off”). Compare also German schlumpen (“to trail; draggle; be sloppy”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slump (plural slumps)",
          "definitionGroups": [
            {
              "group": "A heavy or helpless collapse; a slouching or drooping posture; a period of poor activity or performance, especially an extended period.",
              "entries": [
                {
                  "meaning": "(slang by extension) A period when a person goes without the expected amount of sex or dating.",
                  "examples": [
                    "TOM. We haven't had sex with each other in five months.",
                    "MICHAEL. We're in a slump, I know that.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A measure of the fluidity of freshly mixed concrete, based on how much the concrete formed in a standard slump cone sags when the cone is removed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) A boggy place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) The noise made by anything falling into a hole, or into a soft, miry place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) The gross amount; the mass; the lump.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cobbler-like dessert cooked on a stove.",
                  "examples": [
                    "a blackberry slump"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slump (third-person singular simple present slumps, present participle slumping, simple past and past participle slumped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To collapse heavily or helplessly.",
                  "examples": [
                    "Exhausted, he slumped down onto the sofa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To decline or fall off in activity or performance.",
                  "examples": [
                    "Real estate prices slumped during the recession."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To slouch or droop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lump; to throw together messily.",
                  "examples": [
                    "These different groups […] are exclusively slumped together under that sense."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fall or sink suddenly through or in, when walking on a surface, as on thawing snow or ice, a bog, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To cause to collapse; to hit hard; to render unsconscious; to kill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}