{
  "word": "legend",
  "etymologies": [
    {
      "description": [
        "From Middle English legende, from Old French legende, from Medieval Latin legenda (“a legend, story, especially the lives of the saints”), from Latin legenda (“things which ought to be read”), from lego (“I read”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "legend (countable and uncountable, plural legends)",
          "definitionGroups": [
            {
              "group": "An unrealistic story depicting past events.",
              "entries": [
                {
                  "meaning": "A story of unknown origin describing plausible but extraordinary past events.",
                  "examples": [
                    "Synonym: myth",
                    "The legend of Troy was discovered to have a historical basis."
                  ]
                },
                {
                  "meaning": "A plausible story set in the historical past, but whose historicity is uncertain.",
                  "examples": [
                    "the legend of Robin Hood"
                  ]
                },
                {
                  "meaning": "A story in which a kernel of truth is embellished to an unlikely degree.",
                  "examples": [
                    "Synonyms: myth, tall tale",
                    "The 1984 Rose Bowl prank has spawned many legends. Here's the real story."
                  ]
                },
                {
                  "meaning": "A fabricated backstory for a spy, with associated documents and records.",
                  "examples": [
                    "Synonym: cover story",
                    "According to his legend, he once worked for the Red Cross, spreading humanitarian aid in Africa."
                  ]
                }
              ]
            },
            {
              "group": "A person related to a legend or legends.",
              "entries": [
                {
                  "meaning": "A leading protagonist in a historical legend.",
                  "examples": [
                    "Synonym: hero",
                    "Achilles is a legend in Greek culture."
                  ]
                },
                {
                  "meaning": "A person with legend-like qualities, such as extraordinary accomplishment.",
                  "examples": [
                    "Michael Jordan stands as a legend in basketball."
                  ]
                },
                {
                  "meaning": "(UK, Ireland, Australia, New Zealand, colloquial, slang) A cool, nice or helpful person, especially one who is male.",
                  "examples": [
                    "Synonym: brick",
                    "I've lost my pen! —Here mate, borrow mine. —You legend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A key to the symbols and color codes on a map, chart, etc.",
                  "examples": [
                    "Synonyms: guide, key",
                    "According to the legend on the map, that building is a school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(numismatics, heraldry) An inscription, motto, or title, especially one surrounding the field in a medal or coin, or placed upon a heraldic shield or beneath an engraving or illustration.",
                  "examples": [
                    "Synonym: inscription"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A musical composition set to a poetical story.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(naval) The design and specification of a vessel.",
                  "examples": [
                    "The legend displacement on the basis then in use was 48,000 tons, the corresponding standard displacement as defined by the Washington Treaty being 47,540 tons."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "legend (third-person singular simple present legends, present participle legending, simple past and past participle legended)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To tell or narrate; to recount.",
                  "examples": [
                    "Nor ladie's wanton love , nor wand'ring knight, Legend I out in rymes all richly dight"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}