{
  "word": "mutilate",
  "etymologies": [
    {
      "description": [
        "From Latin mutilatus, the past participle of mutilo (“to mutilate”), itself from mutilus (“maimed”)."
      ],
      "adjectives": [
        {
          "description": "mutilate (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Deprived of, or having lost, an important part; mutilated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Having fin-like appendages or flukes instead of legs, as a cetacean does.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "mutilate (third-person singular simple present mutilates, present participle mutilating, simple past and past participle mutilated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To physically harm as to impair use, notably by cutting off or otherwise disabling a vital part, such as a limb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To destroy beyond recognition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To render imperfect or defective.",
                  "examples": [
                    "For two reasons then it is right to be content with that which happens to thee; the one, because it was done for thee and prescribed for thee, and in a manner had reference to thee, originally from the most ancient causes spun with thy destiny; and the other, because even that which comes severally to every man is to the power which administers the universe a cause of felicity and perfection, nay even of its very continuance.  For the integrity of the whole is mutilated, if thou cuttest off anything whatever from the conjunction and the continuity either of the parts or of the causes. And thou dost cut off, as far as it is in thy power, when thou art dissatisfied, and in a manner triest to put anything out of the way."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}