{
  "word": "atlas",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin Atlas, from the name of the Ancient Greek mythological figure Ἄτλας (Átlas, “Bearer (of the Heavens)”), from τλῆναι (tlênai, “to suffer”, “to endure”, “to bear”). The sense referring to books of maps reflects that Atlas bore the world on his shoulders. The sense referring to the vertebra reflects that the spine carries the globe of the cranium (the neck carries the head)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "atlas (plural atlases or atlantes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bound collection of maps often including tables, illustrations or other text.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bound collection of tables, illustrations etc. on any given subject.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in anatomy, especially of the human body) A detailed visual conspectus of something of great and multi-faceted complexity, with its elements splayed so as to be presented in as discrete a manner as possible whilst retaining a realistic view of the whole.",
                  "examples": [
                    "An Anatomical Atlas of Vegetable Powders Designed as an Aid to the Microscopic Analysis of Powdered Foods and Drugs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(differential geometry, topology) A family of coordinate charts that cover a manifold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The uppermost vertebra of the cervical spine in the neck in humans and some other animals.",
                  "examples": [
                    "Synonyms: atlanto-, atlo-"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who supports a heavy burden; mainstay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A figure of a man used as a column.",
                  "examples": [
                    "Synonym: telamon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(paper) A sheet of paper measuring 26 inches by 34 inches.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Arabic أَطْلَس‎ (ʔaṭlas)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "atlas (countable and uncountable, plural atlases or atlasses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A rich satin fabric.",
                  "examples": [
                    "I saw ye Taffaties and Atlasses in ye warehouse, and gave directions concerning their severall colours and stripes, ordering Mr. Charnock to use his best endeavours to encrease their quantity;  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}