{
  "word": "ghetto",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian ghetto, either from Venetian ghèto (“foundry”), or alternatively an apheresis of the Italian borghetto, diminutive of borgo (“village”). Initially used of the areas Jews were concentrated, later extended to concentrations of other ethnicities and then non-ethnic groups. The adjective and verb derive from the noun."
      ],
      "adjectives": [
        {
          "description": "ghetto (comparative more ghetto, superlative most ghetto)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to a ghetto or to ghettos in general.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, informal) Unseemly and indecorous or of low quality; cheap; shabby, crude.",
                  "examples": [
                    "My apartment's so ghetto, the rats and cockroaches filed a complaint with the city!",
                    "I like to drive ghetto cars; if they break down you can just abandon them and pick up a new one!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, informal, often derogatory or offensive) Characteristic of the style, speech, or behavior of residents of a predominantly black or other ghetto in the United States.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having been raised in a ghetto in the United States.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "ghetto (plural ghettos or ghettoes or ghetti)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An (often walled) area of a city in which Jews are concentrated by force and law. (Used particularly of areas in medieval Italy and in Nazi-controlled Europe.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An (often impoverished) area of a city inhabited predominantly by members of a specific nationality, ethnicity, or race.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area in which people who are distinguished by sharing something other than ethnicity concentrate or are concentrated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, sometimes derogatory) An isolated, self-contained, segregated subsection, area or field of interest; often of minority or specialist interest.",
                  "examples": [
                    "Ennio Morricone... is my favourite composer - and when I say favourite composer, I don't mean movie composer - that ghetto. I'm talking about Mozart, I'm talking about Beethoven, I'm talking about Schubert. That's who I'm talking about."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ghetto (third-person singular simple present ghettoes, present participle ghettoing, simple past and past participle ghettoed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To confine (a specified group of people) to a ghetto.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}