{
  "word": "sergeant",
  "etymologies": [
    {
      "description": [
        "From Middle English sergeant, sergeaunt, serjent, serjaunt, serjawnt, sergant, from Old French sergeant, sergent, serjant, sergient, sergant (“sergeant, servant”), from Medieval Latin servientem, accusative of serviens (“a servant, vassal, soldier, apparitor”), from Latin serviēns (“serving”), present participle of serviō (“serve, be a slave to”). Doublet of servant and servient.",
        "The fish is so called because of its stripes, supposed to resemble a sergeant's insignia of rank.",
        "The pronunciation with /ɑɹ/ is due to a widespread development of Middle English er + consonant (see barn, start etc.). In sergeant, the spelling was standardised in one way, the pronunciation in another (compare clerk, derby in Commonwealth English, further parson vs. person, and varsity vs. university)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sergeant (plural sergeants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) UK army rank with NATO code OR-6, senior to corporal and junior to warrant officer ranks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The highest rank of noncommissioned officer in some non-naval military forces and police.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, historical) A lawyer of the highest rank, equivalent to the doctor of civil law.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, historical) A title sometimes given to the servants of the sovereign.",
                  "examples": [
                    "sergeant surgeon, i.e. a servant, or attendant, surgeon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fish, the cobia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various nymphalid butterflies of the genus Athyma; distinguished from the false sergeants by their truth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bailiff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A servant in monastic offices.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}