{
  "word": "apprehend",
  "etymologies": [
    {
      "description": [
        "From Late Middle English apprehenden (“to grasp, take hold of; to comprehend; to learn”), from Old French apprehender (modern French appréhender (“to apprehend; to catch; to dread”)), from Latin apprehendere, adprehendere, the present active infinitive of apprehendō, adprehendō (“to grab, grasp, seize, take; to apprehend, arrest; to comprehend, understand; to embrace, include; to take possession of, obtain, secure”), from ap-, ad- (prefix meaning ‘to’) + prehendō (“to grab, grasp, seize, snatch, take; to accost; to catch in the act, take by surprise; (figuratively, rare) of the mind: to apprehend, comprehend, grasp”) (ultimately from Proto-Indo-European *gʰed- (“to hold, seize, take; to find”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "apprehend (third-person singular simple present apprehends, present participle apprehending, simple past and past participle apprehended) (transitive)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To be or become aware of (something); to perceive.",
                  "examples": []
                },
                {
                  "meaning": "To acknowledge the existence of (something); to recognize.",
                  "examples": []
                },
                {
                  "meaning": "To take hold of (something) with understanding; to conceive (something) in the mind; to become cognizant of; to understand.",
                  "examples": [
                    "Synonyms: catch, get"
                  ]
                },
                {
                  "meaning": "To have a conception of (something); to consider, to regard.",
                  "examples": [
                    "Synonyms: believe, gather, reckon"
                  ]
                },
                {
                  "meaning": "To anticipate (something, usually unpleasant); especially, to anticipate (something) with anxiety, dread, or fear; to dread, to fear.",
                  "examples": []
                },
                {
                  "meaning": "(archaic or obsolete, also figuratively) To seize or take (something); to take hold of.",
                  "examples": [
                    "Synonym: catch"
                  ]
                },
                {
                  "meaning": "(law enforcement) To seize or take (a person) by legal process; to arrest.",
                  "examples": [
                    "Synonyms: capture, detain",
                    "Officers apprehended the suspect two streets away from the bank."
                  ]
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To feel (something) emotionally.",
                  "examples": []
                },
                {
                  "meaning": "To learn (something).",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) To take possession of (something); to seize.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To be of opinion, believe, or think; to suppose.",
                  "examples": []
                },
                {
                  "meaning": "To understand.",
                  "examples": []
                },
                {
                  "meaning": "To be apprehensive; to fear.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}