{
  "word": "language",
  "etymologies": [
    {
      "description": [
        "From Middle English langage, language, from Old French language, from Vulgar Latin *linguāticum, from Latin lingua (“tongue, speech, language”), from Old Latin dingua (“tongue”), from Proto-Indo-European *dn̥ǵʰwéh₂s (“tongue, speech, language”). Displaced native Old English ġeþēode."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "language (countable and uncountable, plural languages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A body of words, and set of methods of combining them (called a grammar), understood by a community and used as a form of communication.",
                  "examples": [
                    "The English language and the German language are related.",
                    "Deaf and mute people communicate using languages like ASL."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The ability to communicate using words.",
                  "examples": [
                    "the gift of language"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A sublanguage: the slang of a particular community or jargon of a particular specialist field.",
                  "examples": [
                    "legal language;   the language of chemistry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, figurative) The expression of thought (the communication of meaning) in a specified way; that which communicates something, as language does.",
                  "examples": [
                    "body language;   the language of the eyes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A body of sounds, signs and/or signals by which animals communicate, and by which plants are sometimes also thought to communicate.",
                  "examples": [
                    "A more likely hypothesis was that the attacked leaves were transmitting some airborne chemical signal to sound the alarm, rather like insects sending out warnings  […]  But this is the first time that a plant-to-plant language has been detected."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, countable) A computer language; a machine language.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Manner of expression.",
                  "examples": [
                    "Their language simple, as their manners meek,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The particular words used in a speech or a passage of text.",
                  "examples": [
                    "The language used in the law does not permit any other interpretation.",
                    "The language he used to talk to me was obscene."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Profanity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "language (third-person singular simple present languages, present participle languaging, simple past and past participle languaged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, now nonstandard or technical) To communicate by language; to express in language.",
                  "examples": [
                    "Others were languaged in such doubtful expressions that they have a double sense."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Alteration of languet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "language (plural languages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A languet, a flat plate in or below the flue pipe of an organ.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}