{
  "word": "quit",
  "etymologies": [
    {
      "description": [
        "From Middle English quiten, quyten, from Anglo-Norman quitter, Old French quitter, from quitte (“acquitted, quit”), ultimately from Latin quietus.",
        "Compare Dutch kwijten (“to quit”), German Low German quitten (“to quit”), German quitten, quittieren, Danish kvitte, Swedish qvitta, kvitta (“to quit, leave, set off”), Icelandic kvitta."
      ],
      "adjectives": [
        {
          "description": "quit (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually followed by of) Released from obligation, penalty, etc; free, clear, or rid.",
                  "examples": [
                    "With mounting anger the King denounced the pair, both father and son, and was about to condemn them to death when his strength gave out. Faint and trembling he was unable to walk and the sword fell from his hands as he murmured: 'May the Protector of the Buddhist Faith grant me but seven more days grace of life to be quit of this disloyal couple, father and son'."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "quit (third-person singular simple present quits, present participle quitting, simple past and past participle quit or quitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To pay (a debt, fine etc.).",
                  "examples": [
                    "Enkindle all the sparks of nature  To quit this horrid act."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To repay (someone) for (something).",
                  "examples": [
                    "But if that I knewe what his name hight,For clatering of me I would him ſone quight;For his falſe lying, of that I ſpake never,I could make him ſhortly repent him forever: […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To repay, pay back (a good deed, injury etc.).",
                  "examples": [
                    "Forgive me, Rogero: 'tis my fate  To love thy friend and quit thy love with hate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, archaic) To conduct or acquit (oneself); to behave (in a specified way).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To carry through; to go through to the end.",
                  "examples": [
                    "Never worthy prince a day did quit  With greater hazard and with more renown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set at rest; to free, as from anything harmful or oppressive; to relieve; to clear; to liberate.",
                  "examples": [
                    "To quit you  […]  of this fear,  […] you have already lookt Death in the face; what have you found so terrible in it?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To release from obligation, accusation, penalty, etc.; to absolve; to acquit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To abandon, renounce (a thing).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To leave (a place).",
                  "examples": [
                    "Jones had no sooner quitted the room, than the petty-fogger, in a whispering tone, asked Mrs Whitefield, “If she knew who that fine spark was?”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To resign from (a job, office, position, etc.).",
                  "examples": [
                    "After having to work overtime without being paid, I quit my job."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To stop, give up (an activity) (usually + gerund or verbal noun).",
                  "examples": [
                    "John is planning to quit smoking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To close (an application).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably of imitative origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quit (plural quits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of numerous species of small passerine birds native to tropical America. [from 19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}