{
  "word": "rivet",
  "etymologies": [
    {
      "description": [
        "From Old French rivet (13th century), from the verb Old French river (“to fetter [a person]”) (12th century), from Old French rive (“rim, edge”) (ca. 1100), which is ultimately from Latin ripa (“riverbank”). Compare river, rival, riparian.",
        "The sense \"kind of footman's armour\" is apparently a back-formation from almain rivet, which is apparently derived from the English noun; see that entry for more."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rivet (plural rivets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cylindrical mechanical fastener that attaches multiple parts together by fitting through a hole and deforming the head(s) at either end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any fixed point or certain basis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A light kind of footman's plate armour; an almain rivet.",
                  "examples": [
                    "In 1579 it is mentioned that Almain rivets are now out of use, and in lieu of them a corselett shall be found. The rivets varied in cost; in 1509 they were to be had for 8s., in 1512 they were imported at 16s., and again in 1513  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rivet (third-person singular simple present rivets, present participle riveting or rivetting, simple past and past participle riveted or rivetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attach or fasten parts by using rivets. [from early 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To install rivets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To command the attention of. [from c. 1600]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To make firm or immovable.",
                  "examples": [
                    "Terror riveted him to the spot."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}