{
  "word": "ease",
  "etymologies": [
    {
      "description": [
        "From Middle English ese, eise, aise, from Anglo-Norman ese (“ease”), from Old French eise, aise (“elbow room; opportunity”), of uncertain and obscure origin. Apparently related to Provençal ais, Italian agio and asio,  Sicilian aciu and  Portuguese azo. Sometimes ascribed to Vulgar Latin *āsia or *āsium, possibly from Latin ānsa (“handle, haft”) or Frankish *ansiju (“handle, loophole, eyelet; cup-handle; arms akimbo, elbow room”), but more often derived from Vulgar Latin *adjace(m), from Latin adjacēns (“adjacent, neighbouring”), present participle of adjaceō (“lie next to, border on”), though the forms and senses are difficult to trace clearly.",
        "Alternatively, possibly from a non-Latin source such as Germanic or Celtic on the basis of the conflicting forms which appear in various Romance languages. Compare Old English īeþe (“easy”), Gothic 𐌰𐌶𐌴𐍄𐌹 (azēti, “ease; pleasure”), *𐌰𐌶𐌴𐍄𐍃 (*azēts, “easy”), Breton eaz, ez (“easy”), Irish adhais (“easy; leisure”). See also eath.",
        "The verb is from Middle English esen, ultimately of the same origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ease (uncountable)",
          "definitionGroups": [
            {
              "group": "Ability, the means to do something, particularly:",
              "entries": [
                {
                  "meaning": "Skill, dexterity, facility.",
                  "examples": [
                    "He played the ukelele with ease."
                  ]
                }
              ]
            },
            {
              "group": "Comfort, a state or quality lacking unpleasantness, particularly:",
              "entries": [
                {
                  "meaning": "Freedom from pain, hardship, and annoyance, sometimes (derogatory, archaic) idleness, sloth.",
                  "examples": [
                    "She enjoyed the ease of living in a house where the servants did all the work."
                  ]
                },
                {
                  "meaning": "Freedom from worry and concern; peace; sometimes (derogatory, archaic) indifference.",
                  "examples": [
                    "The pension set her mind at ease."
                  ]
                },
                {
                  "meaning": "Freedom from difficulty.",
                  "examples": [
                    "He passed all the exams with ease."
                  ]
                },
                {
                  "meaning": "Freedom from effort, leisure, rest.",
                  "examples": [
                    "We took our ease on the patio."
                  ]
                },
                {
                  "meaning": "Freedom from financial effort or worry; affluence.",
                  "examples": [
                    "His inheritance catapulted him into a life of ease."
                  ]
                },
                {
                  "meaning": "Freedom from embarrassment or awkwardness; grace.",
                  "examples": [
                    "She dealt with the faculty with combined authority and ease."
                  ]
                }
              ]
            },
            {
              "group": "Relief, an end to discomfort, particularly:",
              "entries": [
                {
                  "meaning": "Followed by of or from: release from or reduction of pain, hardship, or annoyance.",
                  "examples": [
                    "Take one pill every 12 hours to provide ease from pain."
                  ]
                },
                {
                  "meaning": "(euphemistic, obsolete) Release from intestinal discomfort: defecation.",
                  "examples": []
                },
                {
                  "meaning": "Release from constraint, obligation, or a constrained position.",
                  "examples": [
                    "At ease, soldier!"
                  ]
                },
                {
                  "meaning": "(clothing) Additional space provided to allow greater movement.",
                  "examples": [
                    "Add some ease to the waist measurement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A convenience; a luxury.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A relief; an easement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ease (third-person singular simple present eases, present participle easing, simple past and past participle eased)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To free (something) from pain, worry, agitation, etc.",
                  "examples": [
                    "He eased his conscience by confessing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To alleviate, assuage or lessen (pain).",
                  "examples": [
                    "He loosened his shoe to ease the pain.",
                    "His words of comfort eased his friend's pain and distress."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give respite to (someone).",
                  "examples": [
                    "The provision of extra staff eased their workload."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive) To loosen or slacken the tension on a line.",
                  "examples": [
                    "We eased the boom vang, then lowered the sail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce the difficulty of (something).",
                  "examples": [
                    "We had to ease the entry requirements."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (something) slowly and carefully.",
                  "examples": [
                    "He eased the cork from the bottle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lessen in intensity.",
                  "examples": [
                    "The pain eased overnight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To proceed with little effort.",
                  "examples": [
                    "The car eased onto the motorway."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}