{
  "word": "censor",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Latin cēnsor (“magistrate; critic”), from cēnseō (“to give an opinion, judge; to assess, reckon; to decree, determine”) + -sor (variant of -tor (suffix forming masculine agent nouns)). Cēnseō is derived from Proto-Italic *kensēō, ultimately from Proto-Indo-European *ḱens- (“to announce, proclaim; to put in order”). The English word is cognate with Late Middle English sensour, Proto-Iranian *cánhati (“to declare; to explain”), Sanskrit शंसति (śaṃsati, “to declare”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "censor (plural censors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Rome, historical) One of the two magistrates who originally administered the census of citizens, and by Classical times (between the 8th century B.C.E. and the 6th century C.E.) was a high judge of public behaviour and morality.",
                  "examples": [
                    "Synonyms: censorian, (both obsolete) censurer",
                    "The Ancient Roman censors were part of the cursus honorum, a series of public offices held during a political career, like consuls and praetors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient China, historical) A high-ranking official who was responsible for the supervision of subordinate government officials.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An official responsible for the removal or suppression of objectionable material (for example, if obscene or likely to incite violence) or sensitive content in books, films, correspondence, and other media.",
                  "examples": [
                    "Synonym: (obsolete) censurer",
                    "The headmaster was an even stricter censor of his boarding pupils’ correspondence than the enemy censors had been of his own when the country was occupied."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) A college or university official whose duties vary depending on the institution.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One who censures or condemns.",
                  "examples": [
                    "Synonym: censurer"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "censor (third-person singular simple present censors, present participle censoring, simple past and past participle censored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To review for, and if necessary to remove or suppress, content from books, films, correspondence, and other media which is regarded as objectionable (for example, obscene, likely to incite violence, or sensitive).",
                  "examples": [
                    "Synonyms: bowdlerize, expurgate, expunge, redact",
                    "Antonym: decensor",
                    "The people responsible for censoring films have seen some startling things in their time.",
                    "Occupying powers typically censor anything reeking of resistance"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From an incorrect translation of German Zensur (“censorship”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "censor (plural censors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) A hypothetical subconscious agency which filters unacceptable thought before it reaches the conscious mind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}