{
  "word": "listen",
  "etymologies": [
    {
      "description": [
        "From Middle English listenen, listnen, alteration (due to Middle English listen (“to listen, give heed to”)) of Old English hlysnan (“to listen”), from Proto-Germanic *hlusnijaną, *hlusnōną (compare Middle High German lüsenen), from Proto-Germanic *hlusēną (compare Old High German hlosēn), from Proto-Indo-European *ḱlew- (“to hear”) (compare Ancient Greek κλαίω (klaíō, “I make known, famous”), Welsh clywed (“to hear”), Latin clueō (“I am famous”), Lithuanian klausýti, Old Church Slavonic слушати (slušati, “to hear”), Sanskrit श्रोषति (śróṣati). Related to loud and German lauschen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "listen (plural listens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of listening.",
                  "examples": [
                    "Synonym: (of recorded audio) play",
                    "Give the motor a listen and tell me if it sounds off."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "listen (third-person singular simple present listens, present participle listening, simple past and past participle listened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pay attention to a sound or speech.",
                  "examples": [
                    "Please listen carefully as I explain.  I like to listen to music."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To expect or wait for a sound, such as a signal.",
                  "examples": [
                    "You should listen for the starting gun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To accept advice or obey instruction; to agree or assent.",
                  "examples": [
                    "Listen, the only reason I yelled at you was because I was upset, OK?  Good children listen to their parents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To hear (something or someone), to pay attention to.",
                  "examples": [
                    "'But, sir, lyars ye have lystened, and that hath caused grete debate betwyxte you and me.'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}