{
  "word": "scram",
  "etymologies": [
    {
      "description": [
        "Probably either:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "scram (third-person singular simple present scrams, present participle scramming, simple past and past participle scrammed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, originally US, often imperative) To leave in a hurry; to go away. [from early 20th c.]",
                  "examples": [
                    "Synonyms: see Thesaurus:go away",
                    "What are you kids doing on my lawn? Scram!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; the verb is possibly derived from etymology 1. It has been suggested that the word is an acronym for phrases like “safety control rod actuator mechanism”, “safety control rod axe man”, and “safety control rods activation mechanism”, but these are most likely backronyms.",
        "The noun is probably derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scram (plural scrams) (chiefly nuclear physics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also attributively) A shutdown of a nuclear reactor (or, by extension, some other thing), often done rapidly due to an emergency.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The device used to shut down a nuclear reactor; also, the button or switch used to initiate a shutdown.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scram (third-person singular simple present scrams, present participle scraming or scramming, simple past and past participle scramed or scrammed) (chiefly nuclear physics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shut down (a nuclear reactor or, by extension, some other thing) for safety reasons, usually because of an emergency.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a nuclear reactor or some other thing: to shut down, usually because of an emergency.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is a variant of dialectal English scramb (“to pull or rake together with the hands; to gather a handful of something from the ground; to scratch with the claws or nails; to pull down violently; to tear off; to maul about; a handful of something from the ground”), possibly related to Dutch schrammen (“to graze, scratch”) and German schrammen (“to scratch, scrape”); see etymology 1.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scram (plural scrams)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Derbyshire, Wales) A scratch, especially caused by claws or fingernails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, mining, archaic) A mine previously worked on where most of the ore is believed to have been removed, but which is still being mined on a small scale.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scram (third-person singular simple present scrams, present participle scramming, simple past and past participle scrammed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Derbyshire, Wales) To scratch (something) with claws or fingernails; to claw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, mining, archaic) To mine for ore on a small scale, especially from mines previously been worked on where most of the ore is believed to have been removed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Origin unknown."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "scram (third-person singular simple present scrams, present participle scramming, simple past and past participle scrammed) (intransitive, Britain, dialectal, archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of one's body or limbs: to become numb or stiff due to cold, lack of movement, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be weakened by an accident, a disease, starvation, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}