{
  "word": "port",
  "etymologies": [
    {
      "description": [
        "From Old English port, borrowed from Latin portus (“port, harbour”), ultimately from Proto-Indo-European *pértus (“crossing”) (and thus distantly cognate with ford). The directional sense, attested since at least the 1500s, derives from ancient vessels with the steering oar on the right (see etymology of starboard), which therefore had to moor with their left sides facing the dock or wharf."
      ],
      "adjectives": [
        {
          "description": "port (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Of or relating to port, the left-hand side of a vessel when facing the bow.",
                  "examples": [
                    "on the port side"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "port (countable and uncountable, plural ports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place on the coast at which ships can shelter, or dock to load and unload cargo or passengers.",
                  "examples": [
                    "Synonyms: harbour, haven"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A town or city containing such a place, a port city.",
                  "examples": [
                    "Synonyms: harbour city, harbour town, port city"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, aviation, uncountable) The left-hand side of a vessel, including aircraft, when one is facing the front. Used to unambiguously refer to directions relative to the vessel structure, rather than to a person or object on board.",
                  "examples": [
                    "Synonyms: backboard, larboard, leeboard, left",
                    "Antonym: starboard"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rowing) A sweep rower that primarily rows with an oar on the port side.",
                  "examples": [
                    "Each eight has four ports and four starboards."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "port (third-person singular simple present ports, present participle porting, simple past and past participle ported)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive, chiefly imperative) To turn or put to the left or larboard side of a ship; said of the helm.",
                  "examples": [
                    "Port your helm!"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Inherited from the Old English port, from the Latin porta (“passage, gate”), reinforced by the Old French porte. Doublet of porta."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "port (plural ports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now Scotland, historical) An entryway or gate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An opening or doorway in the side of a ship, especially for boarding or loading; an embrasure through which a cannon may be discharged; a porthole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A small medical appliance installed beneath the skin, connected to a vein by a catheter, and used to inject drugs or to draw blood samples.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling, bowls) A space between two stones wide enough for a delivered stone or bowl to pass through.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An opening where a connection (such as a pipe) is made.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A logical or physical construct in and from which data are transferred.  Computer port (hardware) on  Wikipedia.Wikipedia",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A female connector of an electronic device, into which a cable's male connector can be inserted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Old French porter, from Latin portāre (“carry”). Akin to transport, portable."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "port (plural ports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something used to carry a thing, especially a frame for wicks in candle-making.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The manner in which a person carries himself; bearing; deportment; carriage. See also portance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The position of a weapon when ported; a rifle position executed by throwing the weapon diagonally across the front of the body, with the right hand grasping the small of the stock and the barrel sloping upward and crossing the point of the left shoulder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A program that has been adapted, modified, or recoded so that it works on a different platform from the one for which it was created; the act of this adapting.",
                  "examples": [
                    "Gamers can't wait until a port of the title is released on the new system.",
                    "The latest port of the database software is the worst since we made the changeover."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, BSD) A set of files used to build and install a binary executable file from the source code of an application.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "port (third-person singular simple present ports, present participle porting, simple past and past participle ported)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To carry, bear, or transport. See porter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) To hold or carry (a weapon) with both hands so that it lays diagonally across the front of the body, with the barrel or similar part near the left shoulder and the right hand grasping the small of the stock; or, to throw (the weapon) into this position on command.",
                  "examples": [
                    "Port arms!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, video games) To adapt, modify, or create a new version of, a program so that it works on a different platform.  Porting (computing) on  Wikipedia.Wikipedia",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telephony, transitive) To carry or transfer (an existing telephone number) from one telephone service provider to another.",
                  "examples": [
                    "If you submit a request to port a number, and you list the name on the account as Bob Smith, but your local carrier has the number listed under your wife's name Mary Mahoney, the porting request is rejected."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, government and law) To transfer a voucher or subsidy from one jurisdiction to another.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Named from Portuguese Porto, a city in Portugal where the wines were originally shipped from."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "port (countable and uncountable, plural ports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of very sweet fortified wine, mostly dark red, traditionally made in Portugal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Abbreviation of portmanteau."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "port (plural ports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A suitcase or schoolbag.",
                  "examples": [
                    "How do you think the cane toads got into this pristine environment? Joseph Midnight brought them in his port from Townsville, smuggled them in, not that anyone was there to stop him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Abbreviation of portfolio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "port (plural ports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) The portfolio of a model or artist.",
                  "examples": [
                    "This is a logical way to order your work, but use it only if you're confident the first piece in your port is a strong one. Also note that this style of arrangement works best if all the pieces are in the same category."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}