{
  "word": "smoke",
  "etymologies": [
    {
      "description": [
        "From Middle English smoke, from Old English smoca (“smoke”), probably a derivative of the verb (see below). Related to Dutch smook (“smoke”), Middle Low German smôk (“smoke”), dialectal German Schmauch (“smoke”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "smoke (countable and uncountable, plural smokes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The visible vapor/vapour, gases, and fine particles given off by burning or smoldering material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, countable) A cigarette.",
                  "examples": [
                    "I said I've got a penchant for smokes and kicking douches in the mouth / Sadly for you my last cigarette's gone out"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, uncountable) Anything to smoke (e.g. cigarettes, marijuana, etc.)",
                  "examples": [
                    "Hey, you got some smoke?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, countable, never plural) An instance of smoking a cigarette, cigar, etc.; the duration of this act.",
                  "examples": [
                    "I'm going out for a smoke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figuratively) A fleeting illusion; something insubstantial, evanescent, unreal, transitory, or without result.",
                  "examples": [
                    "The excitement behind the new candidate proved to be smoke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figuratively) Something used to obscure or conceal; an obscuring condition; see also smoke and mirrors.",
                  "examples": [
                    "The smoke of controversy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A light grey colour/color tinted with blue.",
                  "examples": [
                    "smoke:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Bother; problems; hassle.",
                  "examples": [
                    "You better not be giving me no smoke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, uncountable) A particulate of solid or liquid particles dispersed into the air on the battlefield to degrade enemy ground or for aerial observation. Smoke has many uses--screening smoke, signaling smoke, smoke curtain, smoke haze, and smoke deception. Thus it is an artificial aerosol.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, slang) A fastball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A distinct column of smoke, such as indicating a burning area or fire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English smoken, from Old English smocian (“to smoke, emit smoke; fumigate”), from Proto-West Germanic *smokōn, from Proto-Germanic *smukōną (“to smoke”), ablaut derivative of Proto-Germanic *smaukaną (“to smoke”), from Proto-Indo-European *(s)mewg- (“to smoke”). Cognate with Saterland Frisian smookje (“to smoke”), West Frisian smoke (“to smoke”), Low German smöken (“to smoke”), German Low German smoken (“to smoke”). Related also to Old English smēocan (“to smoke, emit smoke; fumigate”), Bavarian schmuckelen (“to smell bad, reek”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "smoke (third-person singular simple present smokes, present participle smoking, simple past and past participle smoked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To inhale and exhale the smoke from a burning cigarette, cigar, pipe, etc.",
                  "examples": [
                    "He's smoking his pipe. Smoking a pipe has gone out of fashion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To inhale and exhale tobacco smoke.",
                  "examples": [
                    "Do you smoke?"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive) To give off smoke.",
              "entries": [
                {
                  "meaning": "(intransitive) Of a fire in a fireplace: to emit smoke outward instead of up the chimney, owing to imperfect draught.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To preserve or prepare (food) for consumption by treating with smoke.",
                  "examples": [
                    "You'll need to smoke the meat for several hours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dry or medicate by smoke.",
                  "examples": [
                    "After opening one of the hives from the back, he smoked the bees to calm them and to drive the queen toward the front of the hive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To fill or scent with smoke; hence, to fill with incense; to perfume.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To make unclear or blurry.",
                  "examples": [
                    "Smoke your bits of glass,Ye loyal Swine, or her transfigurationWill blind your wondering eyes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, chiefly as present participle) To perform (e.g. music) energetically or skillfully.",
                  "examples": [
                    "The horn section was really smokin' on that last tune."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada, New Zealand, slang) To beat someone at something.",
                  "examples": [
                    "We smoked them at rugby."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, slang) To kill, especially with a gun.",
                  "examples": [
                    "He got smoked by the mob."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, obsolete) To thrash; to beat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To smell out; to hunt out; to find out; to detect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, obsolete, transitive) To ridicule to the face; to mock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To burn; to be kindled; to rage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To raise a dust or smoke by rapid motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To suffer severely; to be punished.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US military slang) To punish (a person) for a minor offense by excessive physical exercise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover (a key blank) with soot or carbon to aid in seeing the marks made by impressioning.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}