{
  "word": "gender",
  "etymologies": [
    {
      "description": [
        "From Middle English gendre, gender (see also gendres), from Middle French gendre, genre, from Latin genus (“kind, sort”). Doublet of genre, genus, and kin. The verb developed after the noun."
      ],
      "adjectives": [
        {
          "description": "gender (comparative more gender, superlative most gender)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT, Internet slang, humorous) Evoking indescribable feelings regarding gender.",
                  "examples": [
                    "This song is so gender."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "gender (countable and uncountable, plural genders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Class; kind. [14th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A division of nouns and pronouns (and sometimes of other parts of speech) into masculine or feminine, and sometimes other categories like neuter or common, and animate or inanimate. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now sometimes proscribed) Sex (a category, either male or female, into which sexually-reproducing organisms are divided on the basis of their reproductive roles in their species). [from 15th c.]",
                  "examples": [
                    "the gene is activated in both genders",
                    "The effect of the medication is dependent upon age, gender, and other factors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes proscribed) Identification as a man, a woman, or something else, and association with a (social) role or set of behavioral and cultural traits, clothing, etc; a category to which a person belongs on this basis. (Compare gender role, gender identity.) [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Synonym of voice (“particular way of inflecting or conjugating verbs”)",
                  "examples": [
                    "143.  […]  We have now to speak of the following eight particulars relating to verbs: Gender or Sort, Person, Number, Time, Mode, Participle, Gerund, and Supine. [...]",
                    "1st.--Of the Gender.",
                    "144. Gender means the same as sort or kind. There are four principal Sorts of Verbs; namely, Active verbs, Passive verbs, Neuter verbs, and Impersonal verbs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hardware) The quality which distinguishes connectors, which may be male (fitting into another connector) and female (having another connector fit into it), or genderless/androgynous (capable of fitting together with another connector of the same type). [from 20th c.]",
                  "examples": [
                    "Connectors are identified by gender. When copper pins are exposed in the connector, its gender is male."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gender (third-person singular simple present genders, present participle gendering, simple past and past participle gendered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology) To assign a gender to (a person); to perceive as having a gender; to address using terms (pronouns, nouns, adjectives...) that express a certain gender.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology) To perceive (a thing) as having characteristics associated with a certain gender, or as having been authored by someone of a certain gender.",
                  "examples": [
                    "Yet because texts by “female authors” are not dependent on the voice to gender the text, the topics that they address and the traditions that they employ seem broader and somewhat less constrained by gender stereotypes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gendren, genderen, from Middle French gendrer, from Latin generāre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "gender (third-person singular simple present genders, present participle gendering, simple past and past participle gendered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To engender.",
                  "examples": [
                    "[…]  being a stranger to those restrictions which were afterwards laid on his posterity by the Mosaic law, and which gendered a servile frame of spirit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or obsolete) To breed.",
                  "examples": [
                    "Ye shall keep my statutes. Thou shalt not let thy cattle gender with a diverse kind: thou shalt not sow thy field with mingled seed: neither shall a garment mingled of linen and woollen come upon thee."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Indonesian gender, from Javanese ꦒꦼꦤ꧀ꦢꦺꦂ (gendèr), from Old Javanese gĕnder."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gender (plural genders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An Indonesian musical instrument resembling a xylophone, used in gamelan music.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}