{
  "word": "creed",
  "etymologies": [
    {
      "description": [
        "From Middle English crede, from Old English crēda, crēdo, from Latin crēdō (“I believe”), from Proto-Italic *krezdō, from Proto-Indo-European *ḱred dʰeh₁- (“to place one's heart, i.e., to trust, believe”), a compound phrase of the oblique case form of *ḱḗr (“heart”). Creed is cognate with Old Irish cretim (“to believe”), Sanskrit श्रद्दधाति (śráddadhāti, “to have faith or faithfulness, to have belief or confidence, believe”). Doublet of shraddha."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "creed (plural creeds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is believed; accepted doctrine, especially religious doctrine; a particular set of beliefs; any summary of principles or opinions professed or adhered to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically, religion) A reading or statement of belief that summarizes the faith it represents; a confession of faith for public use, especially one which is brief and comprehensive.",
                  "examples": [
                    "A creed is a manifesto of religious or spiritual beliefs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) The fact of believing; belief, faith.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "creed (third-person singular simple present creeds, present participle creeding, simple past and past participle creeded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete, only survives in \"creeded\") To believe; to credit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To provide with a creed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}