{
  "word": "glamour",
  "etymologies": [
    {
      "description": [
        "Some say from Scots glamer, supposedly from earlier Scots gramarye (“magic, enchantment, spell”).",
        "According to George Mpampiniotis, a glossology professor at the University of Athens, the Scottish term may either be from the Greek word Γραμματική (grammatiki - grammar).  \nA connection has also been suggested with Old Norse glámr (poet. “moon,” name of a ghost) and glámsýni (“glamour, illusion”, literally “glam-sight”). From Grettir's Saga aka Grettis Saga, one of the Sagas of Icelanders, after the hero has been cursed by Glam, aka Glamr:",
        "\"...he was become so fearsome a man in the dark, that he durst go nowhither alone after nightfall, for then he seemed to see all kinds of horrors.",
        "And that has fallen since into a proverb, that Glam lends eyes, or gives Glamsight to those who see things nowise as they are.\"",
        "Glamsight (glámsýni) is also referred to in the Icelandic collection Sturlunga saga."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "glamour (countable and uncountable, plural glamours)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Originally, enchantment; magic charm; especially, the effect of a spell that causes one to see objects in a form that differs from reality, typically to make filthy, ugly, or repulsive things seem beauteous.",
                  "examples": [
                    "They often murmur to themselves, they speakTo one another seldom, for their woeBroods maddening inwardly and scorns to wreakItself abroad; and if at whiles it growTo frenzy which must rave, none heeds the clamour,Unless there waits some victim of like glamour,To rave in turn, who lends attentive show."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Alluring beauty or charm (often with sex appeal).",
                  "examples": [
                    "glamour magazines; a glamour model"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Any excitement, appeal, or attractiveness associated with a person, place, or thing; that which makes something appealing.",
                  "examples": [
                    "The idea of being a movie star has lost its glamour for me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any artificial interest in, or association with, objects, or persons, through which they appear delusively magnified or glorified.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of haze in the air, causing things to appear different from what they really are.",
                  "examples": [
                    ""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An item, motif, person, image that by association improves appearance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "glamour (third-person singular simple present glamours, present participle glamouring, simple past and past participle glamoured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enchant; to bewitch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}