{
  "word": "distress",
  "etymologies": [
    {
      "description": [
        "The verb is from Middle English distressen, from Old French destrecier (“to restrain, constrain, put in straits, afflict, distress”); compare French détresse. Ultimately from Medieval Latin as if *districtiare, an assumed frequentative form of Latin distringere (“to pull asunder, stretch out”), from dis- (“apart”) + stringere (“to draw tight, strain”).",
        "The noun is from Middle English distresse, from Old French destrece, ultimately also from Latin distringere."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "distress (countable and uncountable, plural distresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Physical or emotional discomfort, suffering, or alarm, particularly of a more acute nature.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cause of such discomfort.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Serious danger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An aversive state of stress to which a person cannot fully adapt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A seizing of property without legal process to force payment of a debt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The thing taken by distraining; that which is seized to procure satisfaction.",
                  "examples": [
                    "If he were not paid, he would straight go and take a distress of goods and cattle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "distress (third-person singular simple present distresses, present participle distressing, simple past and past participle distressed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause strain or anxiety to someone.",
                  "examples": [
                    "Synonyms: anguish, harrow, trouble, vex, torment, tantalize, tantalise, martyr"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To retain someone’s property against the payment of a debt; to distrain.",
                  "examples": [
                    "Synonym: distrain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To treat a new object to give it an appearance of age.",
                  "examples": [
                    "Synonyms: age, antique, patinate",
                    "a pair of distressed jeans",
                    "She distressed the new media cabinet so that it fit with the other furniture in the room."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}