{
  "word": "finesse",
  "etymologies": [
    {
      "description": [
        "From Middle English finesse (“degree of excellence; (of metal) fineness, purity”), from Middle French finesse, Old French finesse (“fineness; delicacy; slenderness”), from fine, fin (“fine, thin”) (from Latin fīnis (“end”); compare Middle English fīn (“of superior quality; precious, valuable; admirable, pleasing; pure, refined; fineness, purity; delicate, exquisite, fine; sharp, thin”)) + -esse (suffix forming nouns describing the condition of being something).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "finesse (countable and uncountable, plural finesses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Skill in the handling or manipulation of a situation. [from c. 1520]",
                  "examples": [
                    "Synonym: finessing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The property of having elegance, grace, refinement, or skill. [from mid 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An adroit manoeuvre. [from mid 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, card games) In bridge, whist, etc.: a technique which allows one to win a trick, usually by playing a card when it is thought that a card that can beat it is held by another player whose turn is over. [from early 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "finesse (third-person singular simple present finesses, present participle finessing, simple past and past participle finessed)",
          "definitionGroups": [
            {
              "group": "(transitive, chiefly Canada, US, politics) To evade (a problem, situation, etc.) by using some clever argument or stratagem.",
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To handle or manage carefully or skilfully; to manipulate in a crafty way. [from mid 18th c.]",
                  "examples": [
                    "Synonym: (slang) zhoosh"
                  ]
                },
                {
                  "meaning": "(transitive, slang) To obtain something from someone through trickery or manipulation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, card games) To attempt to win a trick by finessing. [from mid 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, card games) To play (a card) as a finesse. [from mid 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, croquet, obsolete) To play a ball out of the way of an opponent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}