{
  "word": "flounder",
  "etymologies": [
    {
      "description": [
        "From Middle English flowndre, from Anglo-Norman floundre, from Old Northern French flondre, from Old Norse flyðra, from Proto-Germanic *flunþrijǭ. Cognate with Danish flynder, German Flunder, Swedish flundra."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flounder (plural flounders or flounder)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A European species of flatfish having dull brown colouring with reddish-brown blotches; fluke, European flounder, Platichthys flesus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) Any of various flatfish of the family Pleuronectidae or Bothidae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bootmaker's tool for crimping boot fronts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from the noun. Probably a blend of flounce +‎ founder or a blend of founder +‎ blunder or from Dutch flodderen (“wade”). See other terms beginning with fl, such as flutter, flitter, float, flap, flub, flip."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "flounder (third-person singular simple present flounders, present participle floundering, simple past and past participle floundered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act clumsily or confused; to struggle or be flustered.",
                  "examples": [
                    "They have floundered on from blunder to blunder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To flop around as a fish out of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make clumsy attempts to move or regain one's balance.",
                  "examples": [
                    "Robert yanked Connie's leg vigorously, causing her to flounder and eventually fall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be in serious difficulty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}