{
  "word": "memory",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman memorie, Old French memoire etc., from Latin memoria (“the faculty of remembering, remembrance, memory, a historical account”), from memor (“mindful, remembering”), from Proto-Indo-European *(s)mer- (to remember), related to Ancient Greek μνήμη (mnḗmē, “memory”) μέρμερος (mérmeros, “anxious”), μέριμνα (mérimna, “care, thought”), Old English mimor (“mindful, remembering”). More at mimmer. Doublet of memoir and memoria. Displaced native Old English ġemynd."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "memory (countable and uncountable, plural memories)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The ability of the brain to record information or impressions with the facility of recalling them later at will.",
                  "examples": [
                    "Synonym: recall",
                    "Memory is a facility common to all animals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A record of a thing or an event stored and available for later use by the organism.",
                  "examples": [
                    "Synonyms: recall, recollection",
                    "I have no memory of that event.",
                    "My wedding is one of my happiest memories."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The part of a computer that stores variable executable code or data (RAM) or unalterable executable code or default data (ROM).",
                  "examples": [
                    "Synonym: (dated) core",
                    "This data passes from the CPU to the memory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The time within which past events can be or are remembered.",
                  "examples": [
                    "in recent memory",
                    "in living memory"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive, of a material) Which returns to its original shape when heated",
                  "examples": [
                    "memory metal",
                    "memory plastic"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A memorial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of pelmanism (“memory card game”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, collective, rare) A term of venery for a social group of elephants, normally called a herd.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}