{
  "word": "denizen",
  "etymologies": [
    {
      "description": [
        "From Middle English denisein, from Old French denzein, from deinz (“within”) +‎ -ein, from Late Latin dē intus (“from within”), whence French dans."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "denizen (plural denizens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inhabitant of a place; one who dwells in.",
                  "examples": [
                    "The giant squid is one of many denizens of the deep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who frequents a place.",
                  "examples": [
                    "The denizens of that pub are of the roughest sort."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, historical) A person with rights between those of naturalized citizen and resident alien (roughly permanent resident), obtained through letters patent.",
                  "examples": [
                    "Then by commaundement wer all Fre[n]chemen and Scottes imprisoned and the goodes seazed, and all suche as were denizens were commaunded to shewe their letters patentes  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) An animal or plant from a particular range or habitat.",
                  "examples": [
                    "The bald eagle is a denizen of the northern part of the state."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A foreign word that has become naturalised in another language.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "denizen (third-person singular simple present denizens, present participle denizening, simple past and past participle denizened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain, historical) To grant rights of citizenship to; to naturalize.",
                  "examples": [
                    "He was denizened to Ireland after fleeing his home country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with denizens; to populate with adopted or naturalized occupants.",
                  "examples": [
                    "There were a few islets in the sand  […] . These were at once denizened by the Calotropis, Argemone, Tamarix, Gnaphalium luteoalbum and two other species  […] ."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}