{
  "word": "money",
  "etymologies": [
    {
      "description": [
        "From Middle English moneye, moneie, money, borrowed from Anglo-Norman muneie (“money”), from Latin monēta (“money, a place for coining money, coin, mint”), from the name of the temple of Juno Moneta in Rome, where a mint was.",
        "In this sense, displaced native Old English feoh, whence English fee. Doublet of mint, ultimately from the same Latin word but through Germanic and Old English, and of manat, through Russian and Azeri or Turkmen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "money (usually uncountable, plural monies or moneys) (plural used only in certain senses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A legally or socially binding conceptual contract of entitlement to wealth, void of intrinsic value, payable for all debts and taxes, and regulated in supply.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A generally accepted means of exchange and measure of value.",
                  "examples": [
                    "I cannot take money, that I did not work for.",
                    "Before colonial times cowry shells imported from Mauritius were used as money in Western Africa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A currency maintained by a state or other entity which can guarantee its value (such as a monetary union).",
                  "examples": [
                    "money supply;  money market"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hard cash in the form of banknotes and coins, as opposed to cheques/checks, credit cards, or credit more generally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The total value of liquid assets available for an individual or other economic unit, such as cash and bank deposits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wealth; a person, family or class that possesses wealth",
                  "examples": [
                    "He was born with money. He married money."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An item of value between two or more parties used for the exchange of goods or services.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who funds an operation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}