{
  "word": "contract",
  "etymologies": [
    {
      "description": [
        "From Middle English, from Old French contract, from Latin contractum, past participle of contrahere (“to bring together, to bring about, to conclude a bargain”), from con- (“with, together”) + trahere (“to draw, to pull”)."
      ],
      "adjectives": [
        {
          "description": "contract (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Contracted; affianced; betrothed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Not abstract; concrete.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "contract (plural contracts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An agreement between two or more parties, to perform a specific job or work order, often temporary or of fixed duration and usually governed by a written agreement.",
                  "examples": [
                    "Synonyms: compact, pact",
                    "Marriage is a contract.",
                    "sign a contract",
                    "write up a contract",
                    "read a contract",
                    "countersign a contract",
                    "legally-binding contract",
                    "unwritten contract"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An agreement which the law will enforce in some way. A legally binding contract must contain at least one promise, i.e., a commitment or offer, by an offeror to and accepted by an offeree to do something in the future. A contract is thus executory rather than executed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The document containing such an agreement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A part of legal studies dealing with laws and jurisdiction related to contracts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An order, usually given to a hired assassin, to kill someone.",
                  "examples": [
                    "The mafia boss put a contract out on the man who betrayed him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge) The declarer's undertaking to win the number of tricks bid with a stated suit as trump.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English, from Middle French contracter, from Latin contractum, past participle of contrahere (“to bring together, to bring about, to conclude a bargain”), from con- (“with, together”) + trahere (“to draw, to pull”). The verb developed after the noun, and originally meant only \"draw together\"; the sense \"make a contract with\" developed later."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "contract (third-person singular simple present contracts, present participle contracting, simple past and past participle contracted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To draw together or nearer; to shorten, narrow, or lessen.",
                  "examples": [
                    "The snail’s body contracted into its shell.",
                    "to contract one’s sphere of action"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) To shorten by omitting a letter or letters or by reducing two or more vowels or syllables to one.",
                  "examples": [
                    "The word “cannot” is often contracted into “can’t”."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enter into a contract with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enter into, with mutual obligations; to make a bargain or covenant for.",
                  "examples": [
                    "Many persons  […]  had contracted marriage within the degrees of consanguinity  […]  prohibited by law."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make an agreement or contract; to covenant; to agree; to bargain.",
                  "examples": [
                    "to contract for carrying the mail"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring on; to incur; to acquire.",
                  "examples": [
                    "She contracted the habit of smoking in her teens.",
                    "to contract a debt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To gain or acquire (an illness).",
                  "examples": [
                    "An officer contracted hepatitis B and died after handling the blood-soaked clothing of a homicide victim  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To draw together so as to wrinkle; to knit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To betroth; to affiance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}