{
  "word": "paradox",
  "etymologies": [
    {
      "description": [
        "From Middle French paradoxe, from Latin paradoxum, from Ancient Greek παράδοξος (parádoxos, “unexpected, strange”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "paradox (plural paradoxes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An apparently self-contradictory statement, which can only be true if it is false, and vice versa.",
                  "examples": [
                    "\"This sentence is false\" is a paradox."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A counterintuitive conclusion or outcome.",
                  "examples": [
                    "It is an interesting paradox that drinking a lot of water can often make you feel thirsty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A claim that two apparently contradictory ideas are true.",
                  "examples": [
                    "Not having a fashion is a fashion; that's a paradox."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing involving contradictory yet interrelated elements that exist simultaneously and persist over time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing having contradictory properties.",
                  "examples": [
                    "He is a paradox; you would not expect him in that political party."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unanswerable question or difficult puzzle, particularly one which leads to a deeper truth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A statement which is difficult to believe, or which goes against general belief.",
                  "examples": [
                    "they contended to make that Maxim, that there is no faith to be held with Infidels, a meere and absurd Paradox [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The use of counterintuitive or contradictory statements (paradoxes) in speech or writing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, philosophy) A state in which one is logically compelled to contradict oneself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, psychotherapy) The practice of giving instructions that are opposed to the therapist's actual intent, with the intention that the client will disobey or be unable to obey.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}