{
  "word": "room",
  "etymologies": [
    {
      "description": [
        "From Middle English roum, from Old English rūm (“room, space”), from Proto-West Germanic *rūm (“room”), from Proto-Germanic *rūmą (“room”), from Proto-Indo-European *rewh₁- (“free space”).",
        "Cognate with Low German Ruum, Dutch ruimte (“space”) and Dutch ruim (“cargo load”), German Raum (“space, interior space”), Danish rum (“space, locality”), Norwegian rom (“space”), Swedish rum (“space, location”), and also with Latin rūs (“country, field, farm”) through Indo-European. More at rural.",
        "It is ostensibly an exception to the Great Vowel Shift, which otherwise would have produced the pronunciation /ɹaʊm/, but /aʊ/ does not occur before noncoronal consonants in Modern English native vocabulary."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "room (countable and uncountable, plural rooms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Opportunity or scope (to do something). [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Space for something, or to carry out an activity. [from 10th c.]",
                  "examples": [
                    "He explains they have enough room to stand and lie down, points out the \"little cup to brush our teeth\", and the place where they pray."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A particular portion of space. [from 11th c.]",
                  "examples": [
                    "If he have but twelve pence in his purse, he will give it for the best room in a playhouse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figuratively) Sufficient space for or to do something. [from 15th c.]",
                  "examples": [
                    "There are major disagreements within the Coalition and politicians always want to retain room for manoeuvre."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A space between the timbers of a ship's frame. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Place; stead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A separate part of a building, enclosed by walls, a floor and a ceiling. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, with possessive pronoun) (One's) bedroom.",
                  "examples": [
                    "Go to your room!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A set of rooms inhabited by someone; one's lodgings. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the singular, metonymically) The people in a room. [from 17th c.]",
                  "examples": [
                    "The room was on its feet.",
                    "He was good at reading rooms.",
                    "It was fun to watch her work the room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) An area for working in a coal mine. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(caving) A portion of a cave that is wider than a passage. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, countable) An IRC or chat room. [from 20th c.]",
                  "examples": [
                    "Some users may not be able to access the AOL room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Place or position in society; office; rank; post, sometimes when vacated by its former occupant.",
                  "examples": [
                    "Neither that I look for a higher room in heaven."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quantity of furniture sufficient to furnish one room.",
                  "examples": [
                    "“I understand you need some furniture and can’t get no credit.” I liked to fell over. He say, “I’ll give you all the credit you want, but you got to pay the interest on it.” I told him, “Give me three rooms worth and charge whatever you want.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "room (third-person singular simple present rooms, present participle rooming, simple past and past participle roomed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To reside, especially as a boarder or tenant.",
                  "examples": [
                    "Doctor Watson roomed with Sherlock Holmes at Baker Street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assign to a room; to allocate a room to.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English roum, rom, rum, from Old English rūm (“roomy, spacious, ample, extensive, large, open, unencumbered, unoccupied, temporal, long, extended, great, liberal, unrestricted, unfettered, clear, loose, free from conditions, free from occupation, not restrained within due limits, lax, far-reaching, abundant, noble, august”), from Proto-Germanic *rūmaz (“roomy, spacious”), from Proto-Indo-European *rewh₁- (“free space”). Cognate with Scots roum (“spacious, roomy”), Dutch ruim (“roomy, spacious, wide”), Danish rum (“wide, spacious”), German raum (“wide”), Icelandic rúmur (“spacious”)."
      ],
      "adjectives": [
        {
          "description": "room (comparative more room, superlative most room)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal or obsolete) Wide; spacious; roomy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English rome, from Old English rūme (“widely, spaciously, roomily, far and wide, so as to extend over a wide space, liberally, extensively, amply, abundantly, in a high degree, without restriction or encumbrance, without the pressure of care, light-heartedly, without obstruction, plainly, clearly, in detail”). Cognate with Dutch ruim (“amply”, adverb)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "room (comparative more room, superlative most room)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal or obsolete) Far; at a distance; wide in space or extent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Off from the wind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "room (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of roum (“deep blue dye”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}