{
  "word": "claim",
  "etymologies": [
    {
      "description": [
        "From Middle English claimen, borrowed from Old French clamer (“to call, name, send for”), from Latin clāmō, clāmāre (“to call, cry out”), from Proto-Italic *klāmāō, from Proto-Indo-European *kelh₁- (“to shout”), which is imitative.",
        "See also Lithuanian kalba (“language”), Old English hlōwan (“to low, make a noise like a cow”), Old High German halan (“to call”), Ancient Greek καλέω (kaléō, “to call, convoke”), κλέδον (klédon, “report, fame”), κέλαδος (kélados, “noise”), Middle Irish cailech (“cock”), Latin calō (“to call out, announce solemnly”), Sanskrit उषःकल (uṣaḥkala, “cock”, literally “dawn-calling”). Cognate with Spanish llamar and clamar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "claim (plural claims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A demand of ownership made for something.",
                  "examples": [
                    "a claim of ownership",
                    "a claim of victory"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The thing claimed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The right or ground of demanding.",
                  "examples": [
                    "You don't have any claim on my time, since I'm no longer your employee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A new statement of something one believes to be the truth, usually when the statement has yet to be verified or without valid evidence provided.",
                  "examples": [
                    "The company's share price dropped amid claims of accounting fraud."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A demand of ownership for previously unowned land.",
                  "examples": [
                    "Miners had to stake their claims during the gold rush."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A legal demand for compensation or damages.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "claim (third-person singular simple present claims, present participle claiming, simple past and past participle claimed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To demand ownership of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To state a new fact, typically without providing evidence to prove it is true.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To demand ownership or right to use for land.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To demand compensation or damages through the courts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be entitled to anything; to deduce a right or title; to have a claim.",
                  "examples": [
                    "We must know how the first ruler, from whom any one claims, came by his authority, upon what ground any one has empire"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause the loss of, usually by violent means.",
                  "examples": [
                    "The attacks claimed the lives of five people.",
                    "A fire claimed two homes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To proclaim.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To call or name.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}