{
  "word": "pocket",
  "etymologies": [
    {
      "description": [
        "From Middle English pocket (“bag, sack”), from Anglo-Norman poket, Old Northern French poquet, poquete, diminutive of poque, poke (“bag, sack”) (compare modern Norman pouquette and modern French pochette from Old French pochete, from puche), from Frankish *poka (“pouch”), from Proto-Germanic *pukkô, *pukô (“bag; pouch”), from Proto-Indo-European *bew- (“to blow, swell”). Cognate with Middle Dutch poke, Alemannic German Pfoch (“purse, bag”), Old English pocca, pohha (“poke, pouch, pocket, bag”), Old Norse poki (“bag, pocket”). Compare the related poke (\"sack or bag\"). See also Modern French pochette and Latin bucca."
      ],
      "adjectives": [
        {
          "description": "pocket (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a size suitable for putting into a pocket.",
                  "examples": [
                    "a pocket dictionary"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Smaller or more compact than usual.",
                  "examples": [
                    "pocket battleship, pocket beach"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Texas hold'em poker) Referring to the two initial hole cards.",
                  "examples": [
                    "a pocket pair of kings"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pocket (plural pockets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bag stitched to an item of clothing, used for carrying small items.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Such a receptacle seen as housing someone's money; hence, financial resources.",
                  "examples": [
                    "I paid for it out of my own pocket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, billiards, pool, snooker) An indention and cavity with a net sack or similar structure (into which the balls are to be struck) at each corner and one centered on each side of a pool or snooker table.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enclosed volume of one substance surrounded by another.",
                  "examples": [
                    "She knew from avalanche safety courses that outstretched hands might puncture the ice surface and alert rescuers. She knew that if victims ended up buried under the snow, cupped hands in front of the face could provide a small pocket of air for the mouth and nose. Without it, the first breaths could create a suffocating ice mask."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) An area of land surrounded by a loop of a river.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football) The area of the field to the side of the goal posts (four pockets in total on the field, one to each side of the goals at each end of the ground). The pocket is only a roughly defined area, extending from the behind post, at an angle, to perhaps about 30 meters out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) The area behind the line of scrimmage subject to certain rules regarding intentional grounding, illegal contact, etc., formally extending to the end zone but more usually understood as the central area around the quarterback directly protected by the offensive line.",
                  "examples": [
                    "For many years, the popular belief among NFL analysts was that the success of an NFL team comes with a quarterback who can stand tall in the pocket and deliver the ball downfield. Members of the elite group of active quarterbacks, Peyton Manning, Tom Brady and Drew Brees, for instance, also earned their reputation by making plays almost exclusively from the pocket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An area where military units are completely surrounded by enemy units.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby) The position held by a second defensive middle, where an advanced middle must retreat after making a touch on the attacking middle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) The unbroken part of a wave that offers the surfer the most power.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large bag or sack formerly used for packing various articles, such as ginger, hops, or cowries; the pocket of wool held about 168 pounds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A hole or space covered by a movable piece of board, as in a floor, boxing, partitions, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A cavity in a rock containing a nugget of gold, or other mineral; a small body of ore contained in such a cavity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A strip of canvas sewn upon a sail so that a batten or a light spar can placed in the interspace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The pouch of an animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bowling) The ideal point where the pins are hit by the bowling ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A socket for receiving the base of a post, stake, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bight on a lee shore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dentistry) A small space between a tooth and the adjoining gum, formed by an abnormal separation of the two.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, isolated group or area.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pocket (third-person singular simple present pockets, present participle pocketing, simple past and past participle pocketed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put (something) into a pocket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards, snooker, pool) To cause a ball to go into one of the pockets of the table; to complete a shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To take and keep (something, especially money, that is not one's own).",
                  "examples": [
                    "Record executives pocketed most of the young singer's earnings.",
                    "The thief was caught on camera pocketing the diamond."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal, dated) To put up with; to bear without complaint.",
                  "examples": [
                    "As long as the house suffered the practice to prevail, they must submit to pocket the insult of being told that it existed."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}