{
  "word": "market",
  "etymologies": [
    {
      "description": [
        "From Middle English market, from late Old English market (“market”) and Anglo-Norman markiet (Old French marchié); both ultimately from Latin mercātus (“trade, market”), from mercor (“I trade, deal in, buy”), itself derived from merx (“wares, merchandise”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "market (plural markets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gathering of people for the purchase and sale of merchandise at a set time, often periodic.",
                  "examples": [
                    "The right to hold a weekly market was an invaluable privilege not given to all towns in the Middle Ages."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "City square or other fairly spacious site where traders set up stalls and buyers browse the merchandise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A grocery store",
                  "examples": [
                    "Stop by the market on your way home and pick up some milk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of potential customers for one's product.",
                  "examples": [
                    "We believe that the market for the new widget is the older homeowner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A geographical area where a certain commercial demand exists.",
                  "examples": [
                    "Foreign markets were lost as our currency rose versus their valuta."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A formally organized, sometimes monopolistic, system of trading in specified goods or effects.",
                  "examples": [
                    "The stock market ceased to be monopolized by the paper-shuffling national stock exchanges with the advent of Internet markets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sum total traded in a process of individuals trading for certain commodities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The price for which a thing is sold in a market; hence, value; worth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "market (third-person singular simple present markets, present participle marketing, simple past and past participle marketed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (products or services) available for sale and promote them.",
                  "examples": [
                    "We plan to market an ecology model by next quarter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sell.",
                  "examples": [
                    "We marketed more this quarter already than all last year!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To deal in a market; to buy or sell; to make bargains for provisions or goods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To shop in a market; to attend a market.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}