{
  "word": "homosexual",
  "etymologies": [
    {
      "description": [
        "Borrowed from German Homosexual, from homo- (“same”) + sexual (“relating to sex or sexuality”), coined by Karl Maria Kertbeny in 1868, and popularized in Richard von Krafft-Ebing's 1886 Psychopathia Sexualis (in German) and Charles Gilbert Chaddock's 1892 English translation thereof (compare bisexual), displacing the slightly older term Uranian. Equivalent to homo- +‎ -sexual."
      ],
      "adjectives": [
        {
          "description": "homosexual (comparative more homosexual, superlative most homosexual)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person or animal, formal, distancing or dated) Sexually and/or romantically attracted to members of the same sex, such as a man who is attracted to men or a woman who is attracted to women; gay. (Typically used in the sense of sole/exclusive attraction.)",
                  "examples": [
                    "No, it wouldn't make a difference if the applicant was homosexual."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a romantic or sexual act or relationship, formal, distancing or dated) Between two people of the same sex; gay.",
                  "examples": [
                    "Most western countries have repealed laws against homosexual activity between consenting adults."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Intended for or used by homosexuals, as a nightclub, a bar, etc.",
                  "examples": [
                    "No one says \"a homosexual bar\" anymore; it's a \"gay bar\" or maybe a \"lesbian bar\"."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "homosexual (plural homosexuals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typically formal, distancing or dated) A person who is sexually attracted solely or primarily to others of the same sex.",
                  "examples": [
                    "Soon, we got up, walked around the west side — toward the \"meat rack\" — the gay part of the park. There, it was as if someone had hung a line of marionettes on the railing: the lonesome young homosexuals, legs dangling, looking, waiting for that one-night's sexual connection..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}