{
  "word": "formalism",
  "etymologies": [
    {
      "description": [
        "From formal +‎ -ism."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "formalism (countable and uncountable, plural formalisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Strict adherence to a given form of conduct, practice etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) One of several alternative computational paradigms for a given theory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literature) An approach to interpretation and/or evaluation focused on the (usually linguistic) structure of a literary work rather than on the contexts of its origin or reception.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The tendency to elevate formal above expressive value in music, as in serialism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, physics) A particular mathematical or scientific theory or description of a given state or effect.",
                  "examples": [
                    "Heisenberg seems to have been motivated by his intense annoyance that Schrödinger's more intuitive version of quantum theory was more widely accepted than his own, even though both formalisms led to the same results."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, computing, mathematics) A formal expression of a grammar; a formal grammar; a set of rules of syntax that, without reference to semantics, determine whether a sequence of symbols is a well-formed sentence in a given formal language.",
                  "examples": [
                    "Dirac approaches quantum mechanics by means of a so-called symbolic method, the bracket formalism. Although this formalism has a mathematical flavour, in fact, it is based upon bold claims which lack mathematical foundation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy of mathematics) The ontological view of mathematics as a mere collection of string manipulation rules.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}