{
  "word": "epizootic",
  "etymologies": [
    {
      "description": [
        "From French épizootique, animal equivalent of epidemic, from épizootie, irregularly formed from Ancient Greek ἐπί (epí) + ζῷον (zôion, “animal”).\nSurface analysis, epi- +‎ zo- +‎ -otic. Use of the word in the second sense, \"an ailment\", was likely originally a reference to a particular epizootic ailment. Both senses are attested since at least the 1800s, and the pronunciation with five syllables is explicitly attested since then as well. Dialectal pronunciation of the second sense with four syllables is attested since at least the 1910s in spellings like \"epizudic\" and is suggested by 1870s references to a shortened form of the word, \"zooty\"."
      ],
      "adjectives": [
        {
          "description": "epizootic (comparative more epizootic, superlative most epizootic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(epidemiology) Like or having to do with an epizootic: epidemic among animals.",
                  "examples": [
                    "Epizootic plague occurred in the mice following introduction of rats from Europe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology, rare) Containing fossils.",
                  "examples": [
                    "Hence their primary division is into primeval and secondary or Epizootic. And the epizootic mountains are still farther distinguishable into original and derivative."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to epizoa; epizoic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "epizootic (plural epizootics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(epidemiology) An occurrence of a disease or disorder in a population of non-human animals at a frequency higher than that expected in a given time period. Compare epidemic.",
                  "examples": [
                    "At the same time as an epidemic of the flu broke out among the people, an epizootic of the swine flu broke out among their pigs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular epizootic disease.",
                  "examples": [
                    "A surgeon in the town has also informed me, that a person requested him to prescribe for some lambs affected with the epizootic, and he gave them Epsom salts and opium, with, as he said, very good effect."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal, humorous, often in the plural) A disease or ailment (of humans).",
                  "examples": [
                    "Johnny's not doing so well today, I think he caught the epizootic."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}