{
  "word": "deer",
  "etymologies": [
    {
      "description": [
        "From Middle English deere, dere, der, dier, deor (“small animal, deer”), from Old English dēor (“animal”), from Proto-West Germanic *deuʀ, from Proto-Germanic *deuzą, from Proto-Indo-European *dʰewsóm (“living thing”), from *dʰéws (“breath”), full-grade derivative of *dʰwes-.",
        "Cognate with Scots dere, deir (“deer”), North Frisian dier (“animal, beast”), West Frisian dier (“animal, beast”), Dutch dier (“animal, beast”), German Low German Deer, Deert (“animal”), German Tier (“animal, beast”), Swedish djur (“animal, beast”), Norwegian dyr (“animal, beast”), Icelandic dýr (“animal, beast”).",
        "Related also to Albanian dash (“ram”) (possibly), Lithuanian daũsos (“upper air; heaven”), Lithuanian dùsti (“to sigh”), Russian душа́ (dušá, “breath, spirit”), Lithuanian dvėsti (“to breathe, exhale”), Sanskrit ध्वंसति (dhvaṃsati, “he falls to dust”).",
        "For the semantic development compare Latin animālis (“animal”), from anima (“breath, spirit”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "deer (plural deer or (nonstandard) deers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ruminant mammal with antlers and hooves of the family Cervidae, or one of several similar animals from related families of the order Artiodactyla.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in particular) One of the smaller animals of this family, distinguished from a moose or elk",
                  "examples": [
                    "I wrecked my car after a deer ran across the road."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The meat of such an animal; venison.",
                  "examples": [
                    "Oh, I've never had deer before."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, except in the phrase \"small deer\") Any animal, especially a quadrupedal mammal as opposed to a bird, fish, etc.",
                  "examples": [
                    "But mice and rats and such small deer, have been Tom's food for seven long year."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}