{
  "word": "baby",
  "etymologies": [
    {
      "description": [
        "From Middle English baby, babie (“baby”), a diminutive form of babe (“babe, baby”), equivalent to babe +‎ -y/-ie (“endearing and diminutive suffix”). Perhaps ultimately imitative of baby talk (compare babble)."
      ],
      "adjectives": [
        {
          "description": "baby (comparative babier or babyer or baby-er, superlative babiest or babyest or baby-est)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of vegetables, etc.) Picked when small and immature (as in baby corn, baby potatoes).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Newest (overall, or in some group or state), most inexperienced.",
                  "examples": [
                    "Mrs. Paull held out her hand to the babyest of the quartette, as they tiptoed up to  the bed. “Lift her up, please, Marie!” she said, motioning to the place enclosed by her arm. When the rosy cheek touched hers upon the pillow, she asked ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the comparative or superlative) Like or pertaining to a baby, in size or youth; small, young.",
                  "examples": [
                    "Spider. Here  let us begin at the beginning, at the babyest of books for Edith's nursery."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "baby (plural babies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very young human, particularly from conception or birth to a couple of years old or until walking is fully mastered.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any very young animal, especially a vertebrate; many species have specific names for their babies, such as kittens for the babies of cats, puppies for the babies of dogs, and chicks for the babies of birds. See Category:Baby animals for more.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unborn young; a fetus.",
                  "examples": [
                    "When is your baby due?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is immature, infantile or feeble.",
                  "examples": [
                    "Stand up for yourself – don't be such a baby!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is new to or inexperienced in something.",
                  "examples": [
                    "I only qualified as an architect this summer, so I'm still a baby."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lastborn of a family; the youngest sibling, irrespective of age.",
                  "examples": [
                    "Adam is the baby of the family."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person's romantic partner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A term of endearment used to refer to or address one's girlfriend, boyfriend or spouse.",
                  "examples": [
                    "Too busy thinking about my baby, and I ain't got time for nothing else.",
                    "Baby, don't cry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A form of address to a person considered to be attractive.",
                  "examples": [
                    "Hey baby, what are you doing later?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A concept or creation endeared by its creator.",
                  "examples": [
                    "This test program I've designed is my new baby."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pet project or responsibility.",
                  "examples": [
                    "You need to talk to John about that – it's his baby."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An affectionate term for anything.",
                  "examples": [
                    "See my new car here? I can't wait to take this baby for a drive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A small image of an infant; a doll.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often attributive) One who is new to an identity or community.",
                  "examples": [
                    "These more general spells and rituals can also be helpful for baby witches, who might want more time to practice before they hop into highly-specific spells."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "baby (third-person singular simple present babies, present participle babying, simple past and past participle babied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To coddle; to pamper somebody like an infant.",
                  "examples": [
                    "Then the man effected measles and stayed off the job for six weeks, babying himself at home, though he lived just round the corner from my half-built house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tend (something) with care; to be overly attentive to (something), fuss over.",
                  "examples": [
                    "In the past 27 years, \"Mr. Mac,\" as he is known to his 46,000 teammates, has built and babied his McDonnell Co. from nothing into a $1 billion-a-year corporation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}