{
  "word": "churn",
  "etymologies": [
    {
      "description": [
        "Noun from Middle English chyrne, cherne, kyrne ( > Scots kirn), from Old English ċyrn, ċyrin, ċirin (“churn”), from Proto-Germanic *kirnijǭ (“churn”); verb from Middle English chyrnen from Old English ċernan, from Proto-Germanic *kirnijaną (“to churn, stir”), of unknown origin. Cognate with West Frisian tsjerne, Dutch karn, Walloon serene, German Karn, Kirne, Norwegian Bokmål kjerne, Danish kjærne, Swedish kärna, Icelandic kirna."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "Noun from Middle English chyrne, cherne, kyrne ( > Scots kirn), from Old English ċyrn, ċyrin, ċirin (“churn”), from Proto-Germanic *kirnijǭ (“churn”); verb from Middle English chyrnen from Old English ċernan, from Proto-Germanic *kirnijaną (“to churn, stir”), of unknown origin. Cognate with West Frisian tsjerne, Dutch karn, Walloon serene, German Karn, Kirne, Norwegian Bokmål kjerne, Danish kjærne, Swedish kärna, Icelandic kirna.",
          "definitionGroups": []
        },
        {
          "description": "churn (countable and uncountable, plural churns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vessel used for churning, especially for producing butter.",
                  "examples": [
                    "a butter churn"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A milk churn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Customer attrition; the phenomenon or rate of customers leaving a company.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telecommunications) The time when a consumer switches his/her service provider.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telecommunications) The mass of people who are ready to switch carriers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cyclic activity that achieves nothing.",
                  "examples": [
                    "I wished my brain would shut up and knew that soon I'd have to start tidying, but first I needed to rest, so I tried to quell the pointless churn behind my eyes and kept on trying (in a minute) until Vicky came back home."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "churn (third-person singular simple present churns, present participle churning, simple past and past participle churned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To agitate rapidly and repetitively, or to stir with a rowing or rocking motion; generally applies to liquids, notably cream.",
                  "examples": [
                    "Now the cream is churned to make butter.",
                    "no-churn ice cream"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To produce excessive and sometimes undesirable or unproductive activity or motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move rapidly and repetitively with a rocking motion; to tumble, mix or shake.",
                  "examples": [
                    "I was so nervous that my stomach was churning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a customer) To stop using a company's product or service.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, travel, aviation) To repeatedly cancel and rebook a reservation in order to refresh ticket time limits or other fare rule restrictions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, informal, finance, travel) To continually sign up for new credit cards in order to earn signup bonuses, airline miles, and other benefits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) To carry out wash sales in order to make the market appear more active than it really is.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The last grain cut at harvest; kern",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}