{
  "word": "jackanapes",
  "etymologies": [
    {
      "description": [
        "1450, from “Jack of Naples”, with “of Naples” rendered “a Napes” in vernacular. Originally rendered as Jac Napes, Jac Nape, and Jack Napis in 1450s. Presumably from *Jak a Napes, and original *Jak of Naples, presumably circa 1400. Monkeys were one of many exotic goods from Naples exhibited in Britain, hence acquired the nickname Jack a Napes.",
        "In sense “upstart person”, applied to 15th century William de la Pole, 1st Duke of Suffolk, one of the first nouveau riche nobles (risen from merchant class). The family used a collar and chain on their coat of arms, which was an unfortunate choice, as this was more associated with monkey leashes, leading to the derisive nickname Jack Napis for de la Pole, yielding the insult.",
        "Later mis-analyzed as Jack-an-apes (16th and 17th century), leading to folk etymology (taking “ape” from “monkey”). The same process and mis-analysis occurred for fustian of Naples, which became fustian a napes, fustian anapes, etc.",
        "Also attributed to the transition of the playing card 'Knave' to 'Jack' where both cards were associated with the idea of roguery. The 'Jack' became the Jack a napes,  derived from Jack a naipes, naipes being the Spanish for playing card."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jackanapes (plural jackanapeses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A monkey.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, derogatory) An impudent or mischievous person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jackanapes",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "plural of jackanape",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}