{
  "word": "brother",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English brother, from Old English brōþor, from Proto-West Germanic *brōþer, from Proto-Germanic *brōþēr, from Proto-Indo-European *bʰréh₂tēr. Doublet of frater, friar, and pal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brother (plural brothers or (archaic in most senses) brethren)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Son of the same parents as another person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male having at least one parent in common with another (see half-brother, stepbrother).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male fellow member of a religious community, church, trades union etc.",
                  "examples": [
                    "You shall not charge interest to your brother—interest on money or food or anything that is lent out at interest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A form of address to a man.",
                  "examples": [
                    "Listen, brother, I don't know what you want, but I'm not interested."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular) A black male.",
                  "examples": [
                    "SPIN: Aren't you both as popular with white people as black people?",
                    "L.L.: Oh, no question. But I've always said, that's why when people say, \"L.L., hey, like, on the last album, you sold out,\" I say, \"Yo, can I ask you a question, Mike Tyson sell out?\" \"No, he's a brother.\" I say, he's a cross-over artist. He went pop. You know what I'm saying? I mean, the rap audience [...] they have to understand that their music is for all people. Me personally, I don't think it's about being black or white,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Somebody, usually male, connected by a common cause, situation, or affection.",
                  "examples": [
                    "The marvelous new militancy which has engulfed the Negro community must not lead us to a distrust of all white people, for many of our white brothers, as evidenced by their presence here today, have come to realize that their destiny is tied up with our destiny."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who is a peer, whether male or female.",
                  "examples": [
                    "And, above all, no animal must ever tyrannise over his own kind. Weak or strong, clever or simple, we are all brothers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic) Someone who is a kinsman or shares the same patriarch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brother (third-person singular simple present brothers, present participle brothering, simple past and past participle brothered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat as a brother.",
                  "examples": [
                    "Seest thou not we are overreached, and that our proposed mode of communicating with our friends without has been disconcerted by this same motley gentleman thou art so fond to brother?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}