{
  "word": "stunt",
  "etymologies": [
    {
      "description": [
        "Unknown. Compare Middle Low German stunt (“a shoulder grip with which you throw someone on their back”), Middle English stunt (“foolish; stupid”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stunt (plural stunts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A daring or dangerous feat, often involving the display of gymnastic skills.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) skill",
                  "examples": [
                    "\"See if you can hit the barrel, Joe,\" urged George Bland. \"A lot of us have missed it, including Peaches, who seems to think his particular stunt is high throwing.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A special means of rushing the quarterback done to confuse the opposing team's offensive line.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stunt (third-person singular simple present stunts, present participle stunting, simple past and past participle stunted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cheerleading) To perform a stunt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, African-American Vernacular) To show off; to posture.",
                  "examples": [
                    "I was that interested because I wanted the Z28, but I wasn't going another day with Sterling stunting on me with the Contour."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From dialectal stunt (“stubborn, dwarfed”), from Middle English stont, stunt (“short, brief”), from Old English stunt (“stupid, foolish, simple”), from Proto-Germanic *stuntaz (“short, compact, stupid, dull”). Cognate with Middle High German stunz (“short”), Old Norse stuttr (“short in stature, dwarfed”). Related to Old English styntan (“to make dull, stupefy, become dull, repress”). More at stint."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stunt (plural stunts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A check in growth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which has been checked in growth; a stunted animal or thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A two-year-old whale, which, having been weaned, is lean and yields little blubber.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stunt (third-person singular simple present stunts, present participle stunting, simple past and past participle stunted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To check or hinder the growth or development of.",
                  "examples": [
                    "Some have said smoking stunts your growth.",
                    "The politician timed his announcement to stunt any surge in the polls his opponent might gain from the convention."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}