{
  "word": "moralize",
  "etymologies": [
    {
      "description": [
        "From Old French moraliser."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "moralize (third-person singular simple present moralizes, present participle moralizing, simple past and past participle moralized)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make moral reflections (on, upon, about or over something); to regard acts and events as involving a moral.",
                  "examples": [
                    "[…]  his Ladie reaching him a Marigold, he began to moralize of it thus merely. I meruaile the Poets that were so prodigall in painting the amorous affection of the Sunne to his Hyacinth, did neuer obserue the relation of loue twixt him and the Marigold:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say (something) expressing a moral reflection or judgment.",
                  "examples": [
                    "“The more one loves, the more helpless one feels”, she moralised."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To render moral; to correct the morals of; to give the appearance of morality to.",
                  "examples": [
                    "Let gratefull Aromatick odours burne,",
                    "Let pious incense smoake, for the returne",
                    "Of Great Flaminius, in whom abide",
                    "More Art, then raised Athens to her pride,",
                    "More civill Ethicks he containe, then may",
                    "Well moralize all sauage India."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give a moral quality to; to affect the moral quality of, either for better or worse.",
                  "examples": [
                    "For since good and bad stars moralize not our actions, and neither excuse nor commend, acquit or condemn our good or bad deeds at the present or last bar  […]  not celestial figures, but virtuous schemes must denominate and state our actions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To apply to a moral purpose; to explain in a moral sense; to draw a moral from.",
                  "examples": [
                    "[…]  where the Place is obscure, and the Construction difficult, I take leave by paraphrase to give the Meaning: which is a method of times observed by the Septuagint, whose Version Moralizeth in the Greek, what was wrapp’d up in figures by the Hebrew."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To supply with moral lessons, teachings, or examples; to lend a moral to.",
                  "examples": [
                    "Kind Nature’s charities his steps attend,",
                    "In every babbling brook he finds a friend,",
                    "While chast’ning thoughts of sweetest use, bestowed",
                    "By Wisdom, moralize his pensive road."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}