{
  "word": "vibrator",
  "etymologies": [
    {
      "description": [
        "From New Latin vibrātor, from Latin vibrō (“to vibrate”). By surface analysis, vibrate +‎ -or."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vibrator (plural vibrators)",
          "definitionGroups": [
            {
              "group": "A device that vibrates or causes vibration.",
              "entries": [
                {
                  "meaning": "A vibrating device used for massage or sexual stimulation.",
                  "examples": [
                    "They recommend a vibrator because it's a safe alternative to sex."
                  ]
                },
                {
                  "meaning": "(historical) A device designed to electromechanically interrupt current flowing to the step-up transformer which was used to generate the high tension positive supply in old battery-operated (automotive) valve radios.",
                  "examples": []
                },
                {
                  "meaning": "A trembler, as of an electric bell.",
                  "examples": []
                },
                {
                  "meaning": "A vibrating reed for transmitting or receiving pulsating currents in a harmonic telegraph system.",
                  "examples": []
                },
                {
                  "meaning": "A device for vibrating the pen of a siphon recorder to diminish frictional resistance on the paper.",
                  "examples": []
                },
                {
                  "meaning": "An oscillator.",
                  "examples": []
                },
                {
                  "meaning": "An ink-distributing roller in a printing machine, having an additional vibratory motion.",
                  "examples": []
                },
                {
                  "meaning": "A vibrating reed in a musical instrument, especially a reed organ.",
                  "examples": []
                },
                {
                  "meaning": "(weaving) Any of various vibrating devices, such as one for slackening the warp as a shed opens.",
                  "examples": []
                },
                {
                  "meaning": "An attachment, usually pneumatic, in a moulding machine to shake the pattern loose.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}