{
  "word": "chief",
  "etymologies": [
    {
      "description": [
        "From Middle English cheef, chef, from Old French chef, chief (“leader”), from Vulgar Latin capus (from which also captain, chieftain), from Latin caput (“head”) (English cap (“head covering”)), from Proto-Indo-European *kauput- (English head). Doublet of chef."
      ],
      "adjectives": [
        {
          "description": "chief (comparative chiefer or more chief, superlative chiefest or most chief)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Primary; principal.",
                  "examples": [
                    "Negligence was the chief cause of the disaster."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) Intimate, friendly.",
                  "examples": [
                    "'You’re doing it because she was your friend, not because she was a parishioner, and certainly not because of the Declaratory Articles,' Macmurray said, pushing himself forward on his seat. 'Everybody knows how chief you and she were. It was an unfitting relationship for a minister while she was alive, and it is equally unfitting for you to do her a favour like this now she's dead.'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "chief (plural chiefs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A leader or head of a group of people, organisation, etc. [from 13th c.]",
                  "examples": [
                    "All firefighters report to the fire chief."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) The top part of a shield or escutcheon; more specifically, an ordinary consisting of the upper part of the field cut off by a horizontal line, generally occupying the top third. [from 15th c.]",
                  "examples": [
                    "When the Chief is Charged with any figure, in blazon it is said to be \"On a Chief\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The principal part or top of anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(sometimes ironic) An informal term of address.",
              "entries": [
                {
                  "meaning": "(US, Canada, offensive) An informal term of address for a Native American or First Nations man.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chief (third-person singular simple present chiefs, present participle chiefing, simple past and past participle chiefed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) To smoke cannabis.",
                  "examples": [
                    "He chiefed on the bud like a pro, taking long deep hits and holding it within until he had inhaled as much of the weed smoke as he could."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}