{
  "word": "cleave",
  "etymologies": [
    {
      "description": [
        "From Middle English cleven, from the Old English strong verb clēofan (“to split, to separate”), from Proto-West Germanic *kleuban, from Proto-Germanic *kleubaną, from Proto-Indo-European *glewbʰ- (“to cut, to slice”).",
        "Doublet of clive. Cognate with Dutch klieven, dialectal German klieben, Swedish klyva, Norwegian Nynorsk kløyva; also Ancient Greek γλύφω (glúphō, “carve”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cleave (plural cleaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(technology) Flat, smooth surface produced by cleavage, or any similar surface produced by similar techniques, as in glass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cleave (third-person singular simple present cleaves, present participle cleaving, simple past cleft or clove or (UK) cleaved or (archaic) clave, past participle cleft or cloven or (UK) cleaved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To split or sever something with, or as if with, a sharp instrument.",
                  "examples": [
                    "The wings cleaved the foggy air."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mineralogy) To break a single crystal (such as a gemstone or semiconductor wafer) along one of its more symmetrical crystallographic planes (often by impact), forming facets on the resulting pieces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make or accomplish by or as if by cutting.",
                  "examples": [
                    "The truck cleaved a path through the ice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chemistry) To split (a complex molecule) into simpler molecules.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To split.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, mineralogy) Of a crystal, to split along a natural plane of division.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English cleven, a conflation of two verbs: Old English clifian (from Proto-West Germanic *klibēn, from Proto-Germanic *klibāną) and Old English clīfan (from Proto-West Germanic *klīban, from Proto-Germanic *klībaną), both ultimately from Proto-Indo-European *gleybʰ- (“to stick”). Cognate with Dutch kleven, German kleben (“to stick”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "cleave (third-person singular simple present cleaves, present participle cleaving, simple past and past participle cleaved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare) Followed by to or unto: to adhere, cling, or stick fast to something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}