{
  "word": "pale",
  "etymologies": [
    {
      "description": [
        "From Middle English pale, from Old French pale, from Latin pallidus (“pale, pallid”), from palleō (“I am pale; I grow pale; I fade”), from Proto-Indo-European *pelito-, from *pelH- (“gray”). Doublet of pallid. Displaced native Old English blāc."
      ],
      "adjectives": [
        {
          "description": "pale (comparative paler, superlative palest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Light in color.",
                  "examples": [
                    "I have pale yellow wallpaper.",
                    "She had pale skin because she didn't get much sunlight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of human skin) Having a pallor (a light color, especially due to sickness, shock, fright etc.).",
                  "examples": [
                    "His face turned pale after hearing about his mother's death."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Feeble, faint.",
                  "examples": [
                    "He is but a pale shadow of his former self.",
                    "The son's clumsy paintings are a pale imitation of his father's."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pale",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Paleness; pallor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pale (third-person singular simple present pales, present participle paling, simple past and past participle paled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To turn pale; to lose colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become insignificant.",
                  "examples": [
                    "The matter of whether the world needs a fourth Ice Age movie pales beside the question of why there were three before it, but Continental Drift feels less like an extension of a theatrical franchise than an episode of a middling TV cartoon, lolling around on territory that’s already been settled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make pale; to diminish the brightness of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English pale, pal, borrowed from Old French pal, from Latin pālus (“stake, prop”). English inherited the word pole (or, rather Old English pāl) from a much older Proto-Germanic borrowing of the same Latin word.",
        "Doublet of peel and pole."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pale (plural pales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden stake; a picket.",
                  "examples": [
                    "[…]  if you deſign it a Fence to keep in Deer, at every eight or ten Foot diſtance, ſet a Poſt with a Mortice in it to ſtand a little ſloping over the ſide of the Bank about two Foot high; and into the Mortices put a Rail  […]  and no Deer will go over it, nor can they creep through it, as they do often, when a Pale tumbles down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Fence made from wooden stake; palisade.",
                  "examples": [
                    "Fourthly, they ſhall not vpon any occaſion whatſoeuer breake downe any of our pales, or come into any of our Townes or forts by any other waies, iſſues or ports then ordinary [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Limits, bounds (especially before of).",
                  "examples": [
                    "But let my due feet never fail, / To walk the ſtudious cloyſters pale, / And love the high embowed roof, / With antic pillars maſſy proof, / And ſtoried windows richly dight, / Caſting a dim religious light."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bounds of morality, good behaviour or judgment in civilized company, in the phrase beyond the pale.",
                  "examples": [
                    ".@realDonaldTrump saying that he might not accept election results is beyond the pale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A vertical band down the middle of a shield.",
                  "examples": [
                    "Coordinate terms: pallet, endorse, cottise"
                  ]
                }
              ]
            },
            {
              "group": "(archaic) A territory or defensive area within a specific boundary or under a given jurisdiction.",
              "entries": [
                {
                  "meaning": "(historical) The parts of Ireland under English jurisdiction.",
                  "examples": []
                },
                {
                  "meaning": "(historical) The territory around Calais under English control (from the 14th to 16th centuries).",
                  "examples": [
                    "He knows the fortifications – crumbling – and beyond the city walls the lands of the Pale, its woods, villages and marshes, its sluices, dykes and canals."
                  ]
                },
                {
                  "meaning": "(historical) A portion of Russia in which Jews were permitted to live.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The jurisdiction (territorial or otherwise) of an authority.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cheese scoop.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pale (third-person singular simple present pales, present participle paling, simple past and past participle paled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To enclose with pales, or as if with pales; to encircle or encompass; to fence off.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}