{
  "word": "speculation",
  "etymologies": [
    {
      "description": [
        "From Middle English speculacioun, speculation, from Old French speculation (compare French spéculation), from Late Latin speculātiō, speculātiōnem, from Latin speculor.\nMorphologically speculate +‎ -ion"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "speculation (countable and uncountable, plural speculations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The faculty of sight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An act of looking at something; examination, observation.",
                  "examples": [
                    "[T]he expression of exultation and content on their animated faces, is one of my most delicious speculations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The process of thinking or meditating on a subject.",
                  "examples": [
                    "The Duke and Duchess of Cambridge have ended months of intense speculation by announcing they are expecting their first child, but were forced to share their news earlier than hoped because of the Duchess's admission to hospital on Monday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) The act or process of reasoning a priori from premises given or assumed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conclusion to which the mind comes by speculating; mere theory; notion; conjecture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, finance) An investment involving higher-than-normal risk in order to obtain a higher-than-normal return.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or practice of buying land, goods, shares, etc., in expectation of selling at a higher price, or of selling with the expectation of repurchasing at a lower price; a trading on anticipated fluctuations in price, as distinguished from trading in which the profit expected is the difference between the retail and wholesale prices, or the difference of price in different markets.",
                  "examples": [
                    "Sudden fortunes, indeed, are sometimes made in such places, by what is called the trade of speculation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A card game in which the players buy from one another trumps or whole hands, upon a chance of getting the highest trump dealt, which entitles the holder to the pool of stakes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) The process of anticipating which branch of code will be chosen and executing it in advance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}