{
  "word": "psalm",
  "etymologies": [
    {
      "description": [
        "From Middle English salm or psalme, from Old English psealm, later reinforced from Old French psalme (modern French psaume), both from Latin psalmus, from Ancient Greek ψαλμός (psalmós, “the sound emanating from twitching or twanging perhaps with the hands or fingers, mostly of musical strings”) (from ψάλλω (psállō, “to make a sound by striking, touching, plucking, rubbing, twanging, or vibrating”)), but later in New Testament times the meaning of ψαλμός (psalmós) evolved from its Classical meaning of \"a tune played to the harp\" to a more general tune that could be played with any instrument; even a song sung with or without musical accompaniment. By the Byzantine Period, it lost all of its instrumental nuances."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "psalm (plural psalms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion, music) A sacred song; a poetical composition for use in the praise or worship of God.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the hymns by David and others, collected into one book of the Old Testament, or a modern metrical version of such a hymn for public worship.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "psalm (third-person singular simple present psalms, present participle psalming, simple past and past participle psalmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To extol in psalms; to make music; to sing",
                  "examples": [
                    "to psalm his praises."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}