{
  "word": "landward",
  "etymologies": [
    {
      "description": [
        "land +‎ -ward"
      ],
      "adjectives": [
        {
          "description": "landward (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Located, facing or moving in the direction of the land, as opposed to the sea.",
                  "examples": [
                    "[…]  the enclosure in which Bulan resided lay on a landward slope a quarter of a mile from the shore, and so divided from it by lofty trees, that, unless when the inhabitants sought the coast for fishing, they took little heed of what was passing at sea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) Of the country as opposed to the city, rural; agricultural.",
                  "examples": [
                    "[…]  they recommend to all ministers within the bounds, magistrates of towns, and heritors of landward parishes, to exert themselves, and use every prudent and reasonable method in getting their respective congregations to be taught properly, as occasion shall offer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "landward (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Toward the land.",
                  "examples": [
                    "The seamen furl the canvas, strike the mast,",
                    "Then dip their nimble oars, and landward haste."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "landward (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The side facing land.",
                  "examples": [
                    "The Generall then being at supper, and hearing that call, and looking out to landward, sawe those savage people comming after [Fernan Veloso], and presently imagined they meant him harme, and therefore forthwith he commaunded the whole to put themselves in battaile araye, and he himselfe with certaine others, went to landward without anye weapons, deeming verely that those blacke men meant him no harme, nor would offer annye force  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}