{
  "word": "practise",
  "etymologies": [
    {
      "description": [
        "From Middle English practizen, a variant of practisen, from Middle French pratiser, practiser, from Medieval Latin practizo, from Late Latin practico (“to do, perform, execute, propose, practise, exercise, be conversant with, contrive, conspire, etc.”), from prāctica (“practical affairs\", \"business”), from Ancient Greek πρᾱκτική (prāktikḗ), from πρᾱκτικός (prāktikós, “practical”), from πρᾱ́σσειν (prā́ssein, “to do”), ultimately from Proto-Indo-European *per(h₂)- (“to go over, cross”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "practise (plural practises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of practice.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "practise (third-person singular simple present practises, present participle practising, simple past and past participle practised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To repeat (an activity) as a way of improving one's skill in that activity.",
                  "examples": [
                    "You should practise playing piano every day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To repeat an activity in this way.",
                  "examples": [
                    "If you want to speak French well, you need to practise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To perform or observe in a habitual fashion.",
                  "examples": [
                    "They gather to practise religion every Saturday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pursue (a career, especially law, fine art or medicine).",
                  "examples": [
                    "She practised law for forty years before retiring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To conspire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put into practice; to carry out; to act upon; to commit; to execute; to do.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make use of; to employ.",
                  "examples": [
                    "In malice to this good knight's wife, I practised Ubaldo and Ricardo to corrupt her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To teach or accustom by practice; to train.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}