{
  "word": "tiptop",
  "etymologies": [
    {
      "description": [
        "tip +‎ top"
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "tiptop (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Excellently; in a first-rate manner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "tiptop (countable and uncountable, plural tiptops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The very topmost point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, figurative) The highest or utmost degree; the best of anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, African-American Vernacular, MLE) Oral stimulation of the male member, a blowjob (more commonly top).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the name of a brand of freeze pops originally made by a now defunct West Bromwich company called Crystallized Confections.The term is mainly used in the West Midlands and Wales but is sometimes used elsewhere in Britain and in Ireland."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tiptop (countable and uncountable, plural tiptops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(West Midlands, Wales) A freeze pop, irrespective of brand.",
                  "examples": [
                    "2017,  Kenny Attaway,  Black Cream: A Handful of Sky & a Pocketful of Confetti‎[3]:Although they go by many names across the world freezer pop, ice-pole, pop stick icy-pole ice pop, tip top and ice candy but in the hoods of America they are known and respected as Freeze Pops. The pops are made by freezing flavored liquid such as sugar water, Kool-Aid or some form of fruit juice or purée inside a plastic tube - at least the kinds we ate.",
                    "2018 June 25,  Martha Cliff,  “Ice pops... or freezies? Debate over the CORRECT name for classic summer treat goes ciral on Twitter - so what do YOU call them?”, in  MailOnline‎[4]:Brand names also came up with many naming the treat based on the product sold in their region. US users claimed that the sweet treat aught(sic.) to be referred to as an Otter Pop, a popular brand across the pond. Meanwhile UK users were more in favour of the Mr Freeze, found in many a corner shop while Welsh customers said the correct name was in fact a Tip Top.",
                    "2023 April 17 (last accessed)  “The internet is arguing about what these frozen things are officially called”, in  entertainment.ie‎[5], entertainment.ie:To us, these are (and always have been) called 'cool pops'. To others - particularly on Twitter - they're everything from 'ice pops' to 'ice lollies' to 'ice poles' to 'freeze pops' to 'Tip-Tops'."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}