{
  "word": "suite",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French suite. See also the doublet suit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "suite (plural suites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group or train of attendants, servants etc.; a retinue. [from 16th c.]",
                  "examples": [
                    "[A]s to men, we shall live altogether at the Duc de Romagnecourt's, his suite of servants will be ours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A connected series or succession of objects; a number of things used or classed together. [from 16th c.]",
                  "examples": [
                    "a suite of rooms",
                    "a suite of minerals"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of connected rooms, usually separable from other rooms by means of access. [from 18th c.]",
                  "examples": [
                    "The Presidential suite is well appointed and allows for good security."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical form, popular before the time of the sonata, consisting of a string or series of pieces all in the same key, mostly in various dance rhythms, with sometimes an elaborate prelude. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) An excerpt of instrumental music from a larger work that contains other elements besides the music; for example, the Nutcracker Suite is the music (but not the dancing) from the ballet The Nutcracker, and the Carmen Suite is the instrumental music (but not the singing and dancing) from the opera Carmen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A group of related computer programs distributed together. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}