{
  "word": "finger",
  "etymologies": [
    {
      "description": [
        "From Middle English fynger, finger, from Old English finger (“finger”), from Proto-West Germanic *fingr, from Proto-Germanic *fingraz (“finger”), from Proto-Indo-European *penkʷrós, from *pénkʷe (“five”).",
        "Compare West Frisian finger, Low German/German Finger, Dutch vinger, Danish finger; also Old Armenian հինգեր-որդ (hinger-ord, “fifth”)). More at five."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "finger (plural fingers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A slender jointed extremity of the human hand, (often) exclusive of the thumb.",
                  "examples": [
                    "Humans have two hands and ten fingers. Each hand has one thumb and four fingers."
                  ]
                }
              ]
            },
            {
              "group": "(zoology) Similar or similar-looking extremities in other animals, particularly:",
              "entries": [
                {
                  "meaning": "The lower, smaller segment of an arthropod claw.",
                  "examples": []
                },
                {
                  "meaning": "One of the supporting structures of wings in birds, bats, etc. evolved from earlier toes or fingers.",
                  "examples": []
                },
                {
                  "meaning": "One of the slender bony structures before the pectoral fins of gurnards and sea robins (Triglidae).",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something similar in shape to the human finger, particularly:",
              "entries": [
                {
                  "meaning": "(cooking) Finger-shaped pieces of food.",
                  "examples": [
                    "chocolate fingers; fish fingers; cheese fingers"
                  ]
                },
                {
                  "meaning": "(chemistry) A tube extending from a sealed system, or sometimes into one in the case of a cold finger.",
                  "examples": [
                    "An oven is placed over the finger with Co catalyst (oven temperature will depend on whether a quartz or Pyrex finger is used, see Ref. 24), and a cold finger (usually a copper rod immersed in dry ice–isopropanol slurry) is placed on the other tube."
                  ]
                },
                {
                  "meaning": "(UK regional, botany, usually in the plural, obsolete) Synonym of foxglove (D. purpurea).",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something similarly extending, (especially) from a larger body, particularly:",
              "entries": [
                {
                  "meaning": "(botany) Various protruding plant structures, as a banana from its hand.",
                  "examples": []
                },
                {
                  "meaning": "(anatomy, obsolete) A lobe of the liver.",
                  "examples": []
                },
                {
                  "meaning": "(historical) The teeth parallel to the blade of a scythe, fitted to a wooden frame called a crade.",
                  "examples": []
                },
                {
                  "meaning": "The projections of a reaper or mower which similarly separate the stalks for cutting.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) Clipping of finger pier: a shorter, narrower pier projecting from a larger dock.",
                  "examples": []
                },
                {
                  "meaning": "(aviation) Synonym of jet bridge: the narrow elevated walkway connecting a plane to an airport.",
                  "examples": []
                },
                {
                  "meaning": "(computing theory) A leaf in a finger tree data structure.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something similar in function or agency to the human finger, (usually) with regard to touching, grasping, or pointing.",
              "entries": [
                {
                  "meaning": "(obsolete) Synonym of hand, the part of a clock pointing to the hour, minute, or second.",
                  "examples": []
                },
                {
                  "meaning": "(US, obsolete slang) A policeman or prison guard.",
                  "examples": []
                },
                {
                  "meaning": "(US, rare slang) An informer to the police, (especially) one who identifies a criminal during a lineup.",
                  "examples": []
                },
                {
                  "meaning": "(US, rare slang) A criminal who scouts for prospective victims and targets or who performs reconnaissance before a crime.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) That which points; an indicator, as of guilt, blame, or suspicion.",
                  "examples": [
                    "The finger of suspicion pointed clearly at the hotel manager."
                  ]
                }
              ]
            },
            {
              "group": "(units of measure) Various units of measure based or notionally based on the adult human finger, particularly",
              "entries": [
                {
                  "meaning": "(historical) Synonym of digit: former units of measure notionally based on its width but variously standardized, (especially) the English digit of 1⁄16 foot (about 1.9 cm).",
                  "examples": [
                    "a piece of steel three fingers thick"
                  ]
                },
                {
                  "meaning": "(historical) A unit of length notionally based on the length of an adult human's middle finger, standardized as 4½ inches (11.43 cm).",
                  "examples": []
                },
                {
                  "meaning": "(historical) Synonym of digit: 1⁄12 the observed diameter of the sun or moon, (especially) with regard to eclipses.",
                  "examples": []
                },
                {
                  "meaning": "(originally US) An informal measure of alcohol based on its height in a given glass compared to the width of the pourer's fingers while holding it.",
                  "examples": [
                    "Gimme three fingers of bourbon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion) A part of a glove intended to cover a finger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, obsolete) Skill in the use of the fingers, as in playing upon a musical instrument.",
                  "examples": [
                    "A performer capable of doing justice to rapid or expressive passages, is said to have a good finger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, rare) Someone skilled in the use of their fingers, (especially) a pickpocket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK slang) A person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially in the phrase 'give someone the finger') An obscene or insulting gesture made by raising one's middle finger towards someone with the palm of one's hand facing inwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(radio) Any of the individual receivers used in a rake receiver to decode signal components.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar) The act of fingering, inserting a finger into someone's vagina or rectum for sexual pleasure.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "finger (third-person singular simple present fingers, present participle fingering, simple past and past participle fingered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To identify or point out; to blame for something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To report to or identify for the authorities; to inform on.",
                  "examples": [
                    "Synonyms: put the finger on, rat on, rat out, squeal on, tattle on, turn in"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To poke, probe, feel, or fondle with a finger or fingers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use the fingers to penetrate and sexually stimulate one's own or another person's vagina or anus; to fingerbang.",
                  "examples": [
                    "She smiled, a look of amazement on her face, as if thinking that maybe this was the cock that she had been fantasizing about just now, as she fingered herself to a massive, body-engulfing orgasm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To use specified finger positions in producing notes on a musical instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To provide instructions in written music as to which fingers are to be used to produce particular notes or passages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To query (a user's status) using the Finger protocol.",
                  "examples": [
                    "PGP mail welcome (finger me for my key)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To steal; to purloin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To execute, as any delicate work.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}