{
  "word": "corner",
  "etymologies": [
    {
      "description": [
        "From Middle English corner, from Anglo-Norman cornere (compare Old French cornier, corniere (“corner”)), from Old French corne (“corner, angle”, literally “a horn, projecting point”), from Vulgar Latin *corna (“horn”), from Latin cornua, plural of cornū (“projecting point, end, horn”). The sense of \"angle, corner\" in Old French is not found in Latin or other Romance languages. It was possibly calqued from Frankish *hurnijā (“corner, angle”), which is similar to, and derived from *hurn, the Frankish word for \"horn\". Displaced native cognate Middle English hirn, herne, from Old English hyrne, from Proto-Germanic *hurnijǭ (“little horn, hook, angle, corner”), whence modern English hirn (“nook, corner”), itself related to horn."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "corner (plural corners)",
          "definitionGroups": [
            {
              "group": "The point where two converging lines meet; an angle, either external or internal.",
              "entries": [
                {
                  "meaning": "The space in the angle between converging lines or walls which meet in a point.",
                  "examples": [
                    "The chimney corner was full of cobwebs."
                  ]
                },
                {
                  "meaning": "The projection into space of an angle in a solid object.",
                  "examples": [
                    "Herbert bruised his shin on the corner of the coffee table."
                  ]
                },
                {
                  "meaning": "An intersection of two streets; any of the four outer points off the street at that intersection.",
                  "examples": [
                    "The liquor store on the corner also sold lottery tickets."
                  ]
                },
                {
                  "meaning": "(attributive) Denoting a premises that is in a convenient local location, notionally, but not necessarily literally, on the corner of two streets.",
                  "examples": [
                    "corner store, corner deli, corner newsagent"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An edge or extremity; the part farthest from the center; hence, any quarter or part, or the direction in which it lies.",
                  "examples": [
                    "Shining a light in the dark corners of the mind.  I took a trip out to his corner of town."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A secret or secluded place; a remote or out of the way place; a nook.",
                  "examples": [
                    "On weekends, Emily liked to find a quiet corner and curl up with a good book."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An embarrassing situation; a difficulty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, finance) A sufficient interest in a salable security or commodity to allow the cornering party to influence prices.",
                  "examples": [
                    "In the 1970s, private investors tried to get a corner on the silver market, but were ultimately unsuccessful."
                  ]
                }
              ]
            },
            {
              "group": "(heading) Relating to the playing field.",
              "entries": [
                {
                  "meaning": "(baseball) One of the four vertices of the strike zone.",
                  "examples": [
                    "The pitch was just off the corner, low and outside."
                  ]
                },
                {
                  "meaning": "(baseball) First base or third base.",
                  "examples": [
                    "There are runners on the corners with just one out."
                  ]
                },
                {
                  "meaning": "(soccer) A corner kick.",
                  "examples": []
                },
                {
                  "meaning": "(American football) A cornerback.",
                  "examples": []
                },
                {
                  "meaning": "(boxing) The corner of the ring, which is where the boxer rests before and during a fight.",
                  "examples": []
                },
                {
                  "meaning": "(boxing, by extension) The group of people who assist a boxer during a bout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where people meet for a particular purpose.",
                  "examples": [
                    "Welcome to our English corner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A point scored in a rubber at whist.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "corner (third-person singular simple present corners, present participle cornering, simple past and past participle cornered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive (someone or something) into a corner or other confined space.",
                  "examples": [
                    "The cat had cornered a cricket between the sofa and the television stand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To trap in a position of great difficulty or hopeless embarrassment.",
                  "examples": [
                    "The reporter cornered the politician by pointing out the hypocrisy of his position on mandatory sentencing, in light of the politician's own actions in court."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put (someone) in an awkward situation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, business, transitive) To get sufficient command of (a stock, commodity, etc.), so as to be able to manipulate its price.",
                  "examples": [
                    "The buyers attempted to corner the shares of the railroad stock, so as to facilitate their buyout.",
                    "It's extremely hard to corner the petroleum market because there are so many players."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive, transitive) To turn a corner or drive around a curve.",
                  "examples": [
                    "As the stock car driver cornered the last turn, he lost control and spun out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive, intransitive) To handle while moving around a corner in a road or otherwise turning.",
                  "examples": [
                    "That BMW corners well, but the suspension is too stiff."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To supply with corners.",
                  "examples": [
                    "Tool for cornering and cutting off copper switch blades"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}