{
  "word": "slope",
  "etymologies": [
    {
      "description": [
        "From aslope (adjective, adverb)."
      ],
      "adjectives": [
        {
          "description": "slope (comparative more slope, superlative most slope)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sloping.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "slope (comparative more slope, superlative most slope)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) slopingly",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "slope (countable and uncountable, plural slopes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area of ground that tends evenly upward or downward.",
                  "examples": [
                    "I had to climb a small slope to get to the site.",
                    "a steep slope"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The degree to which a surface tends upward or downward.",
                  "examples": [
                    "The road has a very sharp downward slope at that point."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The ratio of the vertical and horizontal distances between two points on a line; zero if the line is horizontal, undefined if it is vertical.",
                  "examples": [
                    "The slope of this line is 0.5"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The slope of the line tangent to a curve at a given point.",
                  "examples": [
                    "The slope of a parabola increases linearly with x."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The angle a roof surface makes with the horizontal, expressed as a ratio of the units of vertical rise to the units of horizontal length (sometimes referred to as run).",
                  "examples": [
                    "The slope of an asphalt shingle roof system should be 4:12 or greater."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, offensive, ethnic slur) A person of Chinese or other East Asian descent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slope (third-person singular simple present slopes, present participle sloping, simple past and past participle sloped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To tend steadily upward or downward.",
                  "examples": [
                    "The road slopes sharply down at that point."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form with a slope; to give an oblique or slanting direction to; to incline or slant.",
                  "examples": [
                    "to slope the ground in a garden;   to slope a piece of cloth in cutting a garment"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, usually followed by a preposition) To try to move surreptitiously.",
                  "examples": [
                    "I sloped in through the back door, hoping my boss wouldn't see me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) To hold a rifle at a slope with forearm perpendicular to the body in front holding the butt, the rifle resting on the shoulder.",
                  "examples": [
                    "The order was given to \"slope arms\"."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}