{
  "word": "allow",
  "etymologies": [
    {
      "description": [
        "From Middle English allowen, alowen, a borrowing from Anglo-Norman allouer, alouer, from Medieval Latin allaudāre, present active infinitive of allaudō, merged with alouer, from Medieval Latin allocō (“to assign”).",
        "The similarity with Middle English alyfen (from Old English ālīefan) and German erlauben, both from Proto-Germanic *uzlaubijaną (“to allow”) is coincidental."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "allow (third-person singular simple present allows, present participle allowing, simple past and past participle allowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grant, give, admit, accord, afford, or yield; to let one have.",
                  "examples": [
                    "to allow a servant his liberty;  to allow a free passage;  to allow one day for rest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To acknowledge; to accept as true; to concede; to accede to an opinion.",
                  "examples": [
                    "to allow a right;  to allow a claim; to allow an appeal  to allow the truth of a proposition"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grant (something) as a deduction or an addition; especially to abate or deduct.",
                  "examples": [
                    "To allow a sum for leakage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grant license to; to permit; to consent to.",
                  "examples": [
                    "To allow a son to be absent.",
                    "Smoking allowed only in designated areas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To not bar or obstruct.",
                  "examples": [
                    "Although I don't consent to their holding such meetings, I will allow them for the time being."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take into account by making an allowance.",
                  "examples": [
                    "When calculating a budget for a construction project, always allow for contingencies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To render physically possible.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To praise; to approve of; hence, to sanction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To sanction; to invest; to entrust.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To like; to be suited or pleased with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, transitive) To decide (a request) in favour of the party who raised it; to grant victory to a party regarding (a request).",
                  "examples": [
                    "To allow an objection, to find in favour of the objection and forbid the conduct objected to; to allow an appeal, to decide the appeal in favour of the appellant (contrast grant leave to appeal, to permit an appeal to be heard)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}