{
  "word": "homologous",
  "etymologies": [
    {
      "description": [
        "From Late Latin homologus, from Ancient Greek ὁμόλογος (homólogos, “agreeing, of one mind”), from ὁμός (homós, “same”) + λόγος (lógos, “reason, reckoning”). Compare homo- (“same”) and -ous (adjectival suffix). From 1655, in the mathematical sense. See also homolog, homologue."
      ],
      "adjectives": [
        {
          "description": "homologous (comparative more homologous, superlative most homologous)",
          "definitionGroups": [
            {
              "group": "Showing a degree of correspondence or similarity.",
              "entries": [
                {
                  "meaning": "(mathematics) In corresponding proportion.",
                  "examples": []
                },
                {
                  "meaning": "(biology) Corresponding to a similar structure in another life form with a common evolutionary origin.",
                  "examples": [
                    "Flippers and hands are homologous structures."
                  ]
                },
                {
                  "meaning": "(chemistry) Belonging to a series of aliphatic organic compounds that differ only by the addition of a CH₂ group.",
                  "examples": []
                },
                {
                  "meaning": "(genetics) Having the same morphology as another chromosome or locus; relating to a homologue.",
                  "examples": []
                },
                {
                  "meaning": "(cultural anthropology, structural anthropology) Playing the same role as seen in another culture, whether by historical connection, psychological archetype, convergent cultural evolution, or otherwise (as may be hypothesized but not known with certainty by current science), as for example with the cryptozoologic concepts of yeti and sasquatch, the use of polite and familiar pronouns, or other similarities.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}