{
  "word": "puddle",
  "etymologies": [
    {
      "description": [
        "From Middle English podel, diminutive of Old English pudd (“ditch”), from Proto-Germanic *puddaz (compare Low German Pudel (“puddle”), Middle High German podel (“quagmire, mudhole”), Hunsrik Puttel, dialectal German Pfudel (“puddle”), German pudeln (“to splash about”)), ultimately imitative."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "puddle (plural puddles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, often temporary, pool of water, usually on a path or road. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now dialectal) Stagnant or polluted water. [from 16th c.]",
                  "examples": [
                    "searching their habitations for water, we could fill but three barricoes, and that such puddle, that never till then we ever knew the want of good water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A homogeneous mixture of clay, water, and sometimes grit, used to line a canal or pond to make it watertight. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rowing) The ripple left by the withdrawal of an oar from the water.",
                  "examples": [
                    "I had only to see the 'puddle' to know that your paddle made it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "puddle (third-person singular simple present puddles, present participle puddling, simple past and past participle puddled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form a puddle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To play or splash in a puddle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Of butterflies, to congregate on a puddle or moist substance to pick up nutrients.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To process iron, gold, etc., by means of puddling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To line a canal with puddle (clay).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To collect ideas, especially abstract concepts, into rough subtopics or categories, as in study, research or conversation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make (clay, loam, etc.) dense or close, by working it when wet, so as to render impervious to water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make foul or muddy; to pollute with dirt; to mix dirt with (water).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}