{
  "word": "vernacular",
  "etymologies": [
    {
      "description": [
        "From Latin vernāculus (“domestic, indigenous, of or pertaining to home-born slaves”), from verna (“a native, a home-born slave (one born in his master's house)”)."
      ],
      "adjectives": [
        {
          "description": "vernacular (comparative more vernacular, superlative most vernacular)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to everyday language, as opposed to standard, literary, liturgical, or scientific idiom.",
                  "examples": [
                    "Synonyms: common, everyday, indigenous, ordinary, vulgar, colloquial"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Belonging to the country of one's birth; one's own by birth or nature.",
                  "examples": [
                    "Synonyms: native, indigenous",
                    "a vernacular disease"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) Of or related to local building materials and styles; not imported.",
                  "examples": [
                    "Synonym: folk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) Connected to a collective memory; not imported.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "vernacular (plural vernaculars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The language of a people or a national language.",
                  "examples": [
                    "Synonym: vulgate",
                    "Coordinate terms: lingua franca, link language, vehicular language",
                    "A vernacular of the United States is English."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Everyday speech or dialect, including colloquialisms, as opposed to standard, literary, liturgical, or scientific idiom.",
                  "examples": [
                    "Street vernacular can be quite different from what is heard elsewhere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Language unique to a particular group of people.",
                  "examples": [
                    "Synonyms: jargon, argot, dialect, slang",
                    "For those of a certain age, hiphop vernacular might just as well be a foreign language."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A language lacking standardization or a written form.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Indigenous spoken language, as distinct from a literary or liturgical language such as Ecclesiastical Latin.",
                  "examples": [
                    "Vatican II allowed the celebration of the mass in the vernacular."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A style of architecture involving local building materials and styles, not imported.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}