{
  "word": "ward",
  "etymologies": [
    {
      "description": [
        "From Middle English ward, from Old English weard (“keeper, watchman, guard, guardian, protector; lord, king; possessor”), from Proto-Germanic *warduz (“guard, keeper”), from Proto-Indo-European *wer- (“to heed, defend”). Cognate with German Wart."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ward (plural wards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or obsolete) A warden; a guard; a guardian or watchman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English ward, warde, from Old English weard (“watching, ward, protection, guardianship; advance post; waiting for, lurking, ambuscade”), from Proto-West Germanic *wardu, from Proto-Germanic *wardō (“protection, attention, keeping”), an extension of the stem *wara- (“attentive”) (English wary, beware), from Proto-Indo-European *wer- (“to cover”).",
        "Cognate with German Warte (“watchtower”), warten (“wait for”); English guard is a parallel form which came via Old French."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ward (countable and uncountable, plural wards)",
          "definitionGroups": [
            {
              "group": "Protection, defence.",
              "entries": [
                {
                  "meaning": "(obsolete) A guard or watchman; now replaced by warden.",
                  "examples": []
                },
                {
                  "meaning": "The action of a watchman; monitoring, surveillance (usually in phrases keep ward etc.)",
                  "examples": []
                },
                {
                  "meaning": "Guardianship, especially of a child or prisoner.",
                  "examples": [
                    "So forth the presoners were brought before Arthure, and he commaunded hem into kepyng of the conestabyls warde, surely to be kepte as noble presoners."
                  ]
                },
                {
                  "meaning": "An enchantment or spell placed over a designated area or social unit, that prevents any tresspasser from entering; approaching; or even being able to locate said protected premises or demographic.",
                  "examples": []
                },
                {
                  "meaning": "(historical, Scots law) Land tenure through military service.",
                  "examples": []
                },
                {
                  "meaning": "(fencing) A guarding or defensive motion or position.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A protected place, and by extension, a type of subdivision.",
              "entries": [
                {
                  "meaning": "An area of a castle, corresponding to a circuit of the walls.",
                  "examples": [
                    "Diocletian […] must certainly have derived some consolation from the grandeur of Aspalaton, the great arcaded wall it turned to the Adriatic, its four separate wards, each town size, and its seventeen watch-towers […]."
                  ]
                },
                {
                  "meaning": "A section or subdivision of a prison.",
                  "examples": []
                },
                {
                  "meaning": "An administrative division of a borough, city or council.",
                  "examples": [
                    "On our last visit to Tokyo, we went to Chiyoda ward and visited the Emperor's palace."
                  ]
                },
                {
                  "meaning": "(UK) A division of a forest.",
                  "examples": []
                },
                {
                  "meaning": "(Mormonism) A subdivision of the LDS Church, smaller than and part of a stake, but larger than a branch.",
                  "examples": []
                },
                {
                  "meaning": "A part of a hospital, with beds, where patients reside.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A person under guardianship.",
              "entries": [
                {
                  "meaning": "A minor looked after by a guardian.",
                  "examples": [
                    "After the trial, little Robert was declared a ward of the state."
                  ]
                },
                {
                  "meaning": "(obsolete) An underage orphan.",
                  "examples": []
                }
              ]
            },
            {
              "group": "An object used for guarding.",
              "entries": [
                {
                  "meaning": "The ridges on the inside of a lock, or the incisions on a key.",
                  "examples": [
                    "A man muſt thorowly ſound himſelfe, and dive into his heart, and there ſee by what wards or ſprings the motions ſtirre."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English warden, from Old English weardian (“to watch, guard, keep, protect, preserve; hold, possess, occupy, inhabit; rule, govern”), from Proto-West Germanic *wardēn, from Proto-Germanic *wardōną, *wardāną (“to guard”), from Proto-Indo-European *wer- (“to heed, defend”). Doublet of guard."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "ward (third-person singular simple present wards, present participle warding, simple past and past participle warded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep in safety, to watch over, to guard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To defend, to protect.",
                  "examples": [
                    "they went to ſeeke their owne death, and ruſhed amidſt the thickeſt of their enemies, with an intention, rather to ſtrike, than to ward themſelves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fend off, to repel, to turn aside, as anything mischievous that approaches (usually followed by off)",
                  "examples": [
                    "Now wards a felling blow, now strikes again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be vigilant; to keep guard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act on the defensive with a weapon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}