{
  "word": "revision",
  "etymologies": [
    {
      "description": [
        "Borrowed from French révision, from Latin revīsiō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "revision (countable and uncountable, plural revisions)",
          "definitionGroups": [
            {
              "group": "(uncountable) The process of revising:",
              "entries": [
                {
                  "meaning": "The action or process of reviewing, editing and amending.",
                  "examples": [
                    "Revision can turn a passable paper into an excellent one and change an excellent one into a radiant one."
                  ]
                },
                {
                  "meaning": "(UK, Australia, New Zealand) The action or process of reviewing something previously learned, especially one′s notes in preparation for a test or examination.",
                  "examples": [
                    "All that last minute revision really paid off in the exam! I got top marks!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A changed edition, or new version; a modification.",
                  "examples": [
                    "The first thing members need to understand about a revision is that the current bylaws are not under consideration at all. If the revision is defeated, no changes to the current bylaws take place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A story corrected or expanded by a writer commissioned by the original author.",
                  "examples": [
                    "A revision story"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From re- +‎ vision."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "revision (third-person singular simple present revisions, present participle revisioning, simple past and past participle revisioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To provide with a new vision.",
                  "examples": [
                    "What philosophy needs is to be revisioned with a more hopeful, engaged inspirational point of view."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}