{
  "word": "diaphragm",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek διάφραγμα (diáphragma, “partition”), from διά (diá, “across”) and φράγμα (phrágma, “barrier”), from the verb φράσσω (phrássō)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "diaphragm (plural diaphragms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) In mammals, a sheet of muscle separating the thorax from the abdomen, contracted and relaxed in respiration to draw air into and expel air from the lungs; also called thoracic diaphragm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Any of various membranes or sheets of muscle or ligament which separate one cavity from another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contraceptive device consisting of a flexible cup, used to cover the cervix during intercourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanics) A flexible membrane separating two chambers and fixed around its periphery that distends into one or other chamber as the difference in the pressure in the chambers varies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(acoustics) In a speaker, the thin, semi-rigid membrane which vibrates to produce sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(optics, photography) A thin opaque structure with a central aperture, used to limit the passage of light into a camera or similar device.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A permeable or semipermeable membrane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) A floor slab, metal wall panel, roof panel or the like, having a sufficiently large in-plane shear stiffness and sufficient strength to transmit horizontal forces to resisting systems.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "diaphragm (third-person singular simple present diaphragms, present participle diaphragming, simple past and past participle diaphragmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(optics, photography) To reduce lens aperture using an optical diaphragm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act as a diaphragm, for example by vibrating.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}