{
  "word": "grope",
  "etymologies": [
    {
      "description": [
        "From Middle English gropien, from Old English grāpian, related to grīpan (whence English gripe); compare also grip."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grope (plural gropes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An act of groping, especially sexually.",
                  "examples": [
                    "The old man tried to get a quick grope of the young lady on the train."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An iron fitting of a medieval cart wheel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grope (third-person singular simple present gropes, present participle groping, simple past and past participle groped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To feel with or use the hands; to handle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To search or attempt to find something in the dark, or, as a blind person, by feeling; to move about hesitatingly, as in darkness or obscurity; to feel one's way, as with the hands, when one can not see.",
                  "examples": [
                    "to grope about a little longer among the miseries and sensualities of a worldly life"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To touch (another person) closely and (especially) sexually.",
                  "examples": [
                    "The parents found the couple kissing and groping."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To intentionally and inappropriately touch or rub against another person, in such a manner as to make the contact appear accidental, for the purpose of one's sexual gratification.",
                  "examples": [
                    "That old man groped that girl on the train!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To examine; to test; to sound.",
                  "examples": [
                    "Felix gropeth him, thinking to have a bribe."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}