{
  "word": "decant",
  "etymologies": [
    {
      "description": [
        "From French décanter, from Medieval Latin dēcanthāre, from dē- +‎ canthus (“beak of a cup or jug”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "decant (third-person singular simple present decants, present participle decanting, simple past and past participle decanted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pour off (a liquid) gently, so as not to disturb the sediment.",
                  "examples": [
                    "After washing, the insoluble lime soap is decomposed with hot dilute sulphuric acid. The melted fatty acids thus rise as an oil to the surface, when they are decanted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pour from one vessel into another.",
                  "examples": [
                    "to decant wine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, intransitive) To flow.",
                  "examples": [
                    "Swincombe, formerly Swan-combe, runs to the north of the ridge, and has the sources of its river in the Fox Tor mires and near Childe's Tomb. It runs north-east, and then abruptly passes north to decant into the West Dart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(science fiction) To remove (a clone or other artificially-gestated baby) from its chamber, vat, or artificial womb.",
                  "examples": [
                    "“We also predestine and condition. We decant our babies as socialized human beings, as Alphas or Epsilons, as future sewage workers or future …” He was going to say “future World controllers,” but correcting himself, said “future Directors of Hatcheries,” instead."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To rehouse people while their buildings are being refurbished or rebuilt.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}