{
  "word": "pretender",
  "etymologies": [
    {
      "description": [
        "pretend +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pretender (plural pretenders)",
          "definitionGroups": [
            {
              "group": "One who pretends.",
              "entries": [
                {
                  "meaning": "(obsolete, rare) One who intends or purposes.",
                  "examples": []
                },
                {
                  "meaning": "One who puts forth a claim, or who aspires to or aims at something; a claimant, candidate, or aspirant; now, one who makes baseless pretensions.",
                  "examples": [
                    "I Think it necessary to acquaint you, that I have received Advices this Morning from Ostend, that the French Fleet sailed from Dunkirk, Tuesday at three in the Morning, Northward, with the Pretender on board; as also, that Sir George Byng had notice of it the same Day at ten: And he being very much superior to the Enemy both in Number and Strength, I make no question, but, by God’s Blessing, he will soon be able to give a good Account of them."
                  ]
                },
                {
                  "meaning": "(obsolete) One who aspires to the hand of a woman in marriage; a suitor, a wooer.",
                  "examples": []
                },
                {
                  "meaning": "A claimant to a throne or the office of a ruler; orig. in a neutral sense, but now always applied to a claimant who is held to have no just title.",
                  "examples": [
                    "I Think it necessary to acquaint you, that I have received Advices this Morning from Ostend, that the French Fleet sailed from Dunkirk, Tuesday at three in the Morning, Northward, with the Pretender on board; as also, that Sir George Byng had notice of it the same Day at ten: And he being very much superior to the Enemy both in Number and Strength, I make no question, but, by God’s Blessing, he will soon be able to give a good Account of them."
                  ]
                },
                {
                  "meaning": "One who pretends or lays claim to something; one who makes a profession, show, or assertion, esp. without adequate grounds, falsely, or with intent to deceive; a dissembler, deceiver, charlatan, hypocrite.",
                  "examples": []
                },
                {
                  "meaning": "A person who professes beliefs and opinions that they do not hold.",
                  "examples": [
                    "Synonyms: dissembler, flip-flopper, hypocrite, phony; see also Thesaurus:deceiver"
                  ]
                },
                {
                  "meaning": "A claimant to an abolished or already occupied throne.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}