{
  "word": "information",
  "etymologies": [
    {
      "description": [
        "From Middle English informacion, enformacion, borrowed from Anglo-Norman informacioun, enformation, Old French information, from Latin īnfōrmātiō (“formation, conception; education”), from the participle stem of īnformāre (“to inform”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "information (usually uncountable, plural informations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which resolves uncertainty; anything that answers the question of \"what a given entity is\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Things that are or can be known about a given topic; communicable knowledge of something. [from 14th c.]",
                  "examples": [
                    "I need some more information about this issue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of informing or imparting knowledge; notification. [from 14th c.]",
                  "examples": [
                    "For your information, I did this because I wanted to."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, countable) A statement of criminal activity brought before a judge or magistrate; in the UK, used to inform a magistrate of an offence and request a warrant; in the US, an accusation brought before a judge without a grand jury indictment. [from 15th c.]",
                  "examples": [
                    "On May 21, 1792, the Attorney General filed an information against Paine charging him with seditious libel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of informing against someone, passing on incriminating knowledge; accusation. [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The systematic imparting of knowledge; education, training. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The creation of form; the imparting of a given quality or characteristic; forming, animation. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, formally) […] the meaning that a human assigns to data by means of the known conventions used in its representation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) Divine inspiration. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A service provided by telephone which provides listed telephone numbers of a subscriber. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(information theory) Any unambiguous abstract data, the smallest possible unit being the bit. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "As contrasted with data, information is processed to extract relevant data. [from late 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(information technology) Any ordered sequence of symbols (or signals) (that could contain a message). [from late 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}