{
  "word": "agglomerate",
  "etymologies": [
    {
      "description": [
        "From Latin agglomerare (“to wind into a ball”), from ad (“to”) + glomerare (“to wind into a ball”), from glomus (“a ball”), akin to globus (“a ball”)."
      ],
      "adjectives": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "agglomerate (comparative more agglomerate, superlative most agglomerate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "collected into a ball, heap, or mass",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "agglomerate (plural agglomerates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A collection or mass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology, volcanology) A mass of angular volcanic fragments united by heat; distinguished from conglomerate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) An ice cover of floe formed by the freezing together of various forms of ice.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "agglomerate (third-person singular simple present agglomerates, present participle agglomerating, simple past and past participle agglomerated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To wind or collect into a ball; hence, to gather into a mass or anything like a mass.",
                  "examples": [
                    "The bustle of a croud is not ill-adapted to the pencil: but the management of it requires great artifice. The whole must be massed together, and considered as one body. ¶ I mean not to have the whole body so agglomerated, as to consist of no detached groups: but to have these groups  […]  appear to belong to one whole, by the artifice of composition, and the effect of light."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}