{
  "word": "kennel",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman kenil, from Old Northern French [Term?], variant of Old French chenil (whence modern French chenil), from Vulgar Latin *canile, ultimately from Latin canis (“dog”), hence from Latin canēs, from Proto-Italic *kō, from Proto-Indo-European *ḱwṓ."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kennel (plural kennels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A house or shelter for a dog.",
                  "examples": [
                    "Synonym: (US) doghouse",
                    "– We want to look at the dog kennels.– That's the pet department, second floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A facility at which dogs are reared or boarded.",
                  "examples": [
                    "Synonyms: pound, shelter",
                    "The town dog-catcher operates the kennel for strays.",
                    "She raises registered Dalmatians at her kennel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, collective) The dogs kept at such a facility; a pack of hounds.",
                  "examples": [
                    "Synonym: pack"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The hole of a fox or other animal.",
                  "examples": [
                    "Synonyms: burrow, den"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "kennel (third-person singular simple present kennels, present participle kenneling or kennelling, simple past and past participle kenneled or kennelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To house or board a dog (or less commonly another animal).",
                  "examples": [
                    "While we're away our friends will kennel our pet poodle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lie or lodge; to dwell, as a dog or a fox.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive (a fox) to covert in its hole.",
                  "examples": [
                    "This is the time that the horseman are flung out, not having the cry to lead them to the death. When quadruped animals of the venery or hunting kind are at rest, the stag is said to be harboured, the buck lodged, the fox kennelled, the badger earthed, the otter vented or watched, the hare formed, and the rabbit set."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English canel, from Old French canel, from Latin canālis (“channel; canal”), from Latin canna (“reed, cane”), from Ancient Greek κάννα (kánna, “reed”), from Akkadian 𒄀 (qanû, “reed”), from Sumerian 𒄀𒈾 (gi.na). Cognate with English channel, canal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kennel (plural kennels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The gutter at the edge of a street; a surface drain.",
                  "examples": [
                    "\"Soon shall the Kennels swell with rapid Streams, / And rush in muddy Torrents to the Thames.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A puddle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}