{
  "word": "racialism",
  "etymologies": [
    {
      "description": [
        "racial +‎ -ism. Coined in 1882 based on the older use of \"race\" as a synonym of \"nation, tribe, ethnic group\", later senses (from 1890) from the use of \"race\" for racial categories."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "racialism (countable and uncountable, plural racialisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dated) Tribalism, nationalism.",
                  "examples": [
                    "The modern dogma of nationalism, as maintained by a class of theoretic politicians (and which might more properly be called racialism [italics in original] — leaving nationalism to denote the recent modified application of socialism in pol. econ.)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The belief that humans can be categorized as belonging to distinct races, each race being characterized by fixed and heritable traits.",
                  "examples": [
                    "Never mentioning Delany by name, Vashon lambastes the “combatants” for their racialism, insisting that a belief in “a natural distinction between the white and colored races” only legitimates the racism of blacks’ oppressors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Racism, belief in different races and that some are superior; policies or practices promoting the dominance of one or more races over others.",
                  "examples": [
                    "This is The Lie of North American Superiority — an assumption based mainly on  our superior living standard.  […]  This Lie of Superiority, this ill-disguised racialism in us who are always denouncing racialism in other people, is more  than an unpleasant breach of good manners. It has deep and evil effects upon the affairs of the world."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}