{
  "word": "daddy",
  "etymologies": [
    {
      "description": [
        "From dad +‎ -y."
      ],
      "adjectives": [
        {
          "description": "daddy (comparative daddier, superlative daddiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncommon) Resembling or characteristic of a dad.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "daddy (plural daddies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually childish) Father.",
                  "examples": [
                    "Synonyms: dad, dada, papa, pop; see also Thesaurus:father"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, with article) A perfect example, a role model.",
                  "examples": [
                    "Synonyms: see Thesaurus:exemplar",
                    "the daddy of them all"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, in early use chiefly African-American English) A male lover.",
                  "examples": [
                    "zack zettik is an example of my daddy",
                    "Her eyes lit up like they were on fire",
                    "She said, \"My name's Flo, and you're on the right track,",
                    "But look here, daddy, I wear furs on my back,",
                    "So if you want to have fun in this man's land,",
                    "Let Lincoln and Jackson start shaking hands.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated slang) An informal term of address for a man.",
                  "examples": [
                    "Rock 'n' roll is cool, daddy, and you know it!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM, sexual slang) A dominant male partner, often used as an address.",
                  "examples": [
                    "The guy I've been dating offered to do bondage with me, and I was like \"Yes please, daddy.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A male juvenile delinquent in a reformatory who dominates the other inmates through threats and violence.",
                  "examples": [
                    "However, what is of interest is that it is clear that the staff have to use the prisoners to run the borstal and thus do not object to, or try to control the inmate subculture that produces 'daddies', violence, sexual assault and racism,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "daddy (third-person singular simple present daddies, present participle daddying, simple past and past participle daddied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly Appalachia) To father; to sire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}