{
  "word": "favourite",
  "etymologies": [
    {
      "description": [
        "Attested from the 1580s, borrowed from Middle French favorit, from Old French favorit or Italian favorito (“favoured, favourite”), past participle of Italian favorire (“to favor”), from favore, from Latin favor (“good will, favor”), from the verb faveō (“I favour”), ultimately from Proto-Indo-European *bʰeh₂weh₁yeti (“to be favourable to”), from the root Proto-Indo-European *bʰeh₂- (“to shine, glow light”). Doublet of favor and favori."
      ],
      "adjectives": [
        {
          "description": "favourite (Britain, Canada, Australia, Ireland, New Zealand, Malta, South Africa)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Preferred or liked above all others (unless qualified).",
                  "examples": [
                    "This is my second favourite occupation.",
                    "Antonyms: least favorite, unfavourite, unfavorite"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Belonging to a category whose members are all preferred or liked over nonmembers.",
                  "examples": [
                    "I just saw a movie with all my favourite actors in it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "favourite (plural favourites) (Britain, Canada, Australia, Ireland, New Zealand, Malta, South Africa)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing who enjoys special regard or favour.",
                  "examples": [
                    "The teacher's favourite always went first.",
                    "Antonyms: unfavourite, unfavorite"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is preferred or trusted above all others.",
                  "examples": [
                    "Synonym: top dog (most preferred)",
                    "Synonym: darling (most loved)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contestant or competitor thought most likely to win.",
                  "examples": [
                    "You were my favourite to win the spelling competition.",
                    "She's the favourite, she'll probably be elected."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A bookmark in a web browser.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A short curl dangling over the temples, fashionable in the reign of Charles II.",
                  "examples": [
                    "the Favourites hang loose upon the Temples with a languishing Lock in the middle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "favourite (third-person singular simple present favourites, present participle favouriting, simple past and past participle favourited) (Britain, Canada, Australia, Ireland, New Zealand, Malta, South Africa)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To favour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) To bookmark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) To add to one's list of favourite items on a website that allows users to compile such lists.",
                  "examples": [
                    "Antonyms: unfavourite, unfavorite"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}