{
  "word": "speed",
  "etymologies": [
    {
      "description": [
        "From Middle English spede (“prosperity, good luck, quickness, success”), from Old English spēd (“success”), from Proto-West Germanic *spōdi (“prosperity, success”), from Proto-West Germanic *spōan, from Proto-Germanic *spōaną (“to prosper, succeed, be happy”), from Proto-Indo-European *speh₁- (“to prosper, turn out well”). Cognate with Scots spede, speid (“success, quickness, speed”), Dutch spoed (“haste; speed”), German Low German Spood (“haste; speed; eagerness; success”), German Sput (“progress, acceleration, haste”). Related also to Old English spōwan (“to be successful, succeed”), Albanian shpejt (“to speed, to hurry”) and Russian спеши́ть (spešítʹ, “to hurry”), Latin spēs (“hope, expectation”), spērō (“hope”, verb), perhaps also to Ancient Greek σπεύδω (speúdō, “to urge on, hasten, press on”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "speed (countable and uncountable, plural speeds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of moving quickly or the capacity for rapid motion.",
                  "examples": [
                    "Synonyms: celerity, rapidity, velocity; see also Thesaurus:speed",
                    "How does Usain Bolt run at that speed?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, physics) The rate of motion or action, specifically  the magnitude of the velocity; the rate distance is traversed in a given time.",
                  "examples": [
                    "Hyponyms: lightspeed, speed of light, speed of sound",
                    "Speed limits provide information to the drivers about the safe speed to travel in average conditions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) The sensitivity to light of film, plates or sensor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) The duration of exposure, the time during which a camera shutter is open (shutter speed).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) The largest size of the lens opening at which a lens can be used.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) The ratio of the focal length to the diameter of a photographic objective.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Amphetamine or any amphetamine-based drug (especially methamphetamine) used as a stimulant, especially illegally.",
                  "examples": [
                    "Synonyms: see Thesaurus:methamphetamine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Luck, success, prosperity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Personal preference.",
                  "examples": [
                    "We could go to the shore next week, or somewhere else if that's not your speed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, uncountable) A third-order measure of derivative price sensitivity, expressed as the rate of change of gamma with respect to changes in the underlying asset price.",
                  "examples": [
                    "Synonyms: DgammaDspot, gamma of the gamma",
                    "Hypernym: Greeks"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English speden, from Old English spēdan (“to speed, prosper, succeed, have success”), from Proto-West Germanic *spōdijan (“to succeed”). Cognate with Scots spede, speid (“to meet with success, assist, promote, accomplish, speed”), Dutch spoeden (“to hurry, rush”), Low German spoden, spöden (“to hasten, speed”), German sputen, spuden (“to speed”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "speed (third-person singular simple present speeds, present participle speeding, simple past and past participle sped or (mostly UK) speeded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To succeed; to prosper, be lucky.",
                  "examples": [
                    "At night returning, every labor sped, / He sits him down the monarch of a shed: / Smiles by his cheerful fire, and round surveys, / His children’s looks, that brighten at the blaze;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To help someone, to give them fortune; to aid or favour.",
                  "examples": [
                    "God speed, until we meet again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go fast.",
                  "examples": [
                    "The Ferrari was speeding along the road."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To exceed the speed limit.",
                  "examples": [
                    "Why do you speed when the road is so icy?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To increase the rate at which something occurs.",
                  "examples": [
                    "It is possible that the uterine contractions speed the sperm along."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To be under the influence of stimulant drugs, especially amphetamines.",
                  "examples": [
                    "If Hector had not been speeding, it was possible that his next thought would have hurt: he loves his uncle unconditionally, in a way he will never love me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be expedient.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To hurry to destruction; to put an end to; to ruin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To wish success or good fortune to, in any undertaking, especially in setting out upon a journey.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause to make haste; to dispatch with celerity; to drive at full speed; hence, to hasten; to hurry.",
                  "examples": [
                    "He sped him thence, home to his habitation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hasten to a conclusion; to expedite.",
                  "examples": [
                    "Judicial acts […] are sped in open court at the instance of one or both of the parties."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}