{
  "word": "sea",
  "etymologies": [
    {
      "description": [
        "From Middle English see, from Old English sǣ (“sea”), from Proto-West Germanic *saiwi, from Proto-Germanic *saiwiz (compare West Frisian see, Dutch zee, German See, Danish sø, Norwegian Bokmål sjø, Swedish sjö), probably either from Proto-Indo-European *sh₂ey-wo- (“to be fierce, afflict”) (compare Latin saevus (“wild, fierce”), Tocharian B saiwe (“itch”), Latvian sievs, sīvs (“sharp, biting”); more at sore) or derived from *sīhwaną (“to percolate, filter”), in which case *saiwiz is from earlier *saigwiz, Pre-Germanic *soykʷ-ís."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sea (plural seas)",
          "definitionGroups": [
            {
              "group": "A large body of salt water.",
              "entries": [
                {
                  "meaning": "The ocean; the continuous body of salt water covering a majority of the Earth's surface.",
                  "examples": []
                },
                {
                  "meaning": "A body of salt water smaller than an ocean, generally forming part of, or connecting with, an ocean or a larger sea.",
                  "examples": [
                    "The Mediterranean Sea, the Caribbean Sea, the Sea of Crete, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lake, especially if large or if salty or brackish.",
                  "examples": [
                    "The Caspian Sea, the Sea of Galilee, the Salton Sea, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The swell of the sea; a single wave; billow.",
                  "examples": [
                    "High pressure will maintain light winds and flat seas through Tue night. ... Potential for briefly choppy 3 ft seas near South Coast..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive, in combination) Living or used in or on the sea; of, near, or like the sea.",
                  "examples": [
                    "Seaman, sea gauge, sea monster, sea horse, sea level, seaworthy, seaport, seaboard, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Anything resembling the vastness or turbulence of the sea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A constant flux of gluons splitting into quarks, which annihilate to produce further gluons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(planetology) A large, dark plain of rock; a mare.",
                  "examples": [
                    "The Apollo 11 mission landed in the Sea of Tranquility."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(planetology) A very large lake of liquid hydrocarbon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}