{
  "word": "slave",
  "etymologies": [
    {
      "description": [
        "From Middle English sclave, from Old French sclave, from Medieval Latin sclāvus (“slave”), from Late Latin Sclāvus (“Slav”), because Slavs were often forced into slavery in the Middle Ages. The Latin word is from Byzantine Greek Σκλάβος (Sklábos), see that entry and Slav for more. Displaced native Old English þēow. Thrall and bondsman/bondswoman, however, remain common synonyms.",
        "An alternative hypothesis derives sclāvus from Ancient Greek σκῡλεύω (skūleúō), σκῡλάω (skūláō, “to strip or despoil a slain enemy”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slave (plural slaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is held in servitude as the property of another person, and whose labor (and often also whose body and life) is subject to the owner's volition and control.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A drudge; one who labors or is obliged (e.g. by prior contract) to labor like a slave with limited rights, e.g. an indentured servant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An abject person.",
                  "examples": [
                    "Synonym: wretch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) One who has no power of resistance (to something), one who surrenders to or is under the domination (of something).",
                  "examples": [
                    "a slave to passion, to strong drink, or to ambition"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM) A submissive partner in a BDSM relationship who (consensually) submits to (sexually and/or personally) serving one or more masters or mistresses.",
                  "examples": [
                    "Hypernym: sub"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sex slave, a person who is forced against their will to perform, for another person or group, sexual acts on a regular or continuing basis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering, computing, photography) A device (such as a secondary flash or hard drive) that is subject to the control of another (a master).",
                  "examples": [
                    "Synonyms: secondary, worker",
                    "Antonyms: master, primary"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slave (third-person singular simple present slaves, present participle slaving, simple past and past participle slaved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To work as a slaver, to enslave people.",
                  "examples": [
                    "MASSINISSA: Wilt thou be slaved? SOPHONISBA: No, free"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To work hard.",
                  "examples": [
                    "I was slaving all day over a hot stove."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place a device under the control of another.",
                  "examples": [
                    "to slave a hard disk"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}