{
  "word": "braid",
  "etymologies": [
    {
      "description": [
        "From Middle English braiden, breiden, bræiden, from Old English breġdan (“to move quickly, pull, shake, swing, throw (wrestling), draw (sword), drag; bend, weave, braid, knit, join together; change color, vary, be transformed; bind, knot; move, be pulled; flash”), from Proto-West Germanic *bregdan, from Proto-Germanic *bregdaną (“to flicker, flutter, jerk, tug, twitch, flinch, move, swing”), from Proto-Indo-European *bʰrēḱ-, *bʰrēǵ- (“to shine, shimmer”).",
        "Cognate with Scots Scots brade, Scots braid (“to move quickly or suddenly”), Saterland Frisian braidje (“to knit”), West Frisian breidzje, Dutch breien (“to knit”), Low German breiden, German breiden, Bavarian bretten (“to move quickly, twitch”), Icelandic bregða (“to move quickly, jerk”), Faroese bregða (“to move quickly, react swiftly; to draw (sword)”) and Faroese bregda (“to plaid, braid, twist, twine”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "braid (plural braids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A sudden movement; a jerk, a wrench. [11th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A weave of three or more strands of fibers, ribbons, cords or hair often for decoration. [from 16th c.]",
                  "examples": [
                    "The physician should evaluate for a history of tight ponytails, buns, chignons, braids, twists, weaves, cornrows, dreadlocks, sisterlocks, and hair wefts in addition to the usage of religious hair coverings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stranded wire composed of a number of smaller wires twisted together",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tubular sheath made of braided strands of metal placed around a central cable for shielding against electromagnetic interference.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A caprice or outburst of passion or anger.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "braid (third-person singular simple present braids, present participle braiding, simple past and past participle braided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To make a sudden movement with, to jerk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, intransitive) To start into motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To weave together, intertwine (strands of fibers, ribbons, etc.); to arrange (hair) in braids.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mix, or make uniformly soft, by beating, rubbing, or straining, as in preparing food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To reproach; to upbraid.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [
        {
          "description": "braid (comparative more braid, superlative most braid)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Deceitful.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}