{
  "word": "languor",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English langore, langour (“disease, illness; misery, sadness; suffering; condition or event causing sadness, suffering, etc.; unwholesomeness; idleness, inertia; depression, self-disgust; expression of grief”) [and other forms], from Middle French languer, langueur, langour, and Anglo-Norman langor, langour, langur, Old French langueur, languour (“disease, illness; suffering; emotional fatigue, sadness; listlessness; stagnation”) (modern French langueur (“languor”)), and from their etymon Latin languor (“faintness, feebleness; languor; apathy”), from languēre, the present active infinitive of langueō (“to feel faint or weak; (figurative) to be idle, inactive; to be listless”), ultimately from Proto-Indo-European *(s)leg-, *(s)leh₁g-. The English word is cognate with Catalan llangor, Italian languore (“faintness, weakness; languor”), langore (obsolete), Old Occitan langor (modern Occitan langor), Portuguese langor, languor (obsolete), Spanish langor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "languor (countable and uncountable, plural languors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A state of the body or mind caused by exhaustion or disease and characterized by a languid or weary feeling; lassitude; (countable) an instance of this.",
                  "examples": [
                    "Synonym: torpor",
                    "languor of convalescence"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Melancholy caused by lovesickness, sadness, etc.; (countable) an instance of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Dullness, sluggishness; lack of vigour; stagnation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Listless indolence or inactivity, especially if enjoyable or relaxing; dreaminess; (countable) an instance of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Heavy humidity and stillness of the air.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Sorrow; suffering; also, enfeebling disease or illness; (countable, obsolete) an instance of this.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Middle English langouren (“to be ill; to languish, suffer; to cause to suffer”) [and other forms], from Anglo-Norman langurer and Middle French langorer, langorir, langourer (“to languish; to be languorous”), from Old French languerer, from langueur (“disease, illness; suffering; emotional fatigue, sadness; listlessness; stagnation”); see further at etymology 1 above. Later uses of the verb have been influenced by the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "languor (third-person singular simple present languors, present participle languoring, simple past and past participle languored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To languish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}