{
  "word": "underwrite",
  "etymologies": [
    {
      "description": [
        "From Middle English underwriten, from Old English underwrītan (“to write at the foot of, write under, subscribe”), equivalent to under- +‎ write. Compare Dutch onderschrijven (“to endorse”), German unterschreiben (“to sign; endorse”), Danish underskrive (“to sign; endorse”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "underwrite (third-person singular simple present underwrites, present participle underwriting, simple past underwrote, past participle underwritten)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To write below or under; subscribe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete) To subscribe (a document, policy etc.) with one's name.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sign; to put one's name to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To agree to pay by signing one's name; subscribe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Specifically, to assume financial responsibility for something, and guarantee it against failure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, insurance) To act as an underwriter.",
                  "examples": [
                    "The broker who procures the insurance  […] ought not, by underwriting the policy, to deprive the parties of his unbiased testimony."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To support, lend support to, guarantee the basis of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To submit to; put up with.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}