{
  "word": "incident",
  "etymologies": [
    {
      "description": [
        "Recorded since 1412, from Middle French incident, from Latin incidens, the present active participle of incidō (“to happen, befall”), itself from in- (“on”) + -cidō, the combining form of cadō (“to fall”)."
      ],
      "adjectives": [
        {
          "description": "incident (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Arising as the result of an event, inherent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, of a stream of particles or radiation) Falling on or striking a surface.",
                  "examples": [
                    "The incident light illuminated the surface."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Coming or happening accidentally; not in the usual course of things; not in connection with the main design; not according to expectation; casual; fortuitous.",
                  "examples": [
                    "As the ordinary course of common affairs is disposed of by general laws, so likewise men's rarer incident necessities and utilities should be with special equity considered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Liable to happen; apt to occur; befalling; hence, naturally happening or appertaining.",
                  "examples": [
                    "the studies incident to his profession"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Dependent upon, or appertaining to, another thing, called the principal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "incident (plural incidents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) An event or occurrence.",
                  "examples": [
                    "She could not recall the time of the incident.",
                    "It was an incident that he hoped to forget.",
                    "The suspect was released without further incident."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A (relatively minor) event that is incidental to, or related to others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An event that causes or may cause an interruption or a crisis, such as a workplace illness or a software error.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}