{
  "word": "hazard",
  "etymologies": [
    {
      "description": [
        "From Middle English hasard, from Old French hasart (“a game of dice”) (noun), hasarder (verb), from Arabic اَلزَّهْر‎ (az-zahr, “the dice”). Compare Spanish azar, Portuguese azar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hazard (countable and uncountable, plural hazards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The chance of suffering harm; danger, peril, risk of loss. [from 16th c.]",
                  "examples": [
                    "He encountered the enemy at the hazard of his reputation and life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An obstacle or other feature which causes risk or danger; originally in sports, and now applied more generally. [from 19th c.]",
                  "examples": [
                    "The video game involves guiding a character on a skateboard past all kinds of hazards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in driving a vehicle) An obstacle or other feature that presents a risk or danger that justifies the driver in taking action to avoid it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A sand or water obstacle on a golf course.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards) The act of potting a ball, whether the object ball (winning hazard) or the player's ball (losing hazard).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A game of chance played with dice, usually for monetary stakes; popular mainly from 14th c. to 19th c.",
                  "examples": [
                    "[T]here's Harry diets himself—for gaming and is now under a hazard Regimen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chance. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Anything that is hazarded or risked, such as a stake in gambling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis) The side of the court into which the ball is served.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) A problem with the instruction pipeline in CPU microarchitectures when the next instruction cannot execute in the following clock cycle, potentially leading to incorrect results.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hazard (third-person singular simple present hazards, present participle hazarding, simple past and past participle hazarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To expose to chance; to take a risk.",
                  "examples": [
                    "to be consistent, you ought to be a Chriſtian in temper and practice; for you hazard nothing by a course of evangelical obedience"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To risk (something); to venture, incur, or bring on.",
                  "examples": [
                    "I'll hazard a guess."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}