{
  "word": "express",
  "etymologies": [
    {
      "description": [
        "From French exprès, from Latin expressus, past participle of exprimere (see Etymology 2, below)."
      ],
      "adjectives": [
        {
          "description": "express (comparative more express, superlative most express)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Moving or operating quickly, as a train not making local stops.",
                  "examples": [
                    "Synonyms: fast, crack"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Specific or precise; directly and distinctly stated; not merely implied.",
                  "examples": [
                    "Synonyms: explicit, plain; see also Thesaurus:explicit",
                    "Antonym: implied",
                    "I gave him express instructions not to begin until I arrived, but he ignored me.",
                    "This book cannot be copied without the express permission of the publisher."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Truly depicted; exactly resembling.",
                  "examples": [
                    "In my eyes it bore a livelier image of the spirit, it seemed more express and single, than the imperfect and divided countenance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(postpositive, retail) Providing a more limited but presumably faster service than a full or complete dealer of the same kind or type.",
                  "examples": [
                    "Pizza Hut Express",
                    "McDonald's Express"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "express",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moving or operating quickly, as a train not making local stops.",
                  "examples": [
                    "The train runs express to 96 St."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "express (plural expresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mode of transportation, often a train, that travels quickly or directly.",
                  "examples": [
                    "Antonyms: local, stopper",
                    "I took the express into town."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A service that allows mail or money to be sent rapidly from one destination to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An express rifle.",
                  "examples": [
                    "\"Give me my express,\" I said, laying down the Winchester, and he handed it to me cocked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A clear image or representation; an expression; a plain declaration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A messenger sent on a special errand; a courier.",
                  "examples": [
                    "I learned, to my inexpressible terror, that at two o'clock, the day before, an express had been sent to Geraldine by Mr Bergasse, with a letter, which he had received from the Hotel de Romagnecourt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An express office.",
                  "examples": [
                    "She charged him  […]  to ask at the express if anything came up from town."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is sent by an express messenger or message.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old French espresser, expresser, from frequentative form of Latin exprimere."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "express (plural expresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The action of conveying some idea using words or actions; communication, expression.",
                  "examples": [
                    "Whereby they discoursed in silence, and were intuitively understood from the theory of their expresses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A specific statement or instruction.",
                  "examples": [
                    "This Gentleman [...] caused a man to go down no less than a hundred fathom, with express to take notice whether it were hard or soft in the place where it groweth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "express (third-person singular simple present expresses, present participle expressing, simple past and past participle expressed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey or communicate; to make known or explicit.",
                  "examples": [
                    "Words cannot express the love I feel for him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To press, squeeze out (especially said of milk).",
                  "examples": [
                    "It contained many cysts which were filled with sagolike granules that could be expressed under pressure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biochemistry) To translate messenger RNA into protein.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biochemistry) To transcribe deoxyribonucleic acid into messenger RNA.",
                  "examples": [
                    "When a cell “expresses” a gene, it translates the DNA first into a signature messenger RNA (mRNA) sequence and subsequently into a chain of amino acids that forms a protein."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}