{
  "word": "glass",
  "etymologies": [
    {
      "description": [
        "From Middle English glas, from Old English glæs, from Proto-Germanic *glasą, possibly related to Proto-Germanic *glōaną (“to shine”) (compare glow), and ultimately from the Proto-Indo-European root *ǵʰel- (“to shine, shimmer, glow”). Cognate with West Frisian glês, Dutch glas, Low German Glas, German Glas, Swedish glas, Icelandic gler."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "glass (countable and uncountable, plural glasses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually uncountable) An amorphous solid, often transparent substance, usually made by melting silica sand with various additives (for most purposes, a mixture of soda, potash and lime is added).",
                  "examples": [
                    "The tabletop is made of glass.",
                    "A popular myth is that window glass is actually an extremely viscous liquid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, by extension) Any amorphous solid (one without a regular crystal lattice).",
                  "examples": [
                    "Metal glasses, unlike those based on silica, are electrically conductive, which can be either an advantage or a disadvantage, depending on the application."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A vessel from which one drinks, especially one made of glass, plastic, or similar translucent or semi-translucent material.",
                  "examples": [
                    "Fill my glass with milk, please."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metonymically) The quantity of liquid contained in such a vessel.",
                  "examples": [
                    "There is half a glass of milk in each pound of chocolate we produce."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Glassware.",
                  "examples": [
                    "We collected art glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mirror.",
                  "examples": [
                    "[…]  for what lady can abide to love a spruce silken-face courtier, that stands every morning two or three hours learning how to look by his glass, how to speak by his glass, how to sigh by his glass, how to court his mistress by his glass? I would wish him no other plague, but to have a mistress as brittle as glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A magnifying glass or telescope.",
                  "examples": [
                    "Haviers, or stags which have been gelded when young, have no horns, as is well known, and in the early part of the stalking season, when seen through a glass, might be mistaken for hummels  […]"
                  ]
                }
              ]
            },
            {
              "group": "(sports) A barrier made of solid, transparent material.",
              "entries": [
                {
                  "meaning": "(basketball, colloquial) The backboard.",
                  "examples": [
                    "He caught the rebound off the glass."
                  ]
                },
                {
                  "meaning": "(ice hockey) The clear, protective screen surrounding a hockey rink.",
                  "examples": [
                    "He fired the outlet pass off the glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A barometer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive, in names of species) Transparent or translucent.",
                  "examples": [
                    "glass frog;  glass shrimp;  glass worm"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An hourglass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, photography, informal) Lenses, considered collectively.",
                  "examples": [
                    "Her new camera was incompatible with her old one, so she needed to buy new glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A pane of glass; a window (especially of a coach or similar vehicle).",
                  "examples": [
                    "[N]o sooner had we entered Holbourn than letting down one of the Front Glasses I enquired of every decent-looking Person that we passed ‘If they had seen my Edward?’"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "glass (third-person singular simple present glasses, present participle glassing, simple past and past participle glassed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fit with glass; to glaze.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enclose in glass.",
                  "examples": [
                    "I made the Tryal upon a flat piece of purely White Glass'd Earth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Clipping of fibreglass. To fit, cover, fill, or build, with fibreglass-reinforced resin composite (fiberglass).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, colloquial) To strike (someone), particularly in the face, with a drinking glass with the intent of causing injury.",
                  "examples": [
                    "JUDD. Any trouble last night?",
                    "LES. Usual. Couple of punks got glassed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, science fiction) To bombard an area with such intensity (nuclear bomb, fusion bomb, etc) as to melt the landscape into glass.",
                  "examples": [
                    "“The Covenant don’t ‘miss’ anything when they glass a planet,” the Master Chief replied."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To view through an optical instrument such as binoculars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To smooth or polish (leather, etc.), by rubbing it with a glass burnisher.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, reflexive) To reflect; to mirror.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make glassy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become glassy.",
                  "examples": [
                    "Bourez had timed it perfectly: a wind that was forecast for the morning began to stir just after his arrival and the sea glassed off for a brief period before the waves grew bigger and bigger."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}