{
  "word": "flask",
  "etymologies": [
    {
      "description": [
        "From Middle English flask, flaske (“case, cask, keg”), from Old English flasce, flaxe (“bottle, flask”) and Medieval Latin flascō (“bottle”); from Frankish *flaskā; whence also Dutch fles; both from Proto-Germanic *flaskǭ (“braid-covered bottle, wicker-enclosed jug”) (whence also German Low German Flaske, Fless, German Flasche, Danish flaske), from Proto-Indo-European *ploḱ-skō (“flat”) (whence also Lithuanian plókščias, Czech ploský, Albanian flashkët), or from Proto-Indo-European *pleḱ- (“to weave”).",
        "Sense 2 from Italian fiasco and sense 3 from Middle French flasque (“powder flask”), itself from Old Spanish flasco, frasco, both from Late Latin above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flask (plural flasks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A narrow-necked vessel of metal or glass, used for various purposes; as of sheet metal, to carry gunpowder in; or of wrought iron, to contain quicksilver; or of glass, to heat water in, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A container used to discreetly carry a small amount of a hard alcoholic beverage; a pocket flask.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) Laboratory glassware used to hold larger volumes than test tubes, normally having a narrow mouth of a standard size which widens to a flat or spherical base.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A container for holding a casting mold, especially for sand casting molds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bed in a gun carriage.",
                  "examples": [
                    ""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flask (third-person singular simple present flasks, present participle flasking, simple past and past participle flasked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dentistry) To invest a denture in a flask so as to produce a sectional mold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}