{
  "word": "misken",
  "etymologies": [
    {
      "description": [
        "From Middle English *miskennen (suggested by miskenninge (“mistake, misinterpretation”)), from Old English *miscennan (suggested by miscennung (“a mistake or variation in pleading before a court, or a fine exacted for this mistake”)), equivalent to mis- +‎ ken. Cognate with Scots misken (“to not know, misken”), Dutch miskennen (“to fail to recognise, ignore”), German mißkennen (“to misunderstand”), Swedish misskänna (“to misunderstand”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "misken (third-person singular simple present miskens, present participle miskenning, simple past and past participle miskenned or miskent)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal) To mistake one for another; mistake in point of knowledge or recognition; misconceive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal) To fail to know; be ignorant or unaware of; appear to be ignorant of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal) To misunderstand; mistake; have the wrong idea of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, UK dialectal) To esteem oneself incorrectly; have a false or exaggerated opinion of oneself or one's position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal) To fail to recognise or identify.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal) To refuse to acknowledge; disown; repudiate; pass over; ignore; disregard; neglect; overlook; disavow; disclaim; disown; deny.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal) To fail to mention.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}