{
  "word": "deadhead",
  "etymologies": [
    {
      "description": [
        "dead +‎ head. Some senses are derived from theater jargon (originally spelled dead head) for audience members admitted without paying, which probably arose in analogy to dead weight or deadwood in reference to their lack of contribution to revenue or in reference to their unenthusiastic (dead) response to performances. Perhaps even from Latin caput mortuum, alchemy term for distillation residue. As Paul Quinion writes: Similarly, the term was applied to a dull or lazy person, one who contributes nothing to an enterprise, only in the early years of the twentieth century, well after the theatrical and transport senses had become well established."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "deadhead (plural deadheads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person either admitted to a theatrical or musical performance without charge, or paid to attend.",
                  "examples": [
                    "Among the Romans.... The free admission tickets were small ivory death's heads, and specimens of these are to be seen in the Museum of Naples. From this custom, it is stated, that we derive our word “Deadhead,” as denoting one who has a free entrance to places of amusement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An employee of a transport company, especially a pilot, traveling as a passenger for logistical reasons, for example to return home or travel to the next assignment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anyone traveling for free.",
                  "examples": [
                    "With the check came two through tickets—good on the railroad from Hawkeye to Washington via New York—and they were “deadhead” tickets, too, which had been given to Senator Dilworthy by the railway companies. Senators and representatives were paid thousands of dollars by the government for traveling expenses, but they always traveled “deadhead” both ways, and then did as any honorable, high-minded men would naturally do—declined to receive the mileage tendered them by the government. The Senator had plenty of railway passes, and could. easily spare two to Laura—one for herself and one for a male escort."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A train or truck moved between cities with no passengers or freight, in order to make it available for service.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person staying at a lodging, such as a hotel or boarding house, without paying rent; freeloader.",
                  "examples": [
                    "For the Caput mortuum (or deadhead, in vulgar phrase) is apt to be furnished with a Venter vivus, or, as we may say, a lively appetite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stupid or boring person; dullard.",
                  "examples": [
                    "“Listen, you two deadheads,” he growled at them, more viciously energetic than he meant, and both turned to stare. He softened his tone. “What's going on here, anyway? What kind of a morgue is this? Is this any way to spend my last four days in town? Come on, let's all go out and do something.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tree or tree branch fixed in the bottom of a river or other navigable body of water, partially submerged or rising nearly the surface, by which boats are sometimes pierced and sunk; snag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Driftwood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Alternative form of Deadhead (“fan of the rock band The Grateful Dead”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A zombie.",
                  "examples": [
                    "I was dreaming about working at Wal-Mart before the deadheads came."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "deadhead (third-person singular simple present deadheads, present participle deadheading, simple past and past participle deadheaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To admit to a performance without charge.",
                  "examples": [
                    "[…]  the \"puffing\" system in criticism, whereby newspaper people were deadheaded in exchange for complimentary notices."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel as a deadhead, or non-paying passenger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To drive an empty vehicle.",
                  "examples": [
                    "Kit had fallen into conversation with a footplate man who was deadheading back out to Samarkand, where he lived with his wife and children."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send (a person or message) for free.",
                  "examples": [
                    "Washington suggested that she get some old friend of the family to come with her, and said the Senator would “deadhead” him home again as soon as he had grown tired, of the sights of the capital."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove spent or dead blossoms from a plant.",
                  "examples": [
                    "If you deadhead your roses regularly, they will bloom all season."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}