{
  "word": "cloth",
  "etymologies": [
    {
      "description": [
        "From Middle English cloth, clath, from Old English clāþ (“cloth, clothes, covering, sail”), from Proto-Germanic *klaiþą (“garment”), perhaps from Proto-Indo-European *gleyt- (“to cling to, cleave, stick”) (compare Albanian ngjit (“to stick, attach, glue”)), a form of *gleh₁y- (“to smear; to stick”). Cognate with Scots clath (“cloth”), North Frisian klaid (“dress, garment”), Saterland Frisian Klood (“dress, apparel”), West Frisian kleed (“cloth, article of clothing”), Dutch kleed (“robe, dress”), Low German kleed (“dress, garment”), German Kleid (“gown, dress”), Danish klæde (“cloth, dress”), Norwegian klede, Swedish kläde (“cloth”), Icelandic klæði (“cloth, dressing”), Old English clīþan (“to adhere, stick”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cloth (countable and uncountable, plural cloths or (obsolete) clothes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A fabric, usually made of woven, knitted, or felted fibres or filaments, such as used in dressing, decorating, cleaning or other practical use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specifically, a tablecloth, especially as spread before a meal or removed afterwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A piece of cloth used for a particular purpose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metaphoric) Substance or essence; the whole of something complex.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metaphoric) Appearance; seeming.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A form of attire that represents a particular profession or status.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in idioms) Priesthood, clergy.",
                  "examples": [
                    "He is a respected man of the cloth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}