{
  "word": "something",
  "etymologies": [
    {
      "description": [
        "From Middle English somþyng, some-thing, som thing, sum thinge, sum þinge, from Old English sum þing (literally “some thing”), equivalent to some +‎ thing. Compare Old English āwiht (“something”, literally “some thing, any thing”), Swedish någonting (“something”, literally “some thing, any thing”)."
      ],
      "adjectives": [
        {
          "description": "something (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a characteristic that the speaker cannot specify.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "something (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(degree) Somewhat; to a degree.",
                  "examples": [
                    "The baby looks something like his father."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, especially in certain set combinations) Used to adverbialise a following adjective",
                  "examples": [
                    "I miss them something terrible. (I miss them terribly)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "something (plural somethings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object whose nature is yet to be defined.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object whose name is forgotten by, unknown or unimportant to the user, e.g., from words of a song. Also used to refer to an object earlier indefinitely referred to as 'something' (pronoun sense).",
                  "examples": [
                    "What was the something the pilot saw, the something worth killing for?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "something (third-person singular simple present somethings, present participle somethinging, simple past and past participle somethinged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Applied to an action whose name is forgotten by, unknown or unimportant to the user, e.g. from words of a song.",
                  "examples": [
                    "He didn’t apply for it for a long time, and then there was a hitch about it, and it was somethinged—vetoed, I believe she said."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}