{
  "word": "governor",
  "etymologies": [
    {
      "description": [
        "From Middle English governour, from Old French gouvreneur, from Latin gubernator, from Ancient Greek κυβερνήτης (kubernḗtēs, “steersman, pilot, guide”), from κυβερνάω (kubernáō, “to steer, to drive, to guide, to act as a pilot”), of disputed origin. Doublet of gubernator."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "governor (plural governors, feminine governess)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) The chief executive officer of a first-level division of a country.",
                  "examples": [
                    "Younger voters are more libertarian in political philosophy than older voters and are credited with the success of libertarian governor Jesse Ventura of Minnesota"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device which regulates or controls some action of a machine through automatic feedback.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of a decision-making for an organization or entity (including some public agencies) similar to or equivalent to a board of directors (used especially for banks); a member of the board of governors.",
                  "examples": [
                    "The seven members of the Board of Governors of the Federal Reserve System are nominated by the President and confirmed by the Senate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Father.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Boss; employer; gaffer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, informal, dated) Term of address to a man; guv'nor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A constituent of a phrase that governs another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) One who has the care or guardianship of a young man; a tutor; a guardian.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A pilot; a steersman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}