{
  "word": "unmannerly",
  "etymologies": [
    {
      "description": [
        "From Middle English unmanerli (“of a person: disorderly, unruly; of conduct: inappropriate, improper”), from un- (prefix meaning ‘not’) + manerli, manerly (“well-mannered; modest; customary; moral”). Manerli is derived from maner (“kind, sort; form, nature; circumstances; method, manner; outward behaviour, manners; morals; custom, usage; cause, reason”) (from Anglo-Norman, Old French manere (“fashion, manner, way”), from Latin manuārius (“of or pertaining to the hand”), from manus (“hand”), ultimately from Proto-Indo-European *(s)meh₂- (“to beckon”)) + -li (suffix forming adjectives). The English word is analysable as un- +‎ mannerly, and is cognate with Danish umanerlig, German unmanierlich, Middle Dutch onmanierlijc (modern Dutch onmanierlijk), Swedish omanerlig, West Frisian ûnmanearlik."
      ],
      "adjectives": [
        {
          "description": "unmannerly (comparative more unmannerly, superlative most unmannerly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) Not mannerly (“polite; having good manners”).",
                  "examples": [
                    "Synonyms: discourteous, impolite, rude, uncivil; see also Thesaurus:impolite",
                    "Antonyms: mannerly; see also Thesaurus:polite"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English unmanerli (“discourteously, rudely; excessively, unrestrainedly”) [and other forms], from un- (prefix meaning ‘not’) + manerli, manerly (“with good manners, courteously; in accordance with custom or propriety, appropriately, becomingly, properly; respectfully”). Manerli is derived from maner (“kind, sort; form, nature; circumstances; method, manner; outward behaviour, manners; morals; custom, usage; cause, reason”) (see further at etymology 1) + -li (suffix forming adverbs). The English word is analysable as un- +‎ mannerly, and is cognate with Middle Dutch onmanierlike (modern Dutch onmanierlijk)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "unmannerly (comparative more unmannerly, superlative most unmannerly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) In a way that is not mannerly; discourteously, rudely.",
                  "examples": [
                    "Synonyms: impolitely, uncivilly"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}