{
  "word": "gun",
  "etymologies": [
    {
      "description": [
        "From Middle English gunne, gonne, from Lady Gunilda, a huge crossbow with a powerful shot, with the second part of the term being of Old Norse origin. It was later used to denote firearms. The name Gunnhildr and its multiple variations are derived from Old Norse gunnr (“battle, war”) + hildr (“battle”), which makes it a pleonasm. In the given context the woman's name means battle maid. See also Hilda, Gunilda, Gunhild, Gunhilda, Gunnhildr."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gun (plural guns)",
          "definitionGroups": [
            {
              "group": "A device for projecting a hard object very forcefully; a firearm or cannon.",
              "entries": [
                {
                  "meaning": "A very portable, short firearm, for hand use, which fires bullets or projectiles, such as a handgun, revolver, pistol, or Derringer.",
                  "examples": []
                },
                {
                  "meaning": "A less portable, long firearm that fires bullets or projectiles; a rifle, either manual, automatic or semi-automatic; a flintlock, musket or shotgun.",
                  "examples": []
                },
                {
                  "meaning": "(military) A cannon with relatively long barrel, operating with relatively low angle of fire, and having a high muzzle velocity.",
                  "examples": []
                },
                {
                  "meaning": "(military) A cannon with a 6-inch/155mm minimum nominal bore diameter and tube length 30 calibers or more. See also: howitzer; mortar.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) A firearm or cannon used for saluting or signalling.21-gun salute",
                  "examples": []
                }
              ]
            },
            {
              "group": "A device operated by a trigger and acting in a manner similar to a firearm.",
              "entries": [
                {
                  "meaning": "Any implement designed to fire a projectile from a tube.",
                  "examples": [
                    "air-pressure pellet gun",
                    "zipgun",
                    "nail gun"
                  ]
                },
                {
                  "meaning": "A device or tool that projects a substance.",
                  "examples": [
                    "squirt gun",
                    "spray gun",
                    "grease gun"
                  ]
                },
                {
                  "meaning": "A device or tool that applies something rather than projecting it.",
                  "examples": [
                    "a rivet gun",
                    "screw gun",
                    "a price-label gun"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) A long surfboard designed for surfing big waves (not the same as a longboard, a gun has a pointed nose and is generally a little narrower).",
                  "examples": [
                    "by the winter of 1962, the Brewer Surfboards Hawaii gun was the most in-demand big-wave equipment on the North Shore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cellular automata) A pattern that \"fires\" out other patterns.",
                  "examples": [
                    "Greene's period-416 2c/5 spaceship gun"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, metonymically) A person who carries or uses a rifle, shotgun or handgun.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) An electron gun.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, usually in the plural) The biceps.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, in the plural) Violent blasts of wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An expert.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, slang) Someone excellent, surpassingly wonderful, or cool.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gun (third-person singular simple present guns, present participle gunning, simple past and past participle gunned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to speed up.",
                  "examples": [
                    "He gunned the engine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To offer vigorous support to (a person or cause).",
                  "examples": [
                    "We're all gunning for you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To seek to attack someone; to take aim at someone; used with for.",
                  "examples": [
                    "He's been gunning for you ever since you embarrassed him at the party."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To practice fowling or hunting small game; chiefly in participial form: to go gunning.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, prison slang) To masturbate while observing and visible to a corrections officer.",
                  "examples": [
                    "[…]  all inmates participated in such conduct, and  […]  \"the inmates gunned only female staff, not the all-male security staff,\" he said."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Related to ganef."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gun (plural guns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang) A magsman or street thief.",
                  "examples": [
                    "To discover  […]  how the honest poor are compelled to hob-and-nob with the “shoful pitcher” and the “gun,” it is necessary to visit the vast nursery-grounds of crime."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From gunna, from gonna, from going to."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "gun",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Nonstandard spelling of going to.",
                  "examples": [
                    "I'm gun go get my coat from da closet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}