{
  "word": "alchemy",
  "etymologies": [
    {
      "description": [
        "From Old French alkimie, arquemie (French alchimie), from Medieval Latin alkimia, from Arabic اَلْكِيمِيَاء‎ (al-kīmiyāʔ), from Ancient Greek χημεία (khēmeía) or χυμεία (khumeía) originally “a mingling, infusion, juice, liquid, as extracted from gold” and later “alchemy”, perhaps from Χημία (Khēmía, “black earth (ancient name for Egypt)”) and/or χυμός (khumós, “juice, sap”). (Compare Spanish alquimia and Italian alchimia)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "alchemy (countable and uncountable, plural alchemies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The premodern and early modern study of physical changes, particularly in Europe, Arabia, and China and chiefly in pursuit of an elixir of immortality, a universal panacea, and/or a philosopher's stone able to transmute base metals into gold, eventually developing into chemistry.",
                  "examples": [
                    "And yet surely to alchemy this right is due, that it may be compared to the husbandman whereof Æsop makes the fable; that, when he died, told his sons that he had left unto them gold buried underground in his vineyard; and they digged over all the ground, and gold they found none; but by reason of their stirring and digging the mould about the roots of their vines, they had a great vintage the year following: so assuredly the search and stir to make gold hath brought to light a great number of good and fruitful inventions and experiments, as well for the disclosing of nature as for the use of man’s life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The causing of any sort of mysterious sudden transmutation.",
                  "examples": [
                    "No alchymy to saving."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, slang, countable) Any elaborate transformation process or algorithm.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}