{
  "word": "liberate",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin līberātus, past participle of līberō (“to set free, deliver”), from līber (“free”); see liberal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "liberate (third-person singular simple present liberates, present participle liberating, simple past and past participle liberated)",
          "definitionGroups": [
            {
              "group": "(transitive) To set free, to make or allow to be free, particularly",
              "entries": [
                {
                  "meaning": "To release from slavery: to manumit.",
                  "examples": []
                },
                {
                  "meaning": "To release from servitude or unjust rule.",
                  "examples": []
                },
                {
                  "meaning": "To release from restraint or inhibition.",
                  "examples": [
                    "Jeeves: Foreign travel often liberates emotions best kept in check, sir. The air of North America is notoriously stimulating in this regard, as witness the regrettable behavior of its inhabitants in 1776.B. Wooster: Hm? What happened in 1776, Jeeves?Jeeves: I prefer not to dwell on it, if it's convenient to you, sir."
                  ]
                },
                {
                  "meaning": "(chemistry) To release from chemical bonds or solutions.",
                  "examples": [
                    "Since the procedure liberates a large amount of chlorine gas, a powerful ventilation system is recommended."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military, euphemistic) To acquire from an enemy during wartime, used especially of cities, regions, and other population centers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, euphemistic) To acquire from another by theft or force: to steal, to rob.",
                  "examples": [
                    "We didn't need IDs. We just liberated these beers from the back of the shop."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}