{
  "word": "talent",
  "etymologies": [
    {
      "description": [
        "From Middle English talent, from Old English talente, borrowed from the plural of Latin talentum (“a Grecian weight; a talent of money”), from Ancient Greek τάλαντον (tálanton, “balance, a particular weight, especially of gold, sum of money, a talent”). Compare Old High German talenta (“talent”). Later figurative senses are from Old French talent (“talent, will, inclination, desire”), derived from the biblical Parable of the Talents."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "talent (plural talents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A marked natural ability or skill. [from 15th c.]",
                  "examples": [
                    "Feel awfully about Scott... I always knew he couldn't think—he never could—but he had a marvelous talent and the thing is to use it—not whine in public."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A unit of weight and money used in ancient times in Greece, the Roman Empire, and the Middle East, equal to about 30 to 60 kg in various times and places. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A desire or inclination for something. [14th–16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, media, sports) People of talent, viewed collectively; a talented person. [from 19th c.]",
                  "examples": [
                    "The director searched their talent pool to fill the new opening."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The men or (especially) women of a place or area, judged by their attractiveness. [from 20th c.]",
                  "examples": [
                    "Not much talent in this bar tonight—let's hit the clubs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}