{
  "word": "rump",
  "etymologies": [
    {
      "description": [
        "From Middle English rumpe, from Old Norse rumpr (“rump”), from Middle Low German rump (“the bulk or trunk of a body, trunk of a tree”), ultimately from Proto-Germanic *rumpō (“trunk of a tree, log”). The ultimate origin could be related to Proto-Germanic *hrimpaną (“to wrinkle”) (Dutch rimpel and German rümpfen (“to wrinkle”)); outside of Germanic, compare Ancient Greek ῥάμφος (rhámphos, “crooked beak”).",
        "Cognate with Icelandic rumpur (“rump”), Swedish rumpa (“rump”), Dutch romp (“trunk, body, hull”), German Rumpf (“hull, trunk, torso, trunk”).",
        "In the sense of remnant, first attested in the Rump Parliament of 1648; its original meaning here was a reference to the rotten, unclean hindquarters of an animal, gradually morphing to refer to the \"remnant\" aspect of the Parliament rather than its perceived unsavory nature."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rump (plural rumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The hindquarters of a four-legged mammal, not including its legs",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cut of meat from the rump of an animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The buttocks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A remnant, as in Rump Parliament.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rump (third-person singular simple present rumps, present participle rumping, simple past and past participle rumped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To turn one's back on, to show one's (clothed) backside to, as a sign of disrespect.",
                  "examples": [
                    "And when they succeeded in forcing themselves back upon the King, who loathed them, and had rumped them, they put the Great Seal into Commission, and omitted Lord Brougham's name in the list of the Cabinet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(somewhat vulgar, slang) To fuck. (Compare bum (verb).)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang) To cheat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To ramble; to move (or talk) aimlessly.",
                  "examples": [
                    "[…]  Mr. Turner. Mr. Speaker, the gentleman from Allegheny has been rumping around for several minutes and I think I ought to have a chance to rump a little bit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move (someone or something) around.",
                  "examples": [
                    "Barney rumped him out to the step, but the kid hung onto the door. Wind roared into the cab. Cold. Slicing up Barney's trouser's legs, pressing his shirt. The rig's heavy treads machinegunned the pavement."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}