{
  "word": "involve",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin involvō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "involve (third-person singular simple present involves, present participle involving, simple past and past participle involved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To comprise or include; to have as a related part.",
                  "examples": [
                    "My job involves forecasting economic trends."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause or engage (someone or something) to participate or to become connected or implicated.",
                  "examples": [
                    "How can we involve the audience more during the show?",
                    "By involving herself in her local community, Mary met lots of people and also helped make it a nicer place to live.",
                    "I don't want to involve him in my personal affairs.",
                    "We are always trying to involve new technology in our products."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To envelop, enfold, entangle.",
                  "examples": [
                    "to involve a person in debt or misery"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(largely obsolete, transitive) To complicate or make intricate.",
                  "examples": [
                    "The distribution and configuration of the land, together with the influence of the winds, greatly involve the problem of the tides, and render it one of the most difficult in the whole range of physics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(largely obsolete) To take in; to gather in; to mingle, blend or merge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, archaic) To raise to any assigned power; to multiply, as a quantity, into itself a given number of times.",
                  "examples": [
                    "a quantity involved to the third or fourth power"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To roll or fold up; to wind round; to entwine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To envelop completely; to surround; to cover; to hide.",
                  "examples": [
                    "to involve in darkness or obscurity"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To connect with something as a natural or logical consequence or effect; to include necessarily; to imply.",
                  "examples": [
                    "The contrary necessarily involves a contradiction."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}