{
  "word": "dory",
  "etymologies": [
    {
      "description": [
        "Attested in American English from 1709 C.E.; possibly derived from an indigenous language of the West Indies or Central America, perhaps Miskito."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dory (plural dories)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A small flat-bottomed boat with pointed or somewhat pointed ends, used for fishing both offshore and on rivers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English dorry, from Old French doree, past participle of dorer (“to gild”), from Latin deauratus."
      ],
      "adjectives": [
        {
          "description": "dory (comparative more dory, superlative most dory)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Of a bright yellow or golden color.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "dory (plural dories)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several different families of large-eyed, silvery, deep-bodied, laterally compressed, and roughly discoid marine fish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Ancient Greek δόρυ (dóru)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dory (plural dories or dorata)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden pike or spear about three metres (ten feet) in length with a flat, leaf-shaped iron spearhead and a bronze butt-spike (called a sauroter), which was the main weapon of hoplites in Ancient Greece. It was usually not thrown but rather thrust at opponents with one hand.",
                  "examples": [
                    "The principal weapon of the hoplite was the dory spear. It was unusually long – it could measure up to 10ft (3m) in length, and weighed about 4.4lb (2kg). At one end was a broad, leaf-pattern spearhead, while at the other end was a metal spike called a sauroter. The purpose of the spike is much debated: it almost certainly acted as a counterbalance, making the spear easier to hold and wield; it could have been used as an improvised spear point, or for making downward attacks on the enemy's exposed feet; or it might even have been embedded in the ground to keep the spear in place."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}