{
  "word": "lather",
  "etymologies": [
    {
      "description": [
        "From Middle English lather, from Old English lēaþor (“a kind of niter used for soap, soda”), from Proto-Germanic *lauþrą (“that which is used for washing, soap”), from Proto-Indo-European *lówh₃trom (“that which is used for washing”), from *lewh₃-, *lowh₃- (“to wash, bathe”). Cognate with Swedish lödder (“lather, foam, froth, soap”), Icelandic löður (“foam, froth, a kind of niter used for soap”), Old Irish lóathar (“wash-basin”), Ancient Greek λουτρόν (loutrón, “a bath, wash-room”), Latin lavō (“I wash”), Albanian laj (“I wash”), Ancient Greek λούω (loúō). More at lye."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lather (countable and uncountable, plural lathers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) The foam made by rapidly stirring soap and water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Foam from profuse sweating, as of a horse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A state of agitation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English *lethren, from Old English lēþrian, lȳþrian, *līeþrian (“to anoint, smear, lather”), from Old English lēaþor (“a kind of niter used for soap, soda”). See above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "lather (third-person singular simple present lathers, present participle lathering, simple past and past participle lathered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with lather.",
                  "examples": [
                    "The young woman lathered her breasts with lavender-scented soap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To beat or whip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form lather or froth, as a horse does when profusely sweating.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}