{
  "word": "there",
  "etymologies": [
    {
      "description": [
        "From Middle English there, ther, thare, thar, thore, from Old English þēr, þǣr, þār (“there; at that place”), from Proto-West Germanic *þār, from Proto-Germanic *þar (“at that place; there”), from Proto-Indo-European *tar- (“there”), from demonstrative pronominal base *to- (“the, that”) + adverbial suffix *-r.",
        "Cognate with Scots thar, thair (“there”), North Frisian dear, deer, där (“there”), Saterland Frisian deer (“there”), West Frisian dêr (“there”), Dutch daar (“there”), Low German dar (“there”), German da, dar- (“there”), Danish der (“there”), Norwegian der (“there”), Swedish där (“there”), Icelandic þar (“in that place, there”)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "there (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(location) In a place or location (stated, implied or otherwise indicated) at some distance from the speaker (compare here).",
                  "examples": [
                    "The Lord God planted a garden eastward in Eden; and there he put the man whom he had formed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) In that matter, relation, etc.; at that point, stage, etc., regarded as a distinct place.",
                  "examples": [
                    "He did not stop there, but continued his speech.",
                    "They patched up their differences, but matters did not end there."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(location) To or into that place; thither.",
                  "examples": [
                    "There is a path which no fowl knoweth, and which the vulture's eye hath not seen:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Where, there where, in which place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In this world, used to say that someone or something exists; see pronoun section below.",
                  "examples": [
                    "These firms do not want the truth to get out and are financing these flights in the hope of dazzling the public. Yet the record of the gas engine is there for all to see."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "there (plural theres)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That status; that position.",
                  "examples": [
                    "You rinse and de-string the green beans; I'll take it from there."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}