{
  "word": "plot",
  "etymologies": [
    {
      "description": [
        "From Middle English plot, plotte, from Old English plot (“a plot of ground”), from Proto-Germanic *plataz, *platjaz (“a patch”), of uncertain origin. Cognate with Middle Low German plet (“patch, strip of cloth, rags”), German Bletz (“rags, bits, strip of land”), Gothic 𐍀𐌻𐌰𐍄𐍃 (plats, “a patch, rags”). See also plat. See also complot for an influence on or source of the \"secret plan\" sense."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plot (plural plots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(narratology) The course of a story, comprising a series of incidents which are gradually unfolded, sometimes by unexpected means. [from 1640s]",
                  "examples": [
                    "Synonym: storyline"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area or land used for building on or planting on. [from 1550s]",
                  "examples": [
                    "Synonym: parcel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A graph or diagram drawn by hand or produced by a mechanical or electronic device.",
                  "examples": [
                    "I was told to fly out on a vector of 100 degrees to meet a strong plot of aircraft 30 miles from the coast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A secret plan to achieve an end, the end or means usually being illegal or otherwise questionable. [from 1580s]",
                  "examples": [
                    "Synonyms: conspiracy, scheme",
                    "The plot would have enabled them to get a majority on the board.",
                    "The assassination of Lincoln was part of a larger plot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Contrivance; deep reach thought; ability to plot or intrigue.",
                  "examples": [
                    "a man of much plot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Participation in any stratagem or conspiracy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plan; a purpose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Various fandom slang, euphemistic) Attractive physical attributes of characters involved in a story, originating from ironic juxtaposition with the original meaning (course of the story).",
                  "examples": [
                    "I'm not sure what's happening in that show, I mainly watch it for the plot."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plot (third-person singular simple present plots, present participle plotting, simple past and past participle plotted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To conceive (a crime, misdeed etc).",
                  "examples": [
                    "They had plotted a robbery.",
                    "They were plotting against the king."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To trace out (a graph or diagram).",
                  "examples": [
                    "They plotted the number of edits per day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark (a point on a graph, chart, etc).",
                  "examples": [
                    "Every five minutes they plotted their position."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}