{
  "word": "leaper",
  "etymologies": [
    {
      "description": [
        "From Middle English lepere, lepare, from Old English hlēapere (“runner, leaper, dancer, courier, vagrant”), equivalent to leap +‎ -er. Compare Saterland Frisian Lööper (“runner”), West Frisian ljepper (“leaper”), West Frisian loper (“runner”), Dutch loper (“runner”), German Läufer (“runner”), Swedish löpare (“runner”), Icelandic hlaupari (“runner”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leaper (plural leapers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who leaps.",
                  "examples": [
                    "[…]  I read in the Bulletin about some mad joker breaking into the little kangaroo and koala zoo in the suburbs and slaughtering seven adult leapers and three joeys."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of hooked instrument for untwisting old cordage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) A piece, like the knight, which moves a fixed distance, and ignores pieces in the way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of jumper (“person who attempts suicide by jumping from a height”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person whose birthday falls on 29 February, and thus only occurs in leap years.",
                  "examples": [
                    "I'm sick of getting coloring books and dollies for my birthdays, and other leapers are just as exasperated by their juvenile gifts. Another question we always get is, “When do you celebrate your birthday?” On February 29th, of course."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}