{
  "word": "epicene",
  "etymologies": [
    {
      "description": [
        "From Late Middle English epicene, epicen, epicin, epcyn, episcen, epycen, epycene, epycyn, ypsen (“(grammar) having only one form for masculine and feminine gender, common”), from Late Latin epicoenos, epicoenus (“of a noun: applicable to either males or females”), Latin epicoenon (“noun applicable to either males or females; grammatical gender of such nouns”), from Ancient Greek ἐπίκοινος (epíkoinos, “common to many people, things, etc.; promiscuous, sluttish”) (compare γένος ἐπίκοινον (génos epíkoinon, “common gender”)), from ἐπι- (epi-, prefix meaning ‘on, upon; on top of; all over’) + κοινός (koinós, “common; general, public”) (ultimately from Proto-Indo-European *ḱóm (“beside, by, near, with”) + *-yós (suffix forming adjectives from noun stems))."
      ],
      "adjectives": [
        {
          "description": "epicene (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Of or relating to a class of Greek and Latin nouns that may refer to males or females but have a fixed grammatical gender (feminine, masculine, neuter, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Of or relating to nouns or pronouns in any language that have a single form for male and female referents.",
                  "examples": [
                    "Synonym: common"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Suitable for use regardless of sex; unisex.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology and figuratively) Of indeterminate sex, whether asexual, androgynous, hermaphrodite, or intersex; of a human face, intermediate in form between a man's face and a woman's face.",
                  "examples": [
                    "Synonyms: gynandromorphic, gynandrous"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Indeterminate; mixed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, usually derogatory) Of a man: effeminate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "epicene (plural epicenes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) An epicene word; preceded by the: the epicene words of a language as a class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology and figuratively) An epicene person, whether biologically asexual, androgynous, hermaphrodite, or intersex; an androgyne, a hermaphrodite. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A transsexual; also, a transvestite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, usually derogatory) An effeminate man.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}