{
  "word": "raid",
  "etymologies": [
    {
      "description": [
        "From Scots raid, from Northern Middle English rade, from Old English rād (“a riding, an expedition on horseback, road”), whence also the inherited English road (“way, street”). The earlier senses of “a riding, expedition, raid” fell into disuse in Early Modern English, but were revived in the northern form raid by Walter Scott in the early 19th century. The use for a swift police operation appears in the later 19th century and may perhaps have been influenced by French razzia (similar in both original meaning and sound)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "raid (plural raids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A quick hostile or predatory incursion or invasion in a battle.",
                  "examples": [
                    "Marauding chief! his sole delight / The moonlight raid, the morning fight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attack or invasion for the purpose of making arrests, seizing property, or plundering.",
                  "examples": [
                    "a police raid of a narcotics factory",
                    "a raid of contractors on the public treasury"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) An attacking movement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) An activity initiated at or towards the end of a live broadcast by the broadcaster that sends its viewers to a different broadcast, primarily intended to boost the viewership of the receiving broadcaster. This is frequently accompanied by a message in the form of a hashtag that is posted in the broadcast's chat by the viewers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming) A large group in a massively multiplayer online game, consisting of multiple parties who team up to defeat a powerful enemy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "raid (third-person singular simple present raids, present participle raiding, simple past and past participle raided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To engage in a raid against.",
                  "examples": [
                    "The police raided the gambling den.",
                    "The soldiers raided the village and burned it down.",
                    "A group of mobsters raided an art museum and stole a bunch of paintings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lure from another; to entice away from.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To indulge oneself by taking from.",
                  "examples": [
                    "I raided the fridge for snacks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}