{
  "word": "ordinary",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman ordenarie, ordenaire et al., Middle French ordinaire, and their source, Medieval Latin ordinarius, noun use of Latin ōrdinārius (“regular, orderly”), from ōrdō (“order”)."
      ],
      "adjectives": [
        {
          "description": "ordinary (comparative more ordinary, superlative most ordinary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, of a judge) Having regular jurisdiction; now only used in certain phrases.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being part of the natural order of things; normal, customary, routine.",
                  "examples": [
                    "On an ordinary day I wake up at nine o'clock, work for six hours, and then go to the gym."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having no special characteristics or function; everyday, common, mundane; often deprecatory.",
                  "examples": [
                    "I live a very ordinary life most of the time, but every year I spend a week in Antarctica.",
                    "He looked so ordinary, I never thought he'd be capable of murder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, colloquial, informal) Bad or undesirable.",
                  "examples": [
                    "It was, in some ways a sad, almost pathetic sight to see this great American boat which had fought so hard throughout the cup summer, now looking very ordinary indeed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "ordinary (plural ordinaries)",
          "definitionGroups": [
            {
              "group": "A person with authority; authority, ordinance.",
              "entries": [
                {
                  "meaning": "(ecclesiastical, law) A person having immediate jurisdiction in a given case of ecclesiastical law, such as the bishop within a diocese. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A courier; someone delivering mail or post. [16th–19th c.]",
                  "examples": [
                    "I  […]  will lay to till you come within hail  […]  but pray respond by the first ordinary."
                  ]
                },
                {
                  "meaning": "(law) A judge with the authority to deal with cases himself or herself rather than by delegation. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now historical) The chaplain of Newgate prison, who prepared condemned prisoners for death. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something ordinary or regular.",
              "entries": [
                {
                  "meaning": "(obsolete) Customary fare, one's regular daily allowance of food; (hence) a regular portion or allowance. [15th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now chiefly historical) A meal provided for a set price at an eating establishment. [from 16th c.]",
                  "examples": [
                    "Here he recommended me to fix my board, there being an excellent ordinary daily at two o'clock, at which I might dine or not as I pleased."
                  ]
                },
                {
                  "meaning": "(now archaic, historical) A place where such meals are served; a public tavern, inn. [from 16th c.]",
                  "examples": [
                    "He enjoyed a perpetual port duty of fourteen pence a ton, on vessels not owned in the province, yielding not far from five thousand dollars a year; and he exacted a tribute for licenses to hawkers and peddlers and to ordinaries."
                  ]
                },
                {
                  "meaning": "(heraldry) One of the standard geometric designs placed across the center of a coat of arms, such as a pale or fess. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "An ordinary person or thing; something commonplace. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now Scotland, Ireland) The usual course of things; normal condition or health; a standard way of behaviour or action. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now historical) A penny farthing bicycle. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A part of the Christian liturgy that is reasonably constant without regard to the date on which the service is performed.",
                  "examples": [
                    "Coordinate term: proper (noun)"
                  ]
                }
              ]
            },
            {
              "group": "A book setting out ordinary or regular conduct.",
              "entries": [
                {
                  "meaning": "(obsolete) A devotional manual; a book setting our rules for proper conduct. [15th–17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A rule, or book of rules, prescribing the order of service, especially of Mass. [from 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}