{
  "word": "suit",
  "etymologies": [
    {
      "description": [
        "From Middle English sute, borrowed from Anglo-Norman suite and Old French sieute, siute (modern suite), originally a participle adjective from Vulgar Latin *sequita (for secūta), from Latin sequi (“to follow”), because the component garments \"follow each other\", i.e. are worn together. See also the doublet suite. Cognate with Italian seguire and Spanish seguir. Related to sue and segue."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "suit (plural suits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of clothes to be worn together, now especially a man's matching jacket and trousers (also business suit or lounge suit), or a similar outfit for a woman.",
                  "examples": [
                    "Nick hired a navy-blue suit for the wedding."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A garment or set of garments suitable and/or required for a given task or activity: space suit, boiler suit, protective suit, swimsuit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang, metonymically) A person who wears matching jacket and trousers, especially a boss or a supervisor.",
                  "examples": [
                    "Be sure to keep your nose to the grindstone today; the suits are making a \"surprise\" visit to this department."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A full set of armour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The attempt to gain an end by legal process; a process instituted in a court of law for the recovery of a right or claim; a lawsuit.",
                  "examples": [
                    "If you take my advice, you'll file a suit against him immediately."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Petition, request, entreaty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete): The act of following or pursuing; pursuit, chase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pursuit of a love-interest; wooing, courtship.",
                  "examples": [
                    "Rebate your loves, each rival suit suspend, Till this funereal web my labors end."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of suing; the pursuit of a particular object or goal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The full set of sails required for a ship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) Each of the sets of a pack of cards distinguished by color and/or specific emblems, such as the spades, hearts, diamonds, or clubs of traditional Anglo, Hispanic, and French playing cards.",
                  "examples": [
                    "To deal and shuffle, to divide and sortHer mingled suits and sequences."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Regular order; succession.",
                  "examples": [
                    "Every five and thirty years the same kind and suit of weather comes again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A company of attendants or followers; a retinue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A group of similar or related objects or items considered as a whole; a suite (of rooms etc.)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "suit (third-person singular simple present suits, present participle suiting, simple past and past participle suited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make proper or suitable; to adapt or fit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(said of clothes, hairstyle or other fashion item, transitive) To be suitable or apt for one's image.",
                  "examples": [
                    "The ripped jeans didn't suit her elegant image.",
                    "That new top suits you. Where did you buy it?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be appropriate or apt for.",
                  "examples": [
                    "The nickname \"Bullet\" suits her, since she is a fast runner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(most commonly used in the passive form, intransitive) To dress; to clothe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To please; to make content; to fit one's taste.",
                  "examples": [
                    "He is well suited with his place.",
                    "My new job suits me, as I work fewer hours and don't have to commute so much."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To agree; to be fitted; to correspond (usually followed by to, archaically also followed by with)",
                  "examples": [
                    "Synonyms: agree, match, answer"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}