{
  "word": "maneuver",
  "etymologies": [
    {
      "description": [
        "From Middle French manœuvre (“manipulation, maneuver”) and manouvrer (“to maneuver”), from Old French manovre (“handwork, manual labor”), from Medieval Latin manopera, manuopera (“work done by hand, handwork”), from manu (“by hand”) + operari (“to work”). First recorded in the Capitularies of Charlemagne (800 AD) to mean \"chore, manual task\", probably as a calque of the Frankish *handwerc (“hand-work”). Compare Old English handweorc, Old English handġeweorc, German Handwerk. The verb is a doublet of the verb manure."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "maneuver (plural maneuvers) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The planned movement of troops, vehicles etc.; a strategic repositioning; (later also) a large training field-exercise of fighting units. [from 18th c.]",
                  "examples": [
                    "The army was on maneuvers.",
                    "Joint NATO maneuvers are as much an exercise in diplomacy as in tactics and logistics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any strategic or cunning action; a stratagem. [from 18th c.]",
                  "examples": [
                    "“This,” cried he, “is a manœuvre I have been some time expecting: but Mr. Harrel, though artful and selfish, is by no means deep.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A movement of the body, or with an implement, instrument etc., especially one performed with skill or dexterity. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A specific medical or surgical movement, often eponymous, done with the doctor's hands or surgical instruments. [from 18th c.]",
                  "examples": [
                    "The otorhinolaryngologist performed an Epley maneuver and the patient was relieved of his vertigo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A controlled (especially skillful) movement taken while steering a vehicle. [from 18th c.]",
                  "examples": [
                    "Parallel parking can be a difficult maneuver."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "maneuver (third-person singular simple present maneuvers, present participle maneuvering, simple past and past participle maneuvered) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To move (something, or oneself) carefully, and often with difficulty, into a certain position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, transitive) To guide, steer, manage purposefully",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, intransitive) To intrigue, manipulate, plot, scheme",
                  "examples": [
                    "The patriarch maneuvered till his offspring occupied countless key posts"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}