{
  "word": "religion",
  "etymologies": [
    {
      "description": [
        "From Middle English religioun, from Old French religion, from Latin religiō (“scrupulousness, pious misgivings, superstition, conscientiousness, sanctity, an object of veneration, cult-observance, reverence”). Most likely from the Proto-Indo-European *h₂leg- with the meanings preserved in Latin dīligere and legere (“to read repeatedly”, “to have something solely in mind”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "religion (countable and uncountable, plural religions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Belief in a spiritual or metaphysical reality (often including at least one deity), accompanied by practices or rituals pertaining to the belief.",
                  "examples": [
                    "Synonym: faith",
                    "My brother tends to value religion, but my sister not as much."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A particular system of such belief, and the rituals and practices proper to it.",
                  "examples": [
                    "Synonym: faith",
                    "Hypernym: belief system"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The way of life committed to by monks and nuns.",
                  "examples": [
                    "The monk entered religion when he was 20 years of age."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, informal) Rituals and actions associated with religious beliefs, but considered apart from them.",
                  "examples": [
                    "Synonym: (pejorative) superstition",
                    "I think some Christians would love Jesus more if they weren't so stuck in religion.",
                    "Jack's spiritual, but he's not really into religion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any practice to which someone or some group is seriously devoted.",
                  "examples": [
                    "At this point, Star Trek has really become a religion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Faithfulness to a given principle; conscientiousness. [16th–17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "religion (third-person singular simple present religions, present participle religioning, simple past and past participle religioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Engage in religious practice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Indoctrinate into a specific religion.",
                  "examples": [
                    "To men whose minds are thus religioned, tied back to gods that never advance, there can never be any such word as progress"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make sacred or symbolic; sanctify.",
                  "examples": [
                    "The ideas expressed above challenge us to continuously rupture and interrupt racialized, classed, gendered, religioned and sexualized norms that inhere between and within institutions, understandings of bodies and our Selves."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}