{
  "word": "barrel",
  "etymologies": [
    {
      "description": [
        "From Middle English barel, from Anglo-Norman baril, Old French baril, bareil (“barrel”), of uncertain origin. An attempt to link baril to Old French barre (“bar, bolt”) (compare Medieval Latin barra (“bar, rod”)) via assumed Vulgar Latin *barrīculum meets the phonological requirement, but fails to connect the word semantically. The alternate connection to Frankish *baril, *beril or Gothic 𐌱𐌴𐍂𐌹𐌻𐍃 (bērils, “container for transport”), from Proto-Germanic *barilaz, *bērilaz (“barrel, jug, container”), from Proto-Indo-European *bʰer- (“to carry, transport”), is more plausible as it connects not only the form of the word but also the sense; equivalent to bear +‎ -le. Compare also Old High German biril (“jug, large pot”), Luxembourgish Bärel, Bierel (“jug, pot”), Old Norse berill (“barrel for liquids”), Old English byrla (“barrel of a horse, trunk, body”). More at bear."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "barrel (plural barrels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(countable) A round (cylindrical) vessel, such as a cask, of greater length than breadth, and bulging in the middle, made of staves bound with hoops, and having flat ends (heads). Sometimes applied to a similar cylindrical container made of metal, usually called a drum.",
              "entries": [
                {
                  "meaning": "Such a cask of a certain size, holding one-eighth of what a tun holds. (See a diagram comparing cask sizes.)",
                  "examples": [
                    "Hypernym: cask",
                    "Coordinate terms: hogshead, pipe, puncheon, rundlet, tertian, tierce, tun"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quantity which constitutes a full barrel: the volume or weight this represents varies by local law and custom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A solid drum, or a hollow cylinder or case",
                  "examples": [
                    "the barrel of a windlass;  the barrel of a watch, within which the spring is coiled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A metallic tube, as of a gun, from which a projectile is discharged.",
                  "examples": [
                    "You're shooting stars from the barrel of your eyes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A ceiling-mounted tube from which lights are suspended.",
                  "examples": [
                    "Moreover, it adds to difficulties in adjusting/servicing lamps located over high scenery, ceilings etc., where the barrel networks cannot be lowered or reached."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A tube.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) The hollow basal part of a feather.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The part of a clarinet which connects the mouthpiece and upper joint, and looks rather like a barrel (1).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) A wave that breaks with a hollow compartment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, specifically New England) A waste receptacle.",
                  "examples": [
                    "Throw it into the trash barrel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ribs and belly of a horse or pony.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A jar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Any of the dark-staining regions in the somatosensory cortex of rodents, etc., where somatosensory inputs from the contralateral side of the body come in from the thalamus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A statistic derived from launch angle and exit velocity of a ball hit in play.",
                  "examples": [
                    "For quotations using this term, see Citations:barrel."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "barrel (third-person singular simple present barrels, present participle barrelling or barreling, simple past and past participle barrelled or barreled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put or to pack in a barrel or barrels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move quickly or in an uncontrolled manner.",
                  "examples": [
                    "He came barrelling around the corner and I almost hit him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To assume the shape of a barrel; specifically, of the image on a computer display, television, etc., to exhibit barrel distortion, where the sides bulge outwards.",
                  "examples": [
                    "Coordinate term: pincushion"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}