{
  "word": "word",
  "etymologies": [
    {
      "description": [
        "From Middle English word, from Old English word, from Proto-West Germanic *word, from Proto-Germanic *wurdą, from Proto-Indo-European *wr̥dʰh₁om. Doublet of verb and verve; further related to vrata."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "word (countable and uncountable, plural words)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The smallest discrete unit of spoken language with a particular meaning, composed of one or more phonemes and one or more morphemes",
                  "examples": [
                    "I can't believe you want me back.You've got Jen to thank for that. Her words the other day moved me deeply. Very deeply indeed.Really? What did she say.Like I remember! Point is it's the effect of her words that's important."
                  ]
                },
                {
                  "meaning": "The smallest discrete unit of written language with a particular meaning, composed of one or more letters or symbols and one or more morphemes",
                  "examples": []
                },
                {
                  "meaning": "A discrete, meaningful unit of language approved by an authority or native speaker (compare non-word).",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something like such a unit of language:",
              "entries": [
                {
                  "meaning": "A sequence of letters, characters, or sounds, considered as a discrete entity, though it does not necessarily belong to a language or have a meaning",
                  "examples": []
                },
                {
                  "meaning": "(telegraphy) A unit of text equivalent to five characters and one space. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(computing) A fixed-size group of bits handled as a unit by a machine and which can be stored in or retrieved from a typical register (so that it has the same size as such a register). [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "(computer science) A finite string that is not a command or operator. [from 20th or 21st c.]",
                  "examples": []
                },
                {
                  "meaning": "(group theory) A group element, expressed as a product of group elements.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fact or act of speaking, as opposed to taking action. [from 9th c].",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare outside certain phrases) Something that someone said; a comment, utterance; speech. [from 10th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete outside certain phrases) A watchword or rallying cry, a verbal signal (even when consisting of multiple words).",
                  "examples": [
                    "mum's the word"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A proverb or motto.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) News; tidings [from 10th c.]",
                  "examples": [
                    "Have you had any word from John yet?",
                    "I've tried for weeks to get word, but I still don't know where she is or if she's all right."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An order; a request or instruction; an expression of will. [from 10th c.]",
                  "examples": [
                    "He sent word that we should strike camp before winter.",
                    "Don't fire till I give the word",
                    "Their mother's word was law."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A promise; an oath or guarantee. [from 10th c.]",
                  "examples": [
                    "I give you my word that I will be there on time.",
                    "Synonym: promise"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief discussion or conversation. [from 15th c.]",
                  "examples": [
                    "Can I have a word with you?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meiosis) A minor reprimand.",
                  "examples": [
                    "I had a word with him about it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) See words.",
                  "examples": [
                    "There had been words between him and the secretary about the outcome of the meeting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology, sometimes Word) Communication from God; the message of the Christian gospel; the Bible, Scripture. [from 10th c.]",
                  "examples": [
                    "Her parents had lived in Botswana, spreading the word among the tribespeople.",
                    "Synonyms: word of God, Bible"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology, sometimes Word) Logos, Christ. [from 8th c.]",
                  "examples": [
                    "Synonyms: God, Logos"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "word (third-person singular simple present words, present participle wording, simple past and past participle worded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say or write (something) using particular words; to phrase (something).",
                  "examples": [
                    "Synonyms: express, phrase, put into words, state",
                    "I’m not sure how to word this letter to the council."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To flatter with words, to cajole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ply or overpower with words.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To conjure with a word.",
                  "examples": [
                    "Against him  […]  who could word heaven and earth out of nothing, and can when he pleases word them into nothing again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To speak, to use words; to converse, to discourse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Variant of worth (“to become, turn into, grow, get”), from Middle English worthen, from Old English weorþan (“to turn into, become, grow”), from Proto-West Germanic *werþan, from Proto-Germanic *werþaną (“to turn, turn into, become”). More at worth § Verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "word",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of worth (“to become”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}