{
  "word": "crop",
  "etymologies": [
    {
      "description": [
        "From Middle English crop, croppe, from Old English crop, cropp, croppa (“the head or top of a plant, a sprout or herb, a bunch or cluster of flowers, an ear of corn, the craw of a bird, a kidney”), from Proto-West Germanic *kropp, from Proto-Germanic *kruppaz (“body, trunk, crop”), from Proto-Indo-European *grewb- (“to warp, bend, crawl”). Cognate with Dutch krop (“crop”), German Low German Kropp (“a swelling on the neck, the craw, maw”), German Kropf (“the craw, ear of grain, head of lettuce or cabbage”), Swedish kropp (“body, trunk”), Icelandic kroppur (“a hunch on the body”). Related to crap, doublet of group and croup."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crop (plural crops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture) A plant, especially a cereal, grown to be harvested as food, livestock fodder, or fuel or for any other economic purpose.",
                  "examples": [
                    "The farmer had a nice crop of corn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The natural production for a specific year, particularly of plants.",
                  "examples": [
                    "It was a good crop of oats that year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group, cluster or collection of things occurring at the same time.",
                  "examples": [
                    "The decade produced a whole crop of ideas about space travel.",
                    "The university had an exceptional crop of graduates in 1892, including three who went on to win Nobel Prizes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of vesicles at the same stage of development in a disease.",
                  "examples": [
                    "The patient had a crop of bumps indicative of chicken pox."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lashing end of a whip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An entire short whip, especially as used in horse-riding; a riding crop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rocky outcrop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of cropping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A photograph or other image that has been reduced by removing the outer parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short haircut.",
                  "examples": [
                    "She went from a ponytail to a crop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A pouch-like part of the alimentary tract of some birds (and some other animals), used to store food before digestion or for regurgitation; a craw.",
                  "examples": [
                    "A little bird sat on the edge of her nest;",
                    "Her yellow-beaks slept as sound as tops;",
                    "Day-long she had worked almost without rest,",
                    "And had filled every one of their gibbous crops;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The foliate part of a finial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or dialect) The head of a flower, especially when picked; an ear of corn; the top branches of a tree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) Tin ore prepared for smelting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) An outcrop of a vein or seam at the surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An entire oxhide.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English croppen (“to cut, pluck and eat”), from Old English *croppian. Cognate with Scots crap (“to crop”), Dutch kroppen (“to cram, digest”), Low German kröppen (“to cut, crop, stuff the craw”), German kröpfen (“to crop”), Icelandic kroppa (“to cut, crop, pick”). Literally, to take off the crop (top, head, ear) of a plant. See Etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "crop (third-person singular simple present crops, present participle cropping, simple past and past participle cropped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove the top end of something, especially a plant.",
                  "examples": [
                    "I will crop off from the top of his young twigs a tender one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mow, reap or gather.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut (especially hair or an animal's tail or ears) short.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove the outer parts of a photograph or other image, typically in order to frame the subject better.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To yield harvest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to bear a crop.",
                  "examples": [
                    "to crop a field"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To beat with a crop, or riding-whip.",
                  "examples": [
                    "She cropped the horse into a comfortable canter and enjoyed the familiar rhythm and bounce of the horse's stride."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}