{
  "word": "internet",
  "etymologies": [
    {
      "description": [
        "The noun is a variant of Internet. The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "internet (countable and uncountable, plural internets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Internet access or connection; internet connectivity.",
                  "examples": [
                    "Do you have internet at your place? My internet is down and I want to check my email.",
                    "Hello everyone, this is your daily dose of internet."
                  ]
                }
              ]
            },
            {
              "group": "(countable)",
              "entries": [
                {
                  "meaning": "Any set of computer networks that communicate using the Internet Protocol; an intranet.",
                  "examples": []
                },
                {
                  "meaning": "(Internet slang, humorous) A fictitious unit of scoring awarded for making outstanding posts on the internet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "internet (third-person singular simple present internets, present participle internetting, simple past and past participle internetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Internet, informal) To use the Internet; specifically, to search for information using the Internet.",
                  "examples": [
                    "Having no idea what that means, I am internetting like mad."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From inter- (prefix meaning ‘amid, among; between’) +‎ net (“to form a netting or network”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "internet (third-person singular simple present internets, present participle internetting, simple past and past participle internetted) (transitive, intransitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, rare) To entwine or link (several things) together, so as to form a network; to interconnect, to network.",
                  "examples": [
                    "Synonym: interweave"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically, networking) To connect (a computer, an electronic device, etc.) into a computer network (in particular, the Internet).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}