{
  "word": "leader",
  "etymologies": [
    {
      "description": [
        "From Middle English leder, ledere, from Old English lǣdere (“leader”), equivalent to lead +‎ -er. Cognate with Scots ledar, leidar (“leader”), West Frisian lieder (“leader”), Dutch leider (“leader”), German Leiter (“leader, conductor, manager”), Danish leder (“leader, manager”), Swedish ledare (“leader, conductor, director”), Icelandic leiðari (“leader, conductor”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leader (plural leaders)",
          "definitionGroups": [
            {
              "group": "Any person who leads or directs.",
              "entries": [
                {
                  "meaning": "One who goes first.",
                  "examples": [
                    "Follow the leader."
                  ]
                },
                {
                  "meaning": "One having authority to direct.",
                  "examples": [
                    "We elected her team leader.",
                    "Synonyms: chief, chieftain, commander"
                  ]
                },
                {
                  "meaning": "One who leads a political party or group of elected party members; sometimes used in titles.",
                  "examples": [
                    "Leader of the House of Commons",
                    "Senate Majority Leader"
                  ]
                },
                {
                  "meaning": "A person or organization that leads in a certain field in terms of excellence, success, etc.",
                  "examples": [
                    "The company is the leader in home remodeling in the county."
                  ]
                },
                {
                  "meaning": "(music) A performer who leads a band, choir, or a section of an orchestra.",
                  "examples": [
                    "Synonym: conductor"
                  ]
                },
                {
                  "meaning": "(music, UK) The first violin in a symphony orchestra; the concertmaster.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "An animal that leads.",
              "entries": [
                {
                  "meaning": "The dominant animal in a pack of animals, such as wolves or lions.",
                  "examples": [
                    "Synonyms: alpha, pack leader"
                  ]
                },
                {
                  "meaning": "an animal placed in advance of others, especially on a team of horse, oxen, or dogs",
                  "examples": []
                },
                {
                  "meaning": "Either of the two front horses of a team of four in front of a carriage.",
                  "examples": [
                    "Antonym: wheeler"
                  ]
                }
              ]
            },
            {
              "group": "Someone or something that leads or conducts.",
              "entries": [
                {
                  "meaning": "(botany) A fast-growing terminal shoot of a woody plant.",
                  "examples": []
                },
                {
                  "meaning": "A pipe for conducting rain water from a roof to a cistern or to the ground.",
                  "examples": []
                },
                {
                  "meaning": "(UK, journalism) The first, or the principal, editorial article in a newspaper; a leading or main editorial article; a lead story.",
                  "examples": []
                },
                {
                  "meaning": "(fishing) A section of line between the main fishing line and the snell of a hook, intended to be more resistant to bites and harder for a fish to detect than the main fishing line.",
                  "examples": []
                },
                {
                  "meaning": "(film, printing) A piece of material at the beginning or end of a reel or roll to allow the material to be threaded or fed onto something, as a reel of film onto a projector or a roll of paper onto a rotary printing press.",
                  "examples": [
                    "If you need to reload film, the cassette can be rewound slightly by turning the hub located on one end of its spool. Do not rewind so much that the leader disappears into the cassette."
                  ]
                },
                {
                  "meaning": "(cinematography, dated) An intertitle.",
                  "examples": []
                },
                {
                  "meaning": "(marketing) A loss leader or a popular product sold at a normal price.",
                  "examples": []
                },
                {
                  "meaning": "(printing) A type having a dot or short row of dots upon its face.",
                  "examples": []
                },
                {
                  "meaning": "(printing, in the plural) A row of dots, periods, or hyphens, used in tables of contents, etc., to lead the eye across a space to the right word or number.",
                  "examples": []
                },
                {
                  "meaning": "(fishing) A net for leading fish into a pound, weir, etc.",
                  "examples": []
                },
                {
                  "meaning": "(mining) A branch or small vein, not important in itself, but indicating the proximity of a better one.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) A block of hard wood pierced with suitable holes for leading ropes in their proper places.",
                  "examples": []
                },
                {
                  "meaning": "(engineering) The drive wheel in any kind of machinery.",
                  "examples": [
                    "Synonyms: driver, drive wheel"
                  ]
                },
                {
                  "meaning": "(meteorology) The path taken by electrons from a cloud to ground level, determining the shape of a bolt of lightning.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}