{
  "word": "accessory",
  "etymologies": [
    {
      "description": [
        "First attested in 1550s. From Middle English accessorie, from Medieval Latin accessōrius, from Latin accessor (“helper, subordinate”), from accessus. Compare access, from same root."
      ],
      "adjectives": [
        {
          "description": "accessory (comparative more accessory, superlative most accessory)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a secondary, supplementary or subordinate function by accompanying as a subordinate; aiding in a secondary way; being additional; contributing or being contributory. Said of things and actions, very rarely of people (and then usually in a humorous version of the legal sense [or due to confusion between the noun and the adjective]).",
                  "examples": [
                    "accessory garments",
                    "Surprise parties succeed with the help of accessory neighbors or colleagues."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Assisting a crime without actually participating in committing the crime itself; being connected as an incident or subordinate to a principal.",
                  "examples": [
                    "Her actions were clearly accessory because they helped him commit and probably also conceal the crime.",
                    "Coordinate term: principal",
                    "Hypernym: accomplice"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Present in a minor amount, and not essential.",
                  "examples": [
                    "accessory mineral"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "accessory (plural accessories)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that belongs to part of another main thing; something additional and subordinate, an attachment.",
                  "examples": [
                    "the accessories of a mobile phone"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion) An article that completes one's basic outfit, such as a scarf or gloves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A person who is not present at a crime, but contributes to it as an assistant or instigator.",
                  "examples": [
                    "She was an accessory to the murder because she helped him commit and probably also conceal the crime."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) Something in a work of art without being indispensably necessary, for example solely ornamental parts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}