{
  "word": "fescue",
  "etymologies": [
    {
      "description": [
        "From Old French festu (modern fétu), from Proto-Romance festu, from Latin festūca (“stalk, stem, straw”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fescue (countable and uncountable, plural fescues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A straw, wire, stick, etc., used chiefly to point out letters to children when learning to read.",
                  "examples": [
                    "‘Now then,’ Mason rapping upon the Table’s Edge with a sinister-looking Fescue of Ebony, whose List of Uses simple Indication does not quite exhaust, whilst the Girls squirm pleasingly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hardy grass commonly used to border golf fairways in temperate climates. Any member of the genus Festuca.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An instrument for playing on the harp; a plectrum.",
                  "examples": [
                    "with thy golden fescue play'dst upon Thy hollow harp"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The style of a sundial.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fescue (third-person singular simple present fescues, present participle fescuing, simple past and past participle fescued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use a fescue, or teach with a fescue.",
                  "examples": [
                    "A minister that cannot be trusted to pray in his own words without being chewed to, and fescued to a formal injunction of his rote lesson, should as little be trusted to preach, besides the vain babble of praying over the same things immediately again ; for there is a large difference in the repetition of some pathetical ejaculation raised out of the sudden earnestness and vigour of the inflamed soul, (such as was that of Christ in the garden,) from the continual rehearsal of our daily orisons;"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}