{
  "word": "zen",
  "etymologies": [
    {
      "description": [
        "From Zen. In more general use, popularized by Eugen Herrigel's 1948 Zen in the Art of Archery and Robert M. Pirsig's 1974 Zen and the Art of Motorcycle Maintenance."
      ],
      "adjectives": [
        {
          "description": "zen (comparative more zen, superlative most zen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) Alternative letter-case form of Zen: of or related to Zen Buddhism, particularly its focus on indirect teaching of wisdom through riddles and stories.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Wise, displaying enlightenment or similar wisdom, insightful, unburdened and free of worries, extremely relaxed and capable.",
                  "examples": [
                    "Greggs: You hung over? Just sayin', you look like shit.Moreland: You know what you need at a crime scene?Greggs: Rubber glove?Moreland: Soft eyes.Greggs: Like I'm s'posed to cry an' shit?Moreland: You got soft eyes, you can see the whole thing. You got hard eyes? You starin' at the same tree, missin' the forest.Greggs: Ah. Zen shit.Moreland: Soft eyes, grasshopper."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "zen (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) Synonym of enlightenment, particularly the kind acquired through Zen meditation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An approach to instruction, understanding, or an activity similarly emphasizing simplicity and intuition rather than conventional thinking or fixation on goals.",
                  "examples": [
                    "the zen of cooking... the zen of passing the bar exam... the zen of C++..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}