{
  "word": "cape",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French cap, from Occitan cap, from Latin caput (“head”). Doublet of caput, chef, and chief, and distantly with head."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cape (plural capes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) A piece or point of land, extending beyond the adjacent coast into a sea or lake; a promontory; a headland.",
                  "examples": [
                    "Synonyms: chersonese, peninsula, point"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French cape, from Old Occitan capa, from Late Latin cappa (“cape”). The second sense (\"superhero\") is metonymic from the fact that many superheroes wear capes. Likewise, the verb sense \"defend, praise\" alludes to the stereotypical depiction of superheroes wearing capes when they come to people's defense. (Compare caped crusader and cape (“a superhero”).) Doublet of capa and cappa."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cape (plural capes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sleeveless garment or part of a garment, hanging from the neck over the back, arms, and shoulders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A superhero.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cape (third-person singular simple present capes, present participle caping, simple past and past participle caped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To incite or attract (a bull) to charge a certain direction, by waving a cape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To head or point; to keep a course.",
                  "examples": [
                    "The ship capes southwest by south."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To skin an animal, particularly a deer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, chiefly with \"for\") To defend or praise, especially that which is unworthy.",
                  "examples": [
                    "A lot of African-Americans believe the answer is Clinton, mostly because \"she's not Trump\" and because President Barack Obama is shamelessly caping for her."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English capen (“to stare, gape, look for, seek”), from Old English capian (“to look”), from Proto-West Germanic *kapēn. Cognate with Dutch gapen, German gaffen (“to stare at curiously, rubberneck”), Low German gapen (“to stare”). Related to keep."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "cape (third-person singular simple present capes, present participle caping, simple past and past participle caped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To look for, search after.",
                  "examples": [
                    "Long may they search ere that they find that they after cape. (Geoffrey Chaucer)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, dialectal or obsolete) To gaze or stare.",
                  "examples": [
                    "The captain just caped mindlessly into the distance as his ship was hit by volley after volley.",
                    "This Nicholas ever caped upward into the air. (Geoffrey Chaucer)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}