{
  "word": "wonder",
  "etymologies": [
    {
      "description": [
        "From Middle English wonder, wunder, from Old English wundor (“wonder, miracle, marvel”), from Proto-Germanic *wundrą. Cognate with Scots wunner (“wonder”), West Frisian wonder, wûnder (“wonder, miracle”), Dutch wonder (“miracle, wonder”), Low German wunner, wunder (“wonder”), German Wunder (“miracle, wonder”), Danish, Norwegian and Swedish under (“wonder, miracle”), Icelandic undur (“wonder”).",
        "The verb is from Middle English wondren, from Old English wundrian, which is from Proto-Germanic *wundrōną. Cognate with Saterland Frisian wunnerje, West Frisian wûnderje, Dutch wonderen, German Low German wunnern, German wundern, Swedish undra, Icelandic undra."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wonder (countable and uncountable, plural wonders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that causes amazement or awe; a marvel.",
                  "examples": [
                    "Wonders of the World seem to come in sevens."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something astonishing and seemingly inexplicable.",
                  "examples": [
                    "The idea was so crazy that it is a wonder that anyone went along with it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone very talented at something, a genius.",
                  "examples": [
                    "He's a wonder at cooking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sense or emotion which can be inspired by something curious or unknown; surprise; astonishment, often with awe or reverence.",
                  "examples": [
                    "All wonder is the effect of novelty upon ignorance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, informal) A mental pondering, a thought.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A kind of donut; a cruller.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wonder (third-person singular simple present wonders, present participle wondering, simple past and past participle wondered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be affected with surprise or admiration; to be struck with astonishment; to be amazed; to marvel; often followed by at.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To ponder; to feel doubt and curiosity; to query in the mind.",
                  "examples": [
                    "He wondered whether penguins could fly. She had wondered this herself sometimes."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}