{
  "word": "cognitive",
  "etymologies": [
    {
      "description": [
        "From Medieval Latin cognitīvus, from Latin cognitus, perfect passive participle of cognōscō (“I know”) + -īvus (adjective suffix)."
      ],
      "adjectives": [
        {
          "description": "cognitive (comparative more cognitive, superlative most cognitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to the part of mental functions that deals with logic, as opposed to affective which deals with emotions.",
                  "examples": [
                    "Recent findings in cognitive neuroscience are also beginning to unravel how the body perceives magnitudes through sensory-motor systems. Variations in size, speed, quantity and duration, are registered in the brain by electro-chemical changes in neurons. The neurons that respond to these different magnitudes share a common neural network. In a survey of this research, cognitive neuroscientists Domenica Bueti and Vincent Walsh tell us that the brain does not treat temporal perception, spatial perception and perceived quantity as different."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Intellectual.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, rare, obsolete) Cognate; which is to be recognized as cognate.",
                  "examples": [
                    "Wanux \"white man,\" cognitive with Aben. awanoch, now used for \"Canadian Frenchman\";"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cognitive (plural cognitives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, rare, obsolete) Cognate.",
                  "examples": [
                    "Abenaki awanoch, the cognitive of Penobscot awenoch, means Frenchman,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}