{
  "word": "raze",
  "etymologies": [
    {
      "description": [
        "From Middle English rasen, racen, rase (“to scrape; to shave; to erase; to pull; to strip off; to pluck or tear out; to root out (a tree, etc.); to pull away, snatch; to pull down; to knock down; to rend, tear apart; to pick clean, strip; to cleave, slice; to sever; to lacerate; to pierce; to carve, engrave; to dig; (figuratively) to expunge, obliterate; to alter”) [and other forms],, from Anglo-Norman raser, rasere, rasser, Middle French, Old French raser (“to shave; to touch lightly, graze; to level off (grain, etc.) in a measure; to demolish, tear down; to erase; to polish; to wear down”), from Vulgar Latin *raso (“to shave; to scrape; to scratch; to touch lightly, graze”), from Latin rāsus (“scraped; shaved”), the perfect passive participle of rādō (“to scrape, scratch; to shave; to rub, smooth; to brush along, graze”), ultimately from Proto-Indo-European *reh₁d- (“to scrape, scratch; to gnaw”). Doublet of rash (etymology 2 and etymology 7)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "raze (third-person singular simple present razes, present participle razing, simple past and past participle razed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To demolish; to level to the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To destroy; to strike out of existence; to obliterate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To scrape as if with a razor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "raze",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of race (rhizome of ginger).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "raze (plural razes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A swinging fence in a watercourse to prevent cattle passing through.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}