{
  "word": "scratch",
  "etymologies": [
    {
      "description": [
        "From Middle English scracchen, of uncertain origin. Probably a blend of Middle English scratten (“to scratch”) and cracchen (“to scratch”). More at scrat and cratch."
      ],
      "adjectives": [
        {
          "description": "scratch (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "For or consisting of preliminary or tentative, incomplete, etc. work.",
                  "examples": [
                    "This is scratch paper, so go ahead and scribble whatever you want on it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hastily assembled, arranged or constructed, from whatever materials are to hand, with little or no preparation",
                  "examples": [
                    "Bluecoats began crossing the James on June 14 and next day two corps approached Petersburg, which was held by Beauregard with a scratch force of 2,500."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Relating to a scratchpad, a data structure or recording medium attached to a machine for testing or temporary use.",
                  "examples": [
                    "scratch memory"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) (of a player) Of a standard high enough to play without a handicap, i.e. to compete without the benefit of a variation in scoring based on ability.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "scratch (countable and uncountable, plural scratches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A disruption, mark or shallow cut on a surface made by scratching.",
                  "examples": [
                    "I can’t believe there is a scratch in the paint already.",
                    "Her skin was covered with tiny scratches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of scratching the skin to alleviate an itch or irritation.",
                  "examples": [
                    "The dog sat up and had a good scratch."
                  ]
                }
              ]
            },
            {
              "group": "(sports)",
              "entries": [
                {
                  "meaning": "A starting line (originally and simply, a line scratched in the ground), as in boxing.",
                  "examples": []
                },
                {
                  "meaning": "A technical error of touching or surpassing the starting mark prior to the official start signal in the sporting events of long jump, discus, hammer throw, shot put, and similar. Originally the starting mark was a scratch on the ground but is now a board or precisely indicated mark.",
                  "examples": []
                },
                {
                  "meaning": "(cycling) The last riders to depart in a handicap race.",
                  "examples": []
                },
                {
                  "meaning": "(billiards) An aberration.",
                  "examples": []
                },
                {
                  "meaning": "A foul in pool, as where the cue ball is put into a pocket or jumps off the table.",
                  "examples": []
                },
                {
                  "meaning": "(archaic, US, slang) A shot which scores by chance and not as intended by the player; a fluke.",
                  "examples": []
                },
                {
                  "meaning": "(horse racing) A horse withdrawn from a race prior to the start.",
                  "examples": [
                    "There were two scratches in race 8, which reduced the field from 9 horses to 7."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meiosis) An injury.",
                  "examples": [
                    "It's just a scratch!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Money.",
                  "examples": [
                    "He and Bruce cooked up a script together, and Bruce flew home to raise the scratch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A feed, usually a mixture of a few common grains, given to chickens.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) Minute, but tender and troublesome, excoriations, covered with scabs, upon the heels of horses which have been used where it is very wet or muddy.",
                  "examples": [
                    "These are exemplified in the scurfy, scaly affections which appear in the bend of the knee (mallenders) and hock (sallenders) and on the lower parts of the limbs, by scratches, and by a scaly exfoliation […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical) A scratch wig.",
                  "examples": [
                    "[H]e turned to him with a dejected Face, and said ‘ – pray Sir, – could you touch up This a little?’ taking hold of his frightful scratch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A genre of Virgin Islander music, better known as fungi.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Scrawled or illegible handwriting; chicken scratch.",
                  "examples": [
                    "The handwriting in his paper is completely different when compared to his scratch on the note you gave me"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scratch (third-person singular simple present scratches, present participle scratching, simple past and past participle scratched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To rub a surface with a sharp object, especially by a living creature to remove itching with nails, claws, etc.",
                  "examples": [
                    "Could you please scratch my back?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "To rub the skin with rough material causing a sensation of irritation; to cause itching.",
              "entries": [
                {
                  "meaning": "To irritate someone's skin with one's unshaven beard when kissing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mark a surface with a sharp object, thereby leaving a scratch (noun).",
                  "examples": [
                    "A real diamond can easily scratch a pane of glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a surface) to get such scratches",
                  "examples": [
                    "This platter scratches easily."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "To cross out, strike out, strike through some text on a page.",
              "entries": [
                {
                  "meaning": "Hence, to remove, ignore, or delete.",
                  "examples": [
                    "Scratch what I said earlier; I was wrong.",
                    "When the favorite was scratched from the race, there was a riot at the betting windows."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To produce a distinctive sound on a turntable by moving a vinyl record back and forth while manipulating the crossfader (see also scratching).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards) To commit a foul in pool, as where the cue ball is put into a pocket or jumps off the table.",
                  "examples": [
                    "Embarrassingly, he scratched on the break, popping the cue completely off the table."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards, dated, US) To score, not by skillful play but by some fortunate chance of the game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To write or draw hastily or awkwardly; scrawl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To dig or excavate with the claws.",
                  "examples": [
                    "Some animals scratch holes, in which they burrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dig or scrape (a person's skin) with claws or fingernails in self-defense or with the intention to injure.",
                  "examples": [
                    "The cat scratched the little girl."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(swimming, athletics) To announce one's non-participation in a race or sports event part of a larger sports meeting that they were previously signed up for, usually in lieu of another event at the same meeting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}