{
  "word": "scapegoat",
  "etymologies": [
    {
      "description": [
        "From scape +‎ goat; coined by English biblical scholar and translator William Tyndale, interpreting Biblical Hebrew עֲזָאזֵל‎ (“azazél”) (Leviticus 16:8, 10, 26), from an interpretation as coming from עֵז‎ (ez, “goat”) and אוזל‎ (ozél, “escapes”). First attested 1530. Compare English scapegrace, scapegallows."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scapegoat (plural scapegoats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the Mosaic Day of Atonement ritual, a goat symbolically imbued with the sins of the people, and sent out alive into the wilderness while another was sacrificed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone unfairly blamed or punished for some failure.",
                  "examples": [
                    "Synonyms: fall guy, patsy, whipping boy; see also Thesaurus:scapegoat",
                    "He is making me a scapegoat for his own poor business decisions and the supply chain disruptions caused by the hurricane!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scapegoat (third-person singular simple present scapegoats, present participle scapegoating, simple past and past participle scapegoated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To unfairly blame or punish someone for some failure; to make a scapegoat of.",
                  "examples": [
                    "They had been used for centuries to justify or rationalize the behavior of that status and conversely to scapegoat and blame some other category of people."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}