{
  "word": "clay",
  "etymologies": [
    {
      "description": [
        "From Middle English cley, clay, from Old English clǣġ (“clay”), from Proto-West Germanic *klaij, from Proto-Germanic *klajjaz (“clay”), from Proto-Indo-European *gley- (“to glue, paste, stick together”).",
        "Cognate with Dutch klei (“clay”), Low German Klei (“clay”), German Klei, Danish klæg (“clay”); compare Ancient Greek γλία (glía), Latin glūten (“glue”) (whence ultimately English glue), Russian глина (glina, “clay”). Related also to clag, clog."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clay (usually uncountable, plural clays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mineral substance made up of small crystals of silica and alumina, that is ductile when moist; the material of pre-fired ceramics.",
                  "examples": [
                    "Three chairs of the steamer type, all maimed, comprised the furniture of this roof-garden, with (by way of local colour) on one of the copings a row of four red clay flower-pots filled with sun-baked dust […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An earth material with ductile qualities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis) A tennis court surface made of crushed stone, brick, shale, or other unbound mineral aggregate.",
                  "examples": [
                    "The French Open is played on clay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biblical) The material of the human body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A particle less than 3.9 microns in diameter, following the Wentworth scale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A clay pipe for smoking tobacco.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms, informal) A clay pigeon.",
                  "examples": [
                    "We went shooting clays at the weekend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Land or territory of a country or other political region, especially when subject to territorial claims",
                  "examples": [
                    "Danzig is rightfully German clay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A moth, Mythimna ferrago",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clay (third-person singular simple present clays, present participle claying, simple past and past participle clayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To add clay to, to spread clay onto.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of sugar) To purify using clay.",
                  "examples": [
                    "They amounted, therefore, to a prohibition, at first of claying or refining sugar for any foreign market, and at present of claying or refining it for the market, which takes off, perhaps, more than nine-tenths of the whole produce."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}