{
  "word": "munch",
  "etymologies": [
    {
      "description": [
        "From Middle English monchen, a variant of mocchen, mucchen (\"to munch (food); chew audibly\"; > Modern English dialectal mouch), probably imitative in origin (compare crunch). Compare also Old French mangier, mengier (“to bite; eat”), of similar sound and meaning."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "munch (countable and uncountable, plural munches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A location or restaurant where good eating can be expected.",
                  "examples": [
                    "Sally is having a breakfast munch at her place!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An act of eating.",
                  "examples": [
                    "We had a good munch at the chippy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Food.",
                  "examples": [
                    "So once we had a shower with what only I can describe as a fitted garden hose with a broken head, ventured out to get some munch. We found a little restaurant, sat down and pretty much got told what we was [sic] having."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM) A casual meeting for those interested in BDSM, usually at a restaurant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New York drill music, slang, derogatory) Someone who easily agrees to give oral sex. [popularized, if not invented, by Ice Spice from August 2022]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "munch (third-person singular simple present munches, present participle munching, simple past and past participle munched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often with \"on\") To chew with a grinding, crunching sound, and with the mouth closed.",
                  "examples": [
                    "Jim was munching on a biscotti."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To eat vigorously or with excitement.",
                  "examples": [
                    "Watching old Bill munch his pancakes makes me hungry!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}