{
  "word": "pension",
  "etymologies": [
    {
      "description": [
        "From Middle English pencioun, pensioun, from Anglo-Norman pencione, Old French pencion, and their source, Latin pēnsiō, pēnsiōnem (“payment, weight, rent, compensation”), from the participle stem of pendere (“to weigh”). Doublet of pensione."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pension (plural pensions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An annuity paid regularly as benefit due to a retired employee, serviceman etc. in consideration of past services, originally and chiefly by a government but also by various private pension schemes. [from 16th c.]",
                  "examples": [
                    "Many old people depend on their pension to pay the bills."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A boarding house or small hotel, especially in continental Europe, which typically offers lodging and certain meals and services. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A wage or fee. [14th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A charge or expense of some kind; a tax. [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sum paid to a clergyman in place of tithes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical) A regular allowance paid to support a royal favourite, or as patronage of an artist or scholar. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A boarding school in France, Belgium, Switzerland, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pension (third-person singular simple present pensions, present participle pensioning, simple past and past participle pensioned)\n(transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grant a pension to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To force (someone) to retire on a pension.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}