{
  "word": "site",
  "etymologies": [
    {
      "description": [
        "Probably from Old Norse (compare Norwegian syt)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "site (plural sites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sorrow, grief.",
                  "examples": [
                    "Ine þe kyng had a sonne, his name Adellus./Dede he toke & he died, als it salle do vs./Sorow & site he made, þer was non oþer rede,/For his sonne & heyre, þat so sone was dede."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English site, from Anglo-Norman site, from Latin situs (“position, place, site”), from sinere (“to put, lay, set down, usually let, suffer, permit”). Doublet of situs."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "site (plural sites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The place where anything is fixed; situation; local position",
                  "examples": [
                    "the site of a city or of a house"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place fitted or chosen for any certain permanent use or occupation",
                  "examples": [
                    "a site for a church"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The posture or position of a thing.",
                  "examples": [
                    "And if this be the Shape, and Site, then the Refraction of the Rays coming from above onto the subjacent Ice, being as about Four to Three, they must when coming out of the superior Ice be as about Three to Four."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A computer installation, particularly one associated with an intranet or internet service or telecommunications.",
                  "examples": [
                    "If the site is forced to send a mesage against its will,...we make the site go to an error state, and remain there. Note that the site can fail for other reasons."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A website.",
                  "examples": [
                    "[G]eneral site with excellent links to contextual as well as author-specific material."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(category theory) A category together with a choice of Grothendieck topology.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Region of a protein, a piece of DNA or RNA where chemical reactions take place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of the body which has been operated on.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "site (third-person singular simple present sites, present participle siting, simple past and past participle sited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To situate or place a building or construction project.",
                  "examples": [
                    "The U.K. government is dusting off an alternative plan to site the center at a military outfit such as Porton Down."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}