{
  "word": "kiss",
  "etymologies": [
    {
      "description": [
        "From Middle English kissen, kussen, from Old English cyssan (“to kiss”), from Proto-West Germanic *kussijan, from Proto-Germanic *kussijaną (“to kiss”).",
        "Cognates include Saterland Frisian küsje, Dutch kussen, German Low German küssen, German küssen, Danish kysse, Swedish kyssa, Norwegian kysse, Icelandic kyssa. Compare Proto-Indo-European *ku-, *kus- (probably imitative), with byspels including Ancient Greek κύσσω (kússō), poetic form of κύσω (kúsō, “to kiss”), and Hittite [script needed] (kuwassanzi, “they kiss”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "kiss (third-person singular simple present kisses, present participle kissing, simple past and past participle kissed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch with the lips or press the lips against, usually to show love or affection or passion, or as part of a greeting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To (cause to) touch lightly or slightly; to come into contact.",
                  "examples": [
                    "The nearside of the car just kissed a parked truck as he took the corner at high speed.",
                    "His ball kissed the black into the corner pocket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of two or more people, to touch each other's lips together, usually to express love or affection or passion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To treat with fondness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English kis, kys, kus, forms of cos influenced by kissen, from Old English coss, from Proto-West Germanic *koss, from Proto-Germanic *kussaz."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kiss (plural kisses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A touch with the lips, usually to express love or affection, or as a greeting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An 'X' mark placed at the end of a letter or other type of message, signifying the bestowal of a kiss from the sender to the receiver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of filled chocolate candy, shaped as if someone had kissed the top. See Hershey's Kisses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) The alignment of two bodies in the solar system such that they have the same longitude when seen from Earth, conjunction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A low-speed mid-air collision between the envelopes of two hot air balloons, generally causing no damage or injury.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}