{
  "word": "piddle",
  "etymologies": [
    {
      "description": [
        "Unknown, although possibly originally paw + -le (“forming verbs involving continuous or repeated movement”). In later use, a euphemistic diminutive of piss. The noun derives from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "piddle (plural piddles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Australia, euphemistic slang) Piss: urine.",
                  "examples": [
                    "The spunk with his piddle comes bubbling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Australia, euphemistic slang) A piss: an act of urination.",
                  "examples": [
                    "Piddle, urine; occ. the act of making water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, figurative) Nonsense or a trivial matter.",
                  "examples": [
                    "It's the alteration of the little words that makes all the difference between Poetry & piddle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "piddle (third-person singular simple present piddles, present participle piddling, simple past and past participle piddled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Often followed by about or around: to act or work ineffectually and wastefully.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) Synonym of peck: to attack or eat with a beak.",
                  "examples": [
                    "As [Mahomet] was preaching... there commeth a doue flying towards him, & alighteth vpon his shoulder, and pidleth in his eare, looking for meate, hauing vsed her before to feede in his eare for the same purpose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now Southern US, often with 'with') Synonym of nibble: to pick at or toy with one's food, to eat slowly or insubstantially.",
                  "examples": [
                    "Diseases... that make them eate nothing at all, or else they doe but piddle and trifle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, South Africa, Namibia, euphemistic slang, intransitive or reflexive) To urinate.",
                  "examples": [
                    "Ha, ha, ha, Paddy shit in his breaches, ha, ha, ha, I shall laugh till I piddle myself."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}