{
  "word": "feud",
  "etymologies": [
    {
      "description": [
        "Inherited from Northern Middle English fede, feide, from Old French faide, feide, fede, from Proto-West Germanic *faihiþu (“hatred, enmity”) (corresponding to foe +‎ -th), from Proto-Indo-European *peyḱ- (“hostile”). Cognate to Old English fǣhþ, fǣhþu, fǣhþo (“hostility, enmity, violence, revenge, vendetta”), German Fehde, and Dutch vete (“feud”) (directly inherited from Proto-West Germanic) alongside Danish fejde (“feud, enmity, hostility, war”) and Swedish fejd (“feud, controversy, quarrel, strife”) (borrowed from Middle Low German)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "feud (plural feuds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A state of long-standing mutual hostility.",
                  "examples": [
                    "You couldn't call it a feud exactly, but there had always been a chill between Phil Mickelson and Tiger Woods."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(professional wrestling) A staged rivalry between wrestlers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A combination of kindred to avenge injuries or affronts, done or offered to any of their blood, on the offender and all his race.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "feud (third-person singular simple present feuds, present participle feuding, simple past and past participle feuded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To carry on a feud.",
                  "examples": [
                    "The two men began to feud after one of them got a job promotion and the other thought he was more qualified."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Medieval Latin feudum. Doublet of fee and fief."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "feud (plural feuds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An estate granted to a vassal by a feudal lord in exchange for service.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}