{
  "word": "slut",
  "etymologies": [
    {
      "description": [
        "From Middle English slutt, slutte, slute (“a dirty or slovenly person, usually a woman, scullery maid; messy animal to prepare as food; slush, mud”), probably from Old English *slȳte (“sleet”), from Proto-West Germanic *slautijā, from Proto-Germanic *slautijǭ (“sleet, hail”), related to Proto-West Germanic *slaut (“puddle, ditch”). Compare Dutch slodder and slet, dialectal Swedish slata (“idle woman”), Norwegian sludd (“sleet”), and the dialectal Norwegian slutr (“sleet, impure liquid”). Doublet of sleet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slut (plural sluts)",
          "definitionGroups": [
            {
              "group": "(vulgar, often derogatory) A sexually promiscuous woman or girl.",
              "entries": [
                {
                  "meaning": "(vulgar, by extension) A prostitute.",
                  "examples": [
                    "You could hire a slut for a few hours, if you're that desperate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, derogatory) Any sexually promiscuous person, often a gay man.",
                  "examples": [
                    "Before he met you, he was such a whore. No, I'm sorry! Whores get paid. He was a slut."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, figuratively, often derogatory) Someone who seeks attention through inappropriate means or to an excessive degree.",
                  "examples": [
                    "a press slut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, figuratively, often derogatory) A disloyal individual; someone who does not commit to a particular thing.",
                  "examples": [
                    "That guy was a job slut; he changed jobs way too often and quickly, to the point that employers will no longer hire him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, derogatory) A slovenly, untidy person, usually a woman.",
                  "examples": [
                    "The doat on Dowdyes, and Deformity:",
                    "E'en what they cannot praise, they will not blame,",
                    "But veil with some extenuating name:",
                    "The Sallow Skin is for the Swarthy put,",
                    "And love can make a Slattern of a Slut …"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, derogatory) A bold, outspoken woman.",
                  "examples": [
                    "Our Polly is a sad Slut! nor heeds what we have taught her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A female dog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A maidservant.",
                  "examples": [
                    "Our little girl Susan is a most admirable slut, and pleases us mightily, doing more service than both the others and deserves wages better."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A rag soaked in a flammable substance and lit for illumination.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slut (third-person singular simple present sluts, present participle slutting, simple past and past participle slutted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar) To wear slutty clothing or makeup, or otherwise behave in a slutty manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar, usually with around) To visit places frequented by men, with the intention of engaging in sexual intercourse by means of flirting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}