{
  "word": "toe",
  "etymologies": [
    {
      "description": [
        "From Middle English to, from Old English tā, (Mercian) tāhe, from Proto-Germanic *taihwǭ (compare Dutch teen, German Zehe, Danish tå, Swedish tå), from *tīhwaną (“to show, announce”) (compare Old English teōn (“to accuse”), German zeihen (“to accuse, blame”)), from Proto-Indo-European *deyḱ- (“to show”) (compare Hittite [script needed] (tekkuššāi), Latin dīcere (“to say”), digitus (“finger”), Ancient Greek δείκνυμι (deíknumi, “to point out, show”), Sanskrit दिदेष्टि (dídeṣṭi), दिशति (diśáti))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "toe (plural toes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Each of the five digits on the end of the foot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An equivalent part in an animal.",
                  "examples": [
                    "Hyponym: hoof"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That part of a shoe or sock covering the toe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something resembling a toe, especially at the bottom or extreme end of something.",
                  "examples": [
                    "(golf) the extreme end of the head of a club.",
                    "(hurling) the end of a hurley.",
                    "(cricket) the tip of the bat farthest from the handle",
                    "(kayaking) the bow; the front of the kayak.",
                    "(geology) a bulbous protrusion at the front of a lava flow or landslide."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance) An advanced form of ballet primarily for the females, dancing ballet primarily using a Pointe shoe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) An alignment of the wheels of a road vehicle, either positive (toe in), meaning the wheels are closer together at the front than at the back, or negative (toe out), the other way round.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) The journal, or pivot, at the lower end of a revolving shaft or spindle, which rests in a step.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A lateral projection at one end, or between the ends, of a piece, such as a rod or bolt, by means of which it is moved.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A projection from the periphery of a revolving piece, acting as a cam to lift another piece.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(carpentry) The long side of an angled cut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The upper end of the bit (cutting edge) of an axehead; as opposed to the heel (lower end).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) cameltoe",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "toe (third-person singular simple present toes, present participle toeing, simple past and past participle toed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish (a stocking, etc.) with a toe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To touch, tap or kick with the toes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch or reach with the toes; to come fully up to.",
                  "examples": [
                    "to toe the mark"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) To fasten (a piece) by driving a fastener at a near-45-degree angle through the side (of the piece) into the piece to which it is to be fastened.",
                  "examples": [
                    "The framers toed the irregular pieces into the sill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) To mishit a golf ball with the toe of the club.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}