{
  "word": "rede",
  "etymologies": [
    {
      "description": [
        "From Middle English red, rede, from Old English rǣd, from Proto-West Germanic *rād, from Proto-Germanic *rēdaz.",
        "Cognate with Danish råd, Dutch raad, German Rat, Swedish råd, Norwegian Bokmål råd. Indo-European cognates include Old Irish ráidid (“to speak, say, tell”). Doublet of rada."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rede (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Help, advice, counsel.",
                  "examples": [
                    "‘Yet do not cast all hope away. Tomorrow is unknown. Rede oft is found at the rising of the Sun.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Decision, a plan.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English reden, ræden, from Old English rǣdan (“to counsel, advise; plot, design; rule, govern, guide; determine, decide, decree; read, explain”), from Proto-West Germanic *rādan, from Proto-Germanic *rēdaną.",
        "Cognate with German raten, Low German raden, Dutch raden. More at read."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rede (third-person singular simple present redes, present participle reding, simple past and past participle red or redd)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic or UK dialectal) To govern, protect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic or UK dialectal) To discuss, deliberate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic or UK dialectal) To advise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic or UK dialectal) To interpret (a riddle or dream); explain.",
                  "examples": [
                    "The secret of Man's Being is still like the Sphinx's secret: a riddle that he cannot rede."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}