{
  "word": "acquit",
  "etymologies": [
    {
      "description": [
        "From Middle English aquī̆ten (“to give in return; to pay, repay; to redeem (a pledge, security), to make good (a promise); to make amends; to relieve of an obligation; to acquit, clear of a charge; to free; to deprive of; to do one's part, acquit oneself; to act, behave (in a certain way)”), from Old French aquiter (“to act, do”) and Medieval Latin acquitāre (“to settle a debt”), from ad- (“prefix meaning ‘to’”) + quitare (“to free”), equivalent to a- +‎ quit. See quit and compare acquiet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "acquit (third-person singular simple present acquits, present participle acquitting, simple past acquitted, past participle acquitted or (archaic) acquit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To declare or find innocent or not guilty.",
                  "examples": [
                    "Synonyms: absolve, clear, exculpate, exonerate",
                    "Antonyms: condemn, convict"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To discharge (for example, a claim or debt); to clear off, to pay off; to fulfil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Followed by of (and formerly by from): to discharge, release, or set free from a burden, duty, liability, or obligation, or from an accusation or charge.",
                  "examples": [
                    "The jury acquitted the prisoner of the charge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To bear or conduct oneself; to perform one's part.",
                  "examples": [
                    "The soldier acquitted herself well in battle.",
                    "The orator acquitted himself very poorly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To clear oneself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) past participle of acquit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To release, to rescue, to set free.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, rare) To pay for; to atone for.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}