{
  "word": "bed",
  "etymologies": [
    {
      "description": [
        "From Middle English bed, bedde, from Old English bedd, from Proto-West Germanic *badi, from Proto-Germanic *badją."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bed (plural beds)",
          "definitionGroups": [
            {
              "group": "A piece of furniture, usually flat and soft, on which to rest or sleep.",
              "entries": [
                {
                  "meaning": "A prepared spot in which to spend the night.",
                  "examples": [
                    "When camping, he usually makes a bed for the night from hay and a blanket."
                  ]
                },
                {
                  "meaning": "(usually after a preposition) One's place of sleep or rest.",
                  "examples": [
                    "Go to bed!",
                    "I had breakfast in bed this morning."
                  ]
                },
                {
                  "meaning": "(uncountable, usually after a preposition) Sleep; rest; getting to sleep.",
                  "examples": [
                    "He's been afraid of bed since he saw the scary film."
                  ]
                },
                {
                  "meaning": "(uncountable, usually after a preposition) The time for going to sleep or resting in bed; bedtime.",
                  "examples": [
                    "I read until bed."
                  ]
                },
                {
                  "meaning": "(uncountable) Time spent in a bed.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) Marriage.",
                  "examples": [
                    "George, the eldest son of his second bed."
                  ]
                },
                {
                  "meaning": "(figurative, uncountable) Sexual activity.",
                  "examples": [
                    "Too much bed, not enough rest."
                  ]
                },
                {
                  "meaning": "Abbreviation of bedroom.",
                  "examples": [
                    "2 beds, 1 bath"
                  ]
                }
              ]
            },
            {
              "group": "A place, or flat surface or layer, on which something else rests or is laid.",
              "entries": [
                {
                  "meaning": "The bottom of a body of water, such as an ocean, sea, lake, or river. [from later 16thc.]",
                  "examples": [
                    "sea bed",
                    "river bed",
                    "There's a lot of trash on the bed of the river."
                  ]
                },
                {
                  "meaning": "An area where a large number of oysters, mussels, other sessile shellfish, or a large amount of seaweed is found.",
                  "examples": [
                    "Oysters are farmed from their beds."
                  ]
                },
                {
                  "meaning": "A garden plot.",
                  "examples": [
                    "We added a new bush to our rose bed."
                  ]
                },
                {
                  "meaning": "A foundation or supporting surface formed of a fluid.",
                  "examples": [
                    "A bed of concrete makes a strong subsurface for an asphalt parking lot."
                  ]
                },
                {
                  "meaning": "The superficial earthwork, or ballast, of a railroad.",
                  "examples": []
                },
                {
                  "meaning": "The platform of a truck, trailer, railcar, or other vehicle that supports the load to be hauled.",
                  "examples": [
                    "Synonym: tray",
                    "The parcels were loaded onto the truck bed before transportation."
                  ]
                },
                {
                  "meaning": "A shaped piece of timber to hold a cask clear of a ship’s floor; a pallet.",
                  "examples": []
                },
                {
                  "meaning": "(printing, dated) The flat part of the press, on which the form is laid.",
                  "examples": []
                },
                {
                  "meaning": "(computing) The flat surface of a scanner on which a document is placed to be scanned.",
                  "examples": []
                },
                {
                  "meaning": "A piece of music, normally instrumental, over which a radio DJ talks.",
                  "examples": []
                },
                {
                  "meaning": "(darts) Any of the sections of a dartboard with a point value, delimited by a wire.",
                  "examples": []
                },
                {
                  "meaning": "(trampoline) The taut surface of a trampoline.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(heading) A layer or surface.",
              "entries": [
                {
                  "meaning": "A deposit of ore, coal, etc.",
                  "examples": []
                },
                {
                  "meaning": "(geology) The smallest division of a geologic formation or stratigraphic rock series marked by well-defined divisional planes (bedding planes) separating it from layers above and below.",
                  "examples": [
                    "Synonyms: layer, stratum"
                  ]
                },
                {
                  "meaning": "(masonry) The horizontal surface of a building stone.",
                  "examples": [
                    "the upper and lower beds"
                  ]
                },
                {
                  "meaning": "(masonry) The lower surface of a brick, slate, or tile.",
                  "examples": []
                },
                {
                  "meaning": "(masonry) A course of stone or brick in a wall.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bed (third-person singular simple present beds, present participle bedding, simple past and past participle bedded)",
          "definitionGroups": [
            {
              "group": "Senses relating to a bed as a place for resting or sleeping.",
              "entries": [
                {
                  "meaning": "(intransitive) To go to bed. I usually listen to music before I bed.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To place in a bed.",
                  "examples": [
                    "For she was not only publicly contracted, but stated as a bride, and solemnly bedded, and after she was laid, there came in Maximilian's ambassador with letters of procuration"
                  ]
                },
                {
                  "meaning": "To put oneself to sleep.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To furnish with a bed or bedding.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, intransitive) To have sexual intercourse with. [from early 14th c.]",
                  "examples": [
                    "Synonyms: coitize, go to bed with, sleep with; see also Thesaurus:copulate with"
                  ]
                }
              ]
            },
            {
              "group": "Senses relating to a bed as a place or layer on which something else rests or is laid.",
              "entries": [
                {
                  "meaning": "(transitive) To lay or put in any hollow place, or place of rest and security, surrounded or enclosed; to embed.",
                  "examples": [
                    "Among all chains or clusters of mountains where large bodies of still water are bedded."
                  ]
                },
                {
                  "meaning": "(transitive) To set in a soft matrix, as paving stones in sand, or tiles in cement.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To set out (plants) in a garden bed.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To dress or prepare the surface of (stone) so it can serve as a bed.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To lay flat; to lay in order; to place in a horizontal or recumbent position.",
                  "examples": []
                },
                {
                  "meaning": "To settle, as machinery.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}