{
  "word": "clearance",
  "etymologies": [
    {
      "description": [
        "clear +‎ -ance"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clearance (countable and uncountable, plural clearances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of clearing or something (such as a space) cleared.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The distance between two moving objects, especially between parts of a machine",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The height or width of a tunnel, bridge or other passage, or the distance between a vehicle and the walls or roof of such passage; a gap, headroom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A permission for a vehicle to proceed, or for a person to travel.",
                  "examples": [
                    "The plane got clearance from air traffic control, and we were off.",
                    "He got clearance to travel to America, even though he had previous links to terrorists."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A permission to have access to sensitive or secret documents or other information.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A permission to use something, usually intellectual property, that is legally, but not otherwise, protected.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(retail) A sale of merchandise, especially at significantly  reduced prices, usually in order to make room for new merchandise or updated versions of the same merchandise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(banking, finance) The settlement of transactions involving securities or means of payment such as checks by means of a clearing house.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The removal of harmful substances from the blood; renal clearance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, billiards, snooker, pool) The act of potting all the remaining balls on a table at one visit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) The act of kicking a ball away from the goal one is defending.",
                  "examples": [
                    "Synonym: clearing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) Removal of pieces from a rank, file or diagonal so that a bishop, rook or queen is free to move along it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clear or net profit.",
                  "examples": [
                    "There can, I believe, be no doubt of this, that sugar can be made better and cheaper in large quantities than in small. But the clearance, sir; that is the question. How would this affect the clearance? The sugar manufacturer would want his profit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football) The first disposal in a chain that leaves the area of a stoppage, or a disposal that leaves the area of a stoppage itself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football) The act of leaving the area of a stoppage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}