{
  "word": "fangle",
  "etymologies": [
    {
      "description": [
        "From Middle English fangelen (verb), from fangel (“inclined to take”, adjective), from Old English *fangol, *fangel (“inclined to take”), from fōn (“to take, seize”). Compare Old English andfangol (“undertaker, contractor”), Old English underfangelnes (“undertaking, hospitality”), Middle English fangen (“to take, seize, catch”), German fangen (“to catch”). More at fang, onfang."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fangle (third-person singular simple present fangles, present participle fangling, simple past and past participle fangled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialectal) To fashion, manufacture, invent, or create.",
                  "examples": [
                    "[…] not hereby to control and new fangle the Scripture, God forbid, but to mark how corruption and apostasy crept in by degrees, and to gather up wherever we find the remaining sparks of original truth, […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialectal) To trim showily; entangle; hang about.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialectal) To waste time; trifle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Back-formation from newfangled (adjective) as if new + fangle (noun). See newfangle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fangle (plural fangles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A prop; a taking up; a new thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something newly fashioned; a novelty, a new fancy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A foolish innovation; a gewgaw; a trifling ornament.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conceit; whim.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}