{
  "word": "budget",
  "etymologies": [
    {
      "description": [
        "Recorded since 1432 as Middle English bogett, bouget, bowgette (“leather pouch”), borrowed from Old French bougette, the diminutive of bouge (“leather bag, wallet”) (also the root of bulge), itself from Late Latin bulga (“leather bag, bellow”), which derives from Gaulish *bolgā (compare Old Irish bolg (“bag”), Breton bolc’h (“flax pod”)), a common root with the Germanic family (compare Dutch balg (“bellows”)), from the Proto-Indo-European *bʰelǵʰ-. More at belly."
      ],
      "adjectives": [
        {
          "description": "budget (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Appropriate to a restricted budget.",
                  "examples": [
                    "We flew on a budget airline."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "budget (plural budgets)",
          "definitionGroups": [
            {
              "group": "The amount of money or resources earmarked for a particular institution, activity or timeframe.",
              "entries": [
                {
                  "meaning": "(by implication) A relatively small amount of available money.",
                  "examples": [
                    "We're on a budget, so we can't afford to eat at that restaurant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An itemized summary of intended expenditure; usually coupled with expected revenue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A wallet, purse or bag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A compact collection of things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, military) A socket in which the end of a cavalry carbine rests.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "budget (third-person singular simple present budgets, present participle budgeting, simple past and past participle budgeted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To construct or draw up a budget.",
                  "examples": [
                    "Budgeting is even harder in times of recession"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide funds, allow for in a budget.",
                  "examples": [
                    "The PM’s pet projects are budgeted rather generously"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To plan for the use of in a budget.",
                  "examples": [
                    "The prestigious building project is budgeted in great detail, from warf facilities to the protocollary opening."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}