{
  "word": "dominate",
  "etymologies": [
    {
      "description": [
        "From Latin dominātus, perfect active participle of dominor (“rule, have dominion”), from dominus (“lord, master”); see dominus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "dominate (third-person singular simple present dominates, present participle dominating, simple past and past participle dominated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To govern, rule or control by superior authority or power",
                  "examples": [
                    "Antonyms: obey, submit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To exert an overwhelming guiding influence over something or someone",
                  "examples": [
                    "Antonyms: obey, submit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To enjoy a commanding position in some field",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To overlook from a height.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, graph theory, linguistics) To precede another node of a directed graph in all paths from the start of the graph to the other node.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Ultimately from Latin dominor (“rule, have dominion”), either from the perfect active participle Latin dominātus, or via phonetic alteration of the synonym dominant, from the present active participle Latin domināns. Compare the pair predominate, predominant."
      ],
      "adjectives": [
        {
          "description": "dominate (comparative more dominate, superlative most dominate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dominant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin dominātus (“rule, command”) (genitive singular dominātūs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dominate (countable and uncountable, plural dominates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The late period of the Roman Empire, following the principate, during which the emperor's rule became more explicitly autocratic and remaining vestiges of the Roman Republic were removed from the formal workings of government; the reign of any particular emperor during this period.",
                  "examples": [
                    "During the Dominate this tendency was perfected to the point of dirigism in the modern sense, a state-directed society and state-controlled economy, obliterating, once again a prelude to modern times, the laissez-faire climate that had characterized the economic self-determination of the individual under the republic and the Principate."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}