{
  "word": "sconce",
  "etymologies": [
    {
      "description": [
        "From Middle English sconce, sconse (“candlestick or lantern (with screen)”), from Old French esconse (“lantern”), from Latin absconsus (“hidden”), perfect passive participle of abscondō (“hide”). Cognate with abscond."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sconce (plural sconces)",
          "definitionGroups": [
            {
              "group": "A fixture for a light, which holds it and provides a screen against wind or against a naked flame or lightbulb.",
              "entries": [
                {
                  "meaning": "A candlestick (holder for a candle, especially a circular tube, with a brim, into which a candle is inserted), either with a handle for carrying, or with a bracket for attaching to a wall.",
                  "examples": [
                    "Taking the candle  […]  she stood with the little flat brass sconce in her hand."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unclear. Perhaps a use of sconce (“light fixture”) or sconce (“fortification”), but seemingly older than the latter"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sconce (plural sconces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A head or a skull.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A poll tax; a mulct or fine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Oxford University slang) An act of sconcing; very similar to a fine at Cambridge University, though a sconce is the act of issuing a penalty rather than the penalty itself.",
                  "examples": [
                    "Synonym: (Oxford University slang, uncommon) sconcing."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sconce (third-person singular simple present sconces, present participle sconcing, simple past and past participle sconced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To impose a fine, a forfeit, or a mulct.",
                  "examples": [
                    "The Rector sconced him in the buttery-book, but Webberly “wiped it off, with irreverent and unbeseeming language.” For this, he had to apologise, and go without his commons for three months."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Oxford University slang) During a meal or as part of a drinking game, to announce some (usually outrageous) deed such that anyone who has done it must drink; similar to I have never; commonly associated with crewdates; very similar to fining at Cambridge University.",
                  "examples": [
                    "I sconce anyone who has ever…"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Middle Dutch schans, cognate with German Schanze."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sconce (plural sconces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of small fort or other fortification, especially as built to defend a pass or ford.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A hut for protection and shelter; a stall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A squinch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fragment of a floe of ice.",
                  "examples": [
                    "Just then, a broad sconce-piece or low water-washed berg came driving up from the southward. The thought flashed upon me of one of our escapes in Melville Bay; and as the sconce moved rapidly close alongside us, McGary managed to plant an anchor on its slope and hold on to it by a whale-line."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fixed seat or shelf.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sconce (third-person singular simple present sconces, present participle sconcing, simple past and past participle sconced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) to shut within a sconce; to imprison.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}