{
  "word": "deck",
  "etymologies": [
    {
      "description": [
        "From Middle English dekke, borrowed from Middle Dutch dec (“roof, covering”), from Middle Dutch decken, from Old Dutch thecken, from Proto-West Germanic *þakkjan, from Proto-Germanic *þakjaną. Formed the same: German Decke (“covering, blanket”). Doublet of thatch and thack."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "deck (plural decks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any raised flat surface that can be walked on: a balcony; a porch; a raised patio; a flat rooftop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The floorlike covering of the horizontal sections, or compartments, of a ship. Small vessels have only one deck; larger ships have two or three decks.",
                  "examples": [
                    "to swab the deck"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A main aeroplane surface, especially of a biplane or multiplane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A pack or set of playing cards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games, by extension) A set of cards owned by each individual player and from which they draw when playing.",
                  "examples": [
                    "Synonym: library"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) A headline consisting of one or more actual lines of text.",
                  "examples": [
                    "If there's a strapline or subdeck, write these after the main deck and don't use the same words."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of slides for a presentation.",
                  "examples": [
                    "Navigate to the location where your PowerPoint deck is stored and select it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A heap or store.",
                  "examples": [
                    "A paper-blurrer, who on all occasions, / For all times, and all season, hath such trinkets / Ready in the deck"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A folded paper used for distributing illicit drugs.",
                  "examples": [
                    "Defendant placed the decks in his pocket and, after driving out of the city, gave one to Shore. While still in the car, Shore snorted half of the deck. When they returned to defendant's home, defendant handed Shore a second deck of heroin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) The floor.",
                  "examples": [
                    "We hit the deck as bullets began to fly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) The stage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for tape deck.",
                  "examples": [
                    "The general operating procedure for recording a tape is basically the same as for playing it. After you insert the tape in the deck, you fast forward it to the end and then completely rewind it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "deck (third-person singular simple present decks, present participle decking, simple past and past participle decked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) To furnish with a deck, as a vessel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To knock someone to the floor, especially with a single punch.",
                  "examples": [
                    "Wow, did you see her deck that guy who pinched her?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) To cause a player to run out of cards to draw, usually making them lose the game.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English dekken, from Middle Dutch dekken (“to cover”), from Old Dutch thecken, from Proto-West Germanic *þakkjan, from Proto-Germanic *þakjaną (“to roof; cover”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "deck (third-person singular simple present decks, present participle decking, simple past and past participle decked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sometimes with out) To dress (someone) up, to clothe with more than ordinary elegance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sometimes with out) To decorate (something).",
                  "examples": [
                    "(now the dew with spangles decked the ground)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover; to overspread.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}