{
  "word": "rapt",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin raptus, past participle of rapio (“to seize”)."
      ],
      "adjectives": [
        {
          "description": "rapt (comparative more rapt, superlative most rapt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, archaic) Snatched, taken away; abducted.",
                  "examples": [
                    "From Oxford I was rapt by my nephew, Sir Edmund Francis Bacon, to Redgrove."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Lifted up into the air; transported into heaven.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Very interested, involved in something, absorbed, transfixed; fascinated or engrossed.",
                  "examples": [
                    "The children watched in rapt attention as the magician produced object after object from his hat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Enthusiatic; ecstatic, elated, happy.",
                  "examples": [
                    "He was rapt with his exam results."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "rapt (plural rapts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An ecstasy; a trance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Rapidity.",
                  "examples": [
                    "[…]  like the great exemplary wheeles of heaven, we must observe two Circles: that while we are daily carried about, and whirled on by the swinge and rapt of the one, we may maintain a naturall and proper course, in the slow and sober wheele of the other."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rapt (third-person singular simple present rapts, present participle rapting, simple past and past participle rapted or rapt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To transport or ravish.",
                  "examples": [
                    "The Bards with furie rapt, the British youth among,",
                    "Unto the charming Harpe thy future honor song"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To carry away by force.",
                  "examples": [
                    "His only daughter had either been rapt away to the grave, or he was to have some wood-demon for a son-in-law, and, perchance, a troop of goblin grandchildren."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}