{
  "word": "noon",
  "etymologies": [
    {
      "description": [
        "From Middle English noen, none, non, from Old English nōn (“the ninth hour”), from a Germanic borrowing of classical Latin nōna (“ninth hour”) (short for nōna hōra), feminine of nōnus (“ninth”). Cognate with Dutch noen, obsolete German Non, Norwegian non."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noon (countable and uncountable, plural noons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The time of day when the sun is in its zenith; twelve o'clock in the day, midday.",
                  "examples": [
                    "On Sundays, I love to have a lie-in until noon.",
                    "The race is due to start at noon sharp."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The corresponding time in the middle of the night; midnight.",
                  "examples": [
                    "So the sad mother at the noon of night / From bloody Memphis stole her silent flight  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The ninth hour of the day counted from sunrise; around three o'clock in the afternoon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) The highest point; culmination.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "noon (third-person singular simple present noons, present participle nooning, simple past and past participle nooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To relax or sleep around midday",
                  "examples": [
                    "We presently turned just aside from the trail into an episode of beautiful prairie, one of a succession along the plateau at the crest of the range. At this height of about five thousand feet, the snows remain until June. In this fair, oval, forest-circled prairie of my nooning, the grass was long and succulent, as if it grew in the bed of a drained lake."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noon (plural noons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The letter ن in the Arabic script.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}