{
  "word": "boomerang",
  "etymologies": [
    {
      "description": [
        "Borrowed from Dharug bumariny."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boomerang (plural boomerangs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat curved airfoil that spins about an axis perpendicular to the direction of flight, originally used in various parts of the world as a hunting weapon or, in returnable types, for sports or training.",
                  "examples": [
                    "Synonym: kylie"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A breakdancing move in which the performer walks on their hands while keeping the legs raised off the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football, rugby) A boomerang kick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A device for changing the color of a followspot.",
                  "examples": [
                    "Roll: A live action changing from one color to another. Typically requires dexterity to \"crossfade\" between two colors in the boomerang with one hand while following with the other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(RAF slang) An early return of an aircraft whose mission was aborted, often due to technical failures.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "boomerang (third-person singular simple present boomerangs, present participle boomeranging, simple past and past participle boomeranged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To return or rebound unexpectedly, especially when the result is undesired; to backfire.",
                  "examples": [
                    "\"Well, there must be some flaw about this,\" I suggested. \"If your magnet is so strong as all that, you would have your own broadside boomeranging back upon you.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel in a curved path.",
                  "examples": [
                    "He said that to the horse as it boomeranged off again and broke away through the scrub."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(RAF slang) To abort a mission and return to base early.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}