{
  "word": "treadmill",
  "etymologies": [
    {
      "description": [
        "tread +‎ mill. Figurative senses refer to how running on a treadmill requires continued effort and motion in order to remain in the same place."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "treadmill (plural treadmills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of indoor sporting equipment used to allow for the motions of running or walking while staying in one place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A mill worked by persons treading upon steps on the periphery of a wide wheel having a horizontal axis. It was used principally as a means of prison discipline.",
                  "examples": [
                    "Synonyms: mill, stepper, everlasting staircase"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mill worked by horses, dogs, etc., treading an endless belt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A process or situation in which continued effort leads to or is required for remaining at a particular state or level without moving ahead.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "treadmill (third-person singular simple present treadmills, present participle treadmilling, simple past and past participle treadmilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To exercise on a treadmill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To keep busy, for example with work or with other tasks, without being able to get ahead or make progress towards long-term goals.",
                  "examples": [
                    "Most of us are so busy \"earning each day our daily bread\" that we have but little \"open\" time.  […]  Occasionally one wonders \"What's it all for, anyway?\" For years he's been treadmilling it, day in and day out, and presently the graying hair at the temples will shock him into the grim reality that he is getting old—and getting little else."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}