{
  "word": "diaper",
  "etymologies": [
    {
      "description": [
        "From Middle English dyaper, from Old French dyapre, diaspre, from Medieval Latin diaspra, diasprum from Byzantine Greek δίασπρος (díaspros, adj), from δια- (dia-, “across”) + ἄσπρος (áspros, “white”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "diaper (countable and uncountable, plural diapers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A textile fabric having a diamond-shaped pattern formed by alternating directions of thread.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A towel or napkin made from such fabric.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) An absorbent garment worn by a baby, by a young child not yet toilet trained, or by an adult who is incontinent; a nappy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The diamond pattern associated with diaper textiles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Surface decoration of any sort which consists of the constant repetition of one or more simple figures or units of design evenly spaced.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "diaper (third-person singular simple present diapers, present participle diapering, simple past and past participle diapered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put diapers on someone.",
                  "examples": [
                    "I diaper myself or she helps Diaper me and sometimes I get to wet them, she knows I like that. And she whispers in my ear that \"baby wants to make a cummie in his Diapers  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To draw flowers or figures, as upon cloth.",
                  "examples": [
                    "If you diaper upon folds, let your work be broken."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}