{
  "word": "plaid",
  "etymologies": [
    {
      "description": [
        "From Scots plaid, of uncertain origin; perhaps from a past participle form of ply. Scottish Gaelic plaide (“blanket”) is probably a borrowing from Scots.",
        "Also compare Scottish Gaelic peall (“covering, veil, blanket”) << Latin pellis (“hide, covering”), but the OED finds the sound changes problematic."
      ],
      "adjectives": [
        {
          "description": "plaid (comparative more plaid, superlative most plaid)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a pattern or colors which resemble a Scottish tartan; checkered or marked with bars or stripes at right angles to one another.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "plaid (countable and uncountable, plural plaids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textiles) A type of twilled woollen cloth, often with a tartan or chequered pattern. [from 16thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A length of such material used as a piece of clothing, formerly worn in the Scottish Highlands and other parts of northern Britain and remaining as an item of ceremonial dress worn by members of Scottish pipe bands. [from 16thc.]",
                  "examples": [
                    "In battle, the plaid was customarily shrugged off before the charge bit home, and the warrior came into contact with only his long, saffron shirt (‘leine chrochach’) to preserve modesty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The typical chequered pattern of a plaid; tartan. [from 19thc.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Alternative forms."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "plaid",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) simple past tense and past participle of play",
                  "examples": [
                    "\"...then plaid on the organ, and sung...\""
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}