{
  "word": "scrutiny",
  "etymologies": [
    {
      "description": [
        "From Middle English scrutiny, from Medieval Latin scrūtinium (“a search, an inquiry”), from Vulgar Latin scrūtor (“to search or examine thoroughly”), of uncertain origin. Possibly from Late Latin scrūta (“rubbish, broken trash”); or of Germanic origin, related to Old English scrūtnung (“examination, investigation, inquiry, search”), from scrūtnian, scrūdnian (“to examine carefully, scrutinize, consider, investigate”), from Proto-Germanic *skrudōną, *skruþōną (“to search, examine”), from Proto-Indo-European *(s)krewt- (“to cut”). Compare Old High German skrodōn, scrutōn, scrutilōn (“to research, explore”), Old High German scrod (“a search, scrutiny”), Old English scrēadian (“to shred, cut up, cut off, peel, pare, prune”). More at shred."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scrutiny (usually uncountable, plural scrutinies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Intense study of someone or something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Thorough inspection of a situation or a case.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An examination of catechumens, in the last week of Lent, who were to receive baptism on Easter Day.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ticket, or little paper billet, on which a vote is written.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An examination by a committee of the votes given at an election, for the purpose of correcting the poll.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scrutiny (third-person singular simple present scrutinies, present participle scrutinying, simple past and past participle scrutinied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) To scrutinize.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}