{
  "word": "grill",
  "etymologies": [
    {
      "description": [
        "1655, from French gril, from Middle French gril, from Old French greïl, graïl (“gridiron”), from graïlle (“grate, grating”), from Latin crātīcula (“gridiron”), diminutive of crātis (“hurdle, wickerwork”), q.v. Related to griddle, hurdle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grill (plural grills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A grating; a grid of wire or a sheet of material with a pattern of holes or slots, usually used to protect something while allowing the passage of air and liquids. Typical uses: to allow air through a fan while preventing fingers or objects from passing; to allow people to talk to somebody, while preventing attack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The criss-cross pieces that separate panes of glass in a window.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "On a vehicle, a slotted cover as above, to protect and hide the radiator, while admitting air to cool it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A cooking device comprising a source of radiative heat and a means of holding food under it; a broiler in US English",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A cooking device comprising a source of radiative and convective heat and a means of holding food above it; a barbecue.",
                  "examples": [
                    "I put some peppers and mushrooms on the grill to go with dinner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Food (designed to be) cooked on a grill.",
                  "examples": [
                    "a packet of frozen cauliflower cheese grills"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A grillroom; a restaurant serving grilled food.",
                  "examples": [
                    "These coupons will get you a discount at Johnny's Bar and Grill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A type of jewelry worn on the front teeth.",
                  "examples": [
                    "Synonyms: fronts, golds"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, by extension) The front teeth regarded collectively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang, humorous) Deliberate misspelling of girl.",
                  "examples": [
                    "r u a grill?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grill (third-person singular simple present grills, present participle grilling, simple past and past participle grilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cook (food) on a grill; to barbecue.",
                  "examples": [
                    "Synonyms: see Thesaurus:cook",
                    "Why don't we get together Saturday and grill some burgers?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Australia, New Zealand, UK) To cook food under the element of a stove or only under the top element of an oven – (US) broil, (cooking) salamander.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To interrogate; to question aggressively or harshly.",
                  "examples": [
                    "The police grilled him about his movements at the time of the crime."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To feel very hot; to swelter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stamp or mark with a grill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English grillen (“to anger, provoke”), from Old English grillan, griellan (“to annoy, vex, offend”), from Proto-Germanic *graljaną (“to shout, make angry”), from Proto-Indo-European *gʰer- (“to rattle, make a noise, grumble”). Cognate with Saterland Frisian grulje (“to make angry”), Dutch grillen (“to shudder, shiver”), Low German vergrellen (“to anger, provoke”), German grollen (“to rumble”) and perhaps also with French grouiller (“to swarm”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "grill (third-person singular simple present grills, present participle grilling, simple past and past participle grilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland, US, obsolete) To make angry; provoke; offend, incite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly Scotland, obsolete) To terrify; make tremble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly Scotland, obsolete) To tremble; shiver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Northern England, Scotland, obsolete) To snarl; snap.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gril, grille (“harsh, rough, severe”), from Old English *griell, from Proto-Germanic *grellaz (“angry”), from Proto-Indo-European *gʰer- (“to rattle, make a noise, grumble”). Cognate with German grell (“harsh, angry”), Danish grel (“shrill, glaring, dazzling”)."
      ],
      "adjectives": [
        {
          "description": "grill (comparative griller or more grill, superlative grillest or most grill)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Harsh, rough, severe; cruel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "grill (usually uncountable, plural grills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Harm.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}