{
  "word": "carriage",
  "etymologies": [
    {
      "description": [
        "From Middle English cariage, from Old Northern French cariage, from carier (“to carry”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carriage (countable and uncountable, plural carriages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of conveying; carrying.",
                  "examples": [
                    "The remainder of the men were employed in unbarreling our Pork and stringing it on poles for convenience of carriage, and carrying our Batteaux from the river to the pond."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Means of conveyance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A (mostly four-wheeled) lighter vehicle chiefly designed to transport people, generally drawn by horse power.",
                  "examples": [
                    "Hyponym: coach",
                    "Antonym: (heavier vehicle designed to transport people or goods) wagon",
                    "The carriage ride was very romantic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, Britain, Abbreviation of railway carriage) A railroad car",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The manner or posture in which one holds or positions a body part, such as one's arm or head.",
                  "examples": [
                    "The runner has a very low arm carriage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A manner of walking and moving in general; how one carries oneself, bearing, gait.",
                  "examples": [
                    "Cavett: What would it take – seriously – for a musician to be good enough to play in the Miles Davis bands? Suppose you're looking for a new guy.",
                    "Davis: Well, the first thing he needs do – whoever he is – has to have good carriage, you know.",
                    "Cavett: Meaning?",
                    "Davis: Meaning that they have to look like what they're going to play – the instrument."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) One's behaviour, or way of conducting oneself towards others.",
                  "examples": [
                    "He now assumed a carriage to me so very different from what he had lately worn, and so nearly resembling his behaviour the first week of our marriage, that  […]  he might, possibly, have rekindled my fondness for him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a typewriter supporting the paper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, New England) A shopping cart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A stroller; a baby carriage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The charge made for conveying (especially in the phrases carriage forward, when the charge is to be paid by the receiver, and carriage paid).",
                  "examples": [
                    "Synonyms: freight, freightage, cartage, charge, rate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) That which is carried, baggage",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}