{
  "word": "moil",
  "etymologies": [
    {
      "description": [
        "From Middle English mollen (“to soften by wetting”), borrowed from Old French moillier with the same meaning, from Vulgar Latin *molliō, *molliare, from mollis (“soft”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "moil (countable and uncountable, plural moils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hard work.",
                  "examples": [
                    "I finally decided, my heart was really in my singing rather than in the drab, hardy soul- searing toil and moil of a collier's existence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Confusion, turmoil.",
                  "examples": [
                    "Croft no longer saw anything clearly; he could not have said at that moment where his hands ended and the machine gun began; he was lost in a vast moil of noise out of which individual screams and shouts etched in his mind for an instant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spot; a defilement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "moil (third-person singular simple present moils, present participle moiling, simple past and past participle moiled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To toil, to work hard.",
                  "examples": [
                    "Moil not too much underground, for the hope of mines is very uncertain, and useth to make the planters lazy in other things.."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To churn continually; to swirl.",
                  "examples": [
                    "A crowd of men and women moiled like nightmare figures in the smoke-green haze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, transitive) To defile or dirty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Of unclear origin; possibly from French meule or Hebrew מוהל‎ (mohel, “ritual circumciser”), referring to the foreskin-like shape of the unwanted rim."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "moil (countable and uncountable, plural moils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(glassblowing) The glass circling the tip of a blowpipe or punty, such as the residual glass after detaching a blown vessel, or the lower part of a gather.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(glassblowing, blow molding) The excess material which adheres to the top, base, or rim of a glass object when it is cut or knocked off from a blowpipe or punty, or from the mold-filling process. Typically removed after annealing as part of the finishing process (e.g. scored and snapped off).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(glassblowing) The metallic oxide from a blowpipe which has adhered to a glass object.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}