{
  "word": "syllable",
  "etymologies": [
    {
      "description": [
        "From Middle English syllable, sillable, syllabylle, sylabul, from Anglo-Norman sillable, from Old French sillebe, from Latin syllaba, from Ancient Greek συλλαβή (sullabḗ), from συλλαμβάνω (sullambánō, “I gather together”), from συν- (sun-, “together”) + λαμβάνω (lambánō, “I take”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "syllable (plural syllables)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A unit of human speech that is interpreted by the listener as a single sound, although syllables usually consist of one or more vowel sounds, either alone or combined with the sound of one or more consonants; a word consists of one or more syllables.",
                  "examples": [
                    "Meronyms: onset, nucleus, coda, rime"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The written representation of a given pronounced syllable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small part of a sentence or discourse; anything concise or short; a particle.",
                  "examples": [
                    "Then let them cast backe their eies unto former generations of men, and marke what was done in the prime of the World, Seth, Enoch, Noah, Sem, Abraham, Job, and the rest that lived before any syllable of the Law of God was written, did they not sinne as much as we doe in every action not commanded?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "syllable (third-person singular simple present syllables, present participle syllabling, simple past and past participle syllabled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, poetic) To utter in syllables.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}