{
  "word": "ozone",
  "etymologies": [
    {
      "description": [
        "From German Ozon, coined 1840 by Christian Friedrich Schönbein, from Ancient Greek ὄζον (ózon), neuter participle of ὄζω (ózō, “I smell”), in reference to its pungent odour.",
        "The “fresh air” sense is from an erroneous former belief that seaweed contains and releases ozone."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ozone (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(inorganic chemistry) An allotrope of oxygen (symbol O₃) having three atoms in the molecule instead of the usual two; it is a toxic gas, generated from oxygen by electrical discharge.",
                  "examples": [
                    "Hypernym: greenhouse gas"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, informal) Fresh air, especially that breathed at the seaside and smelling of seaweed.",
                  "examples": [
                    "A patent obtained in England, and specified far from clearly, for obtaining ozone by boiling seaweed,†† may be mentioned as a curiosity, and also the credulity with which ozone-baths, prepared in this manner, find a ready sale, in spite of, or perhaps rather on account of, their high price."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ozone (third-person singular simple present ozones, present participle ozoning, simple past and past participle ozoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat with ozone.",
                  "examples": [
                    "Whenever it exists, as it usually does, even where the tide water freshens at the ebb, it seems to have a purifying tendency, probably by ozoning the superincumbent atmosphere."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}