{
  "word": "lesbian",
  "etymologies": [
    {
      "description": [
        "From Latin Lesbiana, from Ancient Greek Λέσβος (Lésbos) + Latin adjective suffix -iana; by reference to Sappho of Lesbos (whence also sapphist, sapphic), known for her sentimental poems about women. This sense of the word may have been borrowed from, or influenced by, the German cognate lesbisch, where it is found in medical literature from the 1830s."
      ],
      "adjectives": [
        {
          "description": "lesbian (comparative more lesbian, superlative most lesbian)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a woman) Homosexual, gay; preferring mostly or exclusively women as romantic or sexual partners.",
                  "examples": [
                    "Lesbian fans of the show were rooting for Jane and Amanda to get together."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a romantic or sexual act or relationship) Between two or more women; homosexual, gay.",
                  "examples": [
                    "a lesbian relationship / marriage / kiss"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially of an institution or group) Intended for lesbians.",
                  "examples": [
                    "We're going to a lesbian bar tonight."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lesbian (plural lesbians)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A homosexual woman, one who is mostly or exclusively sexually or romantically attracted to other women.",
                  "examples": [
                    "There have also been women who loved other women. These are the Lesbians or Tribades."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) A homosexual female animal.",
                  "examples": [
                    "There was one recently that determined on an island off California 14 percent of the female sea gulls were lesbians (and we know that kind of thing would never go among Nantucket sea gulls)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lesbian (third-person singular simple present lesbians, present participle lesbianing, simple past and past participle lesbianed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, nonstandard, transitive, intransitive) To (cause to) take part in lesbian sex, or other lesbian activity.",
                  "examples": [
                    "That's the way I want to go – Lesbianed to death."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}