{
  "word": "crow",
  "etymologies": [
    {
      "description": [
        "From Middle English crowe, from Old English crāwe, from Proto-West Germanic *krāā, from Proto-Germanic *krēǭ (compare West Frisian krie, Dutch kraai, German Krähe), from *krēaną (“to crow”). See below."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crow (plural crows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bird, usually black, of the genus Corvus, having a strong conical beak, with projecting bristles; it has a harsh, croaking call.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various dark-coloured nymphalid butterflies of the genus Euploea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bar of iron with a beak, crook or claw; a bar of iron used as a lever; a crowbar.",
                  "examples": [
                    "Synonym: crowbar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A gangplank (corvus) used by the Ancient Roman navy to board enemy ships.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(among butchers) The mesentery of an animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) An ill-tempered and obstinate woman, or one who otherwise has features resembling the bird; a harpy.",
                  "examples": [
                    "Synonyms: see Thesaurus:shrew"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ethnic slur, offensive, slang) A black person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, slang) The emblem of an eagle, a sign of military rank.",
                  "examples": [
                    "A young petty officer that must have just received his “crow” (a single chevron, with an eagle over it) was showing off to several seamen."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is from Middle English crowen, from Old English crāwan (past tense crēow, past participle crāwen), from Proto-Germanic *krēaną, from imitative Proto-Indo-European *gerH- (“to cry hoarsely”).",
        "The noun is from Middle English crowe, from the verb.",
        "Compare Dutch kraaien, German krähen, Lithuanian gróti, Russian гра́ять (grájatʹ)). Related to croak."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crow (plural crows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cry of the bird known in the US as a rooster and in British English as a cockerel.",
                  "examples": [
                    "Synonym: cock-a-doodle-doo"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crow (third-person singular simple present crows, present participle crowing, simple past crowed or (UK) crew, past participle crowed or (archaic) crown)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make the shrill sound characteristic of a rooster; to make a sound in this manner, either in gaiety, joy, pleasure, or defiance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To shout in exultation or defiance; to brag.",
                  "examples": [
                    "He’s been crowing all day about winning the game of cards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, music) To test the reed of a double reed instrument by placing the reed alone in the mouth and blowing it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}