{
  "word": "shoot",
  "etymologies": [
    {
      "description": [
        "From Middle English shoten, from Old English scēotan, from Proto-West Germanic *skeutan, from Proto-Germanic *skeutaną, from Proto-Indo-European *(s)kéwd-e-ti, from *(s)kewd- (“to shoot, throw”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shoot (plural shoots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The emerging stem and embryonic leaves of a new plant.",
                  "examples": [
                    "Prune off yet also superfluous branches, and shoots of this second spring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A photography session.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hunt or shooting competition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(professional wrestling, slang) An event that is unscripted or legitimate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of shooting; the discharge of a missile; a shot.",
                  "examples": [
                    "One underneath his horse to get a shoot doth stalk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rush of water; a rapid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving) A weft thread shot through the shed by the shuttle; a pick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shoat; a young pig.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A vein of ore running in the same general direction as the lode.",
                  "examples": [
                    "In the western dike is a shoot about 4 feet in diameter carrying a considerable sprinkling of cassiterite, ore which in quantity would undoubtedly be worth mining. The shoot contains a large amount of muscovite mica with quartz and very little or no feldspar..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inclined plane, either artificial or natural, down which timber, coal, ore, etc., are caused to slide; a chute.",
                  "examples": [
                    "That there was no evidence before the jury that at the time of the accident the timber shoot was worked by the defendant company."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) The act of taking all point cards in one hand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A seismic survey carried out with geophones in an attempt to detect oil.",
                  "examples": [
                    "Once the last line of cable has been retrieved, there is little evidence that a shoot has been conducted."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shoot (third-person singular simple present shoots, present participle shooting, simple past shot, past participle shot or (rare) shotten)",
          "definitionGroups": [
            {
              "group": "To launch a projectile.",
              "entries": [
                {
                  "meaning": "(transitive) To fire (a weapon that releases a projectile).",
                  "examples": [
                    "to shoot a gun"
                  ]
                },
                {
                  "meaning": "(transitive) To fire (a projectile).",
                  "examples": [
                    "Synonym: (of an arrow) loose"
                  ]
                },
                {
                  "meaning": "(transitive) To fire a projectile at (a person or target).",
                  "examples": [
                    "The man, in a desperate bid for freedom, grabbed his gun and started shooting anyone he could.",
                    "The hunter shot the deer to harvest its meat."
                  ]
                },
                {
                  "meaning": "(intransitive) To cause a weapon to discharge a projectile.",
                  "examples": [
                    "They shot at a target.",
                    "He shoots better than he rides."
                  ]
                },
                {
                  "meaning": "(intransitive) To hunt birds, etc. with a gun.",
                  "examples": [
                    "They're coming to shoot with us on Sunday."
                  ]
                },
                {
                  "meaning": "(transitive) To hunt on (a piece of land); to kill game in or on.",
                  "examples": [
                    "Although the estate had been shot previously, there had been no effective keepering and little success with the pheasants released."
                  ]
                },
                {
                  "meaning": "(gambling) To throw dice.",
                  "examples": [
                    "Then, when it was his turn to shoot, he reached out with a completely empty hand and caught the dice the stickman threw to him."
                  ]
                },
                {
                  "meaning": "(transitive, slang) To ejaculate.",
                  "examples": [
                    "After a very short time, he shot his load over the carpet."
                  ]
                },
                {
                  "meaning": "(intransitive, usually, as imperative) To begin to speak.",
                  "examples": [
                    "\"Can I ask you a question?\"   \"Shoot.\""
                  ]
                },
                {
                  "meaning": "(intransitive) To discharge a missile; said of a weapon.",
                  "examples": [
                    "The gun shoots well."
                  ]
                },
                {
                  "meaning": "(transitive, figurative) To dismiss or do away with.",
                  "examples": [
                    "His idea was shot on sight."
                  ]
                },
                {
                  "meaning": "(transitive, intransitive, analogous) To photograph.",
                  "examples": [
                    "He shot the couple in a variety of poses.",
                    "He shot seventeen stills."
                  ]
                },
                {
                  "meaning": "(transitive, intransitive, analogous, film, television) To film.",
                  "examples": [
                    "The film was mostly shot in France."
                  ]
                },
                {
                  "meaning": "(transitive) To push or thrust a bolt quickly; hence, to open a lock.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To move or act quickly or suddenly.",
              "entries": [
                {
                  "meaning": "(intransitive) To move very quickly and suddenly.",
                  "examples": [
                    "After an initial lag, the experimental group's scores shot past the control group's scores in the fourth week."
                  ]
                },
                {
                  "meaning": "To go over or pass quickly through.",
                  "examples": [
                    "shoot the rapids"
                  ]
                },
                {
                  "meaning": "(transitive) To tip (something, especially coal) down a chute.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To penetrate, like a missile; to dart with a piercing sensation.",
                  "examples": [
                    "a shooting pain in my leg"
                  ]
                },
                {
                  "meaning": "(obsolete, intransitive) To feel a quick, darting pain; to throb in pain.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To change form suddenly; especially, to solidify.",
                  "examples": [
                    "The north-east [wind] is loaded with vapor, insomuch, that the salt-makers have found that their crystals would not shoot while that blows."
                  ]
                },
                {
                  "meaning": "To send out or forth, especially with a rapid or sudden motion; to cast with the hand; to hurl; to discharge; to emit.",
                  "examples": []
                },
                {
                  "meaning": "(informal, transitive) To send to someone.",
                  "examples": [
                    "I'll shoot you an email with all the details"
                  ]
                }
              ]
            },
            {
              "group": "(sports) To act or achieve.",
              "entries": [
                {
                  "meaning": "(wrestling) To lunge.",
                  "examples": []
                },
                {
                  "meaning": "(professional wrestling) To deviate from kayfabe, either intentionally or accidentally; to actually connect with unchoreographed fighting blows and maneuvers, or speak one's mind (instead of an agreed script).",
                  "examples": []
                },
                {
                  "meaning": "To make the stated score.",
                  "examples": [
                    "In my round of golf yesterday I shot a 76."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surveying) To measure the distance and direction to (a point).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, colloquial) To inject a drug (such as heroin) intravenously.",
                  "examples": [
                    "Synonym: fix"
                  ]
                }
              ]
            },
            {
              "group": "To develop, move forward.",
              "entries": [
                {
                  "meaning": "To germinate; to bud; to sprout.",
                  "examples": []
                },
                {
                  "meaning": "To grow; to advance.",
                  "examples": [
                    "to shoot up rapidly"
                  ]
                },
                {
                  "meaning": "(nautical) To move ahead by force of momentum, as a sailing vessel when the helm is put hard alee.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To travel or ride on (breaking waves) rowards the shore.",
                  "examples": []
                },
                {
                  "meaning": "To push or thrust forward; to project; to protrude; often with out.",
                  "examples": [
                    "A plant shoots out a bud."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To protrude; to jut; to project; to extend.",
                  "examples": [
                    "The land shoots into a promontory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(carpentry) To plane straight; to fit by planing.",
                  "examples": [
                    "two Pieces of Wood are Shot (that is Plained) or else they are Pared [...] with a Pairing-chissel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To variegate as if by sprinkling or intermingling; to color in spots or patches.W",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) To shoot the moon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) To carry out, or attempt to carry out (an approach to an airport runway).",
                  "examples": [
                    "He tried to shoot the visual approach to runway 12, but the visibility was too low."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To carry out a seismic survey with geophones in an attempt to detect oil.",
                  "examples": [
                    "Once the area is ready to \"shoot,\" the seismic crew places geophones and cables along the line of the profile to be recorded."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Minced oath for shit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}