{
  "word": "scalper",
  "etymologies": [
    {
      "description": [
        "scalp +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scalper (plural scalpers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who scalps, or removes the scalp of another.",
                  "examples": [
                    "Denouncing representations of hostile Indians as vicious scalpers of innocent settlers  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada) One who scalps tickets to popular entertainment events: buying them in advance and then selling them (e.g. online or just outside the venue of the event), often at inflated prices.",
                  "examples": [
                    "Synonym: (UK) ticket tout",
                    "We could see three different scalpers moving through the crowd outside the arena, each muttering the characteristic refrain: “Need any tickets?”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) One who scalps any other item with limited availability.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) A gambler who scalps.",
                  "examples": [
                    "The only sure thing about scalping the Series today is that the scalper is paying the bookie a greater profit because he is making a greater number of bets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A person on an open outcry exchange trading floor who buys and sells rapidly for his or her own account, aiming to buy from a seller and a little later sell to a buyer, making a small profit from the difference (roughly the amount of the bid/offer spread, or less).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine for removing the ends of grain, such as wheat or rye, or for separating the different grades of broken wheat, semolina, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A surgical instrument for scraping carious bones.",
                  "examples": [
                    "Synonym: scalping-iron"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}