{
  "word": "indent",
  "etymologies": [
    {
      "description": [
        "Partly from Middle English indenten (“to dent in”), equivalent to in- +‎ dent (see dent); partly from Middle English indenten, endenten, from Old French endenter (“to provide with teeth”), from en- (“in-, en-”) + dent (“tooth”), from Latin dēns."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "indent (plural indents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cut or notch in the margin of anything, or a recess like a notch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stamp; an impression.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A certificate, or intended certificate, issued by the government of the United States at the close of the Revolution, for the principal or interest of the public debt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A requisition or order for supplies, sent to the commissariat of an army.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "indent (third-person singular simple present indents, present participle indenting, simple past and past participle indented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To notch; to jag; to cut into points like a row of teeth",
                  "examples": [
                    "to indent the edge of paper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be cut, notched, or dented.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dent; to stamp or to press in; to impress",
                  "examples": [
                    "indent a smooth surface with a hammer",
                    "to indent wax with a stamp"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) To cut the two halves of a document in duplicate, using a jagged or wavy line so that each party could demonstrate that their copy was part of the original whole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, reflexive, obsolete) To enter into a binding agreement by means of such documents; to formally commit (to doing something); to contract.",
                  "examples": [
                    "The Polanders indented with Henry, Duke of Anjou, their new-chosen king, to bring with him an hundred families of artificers into Poland."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To engage (someone), originally by means of indented contracts.",
                  "examples": [
                    "to indent a young man to a shoemaker; to indent a servant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) To begin (a line or lines) at a greater or lesser distance from the margin. See indentation, and indention. Normal indent pushes in a line or paragraph. \"Hanging indent\" pulls the line out into the margin.",
                  "examples": [
                    "to indent the first line of a paragraph one em",
                    "to indent the second paragraph two ems more than the first"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To crook or turn; to wind in and out; to zigzag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, India, dated) To make an order upon; to draw upon, as for military stores.",
                  "examples": [
                    "What is the rule observed in India in indenting upon England for military stores ?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}