{
  "word": "gauntlet",
  "etymologies": [
    {
      "description": [
        "From Middle English gauntelett, gantlett, a borrowing from Old French gantelet (“gauntlet worn by a knight in armor, a token of one's personality or person, and symbolizing a challenge”), diminutive of gant (“glove”), a borrowing from Frankish *want (“glove; mitten”) and reinforced by Medieval Latin wantus (“glove”) itself borrowed from the former, from Proto-Germanic *wantuz (“glove; mitten”). Cognate with Dutch want (“mitten; shroud”), German Low German Want (“shroud”), Danish vante (“mitten”), Swedish vante (“glove; mitten”), Faroese vøttur (“glove; mitten”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gauntlet (plural gauntlets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Protective armor for the hands, formerly thrown down as a challenge to combat.",
                  "examples": [
                    "Coordinate term: manifer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long glove covering the wrist.",
                  "examples": [
                    "Solventproof rubber gauntlets under solventproof sleeves closed at the wrists should be worn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A rope on which hammocks or clothes are hung for drying.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An eruption of pellagra on the hands.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Modified, under the influence of etymology 1, from gantlope, from Swedish gatlopp (“passageway”), from Old Swedish gata (“lane”) + lopp (“course”), from löpa (“to run”)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gauntlet (plural gauntlets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Two parallel rows of attackers who strike at a criminal as punishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A simultaneous attack from two or more sides.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any challenging, difficult, or painful ordeal, often one performed for atonement or punishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A temporary convergence of two parallel railroad tracks allowing passage through a narrow opening in each direction without switching.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}