{
  "word": "taut",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Middle English taught [and other forms], Early Middle English tohte, towehte (“strained, stretched; distended; tight; firm”), probably from tough, touth, touʒth, toʒt (“powerful, strong; fierce, violent; not tender, tough; hardy, resilient; steadfast, stout; difficult to do or endure”) and possibly influenced by togen, towen, past participle of ten (“to extend, stretch out; to drag, haul, pull, tow, tug”) (modern English tee (“(obsolete) to draw, lead; to draw away; to go, proceed”)), or directly from its etymon Old English tēon (“to drag, draw, pull”) (ultimately from Proto-Indo-European *dewk- (“to draw, pull”)) The word may be related to thight (“(dialectal) compact, dense; close-fitting, tight”) and tight; and is cognate with Scots tacht, taght (“taut”).",
        "The verb is probably derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "taut (comparative tauter, superlative tautest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) Under tension, like a stretched bowstring, rope, or sail; tight.",
                  "examples": [
                    "Synonyms: nonslack, stretched, tense, tensioned; see also Thesaurus:taut",
                    "Antonyms: untaut; see also Thesaurus:loose"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a body, muscles, etc.) Not flabby; firm, toned; (of a person) having a lean, strong body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of music, writing, etc.) Containing only relevant parts; brief and controlled.",
                  "examples": [
                    "Synonyms: concise, crisp, terse, tight; see also Thesaurus:concise",
                    "Antonyms: see Thesaurus:verbose"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Experiencing anxiety or stress.",
                  "examples": [
                    "Synonyms: nonrelaxed, strained, tense, unrelaxed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, of a sailor, a ship, etc.) Neat and well-disciplined; (by extension) efficient and in order.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(oenology) Strong; uncompromising.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "taut (third-person singular simple present tauts, present participle tauting, simple past and past participle tauted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make taut; to tauten, to tighten.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}