{
  "word": "conglomerate",
  "etymologies": [
    {
      "description": [
        "From Latin conglomerātus, past participle of conglomerāre (“to pile into a heap, to roll together”), from con- (“prefix indicating a being or bringing together of several objects”) (ultimately from Proto-Indo-European *ḱóm (“beside, by, near, with”)) + glomerāre (from glomerō (“to pile into a heap, to make into a ball, glomerate”), from glomus (“ball of thread; ball-shaped mass”), from Proto-Indo-European *gel- (“to form into a ball; ball”))."
      ],
      "adjectives": [
        {
          "description": "conglomerate (comparative more conglomerate, superlative most conglomerate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clustered together into a mass.",
                  "examples": [
                    "conglomerate flowers"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) Composed of fragments of rock, pebbles, or stones cemented together.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "conglomerate (plural conglomerates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cluster of heterogeneous things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) A corporation formed by the combination of several smaller corporations whose activities are unrelated to the corporation's primary activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A rock consisting of gravel or pebbles embedded in a matrix.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "conglomerate (third-person singular simple present conglomerates, present participle conglomerating, simple past and past participle conglomerated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To combine together into a larger mass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, business) To combine together into a larger corporation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}