{
  "word": "joke",
  "etymologies": [
    {
      "description": [
        "From Latin iocus (“joke, jest, pastime”), from Proto-Italic *jokos (“word, (playful?) saying”), from Proto-Indo-European *yokos (“word, utterance”), from ultimate root Proto-Indo-European *yek- (“to speak, utter”) (of which distant cognates include Proto-Celtic *yextis (“language”) (Breton yezh (“language”) and Welsh iaith (“language”)) and German Beichte (“confession”)). Cognate with French jeu, Italian gioco, Portuguese jogo,  Spanish juego, Romanian juca, English Yule, Danish Jule, Norwegian Bokmål Jul, Swedish Jul, and Norwegian Nynorsk jol."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "joke (plural jokes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amusing story.",
                  "examples": [
                    "Or witty joke our airy senses moves / To pleasant laughter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something said or done for amusement, not in seriousness.",
                  "examples": [
                    "It was a joke!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The root cause or main issue, especially an unexpected one",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A laughably worthless thing or person; a sham.",
                  "examples": [
                    "Your effort at cleaning your room is a joke.",
                    "The president was a joke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something that is far easier or far less challenging than expected.",
                  "examples": [
                    "The final exam was a joke."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "joke (third-person singular simple present jokes, present participle joking, simple past and past participle joked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To do or say something for amusement rather than seriously.",
                  "examples": [
                    "I didn’t mean what I said — I was only joking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, followed by with) To dupe in a friendly manner for amusement; to mess with, play with.",
                  "examples": [
                    "Relax, man, I'm just joking with you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To make merry with; to make jokes upon; to rally.",
                  "examples": [
                    "to joke a comrade"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}