{
  "word": "leopard",
  "etymologies": [
    {
      "description": [
        "From Middle English leopard, leopart, lepard, leperd, from Old French leopard (“leopard”), from Late Latin leopardus (“leopon, lipard”) from late Ancient Greek λεόπαρδος (leópardos, “leopon, lipard”), from λέων (léōn, “lion”) + πάρδος (párdos, “pard, male leopard”), from earlier πάρδαλις (párdalis, “leopard”), probably from an unattested Old Persian [Term?] term ancestral to Middle Persian palang, Khwarezmian plyk, Sogdian [script needed] (pwrδnk), Pashto پړانګ‎ (pṛāng). Compare Persian پلنگ‎ (palang) and Sanskrit पृदाकु (pṛdāku, “panther”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leopard (plural leopards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Panthera pardus, a large wild cat with a spotted coat native to Africa and Asia, especially the male of the species (in contrast to leopardess).",
                  "examples": [
                    "During all such cases when we were present they responded by giving repeated alarm calls, even when the leopard was already feeding on a carcass. We wanted to determine whether vervets knew enough about the behavior of leopards to recognize that, even in the absence of a leopard, a carcass in a tree signaled the same potential danger as did a leopard itself."
                  ]
                }
              ]
            },
            {
              "group": "(inexact) A similar-looking, large wild cat named after the leopard.",
              "entries": [
                {
                  "meaning": "The clouded leopard (Neofelis nebulosa), a large wild cat native to Asia.",
                  "examples": []
                },
                {
                  "meaning": "The snow leopard (Panthera uncia), a large wild cat native to Asia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A lion passant guardant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various nymphalid butterflies of the genus Phalanta, having black markings on an orange base.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}