{
  "word": "banana",
  "etymologies": [
    {
      "description": [
        "From Wolof banaana, via Spanish or Portuguese, of unknown origin, but potentially from Arabic بَنَان‎ (banān, “fingertip”).",
        "In reference to well-assimilated East Asians, derived from the fruit's foreign origins, and the slur that they are \"yellow (Asian) on the outside, white (influenced by Western culture) on the inside\"."
      ],
      "adjectives": [
        {
          "description": "banana (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Curved like a banana, especially of a ball in flight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "banana (countable and uncountable, plural bananas)",
          "definitionGroups": [
            {
              "group": "An elongated curved tropical fruit of a banana plant, which grows in bunches and has a creamy flesh and a smooth skin.",
              "entries": [
                {
                  "meaning": "(Canada, US, UK, Ireland) In particular, the sweet, yellow fruit of the Cavendish banana cultivar, which may be eaten raw, as distinct from e.g. a plantain for cooking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tropical tree-like plant which bears clusters of bananas, a plant of the genus Musa (but sometimes also including plants from Ensete), which has large, elongated leaves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A yellow colour, like that of a banana's skin.",
                  "examples": [
                    "banana:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, ethnic slur) A person of East Asian descent, especially an ethnic Chinese from a Western country who does not speak Chinese and only speaks English, considered to have overly assimilated and to be subservient to white authority, an East Asian race traitor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The penis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A banana kick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nuclear physics) A banana equivalent dose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer science, colloquial) A catamorphism (from the use of banana brackets in the notation).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}