{
  "word": "mudlark",
  "etymologies": [
    {
      "description": [
        "From mud +‎ lark."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mudlark (plural mudlarks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, now rare) A pig; pork. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, chiefly historical) One who scavenges in river or harbor mud for items of value, especially in London. [from 18th c.]",
                  "examples": [
                    "She removes only what the water ‘delivers’ to her – items she can see lying on the surface. Unlike some other mudlarks, she does not dig for finds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A child who plays in the mud; a child that spends most of its time in the streets, a street urchin. [from 19th c.]",
                  "examples": [
                    "the children were nothing like inert: a large population of junior mudlarks, so long unwashed that you could hardly make them out, climbed among the ruins, cheerfully playing the games that all children play – pushing wheels with sticks, flipping rusty lids and bottle caps in makeshift tiddlywinks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A soldier of the Royal Engineers. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, regional) Any of various birds that are found in muddy places or build their nests with mud, especially Anthus petrosus and Alauda arvensis. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) The Grallina cyanoleuca that builds its nest with mud into a bowl-like shape. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A racehorse that performs well on muddy or wet tracks. [from 20th c.]",
                  "examples": [
                    "Synonym: mudder"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mudlark (third-person singular simple present mudlarks, present participle mudlarking, simple past and past participle mudlarked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To scavenge in river or harbor mud for items of value.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}