{
  "word": "beer",
  "etymologies": [
    {
      "description": [
        "From Middle English bere, from Old English bēor (“beer”) (Oxford OED notes: \"rare, except in poetry\"), from Proto-West Germanic *beuʀ, from Proto-Germanic *beuzą (“beer”) (putatively from Proto-Indo-European *bʰeusóm), meaning “brewer's yeast”.",
        "However, also see the \"beer\" entry on OED (viz.), which links a connection to Vulgar Latin *biber (“a drink, beverage”), from Latin bibere (“to drink”). Samuel Johnson in his famous 18th-century A Dictionary of the English Language guessed it was from (unattested) Welsh *bîr; he distinguished it in his time from ale — the ancient usual word — by beer being older-aged and/or smaller.",
        "Cognate with Saterland Frisian Bjoor, West Frisian bier, German Low German Beer, Dutch bier, German Bier, Icelandic bjór (“beer”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "beer (countable and uncountable, plural beers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) An alcoholic drink fermented from starch material, commonly barley malt; often with hops or some other substance (like gruit) to impart a bitter flavor.",
                  "examples": [
                    "Synonyms: see Thesaurus:beer",
                    "Beer is brewed all over the world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A fermented extract of the roots and other parts of various plants, as spruce, ginger, sassafras, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A solution produced by steeping plant materials in water or another fluid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A glass, bottle, or can of any of the above beverages.",
                  "examples": [
                    "I bought a few beers from the shop for the party.",
                    "Can I buy you a beer?",
                    "I'd like two beers and a glass of white wine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A variety of the above beverages.",
                  "examples": [
                    "Pilsner is one of the most commonly served beers in Europe.",
                    "I haven't tried this beer before."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "beer (third-person singular simple present beers, present participle beering, simple past and past participle beered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, transitive) To give beer to (someone)",
                  "examples": [
                    "No doubt he then can feed us, wine us, beer us, And cook us something that can warm and cheer us."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English beere, equivalent to be +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "beer (plural beers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard) One who is or exists.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}