{
  "word": "around",
  "etymologies": [
    {
      "description": [
        "From Middle English around, arounde, from a- (from Old English a- (“on, at”)) + Middle English round (“circle, round”) borrowed from French, equivalent to a- +‎ round. Cognate with Scots aroond, aroon (“around”). Displaced earlier Middle English umbe, embe (“around”) (from Old English ymbe (“around”)). See umbe."
      ],
      "adjectives": [
        {
          "description": "around (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, with the verb \"to be\") Present in the vicinity.",
                  "examples": [
                    "Is Clare around today?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, with the verb \"to be\") Alive; existing.",
                  "examples": [
                    "The record store on Main Street? Yes, it's still around.",
                    "\"How is old Bob? I heard that his health is failing.\"  \"Oh, he's still around. He's feeling better now.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "around (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "So as to form a circle or trace a circular path, or approximation thereof.",
                  "examples": [
                    "High above, vultures circled around."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "So as to surround or be near.",
                  "examples": [
                    "Everybody please gather around.",
                    "There isn't another house for miles around."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Nearly; approximately; about.",
                  "examples": [
                    "Around a thousand people attended.",
                    "An adult elephant weighs around five tons."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "From place to place.",
                  "examples": [
                    "There are rumors going around that the company is bankrupt.",
                    "Look around and see what you find.",
                    "We moved the furniture around in the living room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "From one state or condition to an opposite or very different one; with a metaphorical change in direction; bringing about awareness or agreement.",
                  "examples": [
                    "The team wasn't doing well, but the new coach really turned things around.",
                    "He used to stay up late but his new girlfriend changed that around.",
                    "The patient was unconscious but the doctor brought him around quickly. (see bring around, come around)",
                    "I didn't think he would ever like the new design, but eventually we brought him around. (see bring around, come around)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with turn, spin, etc.) So as to partially or completely rotate; so as to face in the opposite direction.",
                  "examples": [
                    "Turn around at the end of this street.",
                    "She spun around a few times."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used with verbs to indicate repeated or continuous action, or in numerous locations or with numerous people.",
                  "examples": [
                    "I asked around, and no-one really liked it.",
                    "Shopping around can get you a better deal.",
                    "When are you going to stop whoring around, find a nice girl, and give us grandchildren?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used with certain verbs to suggest unproductive activity.",
                  "examples": [
                    "sit around, mess around, loaf around"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [
        {
          "description": "around",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Forming a circle or closed curve containing (something).",
                  "examples": [
                    "Synonym: (obsolete) environ",
                    "She wore a gold chain around her neck.",
                    "I planted a row of lilies around the statue.",
                    "The jackals began to gather around the carcass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of abstract things) Centred upon; surrounding.",
                  "examples": [
                    "Synonym: (obsolete) environ",
                    "There has been a lot of controversy around the handling of personal information."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Following the perimeter of a specified area and returning to the starting point.",
                  "examples": [
                    "We walked around the football field.",
                    "She went around the track fifty times."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Following a path which curves near an object, with the object on the inside of the curve.",
                  "examples": [
                    "The road took a brief detour around the large rock formation, then went straight on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Near; in the vicinity of.",
                  "examples": [
                    "I left my keys somewhere around here.",
                    "I left the house around 10 this morning.",
                    "I don't want you around me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "At or to various places within.",
                  "examples": [
                    "The pages from the notebook were scattered around the room.",
                    "Those teenagers like to hang around the mall.",
                    "She went around the office and got everyone to sign the card."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}