{
  "word": "origin",
  "etymologies": [
    {
      "description": [
        "From Middle English origine, origyne, from Old French origine, orine, ourine, from Latin origo (“beginning, source, birth, origin”), from orior (“to rise”); see orient. Doublet of origo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "origin (plural origins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The beginning of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The source of a river, information, goods, etc.",
                  "examples": [
                    "It is clear that the origin of the truth would be an admirable criterion of this sort, if only the various origins could be discriminated from one another from this point of view, and the history of dogmatic opinion shows that origin has always been a favorite test. Origin in immediate intuition; origin in pontifical authority; origin in supernatural revelation, as by vision, hearing, or unaccountable impression; origin in direct possession by a higher spirit, expressing itself in prophecy and warning; origin in automatic utterance generally,—these origins have been stock warrants for the truth of one opinion after another which we find represented in religious history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The point at which the axes of a coordinate system intersect.",
                  "examples": [
                    "Synonym: zero vector"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The proximal end of attachment of a muscle to a bone that will not be moved by the action of that muscle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartography) An arbitrary point on Earth's surface, chosen as the zero for a system of coordinates.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) Ancestry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}