{
  "word": "bisexual",
  "etymologies": [
    {
      "description": [
        "From bi- +‎ -sexual. Attested since 1792 as a synonym in botany for \"hermaphroditic\" (\"having male and female parts\"). First used of sexuality in Richard von Krafft-Ebing's 1886 Psychopathia Sexualis (in German) and Charles Gilbert Chaddock's 1892 English translation thereof, due to the theory that people were naturally attracted to the opposite sex and so the brain or mind of a person attracted to \"both\" sexes (or to the same sex) must be partly of another sex and thus \"hermaphroditic\"."
      ],
      "adjectives": [
        {
          "description": "bisexual (comparative more bisexual, superlative most bisexual)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of humans or other animals) Sexually attracted to both men and women (by a narrow definition) or to people of multiple or any genders (by a broad definition; compare pansexual).",
                  "examples": [
                    "Synonyms: (slang) AC/DC, (jocular) ambidextrous, (colloquial) bi, omnifutuent",
                    "Antonym: monosexual"
                  ]
                }
              ]
            },
            {
              "group": "(chiefly botany) Having both male and female parts, characteristics, or functions.",
              "entries": [
                {
                  "meaning": "(botany) Of flowers: having both pollen and seeds.",
                  "examples": []
                },
                {
                  "meaning": "(botany) Of sporophytes: having both male and female organs.",
                  "examples": []
                },
                {
                  "meaning": "(botany) Of gametophytes: producing both eggs and sperm.",
                  "examples": []
                },
                {
                  "meaning": "(botany) Of fungi: producing both the \"female\" ascogonium and the \"male\" antheridium.",
                  "examples": []
                },
                {
                  "meaning": "(rare) Hermaphroditic/intersex, being both male and female, or alternating between being male and being female.",
                  "examples": [
                    "Midrash and Zohar present Adam as hermaphroditic or bisexual."
                  ]
                },
                {
                  "meaning": "Androgynous.",
                  "examples": [
                    "And although Stevens introduces Nanzia Nunzio as a woman, the inflections of the bisexual name and the symbolism implicit in the messenger's characteristics suggest that the \"contemplated spouse\" is something more than a woman."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly biology) Having two distinct sexes, male and female (as contrasted with unisexual or hermaphroditic).",
                  "examples": [
                    "It is probable, therefore, that hermaphroditism must be regarded as a variation from an earlier condition in which the sexes were separate, and that the hermaphrodites which occasionally appear in normally bisexual species are produced by variations occurring sporadically in the same direction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly biology) Involving two sexes (particularly with regard to reproduction; contrast parthenogenetic or asexual).",
                  "examples": [
                    "[…]  where the parthenogenetic and bisexual generations do not differ in any character except their manner of reproduction […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bisexual (plural bisexuals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is bisexual.",
                  "examples": [
                    "Several chapters are devoted to the investigations of the origins and influences prevalent in the life of a bisexual with the latter portion of the book devoted to three extensive in-depth interviews with three bisexuals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, rare) A plant or fungus, or part thereof, which is bisexual.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly biology) An organism (that is, a species) which has male and female sexes.",
                  "examples": [
                    "The direct way to solve this dilemma is to study the inheritance of some specific features of genomic DNA of bisexual species by the genome of unisexual species . It seems possible to study this if the recent bisexuals resemble their ancestral  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}