{
  "word": "chin",
  "etymologies": [
    {
      "description": [
        "From Middle English chyn, from Old English ċinn (“chin”), from Proto-Germanic *kinnuz (“chin”), from Proto-Indo-European *ǵénus (“chin, jaw”). Compare West Frisian/Dutch kin, Low German/German Kinn, Danish kind, Icelandic kinn, Welsh gen, Latin gena, Tocharian A śanwem, Ancient Greek γένυς (génus, “jaw”), Armenian ծնոտ (cnot), Persian چانه‎ (čâne), Sanskrit हनु (hánu). Doublet of gena."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chin (plural chins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bottom of a face, (specifically) the typically jutting jawline below the mouth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, US) Talk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain) A lie, a falsehood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain) A person of the upper class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing, uncountable) The ability to withstand being punched in the chin without being knocked out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The lower part of the front of an aircraft, below the nose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bottom part of a mobile phone, below the screen.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chin (third-person singular simple present chins, present participle chinning, simple past and past participle chinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated, intransitive) To talk.",
                  "examples": [
                    "“I reckon you can explain, Mrs. Peabody.”  […]  “An’ I reckon that newcomer you’ve been chinning with could explain if he had a mind to.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated, transitive) To talk to or with (someone).",
                  "examples": [
                    "“Been up chinning your sporting editor, Ragsy Hurd.  […] ”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, intransitive) To perform a chin-up (exercise in which one lifts one's own weight while hanging from a bar).",
                  "examples": [
                    "It is worth noting that on the eighth day he was strong enough to “chin” himself six times in succession, though previous to the fasting treatment he had never in his life been able to do this more than once or twice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, transitive) To punch or hit (someone)'s chin (part of the body).",
                  "examples": [
                    "He told me once that he used to be scared to death every time he started in a hard game for fear he’d get badly injured. Said it wasn’t until someone had jabbed him in the nose or ‘chinned’ him that he forgot to be scared."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put or hold (a musical instrument) up to one's chin.",
                  "examples": [
                    "Conspicuous in the front rank of “the music” was Joe Lippett, chinning his fife  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To turn on or operate (a device) using one's chin; to select (a particular setting) using one's chin.",
                  "examples": [
                    "I was too tired to argue; I chinned the valve three or four times, felt a blast blistering my face."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put one's chin on (something).",
                  "examples": [
                    "[…]  she elbowed the table and chinned her hand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To indicate or point toward (someone or something) with one's chin.",
                  "examples": [
                    "But you don’t love him, said Madame Sonia with understanding. Do you love this one? Madame Sonia chinned the American."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening of chinchilla."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chin (plural chins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A chinchilla.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}