{
  "word": "rantipole",
  "etymologies": [
    {
      "description": [
        "From ranty and pole, poll (“head”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rantipole (plural rantipoles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unruly, rude young person.",
                  "examples": [
                    "Tom was to be sure, what is called a good boy; he never soiled his clothes, as I did. I was always considered as a rantipole, for whom anything was good enough. But when I saw my brother tricked out in new clothes, and his old duds covering me like a scarecrow, I appeal to any honourable mind whether it was in human nature to feel otherwise than I did, without possessing an angelic disposition, to which I never pretended; and I fairly own that I did shed not one-fiftieth part so many tears over Tom’s grave as I did over his dirty pantaloons, when forced to put them on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rakish person.",
                  "examples": [
                    "Your modern Rantipole, then, is of high Birth, or considerable Fortune, or great Beauty, either of which may entitle her to do that which others are ashamed of, who have not those superb Qualifications, and enable her to reverse the true Estimation of Things, and value herself upon being good for nothing.A young Rantipole, as soon as let out of the Cage, most commonly enters the Order, and opens her first Scene of Life with the Choice of a Gallant, whom she reizes egregiously for a Number of Years, and then marries and torments him without Mercy."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rantipole (third-person singular simple present rantipoles, present participle rantipoling, simple past and past participle rantipoled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act like a rantipole.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}