{
  "word": "porpoise",
  "etymologies": [
    {
      "description": [
        "From Middle English porpeys, purpeys, borrowed from Anglo-Norman porpeis, purpeis, Old French pourpois, porpois, pourpais, porpeis (“porpoise”), from Vulgar Latin *porcopiscis (“porpoise”, literally “pig-fish”), from Latin porcus (“pig”) + piscis (“fish”). Compare (in transposed order) obsolete Italian pesce porco and Portuguese peixe porco; also Latin porcus marinus (“sea hog”), akin in formation to German Meerschwein, English mereswine. More at mereswine."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "porpoise (plural porpoises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small cetacean of the family Phocoenidae, related to dolphins and whales.",
                  "examples": [
                    "Synonyms: garfish, mereswine, sea hog, sea pig, seaswine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, imprecisely) Any small dolphin.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "porpoise (third-person singular simple present porpoises, present participle porpoising, simple past and past participle porpoised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Said of an air-breathing aquatic animal such as a porpoise or penguin: To repeatedly jump out of the water to take a breath and dive back in a continuous motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Said of an aircraft: to make a series of plunges when taking off or landing; or of a watercraft: to successively plunge up and down in the water.",
                  "examples": [
                    "Synonym: (of an aircraft) balloon"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}