{
  "word": "knuckle",
  "etymologies": [
    {
      "description": [
        "From Middle English knokel (“finger joint”), from Old English cnucel (“the juncture of two bones; knuckle; joint”), from Proto-West Germanic *knukil, from Proto-Germanic *knukilaz (“knuckle, knot, bump”), as *knukô (“bone, joint”) +‎ *-ilaz (diminutive suffix). Cognate with Dutch knokkel (“knuckle”), Low German Knökel (“knuckle”), German Knöchel (“ankle, knuckle”), Old Norse knykill."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "knuckle (plural knuckles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the joints between the phalanges of the fingers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A mechanical joint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cut of meat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, billiards, snooker, pool) The curved part of the cushion at the entrance to the pockets on a cue sports table.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The kneejoint of a quadruped, especially of a calf; formerly used of the kneejoint of a human being.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The joint of a plant.",
                  "examples": [
                    "In the West Indies there are found, even in sandy deserts and very dry places, large canes, which at every joint or knuckle yield a good supply of fresh water"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shipbuilding) A convex portion of a vessel's figure where a sudden change of shape occurs, as in a canal boat, where a nearly vertical side joins a nearly flat bottom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contrivance, usually of brass or iron, and furnished with points, worn to protect the hand, to add force to a blow, and to disfigure the person struck; a knuckle duster.",
                  "examples": [
                    "brass knuckles"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(skiing, snowboarding) The rounded point where a flat changes to a slope on a piste.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "knuckle (third-person singular simple present knuckles, present participle knuckling, simple past and past participle knuckled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply pressure, or rub or massage with one's knuckles.",
                  "examples": [
                    "He knuckled the sleep from his eyes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To strike or punch.",
                  "examples": [
                    "I could feel my big toe snap, but as he's gone down on his good knee and half swung round I knuckled him in the kidney as hard as I could hit. He's gone all the way down, so I dropped my 19 stone into the middle of his back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bend the fingers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To touch one's forehead as a mark of respect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To yield.",
                  "examples": [
                    "Synonym: knuckle under"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snowboarding, skiing) To land on the knuckle of a curve of a slope, after a jump off a ramp that precedes the slope.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}