{
  "word": "monarchy",
  "etymologies": [
    {
      "description": [
        "From Old French monarchie, from Late Latin monarchia, from Ancient Greek μοναρχία (monarkhía), from μόνος (mónos, “only”) + ἀρχή (arkhḗ, “power, authority”). Surface analysis: mon- (“one”, “single”) +‎ -archy (“rule”, “command”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "monarchy (countable and uncountable, plural monarchies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A government in which sovereignty is embodied within a single, today usually hereditary head of state (whether as a figurehead or as a powerful ruler).",
                  "examples": [
                    "An absolute monarchy is a monarchy where the monarch is legally the ultimate authority in all temporal matters.",
                    "A constitutional monarchy is a monarchy in which the monarch's power is legally constrained, ranging from where minor concessions have been made to appease certain factions to where the monarch is a figurehead with all real power in the hands of a legislative body."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The territory ruled over by a monarch; a kingdom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A form of government where sovereignty is embodied by a single ruler in a state and his high aristocracy representing their separate divided lands within the state and their low aristocracy representing their separate divided fiefs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "States based on a system of governance headed by a king or a queen.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}