{
  "word": "sanction",
  "etymologies": [
    {
      "description": [
        "From Middle French sanction, from Latin sanctio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sanction (countable and uncountable, plural sanctions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An approval, by an authority, generally one that makes something valid.",
                  "examples": [
                    "The whalers had been operating in the contested waters off the island with sanction from the Japanese government."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A penalty, punishment, or some coercive measure, intended to ensure compliance; especially one adopted by several nations, or by an international body.",
                  "examples": [
                    "The United States enacted a new round of sanctions against the apartheid regime of South Africa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A law, treaty, or contract, or a clause within a law, treaty, or contract, specifying any of the above.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sanction (third-person singular simple present sanctions, present participle sanctioning, simple past and past participle sanctioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ratify; to make valid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give official authorization or approval to; to countenance.",
                  "examples": [
                    "Many of the most earnest Protestants were business men, to whom lending money at interest was essential. Consequently first Calvin, and then other Protestant divines, sanctioned interest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To penalize (a state etc.) with sanctions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}