{
  "word": "veil",
  "etymologies": [
    {
      "description": [
        "From Middle English veil, veyl, from Anglo-Norman and Old Northern French veil (“sail, veil, shroud”) (Francien Old French voil, French voile), Latin vēlum (“cloth, covering”). Displaced Middle English scleire, scleyre, sleyre, slyre (“veil”) (compare German Schleier). Doublet of velum and voile."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "veil (plural veils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something hung up or spread out to hide or protect the face, or hide an object from view; usually of gauze, crepe, or similar diaphanous material.",
                  "examples": [
                    "The veil of the temple was rent in twain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Anything that partially obscures a clear view.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cover; disguise; a mask; a pretense.",
                  "examples": [
                    "Beckett complains that \"in the forest of symbols\" there is never quiet, and longs to break through the veil of language to silence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A covering for a person or thing; as, a caul (especially over the head)",
                  "examples": [
                    "a nun's veil",
                    "a paten veil",
                    "an altar veil"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) The calyptra of mosses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) velum (A circular membrane round the cap of a medusa).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mycology) A thin layer of tissue which is attached to or covers a mushroom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mycology) A membrane connecting the margin of the pileus of a mushroom with the stalk; a velum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An obscuration of the clearness of the tones in pronunciation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, parapsychology) That which separates the living and the spirit world.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "veil (third-person singular simple present veils, present participle veiling, simple past and past participle veiled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dress in, or decorate with, a veil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To conceal as with a veil.",
                  "examples": [
                    "The forest fire was veiled by smoke, but I could hear it clearly."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}