{
  "word": "harem",
  "etymologies": [
    {
      "description": [
        "Borrowed from Ottoman Turkish حرم‎ (harem) Turkish harem, from Arabic حَرَم‎ (ḥaram, “something prohibited; sanctuary, women”); and later also from حَرِيم‎ (ḥarīm) with same meaning, both from حَرُمَ‎ (ḥaruma, “be forbidden or unlawful”). Doublet of haram."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "harem (plural harems)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The private section of an Arab household, traditionally forbidden to male strangers. [1841]",
                  "examples": [
                    "\"In the room next to her own, lived the harem of a merchant who had just arrived from Constantinople with merchandise. It consisted of his wife, children, and two female slaves, who being well off in their circumstances, enjoyed the comforts and conveniences of life, and eat and drank unsparingly every day.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of someone's girlfriends, wives and/or concubines in a polygamous household.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of female animals (cows) herded and controlled by a male animal (bull) of that species for breeding purposes. Such behaviour is exhibited by bovids including cattle and buffalo as well as moose, elephants, seals, sea lions, baboons, and elephant seals.[2006]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) A group of female birds mated to or associated with a breeding male.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Any significant number of women together as a group; a bevy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A genre of anime and manga in which a man is the love interest of three or more women.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}