{
  "word": "swirl",
  "etymologies": [
    {
      "description": [
        "From Middle English swirlen (“to eddy, swirl”), probably from Old Norse *svirla (“to swirl”), a frequentative form of Old Norse sverra (“to swing, twirl”). Cognate with Scots swirl, sworl (“to eddy, swirl”), Norwegian Nynorsk svirla (“to whirl around; swirl”), Swedish sorla (“to murmur, buzz”), Dutch zwirrelen (“to swirl”). Compare also West Frisian swiere (“to reel, whirl”), Dutch zwieren (“to reel, swing around”), German Low German swirren (“to whizz, whirl or buzz around”), German schwirren (“to whirr, whizz, buzz”), Swedish svirra (“to whirr about, buzz, hum”), Danish svirre (“to whizz, whirr”). Related to English swarm."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swirl (plural swirls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A whirling eddy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A twist or coil of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) The upward rushing of a fish through the water to take the bait.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, dated) Interracial mingling (e.g. dating, sex, marriage, etc.).",
                  "examples": [
                    "She told that white boy she wasn't down with the swirl and to take himself a hike."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swirl (third-person singular simple present swirls, present participle swirling, simple past and past participle swirled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To twist or whirl, as an eddy.",
                  "examples": [
                    "I swirled my brush around in the paint."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be arranged in a twist, spiral or whorl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To circulate.",
                  "examples": [
                    "Mr. Cameron had a respite Thursday from the negative chatter swirling around him when he appeared outside 10 Downing Street to denounce the murder a day before of a British soldier on a London street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, dated) To mingle interracially.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}