{
  "word": "profession",
  "etymologies": [
    {
      "description": [
        "From Middle English professioun, from Anglo-Norman professioun, Old French profession (“declaration of faith, religious vows, occupation”), from Latin professiō (“avowal, public declaration”), from the participle stem of profitērī (“to profess”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "profession (plural professions)",
          "definitionGroups": [
            {
              "group": "Declaration of faith.",
              "entries": [
                {
                  "meaning": "(religion) A promise or vow made on entering a religious order. [from 12th c.]",
                  "examples": [
                    "She died only a few years after her profession."
                  ]
                },
                {
                  "meaning": "The declaration of belief in the principles of a religion; hence, one's faith or religion. [from 16th c.]",
                  "examples": [
                    "I congratulate you upon the wisdom that withheld you from entering yourself a member of the Protestant Association  […]  it is likely to bring an odium upon the profession they make, that will not soon be forgotten."
                  ]
                },
                {
                  "meaning": "Any declaration of belief, faith or one's opinion, whether genuine or (as now often implied) pretended. [from 16th c.]",
                  "examples": [
                    "Despite his continued professions of innocence, the court eventually sentenced him to five years."
                  ]
                }
              ]
            },
            {
              "group": "Professional occupation.",
              "entries": [
                {
                  "meaning": "An occupation, trade, craft, or activity in which one has a professed expertise in a particular area; a job, especially one requiring a high level of skill or training. [from 15th c.]",
                  "examples": [
                    "My father was a barrister by profession."
                  ]
                },
                {
                  "meaning": "(collective) The practitioners of such an occupation collectively. [from 17th c.]",
                  "examples": [
                    "His conduct is against the established practices of the legal profession."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}