{
  "word": "element",
  "etymologies": [
    {
      "description": [
        "From Middle English element, from Old French element, from Latin elementum (“a first principle, element, rudiment”) (see further etymology there)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "element (plural elements)",
          "definitionGroups": [
            {
              "group": "One of the simplest or essential parts or principles of which anything consists, or upon which the constitution or fundamental powers of anything are based.",
              "entries": [
                {
                  "meaning": "(chemistry) Any one of the simplest chemical substances that cannot be decomposed in a chemical reaction or by any chemical means and made up of atoms all having the same number of protons.",
                  "examples": [
                    "Synonyms: chemical element, (rare, nonstandard) firststuff"
                  ]
                },
                {
                  "meaning": "One of the four basic building blocks of matter in theories of ancient philosophers and alchemists: water, earth, fire, and air.",
                  "examples": []
                },
                {
                  "meaning": "(usually in the plural) A basic, simple substance out of which something is made, raw material.",
                  "examples": []
                },
                {
                  "meaning": "(law) A required aspect or component of a cause of action. A deed is regarded as a violation of law only if each element can be proved.",
                  "examples": []
                },
                {
                  "meaning": "(set theory) One of the objects in a set.",
                  "examples": [
                    "Synonym: member"
                  ]
                },
                {
                  "meaning": "(mathematics) One of the entries of a matrix.",
                  "examples": []
                },
                {
                  "meaning": "Any of the teeth of a zip fastener.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small part of the whole.",
                  "examples": [
                    "an element of the picture"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small but present amount of a quality, a hint.",
                  "examples": [
                    "an element of doubt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A factor, one of the conditions contributing to a result.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The sky.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any one of the heavenly spheres believed to carry the celestial bodies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural only, with \"the\") Atmospheric forces such as strong winds and rains.",
                  "examples": [
                    "exposed to the elements"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place or state of being that an individual or object is best suited to.",
                  "examples": [
                    "to be in one's element"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, usually in the plural) The bread and wine taken at Holy Communion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people within a larger group having a particular common characteristic.",
                  "examples": [
                    "You sometimes find the hooligan element at football matches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural only) The basic principles of a field of knowledge, basics, fundamentals, rudiments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A component in electrical equipment, often in the form of a coil, having a high resistance, thereby generating heat when a current is passed through it.",
                  "examples": [
                    "The element in this electric kettle can heat the water in under a minute."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) An infinitesimal interval of a quantity, a differential.",
                  "examples": [
                    "The element of area in Cartesian coordinates is dx dy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) An orbital element; one of the parameters needed to uniquely specify a particular orbit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) One of the conceptual objects in a markup language, usually represented in text by tags.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "element (third-person singular simple present elements, present participle elementing, simple past and past participle elemented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To compound of elements.",
                  "examples": [
                    "those things which elemented [love]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To constitute and be the elements of.",
                  "examples": [
                    "His very soul was elemented of nothing but sadness."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}