{
  "word": "gear",
  "etymologies": [
    {
      "description": [
        "From Middle English gere, a borrowing from Old Norse gervi, from Proto-Germanic *garwijaną (“to prepare”). See also adjective yare, yar from the same root via Old English."
      ],
      "adjectives": [
        {
          "description": "gear (comparative more gear, superlative most gear)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Liverpudlian) great or fantastic",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "gear (countable and uncountable, plural gears)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Equipment or paraphernalia, especially that used for an athletic endeavor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clothing; garments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Goods; property; household items.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A wheel with grooves (teeth) engraved on the outer circumference, such that two such devices can interlock and convey motion from one to the other; a gear wheel.",
                  "examples": [
                    "Synonyms: cog, cogwheel, gearwheel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, automotive, cycling) A particular combination or choice of interlocking gears, such that a particular gear ratio is achieved.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, automotive) A configuration of the transmission of a motor car so as to achieve a particular ratio of engine to axle torque.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) Ellipsis of landing gear.",
                  "examples": [
                    "gear-up landing",
                    "Get the gear down quick!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Recreational drugs, including steroids.",
                  "examples": [
                    "\"Have you got any gear? Dominic, have you got any acid?\" Emma kept running her hands nervously through her hair. \"Not LSD, man; that last trip freaked me out.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, archaic) Stuff.",
                  "examples": [
                    "When he was digged up, which was in the presence of the Magistracy of the Town, his body was found entire, not at all putrid, no ill smell about him, saving the mustiness of the grave-Clothes, his joynts limber and flexible, as in those that are alive, his skin only flaccid, but a more fresh grown in the room of it, the wound of his throat gaping, but no gear nor corruption in it; there was also observed a Magical mark in the great toe of his right foot, viz. an Excrescency in the form of a Rose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Business matters; affairs; concern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, UK, dialect) Anything worthless; nonsense; rubbish.",
                  "examples": [
                    "That servant of his that confessed and uttered this gear was an honest man."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gear (third-person singular simple present gears, present participle gearing, simple past and past participle geared)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering, transitive) To provide with gearing; to fit with gears in order to achieve a desired gear ratio.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering, intransitive) To be in, or come into, gear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dress; to put gear on; to harness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with to or toward(s)) To design or devise (something) so as to be suitable (for a particular type of person or a particular purpose).",
                  "examples": [
                    "This shop is not really geared towards people of our age.",
                    "They have geared the hotel mainly at tourists."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) To borrow money in order to invest it in assets.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}