{
  "word": "loo",
  "etymologies": [
    {
      "description": [
        "Clipped form of halloo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "loo (third-person singular simple present loos, present participle looing, simple past and past participle looed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now dialect, used with at, upon or infinitive) To urge on with cries of loo or (figuratively) by other shouting or outcry.",
                  "examples": [
                    "And therefore next uncouple either Hound [sc. George Monck and Prince Rupert],And loo them at two Hares ere one be found."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipped form of lanterloo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loo (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of lanterloo: the card game.",
                  "examples": [
                    "Yet, ladies are seldom at ombre or lue sick."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The penalty paid to the pool in lanterloo for breaking certain rules or failing to take a trick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act that prompts such a penalty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A game of lanterloo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any group of people.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "loo (third-person singular simple present loos, present participle looing, simple past and past participle looed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To beat in the card game lanterloo.",
                  "examples": [
                    "He was seldom indeed without two good trumps, and therefore almost invariably loo'd those who stood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pay a penalty to the pool for breaking certain rules or failing to take a trick in lanterloo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, now dialect) To pay any penalty to any community.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French loup (“wolf; mask, eyemask”). Doublet of wolf."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loo (plural loos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion, obsolete) A half-mask, particularly (historical) those velvet half-masks fashionable in the 17th century as a means of protecting women's complexion from the sun.",
                  "examples": [
                    "Loo Mask. An half Mask."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Hindi उल्का (ulkā), from Sanskrit उल्का (ulkā, “flame”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loo",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) A hot dust-bearing wind found in Bihar, Uttar Pradesh and the Punjab.",
                  "examples": [
                    "It was a pitchy black night, as stifling as a June night can be, and the loo, the red-hot wind from the westward, was booming among the tinder-dry trees and pretending that the rain was on its heels."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain, although usually derived in some way from Waterloo, the site of Wellington's 1815 victory over Napoleon, likely via a pun based on water closet. Other suggested derivations include corruptions of French l'eau (“water”), lieu (“place”), lieux d'aisances (“'places of convenience': a lavatory”), lieu à l'anglaise (“'English place': a British-style lavatory”), bordalou (“a diminutive chamber pot”) or gardez l'eau (“'mind the water'”), via Scots gardyloo, formerly used in Edinburgh while emptying chamber pots out of windows; the supposed use of \"Room 100\" as the lavatory in Continental hotels; a popularisation of lew, a regional corruption of lee (“downwind”), in reference to shepherds' privies or the former use of beakheads on that side of the ship for urination and defecation; or a clipped form of the name of the unpopular 19th-century Countess of Lichfield Lady Harriett Georgiana Louisa Hamilton Anson, who was the subject of an 1867 prank whereby her bedroom's namecard was placed on the door to the lavatory, prompting the other guests to begin speaking of \"going to Lady Louisa\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loo (plural loos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand) A lavatory: a room used for urination and defecation.",
                  "examples": [
                    "I suppose it is unreal because we have been expecting it [sc. World War II] for so long now, and have known that it must be got over before we can go on with our lives. Like in the night when you want to go to the loo and it is miles away down a freezing cold passage and yet you know you have to go down that passage before you can be happy and sleep again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand) A toilet: a fixture used for urination and defecation.",
                  "examples": [
                    "The lack of running water in rural areas often makes Western-style loos hygienic disasters. Suddenly the noncontact squat toilet doesn′t look like such a bad option any more (as long as you roll up your trouser legs)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipped form of lieutenant."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loo (plural loos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A lieutenant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}