{
  "word": "ice",
  "etymologies": [
    {
      "description": [
        "From Middle English is, from Old English īs (“ice”), from Proto-West Germanic *īs, from  Proto-Germanic *īsą  from Proto-Indo-European *h₁eyH-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ice (countable and uncountable, plural ices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Water in frozen (solid) form.",
                  "examples": [
                    "It has always been difficult to explain how ice is formed on the surface of oceans while the temperature of maximum density is lower than that of cogelation, and the observations on this lake were instituted in the hope that they might throw light upon the subject."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, physics, astronomy) Any frozen volatile chemical, such as ammonia or carbon dioxide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, astronomy) Any volatile chemical, such as water, ammonia, or carbon dioxide, not necessarily in solid form, when discussing the composition of e.g. a planet as an ice giant vs a gas giant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A frozen dessert made of fruit juice, water and sugar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, countable, dated) An ice cream.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Any substance having the appearance of ice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) One or more diamonds and jewelry, especially blood diamonds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, drugs) Crystal form of amphetamine-based drugs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, ice hockey) The area where a game of ice hockey is played.",
                  "examples": [
                    "The neighbouring countries have enjoyed many great battles on the ice. They last met for gold at the 1998 world championship, won by Sweden. Three years earlier, Finland bested Sweden for the only world title in its history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Elephant or rhinoceros ivory that has been poached and sold on the black market.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) An artifact that has been smuggled, especially one that is either clear or shiny.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Money paid as a bribe.",
                  "examples": [
                    "Theater operators, theater party agents, playwrights, and others who have ready access to tickets may get in on the “ice” and sometimes the producer is in on it too."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ice (third-person singular simple present ices, present participle icing, simple past and past participle iced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cool with ice, as a beverage.",
                  "examples": [
                    "To treat runner's knee, you need to rest from running or any other high-impact activity, ice the knee, and strengthen the quadriceps through weight training."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become ice; to freeze.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make icy; to freeze.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To murder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with icing (frosting made of sugar and milk or white of egg); to frost; as cakes, tarts, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) To put out a team for a match.",
                  "examples": [
                    "Milton Keynes have yet to ice a team this season"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) To shoot the puck the length of the playing surface, causing a stoppage in play called icing.",
                  "examples": [
                    "If the Bruins ice the puck, the faceoff will be in their own zone."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}