{
  "word": "buffet",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English buffet (“stool”), from Middle French buffet (“side table”), from Old French buffet, of unknown origin. The modern pronunciation is remodelled after modern French buffet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buffet (plural buffets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A counter or sideboard from which food and drinks are served or may be bought.",
                  "examples": [
                    "Synonyms: sideboard, smorgasbord, (obsolete) cupboard"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Food laid out in this way, to which diners serve themselves.",
                  "examples": [
                    "Synonyms: buffet meal, smorgasbord",
                    "We'll be serving supper buffet style."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small low stool; a hassock.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English buffet (“buffet”), from Old French buffet, diminutive of buffe, cognate with Italian buffetto. See buffer, buffoon, and compare German puffen (“to jostle, to hustle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buffet (countable and uncountable, plural buffets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A blow or cuff with or as if with the hand, or by any other solid object or the wind.",
                  "examples": [
                    "Synonyms: blow, (by any solid object) collision, (with the hand) cuff"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, uncountable) The vibration of an aircraft when flying in or approaching a stall, caused by separation of airflow from the aircraft's wings.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English buffeten, from Old French buffeter, from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "buffet (third-person singular simple present buffets, present participle buffeting or buffetting, simple past and past participle buffeted or buffetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike with a buffet; to cuff; to slap.",
                  "examples": [
                    "They spit in his face and buffeted him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To aggressively challenge, denounce, or criticise.",
                  "examples": [
                    "Buffeted by criticism of his policy on Europe, battered by rebellion in the ranks over his bill to legalize same-sex marriage and wounded by the perception that he is supercilious, contemptuous and out of touch with mainstream Conservatism, Mr. Cameron earlier this week took the highly unusual step of sending a mass e-mail (or, as he called it, “a personal note”) to his party’s grass-roots members."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To affect as with blows; to strike repeatedly; to strive with or contend against.",
                  "examples": [
                    "to buffet the billows"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deaden the sound of (bells) by muffling the clapper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}