{
  "word": "underkeep",
  "etymologies": [
    {
      "description": [
        "From under- +‎ keep."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "underkeep (plural underkeeps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An underground reserve.",
                  "examples": [
                    "The earth was swallowing Abascar. \"The Underkeeps caved in.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A keep or storage space located beneath the foundation of a structure; cellar.",
                  "examples": [
                    "[...] located in the bottom of the driving-box cellars (underkeeps), a perforated plate being used between the axle and the cake of grease."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any storage space or reservoir placed below another object.",
                  "examples": [
                    "They have sliding underkeeps of ample oil capacity with pad lubrication and the underkeeps are supplied with oil direct from a mechanical lubricator."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An underkeeper, guardian, or custodian.",
                  "examples": [
                    "[...] rooms taken up by Mr. Newton one of his Mats Gent ushers for the placing of the Kings Mats wardrobe stuffe for the space of three weeks at Newmarkett To Robert Ford underkeep of his Mats House at Newmarkett in considracon of the want [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "underkeep (third-person singular simple present underkeeps, present participle underkeeping, simple past and past participle underkept)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep under or in subjection; subdue; suppress.",
                  "examples": [
                    "It is not economy to overwork or underkeep, or in any wise neglect the farm horse?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep or maintain inadequately or below standard.",
                  "examples": [
                    "Compared to Colva and Benaulim, Palolem 's accommodations are overpriced and underkept — expect to pay Rs200 in season for the privilege of crashing in a charmless double and using a common bathroom outside."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}