{
  "word": "figure",
  "etymologies": [
    {
      "description": [
        "From Middle English figure, borrowed from Old French figure, from Latin figūra (“form, shape, form of a word, a figure of speech, Late Latin a sketch, drawing”), from fingō (“to form, shape, mold, fashion”), from Proto-Indo-European *dʰeyǵʰ- (“to mold, shape, form, knead”). Cognate with Ancient Greek τεῖχος (teîkhos), Sanskrit देग्धि (degdhi), Old English dāg (“dough”). More at dough. Doublet of figura."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "figure (plural figures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drawing or diagram conveying information.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The representation of any form, as by drawing, painting, modelling, carving, embroidering, etc.; especially, a representation of the human body.",
                  "examples": [
                    "a figure in bronze; a figure cut in marble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing representing a certain consciousness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The appearance or impression made by the conduct or career of a person.",
                  "examples": [
                    "He cut a sorry figure standing there in the rain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Distinguished appearance; magnificence; conspicuous representation; splendour; show.",
                  "examples": [
                    "that he may live in figure and indulgence"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A human figure, which dress or corset must fit to; the shape of a human body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A numeral.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number, an amount.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shape.",
                  "examples": [
                    "a geometrical figure, a plane figure, a solid figure"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A visible pattern as in wood or cloth.",
                  "examples": [
                    "The muslin was of a pretty figure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any complex dance moveW.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A figure of speech.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) The form of a syllogism with respect to the relative position of the middle term.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) A horoscope; the diagram of the aspects of the astrological houses.",
                  "examples": [
                    "its quality, like those of all the rest, is determined by its position in the house of the astrological figure"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Any short succession of notes, either as melody or as a group of chords, which produce a single complete and distinct impression.",
                  "examples": [
                    "Here, Beethoven limits the syncopations and modifications of rhythm which are so prominent in the first and third movements, and employs a rapid, busy, and most melodious figure in the Violins, which is irresistible in its gay and brilliant effect […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A form of melody or accompaniment kept up through a strain or passage; a motif; a florid embellishment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "figure (third-person singular simple present figures, present participle figuring, simple past and past participle figured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) To calculate, to solve a mathematical problem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) To come to understand.",
                  "examples": [
                    "I can’t figure if he’s telling the truth or lying."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To think, to assume, to suppose, to reckon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, intransitive) To be reasonable.",
                  "examples": [
                    "It figures that somebody like him would be upset about the situation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To enter into; to be a part of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To represent by a figure, as to form or mould; to make an image of, either palpable or ideal; also, to fashion into a determinate form; to shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To embellish with design; to adorn with figures.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To indicate by numerals.",
                  "examples": [
                    "As through a crystal glass the figured hours are seen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To represent by a metaphor; to signify or symbolize.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To prefigure; to foreshow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To write over or under the bass, as figures or other characters, in order to indicate the accompanying chords.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To embellish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}