{
  "word": "track",
  "etymologies": [
    {
      "description": [
        "From Middle English trak, tracke, from Old French trac (“track of horses, trail, trace”), of uncertain origin. Likely from a Germanic source, either Old Norse traðk (\"a track; path; trodden spot\"; > Icelandic traðk (“a track; path; tread”), Faroese traðk (“track; tracks”), Norwegian tråkke (“to trample”)) or from Middle Dutch trec, *trac, treck (\"line, row, series\"; > Dutch trek (“a draft; feature; trait; groove; expedition”)), German Low German Treck (“a draught; movement; passage; flow”). See tread, trek."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "track (plural tracks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mark left by something that has passed along.",
                  "examples": [
                    "Synonyms: trace, trail, wake",
                    "Follow the track of the ship.",
                    "Can you see any tracks in the snow?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mark or impression left by the foot, either of man or animal.",
                  "examples": [
                    "Synonyms: footprint, impression",
                    "The fox tracks were still visible in the snow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The entire lower surface of the foot; said of birds, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A road or other similar beaten path.",
                  "examples": [
                    "Synonyms: path, road, way",
                    "Follow the track for a hundred metres."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Physical course; way.",
                  "examples": [
                    "Synonyms: course, path, trajectory, way",
                    "Astronomers predicted the track of the comet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A path or course laid out for a race, for exercise, etc.",
                  "examples": [
                    "Synonyms: course, racetrack",
                    "The athletes ran round the track."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The direction and progress of someone or something; path.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(railways) The way or rails along which a train moves.",
                  "examples": [
                    "Synonyms: rails, railway, train tracks, tracks",
                    "They briefly closed the railway to remove debris found on the track."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tract or area, such as of land.",
                  "examples": [
                    "Synonyms: area, parcel, region, tract"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The street, as a prostitute's place of work.",
                  "examples": [
                    "A real pimp is a gentleman, but these are pimps in gorilla suits. They hang around pimps, they have hoes on the track working for them, they may even look like pimps, but they are straight simps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Awareness of something, especially when arising from close monitoring.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) The distance between two opposite wheels on a same axletree.",
                  "examples": [
                    "Synonym: track width"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) Short for caterpillar track.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The pitch.",
                  "examples": [
                    "Synonyms: ground, pitch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sound stored on a record.",
                  "examples": [
                    "Synonym: recording"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The physical track on a record.",
                  "examples": [
                    "Synonym: groove"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A song or other relatively short piece of music, on a record, separated from others by a short silence.",
                  "examples": [
                    "My favourite track on the album is \"Sunshine\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A circular (never-ending) data storage unit on a side of magnetic or optical disk, divided into sectors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, sports) The racing events of track and field; track and field in general.",
                  "examples": [
                    "Synonyms: athletics, track and field",
                    "I'm going to try out for track next week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A themed set of talks within a conference.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion, colloquial) Clipping of trackshoe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "track (third-person singular simple present tracks, present participle tracking, simple past and past participle tracked)",
          "definitionGroups": [
            {
              "group": "To continue over time.",
              "entries": [
                {
                  "meaning": "(transitive) To observe the (measured) state of a person or object over time.",
                  "examples": [
                    "We will track the raven population over the next six months."
                  ]
                },
                {
                  "meaning": "(transitive) To monitor the movement of a person or object.",
                  "examples": [
                    "Agent Miles has been tracking the terrorist since Madrid."
                  ]
                },
                {
                  "meaning": "(transitive) To match the movement or change of a person or object.",
                  "examples": [
                    "My height tracks my father's at my age, so I might end up as tall as him."
                  ]
                },
                {
                  "meaning": "(transitive or intransitive, of a camera) To travel so that a moving object remains in shot.",
                  "examples": [
                    "The camera tracked the ball even as the field of play moved back and forth, keeping the action in shot the entire time."
                  ]
                },
                {
                  "meaning": "(intransitive, chiefly of a storm) To move.",
                  "examples": [
                    "The hurricane tracked further west than expected."
                  ]
                },
                {
                  "meaning": "(transitive) To traverse; to move across.",
                  "examples": [
                    "I've swept o'er the mountain, the forest and fell, / I've played on the rock where the wild chamois dwell; / I have tracked the desert so dreary and rude, / Through the pathless depths of its solitude;  […]"
                  ]
                },
                {
                  "meaning": "(transitive) To tow.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To exhibit good cognitive function.",
                  "examples": [
                    "Is the patient tracking? Does he know where he is?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To follow the tracks of.",
                  "examples": [
                    "My uncle spent all day tracking the deer, whose hoofprints were clear in the mud."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To discover the location of a person or object by following traces.",
                  "examples": [
                    "I tracked Joe to his friend's bedroom, where he had spent the night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make tracks on or to leave in the form of tracks.",
                  "examples": [
                    "In winter, my cat tracks mud all over the house."
                  ]
                }
              ]
            },
            {
              "group": "(transitive or intransitive) To create a musical recording (a track).",
              "entries": [
                {
                  "meaning": "(computing, transitive or intransitive) To create music using tracker software.",
                  "examples": [
                    "At the time, tracking chiptunes (i.e. using trackers) was the fundamental method of chipmusic-making."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial) To make sense; to be consistent with known information",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}