{
  "word": "archaic",
  "etymologies": [
    {
      "description": [
        "From archaism (“ancient or obsolete phrase or expression”) or from French archaïque, ultimately from Ancient Greek ἀρχαϊκός (arkhaïkós, “old-fashioned”), from ἀρχαῖος (arkhaîos, “from the beginning, antiquated, ancient, old”), from ἀρχή (arkhḗ, “beginning, origin”), from ἄρχω (árkhō, “I am first”), from ἄρχω (árkhō, “I begin”), from Proto-Indo-European *h₂ergʰ- (“to begin, rule, command”)."
      ],
      "adjectives": [
        {
          "description": "archaic (comparative more archaic, superlative most archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or characterized by antiquity; old-fashioned, quaint, antiquated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of words) No longer in ordinary use, though still used occasionally to give a sense of antiquity and are still likely to be understood by well-educated speakers and are found in historical texts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) Belonging to the archaic period",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "archaic (plural archaics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology, US, usually capitalized) A general term for the prehistoric period intermediate between the earliest period (‘Paleo-Indian’, ‘Paleo-American’, ‘American‐paleolithic’, &c.) of human presence in the Western Hemisphere, and the most recent prehistoric period (‘Woodland’, etc.).",
                  "examples": [
                    "[...] Archaic Stage [...] the stage of migratory hunting and gathering cultures continuing into environmental conditions approximately those of the present."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(paleoanthropology) (A member of) an archaic variety of Homo sapiens.",
                  "examples": [
                    "[...] prefer the third explanation for the advanced-looking features of Neandertals (Chapter 7) and the Ngandong hominins (Chapter 6), but they have had little to say about the post-Erectine archaics from China."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}