{
  "word": "spoon",
  "etymologies": [
    {
      "description": [
        "From Middle English spoon, spoune, spone, spon (“spoon, chip of wood”), from Old English spōn (“sliver, chip of wood, shaving”), from Proto-West Germanic *spānu, from Proto-Germanic *spēnuz (“chip, flake, shaving”), from Proto-Indo-European *(s)peh₂- (“chip, shaving, log, length of wood”).",
        "Cognate with Scots spun, spon (“spoon, shingle”), West Frisian spoen, Dutch spaan (“chip, flinders”), German Span (“chip, flake, shaving”), Northern Sami spån (“chip, flake”), Faroese spónur (“wood chip; spoon”), Ancient Greek σφήν (sphḗn, “wedge”). Eclipsed non-native Middle English cuculer and coclear (“spoon”) both ultimately borrowed from the Latin.",
        "The \"metaphoric unit of personal energy\" sense was coined by writer and disability advocate Christine Miserandino in 2003 (see spoon theory)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spoon (plural spoons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An implement for eating or serving; a scooped utensil whose long handle is straight, in contrast to a ladle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An implement for stirring food while being prepared; a wooden spoon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A measure that will fit into a spoon; a spoonful.",
                  "examples": [
                    "While Ms. Fly was with Sharon in the kitchen, Sharon asked the defendant for a “spoon of drugs.” Defendant refused and stated that he did not know where drugs could be obtained."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf, archaic) A wooden-headed golf club with moderate loft, similar to the modern three wood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An oar.",
                  "examples": [
                    "To this class college rowing offers no attractions or place, nor are they generally looked upon by the artists of the \"spoons\" as a desirable addition  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A type of metal lure resembling the concave head of a tablespoon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dentistry, informal) A spoon excavator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, slang, archaic) A simpleton, a spooney.",
                  "examples": [
                    "To get all the advantages of being with men of this sort, you must know how to draw your inferences and not be a spoon who takes things literally."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military) A safety handle on a hand grenade, a trigger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A metaphoric unit of finite physical and mental energy available for daily activities, especially in the context of living with chronic illness or disability.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spoon (third-person singular simple present spoons, present participle spooning, simple past and past participle spooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To serve using a spoon; to transfer (something) with a spoon.",
                  "examples": [
                    "Sarah spooned some apple sauce onto her plate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To flirt; to make advances; to court, to interact romantically or amorously.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive, informal, of persons) To lie nestled front-to-back, following the contours of the bodies, in a manner reminiscent of stacked spoons.",
                  "examples": [
                    "(transitive or intransitive, informal, of persons, by extension) To have sex in such a position."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis, golf, croquet) To hit (the ball) weakly, pushing it with a lifting motion, instead of striking with an audible knock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fish with a concave spoon bait.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To catch by fishing with a concave spoon bait.",
                  "examples": [
                    "He had with him all the tackle necessary for spooning pike."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Compare spoom."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "spoon (third-person singular simple present spoons, present participle spooning, simple past and past participle spooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of spoom",
                  "examples": [
                    "We might have spooned before the wind as well as they."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}