{
  "word": "whine",
  "etymologies": [
    {
      "description": [
        "From Middle English whynen, hwinen, whinen, from Old English hwīnan (“to rush, to whizz, to squeal, to whine”), from Proto-West Germanic *hwīnan, from Proto-Germanic *hwīnaną, from Proto-Indo-European *ḱwey- (“to hiss, whistle, whisper”). Cognate with Old Norse hvína, whence Icelandic hvína, Norwegian hvine, Swedish vina, and Danish hvine.",
        "Despite the strong similarity in sound and meaning, not related with German weinen, Dutch wenen, from Proto-Germanic *wainōną (for which see dialectal English ween (“to weep, lament”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whine (plural whines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long-drawn, high-pitched complaining cry or sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A complaint or criticism.",
                  "examples": [
                    "I need to have a quick whine about my boss before we start talking about the holiday."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "whine (third-person singular simple present whines, present participle whining, simple past and past participle whined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To utter a high-pitched cry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a sound resembling such a cry.",
                  "examples": [
                    "The jet engines whined at take off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To complain or protest with a whine or as if with a whine.",
                  "examples": [
                    "Feel awfully about Scott... I always knew he couldn't think—he never could—but he had a marvelous talent and the thing is to use it—not whine in public."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move with a whining sound.",
                  "examples": [
                    "The jet whined into the air.",
                    "The wind whined and moaned through the trees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To utter with the sound of a whine.",
                  "examples": [
                    "The child whined all his complaints.",
                    "Kelly Queen was whining that the boss made him put on his tie."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}