{
  "word": "demur",
  "etymologies": [
    {
      "description": [
        "From Middle English demuren, from Anglo-Norman demorer (French demeurer), from Vulgar Latin demorō, Latin demoror (“to tarry”), from de- + moror (“to delay”).",
        "See alternative etymology in the Anglo-Norman ancestor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "demur (plural demurs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of hesitation as to proceeding; a scruple; also, a suspension of action or decision; a pause, a stop.",
                  "examples": [
                    "Most geologists today would accept such evidence without demur, but it was still ‘fringe’ science when du Toit was publishing."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "demur (third-person singular simple present demurs, present participle demurring, simple past and past participle demurred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To linger; to stay; to tarry",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To delay; to pause; to suspend proceedings or judgment in view of a doubt or difficulty; to hesitate; to put off the determination or conclusion of an affair.",
                  "examples": [
                    "Vpon this rubbe the English Embassadors thought fit to demurre"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To scruple or object; to take exception; to oppose; to balk",
                  "examples": [
                    "I demur to that statement.",
                    "The personnel demurred at the management's new scheme."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, law) To interpose a demurrer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To suspend judgment concerning; to doubt of or hesitate about",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To cause delay to; to put off",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}