{
  "word": "leave",
  "etymologies": [
    {
      "description": [
        "From Middle English leven, from Old English lǣfan (“to leave”), from Proto-West Germanic *laibijan, from Proto-Germanic *laibijaną (“to let stay, leave”), causative of *lībaną (“to stay, remain”), from Proto-Indo-European *leyp- (“to stick; fat”).",
        "Cognate with Old Frisian lēva (“to leave”), Old Saxon lēvian, Old High German leiban (“to leave”), Old Norse leifa (“to leave over”) (whence Icelandic leifa (“to leave food uneaten”)), lifna (“to be left”) (whence Danish levne). More at lave, belive."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "leave (third-person singular simple present leaves, present participle leaving, simple past and past participle left)",
          "definitionGroups": [
            {
              "group": "To have a consequence or remnant.",
              "entries": [
                {
                  "meaning": "(transitive) To cause or allow (something) to remain as available; to refrain from taking (something) away; to stop short of consuming or otherwise depleting (something) entirely.",
                  "examples": [
                    "I left my car at home and took a bus to work.",
                    "The ants did not leave so much as a crumb of bread.",
                    "There's not much food left. We'd better go to the shops."
                  ]
                },
                {
                  "meaning": "(transitive or intransitive, copulative) To cause, to result in.",
                  "examples": [
                    "The lightning left her dazzled for several minutes.",
                    "Infantile paralysis left him lame for the rest of his life.",
                    "She left disappointed."
                  ]
                },
                {
                  "meaning": "(transitive) To put; to place; to deposit; to deliver, with a sense of withdrawing oneself.",
                  "examples": [
                    "Leave your hat in the hall.",
                    "We should leave the legal matters to lawyers.",
                    "I left my sewing and went to the window to watch the falling snow."
                  ]
                }
              ]
            },
            {
              "group": "To depart; to separate from.",
              "entries": [
                {
                  "meaning": "To let be or do without interference.",
                  "examples": [
                    "I left him to his reflections.",
                    "I leave my hearers to judge."
                  ]
                },
                {
                  "meaning": "(transitive) To depart from; to end one's connection or affiliation with.",
                  "examples": [
                    "I left the country and I left my wife."
                  ]
                },
                {
                  "meaning": "(transitive) To end one's membership in (a group); to terminate one's affiliation with (an organization); to stop participating in (a project).",
                  "examples": [
                    "If we were to leave, the economic impact on a number of European countries would be severe."
                  ]
                },
                {
                  "meaning": "(intransitive) To depart; to go away from a certain place or state.",
                  "examples": [
                    "I think you'd better leave."
                  ]
                }
              ]
            },
            {
              "group": "To transfer something.",
              "entries": [
                {
                  "meaning": "(transitive) To transfer possession of after death.",
                  "examples": [
                    "When my father died, he left me the house."
                  ]
                },
                {
                  "meaning": "(transitive) To give (something) to someone; to deliver (something) to a repository; to deposit.",
                  "examples": [
                    "I'll leave the car in the station so you can pick it up there."
                  ]
                },
                {
                  "meaning": "(transitive) To transfer responsibility or attention of (something) (to someone); to stop being concerned with.",
                  "examples": [
                    "Can't we just leave this to the experts?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To remain (behind); to stay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To stop, desist from; to \"leave off\" (+ noun / gerund).",
                  "examples": [
                    "Now leave Complaining, and begin your Tea."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Formed in English by conversion (anthimeria) of the transitive verb leave (“cause or allow to remain available”). Attested since the 19th century, with earliest references to billiards."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leave (plural leaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The action of the batsman not attempting to play at the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards) The arrangement of balls in play that remains after a shot is made (which determines whether the next shooter — who may be either the same player, or an opponent — has good options, or only poor ones).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English leve, from Old English lēaf (“permission, privilege”), from Proto-Germanic *laubō, *laubą (“permission, privilege, favour, worth”), from Proto-Indo-European *lewbʰ- (“to love, hold dear”). Cognate with obsolete German Laube (“permission”), Swedish lov (“permission”), Icelandic leyfi (“permission”). Related to Dutch verlof, German Erlaubnis. See also love."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leave (countable and uncountable, plural leaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Permission to be absent; time away from one's work.",
                  "examples": [
                    "Synonyms: annual leave, holiday; see also Thesaurus:vacation",
                    "I've been given three weeks' leave by my boss."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated or law) Permission.",
                  "examples": [
                    "Synonyms: authorisation, consent",
                    "Might I beg leave to accompany you?",
                    "The applicant now seeks leave to appeal and, if leave be granted, to appeal against these sentences."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Farewell, departure.",
                  "examples": [
                    "I took my leave of the gentleman without a backward glance."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English leven, from Old English līefan (“to allow, grant, concede; believe, trust, confide in”), from Proto-West Germanic *laubijan, from Proto-Germanic *laubijaną (“to allow, praise”), from Proto-Indo-European *lewbʰ- (“to love, hold dear”). Cognate with German lauben (“to allow, believe”), Icelandic leyfa (“to allow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "leave (third-person singular simple present leaves, present participle leaving, simple past and past participle leaved or left)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give leave to; allow; permit; let; grant.",
                  "examples": [
                    "We were not left go to the beach after school except on a weekend."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English leven, from lef (“leaf”). More at leaf."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "leave (third-person singular simple present leaves, present participle leaving, simple past and past participle leaved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare) To produce leaves or foliage.",
                  "examples": [
                    "Each Morn a thousand Roses brings, you say:",
                    "Yes, but where leaves the Rose of Yesterday?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French lever. Compare levy. Compare also Middle English leve, a variant of levy that may have been monosyllabic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "leave (third-person singular simple present leaves, present participle leaving, simple past and past participle leaved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To raise; to levy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}