{
  "word": "sponge",
  "etymologies": [
    {
      "description": [
        "From Old English spunge, taken from Latin spongia, from Ancient Greek σπογγιά (spongiá), related to σπόγγος (spóngos)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sponge (countable and uncountable, plural sponges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any of various marine invertebrates of the phylum Porifera, that have a porous skeleton often of silica.",
                  "examples": [
                    "Synonyms: sea sponge, bath sponge, poriferan, porifer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A piece of porous material used for washing (originally made from the invertebrates, now often made of plastic).",
                  "examples": [
                    "Synonym: bath sponge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A porous material such as sponges consist of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A heavy drinker.",
                  "examples": [
                    "Synonyms: souse, swill-pot; see also Thesaurus:drunkard"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A type of light cake.",
                  "examples": [
                    "Synonym: sponge cake"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, Britain) A type of steamed pudding.",
                  "examples": [
                    "Synonym: sponge pudding"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A person who takes advantage of the generosity of others (abstractly imagined to absorb or soak up the money or efforts of others like a sponge).",
                  "examples": [
                    "Synonyms: freeloader, sponger; see also Thesaurus:scrounger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who readily absorbs ideas.",
                  "examples": [
                    "For this reason, we need to think of our children as sponges of information and watch their sources carefully. We also need to always model appropriate behaviour, as we are a constant source of new information."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A form of contraception that is inserted vaginally; a contraceptive sponge.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Any sponge-like substance.",
              "entries": [
                {
                  "meaning": "(baking) Dough before it is kneaded and formed into loaves, and after it is converted into a light, spongy mass by the agency of the yeast or leaven.",
                  "examples": []
                },
                {
                  "meaning": "Iron from the puddling furnace, in a pasty condition.",
                  "examples": []
                },
                {
                  "meaning": "Iron ore, in masses, reduced but not melted or worked.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mop for cleaning the bore of a cannon after a discharge. It consists of a cylinder of wood, covered with sheepskin with the wool on, or cloth with a heavy looped nap, and having a handle, or staff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The extremity, or point, of a horseshoe, corresponding to the heel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A nuclear power plant worker routinely exposed to radiation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sponge (third-person singular simple present sponges, present participle sponging, simple past and past participle sponged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To take advantage of the kindness of others.",
                  "examples": [
                    "He has been sponging off his friends for a month now."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive with on or upon) To get by imposition; to scrounge.",
                  "examples": [
                    "Synonym: blag"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deprive (somebody) of something by imposition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To clean, soak up, or dab with a sponge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To suck in, or imbibe, like a sponge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wipe out with a sponge, as letters or writing; to efface; to destroy all trace of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, baking) To be converted, as dough, into a light, spongy mass by the agency of yeast or leaven.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marine biology, of dolphins) To use a piece of wild sponge as a tool when foraging for food.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}