{
  "word": "valerian",
  "etymologies": [
    {
      "description": [
        "From Old French valeriane or Medieval Latin valeriāna, a reinterpretation of what is found as German Baldrian after valēre (“to be powerful”) or also the gentilic name Valerius, which is seemingly borrowed in the Dark Age period from the late 6th to early 8th century from Turkic or Proto-Mongolic, when the Pannonian Avars were direct neighbours to the Germans, notably also present in Hungarian bojtorján (“burdock”), ultimately from Proto-Mongolic, reflected as\nMiddle Mongol ᠪᠠᠯᠴᠢᠷᠭᠠᠨ᠎ᠠ (balčirɣan'a, “false hellebore; angelica”), composed as ᠪᠠᠯᠴᠢᠷ (balčir, “infant; young, tender, fresh, rank”) + plant name suffix ᠭᠠᠨᠠ (-ɣana),\nMongolian балчиргана (balčirgana, “false hellebore; angelica”), composed as балчир (balčir, “infant; young, tender, fresh, rank”) + plant name suffix -гана (-gana).",
        "See Ottoman Turkish بالدران‎ (baldıran, “hemlock”) for Turkic cognates."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "valerian (countable and uncountable, plural valerians)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hardy perennial flowering plant, Valeriana officinalis, with heads of sweetly scented pink or white flowers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "More generally, any plant of the genus Valeriana.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The root of Valeriana officinalis, used in herbal medicine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An extract of the dried roots of the Valeriana officinalis used in herbal medicine as a sedative.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}