{
  "word": "fascine",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from French fascine (“bundle of kindling; bundle of branches used to build defences, fill in ditches, etc.; logs arranged horizontally between piles on the banks of a watercourse as an erosion barrier”), from Old French faissine, from Latin fascīna (“bundle of sticks”), from fascis (“bundle of sticks, faggot, fascine; bundle, package; burden, load”) (ultimately from Proto-Indo-European *bʰask- (“band; bundle”)) + -īna (the nominative, vocative, or ablative feminine singular of -īnus (suffix forming nouns)).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fascine (plural fascines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly construction) Originally a cylindrical bundle of small sticks of wood, and now often a bundle of plastic pipes, bound together, and used for strengthening purposes, such as in revetments for riverbanks, and in mats for dams, jetties, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically, military fortification) A similar bundle of sticks of wood or plastic pipes used for filling in ditches for armoured fighting vehicles to drive over, and for making parapets, raising batteries, and strengthening ramparts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, rare) Something which is used for defensive purposes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fascine (third-person singular simple present fascines, present participle fascining, simple past and past participle fascined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, originally military, chiefly New Zealand) To use fascines to build or reinforce (something), or to fill in (a trench, etc.).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}