{
  "word": "color",
  "etymologies": [
    {
      "description": [
        "From Middle English colour, borrowed from Anglo-Norman colur, from Old French colour, color, from Latin color.",
        "Displaced English blee, Middle English blee (“color”), from Old English blēo. Also partially replaced Old English hīew (“color”) and its descendants, which is less often used in this sense. Doublet of couleur.",
        "In the US, the spelling color is used to match the spelling of the word's Latin etymon, and to make all derivatives consistent (colorimeter,  coloration, colorize, colorless, etc). Elsewhere in the English-speaking world, the spelling colour has been retained."
      ],
      "adjectives": [
        {
          "description": "color (not comparable) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Conveying color, as opposed to shades of gray.",
                  "examples": [
                    "Color television and movies were considered a great improvement over black and white."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "color (countable and uncountable, plural colors) (American spelling) (Canadian spelling, rare)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The spectral composition of visible light.",
                  "examples": [
                    "Humans and birds can perceive color.",
                    "Synonym: (archaic) blee"
                  ]
                }
              ]
            },
            {
              "group": "A subset thereof:",
              "entries": [
                {
                  "meaning": "(countable) A particular set of visible spectral compositions, perceived or named as a class.",
                  "examples": [
                    "Most languages have names for the colors black, white, red, and green.",
                    "Synonyms: hue, (archaic) blee"
                  ]
                },
                {
                  "meaning": "(uncountable) Hue as opposed to achromatic colors (black, white and grays).",
                  "examples": [
                    "He referred to the white flag as one \"drained of all color\".",
                    "Synonyms: hue, shade, (archaic) blee"
                  ]
                },
                {
                  "meaning": "These hues as used in color television or films, color photographs, etc (as opposed to the shades of grey used in black-and-white television).",
                  "examples": [
                    "This film is broadcast in color.  Most people dream in color, but some dream in black and white.",
                    "Synonym: color television"
                  ]
                },
                {
                  "meaning": "(heraldry) Any of the standard dark tinctures used in a coat of arms, including azure, gules, sable, and vert.",
                  "examples": [
                    "Coordinate terms: metal, stain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A paint.",
                  "examples": [
                    "The artist took out her colors and began work on a landscape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Human skin tone, especially as an indicator of race or ethnicity.",
                  "examples": [
                    "Color has been a sensitive issue in many societies.",
                    "Synonyms: complexion, ethnicity, race"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Skin color, noted as normal, jaundiced, cyanotic, flush, mottled, pale, or ashen as part of the skin signs assessment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flushed appearance of blood in the face; redness of complexion.",
                  "examples": [
                    "[…]  her very embarrassment wore a graceful air; her high colour had softened down to a warm, delicate tint; and her dress, which looked beautifully new and fresh, was in good taste, and showed her off to advantage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Richness of expression; detail or flavour that is likely to generate interest or enjoyment.",
                  "examples": [
                    "There is a great deal of colour in his writing.",
                    "a bit of local color"
                  ]
                }
              ]
            },
            {
              "group": "A standard, flag, or insignia:",
              "entries": [
                {
                  "meaning": "(in the plural) A standard or banner.",
                  "examples": [
                    "The loss of their colors destroyed the regiment's morale.",
                    "Synonyms: banner, standard"
                  ]
                },
                {
                  "meaning": "(in the plural) The flag of a nation or team.",
                  "examples": [
                    "The colors were raised over the new territory."
                  ]
                },
                {
                  "meaning": "(in the plural) Gang insignia.",
                  "examples": [
                    "Both of the perpetrators were wearing colors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) An award for sporting achievement, particularly within a school or university.",
                  "examples": [
                    "He was awarded colors for his football."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, in the plural) The morning ceremony of raising the flag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A property of quarks, with three values called red, green, and blue, which they can exchange by passing gluons; color charge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, uncountable) A third-order measure of derivative price sensitivity, expressed as the rate of change of gamma with respect to time, or equivalently the rate of change of charm with respect to changes in the underlying asset price.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) The relative lightness or darkness of a mass of written or printed text on a page. (See  type color on  Wikipedia.Wikipedia )",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker) Any of the colored balls excluding the reds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A front or facade; an ostensible truth actually false; pretext.",
                  "examples": [
                    "At the far end of the continuum, Roger Seagraves collected personal items from people he'd murdered, or assassinated rather, since he'd done it under the color of serving his country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An appearance of right or authority; color of law.",
                  "examples": [
                    "Under color of law, he managed to bilk taxpayers of millions of dollars."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "color (third-person singular simple present colors, present participle coloring, simple past and past participle colored) (American spelling)",
          "definitionGroups": [
            {
              "group": "(transitive) To give something color.",
              "entries": [
                {
                  "meaning": "(transitive) To cause (a pipe, especially a meerschaum) to take on a brown or black color, by smoking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To apply colors to the areas within the boundaries of a line drawing using colored markers or crayons.",
                  "examples": [
                    "Synonym: color in",
                    "My kindergartener loves to color."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person or their face) To become red through increased blood flow.",
                  "examples": [
                    "Synonym: blush",
                    "Her face colored as she realized her mistake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To affect without completely changing.",
                  "examples": [
                    "Synonyms: affect, influence",
                    "That interpretation certainly colors my perception of the book."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To attribute a quality to; to portray (as).",
                  "examples": [
                    "Synonym: call",
                    "Color me confused.",
                    "They tried to colour the industrial unrest as a merely local matter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, graph theory) To assign colors to the vertices of a graph (or the regions of a map) so that no two vertices connected by an edge (regions sharing a border) have the same color.",
                  "examples": [
                    "Can this graph be 2-colored?",
                    "You can color any map with four colors."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}