{
  "word": "serial",
  "etymologies": [
    {
      "description": [
        "1840, in reference to the books of Charles Dickens (published in sequential parts, as a series). Formed as series +‎ -al, on model of Latin seriālis, from seriēs + -ālis.",
        "Cognate to Italian seriale."
      ],
      "adjectives": [
        {
          "description": "serial (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having to do with or arranged in a series.",
                  "examples": [
                    "Synonym: sequential"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Who performs a specified action or course of action repeatedly or regularly.",
                  "examples": [
                    "Synonym: career",
                    "The serial killer had a string of victims across seven states.",
                    "He was a serial entrepreneur, always coming up with a new way to make cash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Published or produced in installments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Of or relating to a grammatical aspect relating to an action that is habitual and ongoing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "serial (plural serials)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A work, such as a work of fiction, published in installments, often numbered and without a specified end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A publication issued in successive parts, often numbered and with no predetermined end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, slang) A serial number, esp. one required to activate software.",
                  "examples": [
                    "Go to these sites for serials, cracks and keygens."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A unit of police officers equipped with shields to tackle a riot.",
                  "examples": [
                    "The practice, especially among members of shield serials, of 'whooping like cowboys and indians' and beating of truncheons on riot shields must cease as this tends to frighten and intimidate rioters."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "serial (third-person singular simple present serials, present participle serialling or (US) serialing, simple past and past participle serialled or (US) serialed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to assign a serial number to (especially of aircraft)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}