{
  "word": "army",
  "etymologies": [
    {
      "description": [
        "From (1386) Middle English armee, borrowed from Old French armee (cf. modern French armée), from Medieval Latin armāta (“armed force”), a noun taken from the past participle of Latin armāre (“to arm”), itself related to arma (“tools, arms”), from Proto-Indo-European *h₂er- (“to join, fit together”).\nDoublet of armada. Displaced native Old English here and fierd."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "army (plural armies)",
          "definitionGroups": [
            {
              "group": "A large, highly organized military force, concerned mainly with ground (rather than air or naval) operations.",
              "entries": [
                {
                  "meaning": "Used absolutely for that entire branch of the armed forces.",
                  "examples": [
                    "The army received a bigger share of this year's budget increase than the navy or air force."
                  ]
                },
                {
                  "meaning": "(often capitalized) Within a vast military, a very large tactical contingent (e.g. a number of divisions).",
                  "examples": [
                    "The Fourth Army suffered such losses that its remainders were merged into the Second Army, also deployed on the Western front."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The governmental agency in charge of a state's army.",
                  "examples": [
                    "The army opposed the legislature's involvement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A large group of people working toward the same purpose.",
                  "examples": [
                    "It took an army of accountants to uncover the fraud.",
                    "On sunny days the beaches draw armies of tourists of all kinds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A large group of social animals working toward the same purpose.",
                  "examples": [
                    "Our house is being attacked by an army of ants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any multitude.",
                  "examples": [
                    "There was an army of construction cranes working on building the skyscraper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The military as a whole.",
                  "examples": [
                    "The People's Liberation Army Navy of China.",
                    "The Yugoslav Army consisted of the Navy, Ground Forces, and Air Force.",
                    "Iran's army consists of the Navy, Ground Forces, and Air Force."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}