{
  "word": "tambour",
  "etymologies": [
    {
      "description": [
        "Borrowed from French tambour (“drum”), from Arabic طُنْبُور‎ (ṭunbūr), perhaps influenced by Persian تبیر‎ (tabir, “drum”). Compare Armenian տաւիղ (tawił), and tabla."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tambour (countable and uncountable, plural tambours)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A small shallow drum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A circular frame for embroidery.",
                  "examples": [
                    "Recollect Lady Teazle when I saw you first—sitting at your tambour in a pretty figured linen gown—"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rich kind of gold and silver embroidery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Silk or other material embroidered on a tambour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The capital of a Corinthian column.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) Synonym of drum (“cylindrical stone in the shaft of a column”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A work usually in the form of a redan, to enclose a space before a door or staircase, or at the gorge of a larger work. It is arranged like a stockade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A shallow metallic cup or drum, with a thin elastic membrane supporting a writing lever. Two or more of these are connected by a rubber tube and used to transmit and register the movements of the pulse or of any pulsating artery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) In real tennis, a buttress-like obstruction in the main wall.",
                  "examples": [
                    "One hazard is the tambour, a buttress which juts out and causes the ball to bounce unpredictably."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rolling top or front (as of a rolltop desk) of narrow strips of wood glued on canvas.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tambour (third-person singular simple present tambours, present participle tambouring, simple past and past participle tamboured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To embroider on a tambour (circular frame).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}