{
  "word": "match",
  "etymologies": [
    {
      "description": [
        "From Middle English macche, mecche, from Old English mæċċa, ġemæċċa (“companion, mate, wife, one suited to another”), from Proto-West Germanic *makkjō, *gamakkjō (“partner, equal”), from Proto-Germanic *makô, from Proto-Indo-European *mag- (“to knead, work”). Compare Danish mage (“mate”), Icelandic maki (“spouse”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "match (plural matches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A competitive sporting event such as a boxing meet, a baseball game, or a cricket match.",
                  "examples": [
                    "My local team are playing in a match against their arch-rivals today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any contest or trial of strength or skill, or to determine superiority.",
                  "examples": [
                    "A solemn match was made; he lost the prize."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone with a measure of an attribute equaling or exceeding the object of comparison.",
                  "examples": [
                    "He knew he had met his match."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A marriage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A candidate for matrimony; one to be gained in marriage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Suitability.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Equivalence; a state of correspondence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Equality of conditions in contest or competition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pair of items or entities with mutually suitable characteristics.",
                  "examples": [
                    "The carpet and curtains are a match.",
                    "a match made in heaven"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An agreement or compact.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metalworking) A perforated board, block of plaster, hardened sand, etc., in which a pattern is partly embedded when a mould is made, for giving shape to the surfaces of separation between the parts of the mould.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "match (third-person singular simple present matches, present participle matching, simple past and past participle matched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To agree; to be equal; to correspond.",
                  "examples": [
                    "Their interests didn't match, so it took a long time to agree what to do together.",
                    "These two copies are supposed to be identical, but they don't match."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To agree with; to be equal to; to correspond to.",
                  "examples": [
                    "His interests didn't match her interests."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a successful match or pairing.",
                  "examples": [
                    "They found out about his color-blindness when he couldn't match socks properly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To equal or exceed in achievement.",
                  "examples": [
                    "She matched him at every turn: anything he could do, she could do as well or better."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To unite in marriage, to mate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fit together, or make suitable for fitting together; specifically, to furnish with a tongue and groove at the edges.",
                  "examples": [
                    "to match boards"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) To be an example of a rule or regex.",
                  "examples": [
                    "The behavior matched one or more rules and was rejected by an edit filter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English macche, mecche (“wick (of a candle)”), from Old French mesche, meische, from Vulgar Latin micca (compare Catalan metxa, Spanish mecha, Italian miccia), which in turn is probably from Latin myxa (“nozzle, curved part of a lamp”), from Ancient Greek μύξα (múxa, “lamp wick”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "match (plural matches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device made of wood or paper, at the tip coated with chemicals that ignite with the friction of being dragged (struck) against a rough dry surface.",
                  "examples": [
                    "Synonym: (obsolete) spunk",
                    "He struck a match and lit his cigarette."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}