{
  "word": "wigwag",
  "etymologies": [
    {
      "description": [
        "wig (“to wag, waggle”) + wag (“to swing from side to side”). The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "wigwag (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With a wigwagging or to-and-fro motion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "wigwag (plural wigwags)",
          "definitionGroups": [
            {
              "group": "Any of a number of mechanical or electrical devices which cause a component to oscillate between two states.",
              "entries": [
                {
                  "meaning": "A device that causes one or more lights to flash in a preset pattern.",
                  "examples": []
                },
                {
                  "meaning": "(film, television) A red light near the door of a sound stage that flashes to indicate that cameras are rolling inside the stage and that all people and vehicles outside should remain quiet; a red-eye.",
                  "examples": []
                },
                {
                  "meaning": "(road transport) A device used to cause lamps installed on a motor vehicle, especially an emergency vehicle such as an ambulance or police car, to flash as a warning.",
                  "examples": []
                },
                {
                  "meaning": "(road transport) A device with multiple (often two), alternately flashing lights which is installed at a railway level crossing (or grade crossing), a movable bridge, etc., to warn vehicular traffic to stop.",
                  "examples": []
                },
                {
                  "meaning": "(watchmaking) An instrument that creates a wigwagging motion for polishing.",
                  "examples": []
                },
                {
                  "meaning": "(road transport) A warning device inside the cabin of a truck that causes a mechanical arm to drop into view when the pressure in the airbrake system of the truck becomes too low for the brakes to be reliably deployed.",
                  "examples": []
                },
                {
                  "meaning": "(US, rail transport) A grade crossing signal with a swinging motion used to indicate an approaching train.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, historical) A signal sent by waving a flag to and fro.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wigwag (third-person singular simple present wigwags, present participle wigwagging, simple past and past participle wigwagged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move gently in one direction and then another; to wig or wiggle, to wag or waggle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of wigwagging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To oscillate between two states.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, historical) To send a signal by waving a flag to and fro.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}