{
  "word": "historical",
  "etymologies": [
    {
      "description": [
        "From Latin historicus (“historical”)  +‎ -al (“forming adjectives denoting of or relating to”)."
      ],
      "adjectives": [
        {
          "description": "historical (comparative more historical, superlative most historical)",
          "definitionGroups": [
            {
              "group": "Of, concerning, or in accordance with recorded history, (particularly) as opposed to legends, myths, and fictions.",
              "entries": [
                {
                  "meaning": "(literature, art) About history; depicting persons or events from history.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Of, concerning, or in accordance with the past generally.",
              "entries": [
                {
                  "meaning": "(literature, art) Set in the past.",
                  "examples": []
                },
                {
                  "meaning": "(uncommon) Former, erstwhile; (religious, obsolete) lapsed, nominal.",
                  "examples": [
                    "But concerning some persons of your neighbourhood... their Confession [of Faith] is rather an opinion than a true and sincere earnestness, for all of them are not that which they boast and glory to be; there may be many honest hearts among them; but many of them are only historical and titular, and desire only to show themselves, and to be applauded ..."
                  ]
                },
                {
                  "meaning": "(grammar) One of various tenses or moods used to tell about past events, historic (tense).",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, biology) Synonym of hereditary or evolutionary.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Of, concerning, or in accordance with the scholarly discipline of history.",
              "entries": [
                {
                  "meaning": "Done in the manner of a historian: written as a development over time or in accordance with the historical method.",
                  "examples": [
                    "...No studies have investigated the problem’s historic roots. Thus, this paper explores the perspective of “early insiders” through an historical analysis of autobiographies, biographies, and magazine articles written by and about early US newspaper reporters and editors."
                  ]
                },
                {
                  "meaning": "(uncommon) Synonym of historic: important or likely to be important to history and historians.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Forming compound adjectives with the meaning \"historical/~\" or \"historically\":",
                  "examples": [
                    "historical-political"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "historical (plural historicals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A historical romance.",
                  "examples": [
                    "However, as regular romance readers know, the romance novels that appear on the best-seller lists are not Harlequins at all, but rather historicals and contemporaries, which vary widely from the Harlequin pattern in style, plot, and character."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}