{
  "word": "connect",
  "etymologies": [
    {
      "description": [
        "From Latin connectere (“fasten together”), from con- (“together”) +‎ nectere (“bind”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "connect (plural connects)",
          "definitionGroups": [
            {
              "group": "(slang) Clipping of connection.",
              "entries": [
                {
                  "meaning": "A drug dealer.",
                  "examples": [
                    "My connects in Chicago are telling me all kinds of things. Nobody knows anything for sure except that Griffith is missing and money is missing."
                  ]
                },
                {
                  "meaning": "A useful friend or associate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "connect (third-person singular simple present connects, present participle connecting, simple past and past participle connected)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of an object) To join (to another object): to attach, or to be intended to attach or capable of attaching, to another object.",
                  "examples": [
                    "Synonyms: affix, join, put together, unite; see also Thesaurus:join",
                    "I think this piece connects to that piece over there."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of two objects) To join: to attach, or to be intended to attach or capable of attaching, to each other.",
                  "examples": [
                    "Both roads have the same name, but they don't connect: they're on opposite sides of the river, and there's no bridge there."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a blow) To arrive at an intended target; to land.",
                  "examples": [
                    "When that roundhouse kick connected with his temple it sent him flying across the room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of an object) To join (two other objects), or to join (one object) to (another object): to be a link between two objects, thereby attaching them to each other.",
                  "examples": [
                    "The new railroad will connect the northern part of the state to the southern part."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a person) To join (two other objects), or to join (one object) to (another object): to take one object and attach it to another.",
                  "examples": [
                    "I connected the printer to the computer, but I couldn't get it work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To join an electrical or telephone line to a circuit or network.",
                  "examples": [
                    "When the technician connects my house, I'll be able to access the internet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To associate; to establish a relation between.",
                  "examples": [
                    "I didn't connect my lost jewelry with the news of an area cat burglar until the police contacted me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a travel connection; to switch from one means of transport to another as part of the same trip.",
                  "examples": [
                    "I'm flying to London where I connect with a flight heading to Hungary."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}