{
  "word": "plague",
  "etymologies": [
    {
      "description": [
        "From Middle English plage, borrowed from Old French plage, from Latin plāga (“blow, wound”), from plangō (“to strike”). Cognate with Middle Dutch plāghe (> Dutch plaag), plāghen (> Dutch plagen); Middle Low German plāge; Middle High German plāge, pflāge (> German Plage); plāgen (> German plagen); Swedish plåga; French plaie, Occitan plaga. Doublet of plaga. Displaced native Old English wōl."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plague (countable and uncountable, plural plagues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often used with the, sometimes capitalized: the Plague) The bubonic plague, the pestilent disease caused by the virulent bacterium Yersinia pestis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pathology) An epidemic or pandemic caused by any pestilence, but specifically by the above disease.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A widespread affliction, calamity or destructive influx, especially when seen as divine retribution.",
                  "examples": [
                    "Ten Biblical plagues over Egypt, ranging from locusts to the death of the crown prince, finally forced Pharaoh to let Moses's people go."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A grave nuisance, whatever greatly irritates.",
                  "examples": [
                    "Bart is an utter plague; his pranks never cease."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) A group of common grackles.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plague (third-person singular simple present plagues, present participle plaguing, simple past and past participle plagued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To harass, pester or annoy someone persistently or incessantly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To afflict with a disease or other calamity.",
                  "examples": [
                    "Natural catastrophes plagued the colonists till they abandoned the pestilent marshland."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}