{
  "word": "fellowship",
  "etymologies": [
    {
      "description": [
        "From Middle English felowschipe, felawshipe, felaȝschyp, equivalent to fellow +‎ -ship; or perhaps adapted from Old Norse félagskapr, félagsskapr (“fellowship”). Compare Icelandic félagsskapur (“companionship, company, community”), Danish fællesskab (“fellowship”), Norwegian fellesskap (“fellowship”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fellowship (countable and uncountable, plural fellowships)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A company of people that share the same interest or aim.",
                  "examples": [
                    "Coordinate terms: companionship, communing",
                    "The Fellowship of the Ring"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Company, companions; a group of people or things following another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A feeling of friendship, relatedness or connection between people.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) A merit-based scholarship.",
                  "examples": [
                    "Coordinate term: traineeship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) A temporary position at an academic institution with limited teaching duties and ample time for research.",
                  "examples": [
                    "Synonym: postdoc"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A period of supervised, sub-specialty medical training in the United States and Canada that a physician may undertake after completing a specialty training program or residency.",
                  "examples": [
                    "Coordinate terms: residency, internship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(arithmetic, archaic) The proportional division of profit and loss among partners.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fellowship (third-person singular simple present fellowships, present participle fellowshipping or (US also) fellowshiping, simple past and past participle fellowshipped or (US also) fellowshiped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To admit to fellowship, enter into fellowship with; to make feel welcome by showing friendship or building a cordial relationship. Now only in religious use.",
                  "examples": [
                    "The Bishop's family fellowshipped the new converts.",
                    "The Society of Religious Snobs refused to fellowship the poor family."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now chiefly religious, especially in Canada, US) To join in fellowship; to associate with.",
                  "examples": [
                    "The megachurch he attends is too big for making personal connections, so he also fellowships weekly in one of the church's small groups.",
                    "After she got married, she stopped fellowshipping with the singles in our church."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}