{
  "word": "actual",
  "etymologies": [
    {
      "description": [
        "From Middle English actual, actuel (“active”), from Anglo-Norman actuel, actual, and its source Late Latin actuālis (“active, practical”), from Latin actus (“act, action, performance”), from agere (“to do; to act”) + -alis (“-al”), ultimately from Proto-Indo-European *h₂éǵeti, from the root *h₂eǵ-."
      ],
      "adjectives": [
        {
          "description": "actual (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly theology) relating to a person's acts or deeds; active, practical [from 14th c.]",
                  "examples": [
                    "Apparently, the holy Doctor was referring to actual, rather than original, sin; yet the basis of his argument for Mary's holiness, the divine maternity, would logically lead to the conclusion that she was free from original sin also."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Existing in reality, not just potentially; really acted or acting; occurring in fact. [from 14th c.]",
                  "examples": [
                    "the actual cost of goods;  the actual case under discussion",
                    "The actual government expenses dramatically exceed the budget.",
                    "Synonym: real",
                    "Antonyms: potential, possible, virtual, speculative, conceivable, theoretical, nominal, hypothetical, estimated"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) in action at the time being; now existing; current. [from 18th c.]",
                  "examples": [
                    "To my actual feelings it seems incredible that I could ever believe that I believed in Transubstantiation!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used as intensifier to emphasise a following noun; exact, specific, very. [from 18th c.]",
                  "examples": [
                    "Synonym: present",
                    "Antonyms: future, past"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "actual (countable and uncountable, plural actuals)",
          "definitionGroups": [
            {
              "group": "an actual, real one; notably:",
              "entries": [
                {
                  "meaning": "(finance) something actually received; real receipts, as distinct from estimated ones.",
                  "examples": []
                },
                {
                  "meaning": "(military) a radio callsign modifier that specifies the commanding officer of the unit or asset denoted by the remainder of the callsign and not the officer's assistant or other designee.",
                  "examples": [
                    "Bravo Six Actual, this is Charlie One. Come in, over. (The radio operator is requesting to speak to the commander of the unit under the call sign \"Bravo Six\", as opposed to any available member of the unit.)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Reality, usually with the definite article.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}