{
  "word": "female",
  "etymologies": [
    {
      "description": [
        "From Middle English female, an alteration of Middle English femele, from Old French femele, femelle (“female”), from Medieval Latin fēmella (“a female”), from Latin fēmella (“a girl, a young female, a young woman”), diminutive of fēmina (“a woman”). The English spelling and pronunciation were remodelled under the influence of male, which is otherwise not etymologically related. Contrast woman, which is etymologically built on man (as in person)."
      ],
      "adjectives": [
        {
          "description": "female (not generally comparable, comparative femaler or more female, superlative femalest or most female)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Belonging to the sex which typically produces eggs (ova), or to the gender which is typically associated with it. [from 14th c.]",
                  "examples": [
                    "female authors, the leading male and female artists, a female bird cooing at a male, intersex female patients, a trans female vlogger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic of this sex/gender. (Compare feminine, womanly.)",
                  "examples": [
                    "stereotypically female pastimes, an insect with typically female coloration"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Tending to lead to or regulate the development of sexual characteristics typical of this sex.",
                  "examples": [
                    "the female chromosome;   estrogen, the primary female sex hormone, is produced by both females and males"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, less common than 'feminine') Feminine; of the feminine grammatical gender.",
                  "examples": [
                    "If you are describing a female noun, you must make the adjective feminine by adding an 'e'. If you describe a male noun, you add an 'er'. For neutral nouns you add an 'es'."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of bacteria) Lacking the F factor, and able to receive DNA from another bacterium which does have this factor (a male).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Having an internal socket, as in a connector or pipe fitting. [from 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "female (plural females)",
          "definitionGroups": [
            {
              "group": "One of the female (feminine) sex or gender.",
              "entries": [
                {
                  "meaning": "A human of the feminine sex.",
                  "examples": [
                    "Synonyms: see Thesaurus:female",
                    "Hyponyms: girl, woman; see also Thesaurus:girl, Thesaurus:woman"
                  ]
                },
                {
                  "meaning": "An animal of the sex that produces eggs.",
                  "examples": []
                },
                {
                  "meaning": "(botany) A plant which produces only that kind of reproductive organ capable of developing into fruit after impregnation or fertilization; a pistillate plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bacterium which lacks the F factor, and is able to receive DNA from another bacterium which has that factor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female connector, pipe fitting, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}