{
  "word": "fat",
  "etymologies": [
    {
      "description": [
        "From Middle English fat, from Old English fǣtt (“fatted, fat”), from Proto-West Germanic *faitid (“fatted”), originally the past participle of the verb *faitijan (“to make fat”), from *fait (“fat”)."
      ],
      "adjectives": [
        {
          "description": "fat (comparative fatter, superlative fattest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Carrying more fat than usual on one's body; plump; not lean or thin.",
                  "examples": [
                    "The fat man had trouble getting through the door.",
                    "The fattest pig should yield the most meat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Thick; large.",
                  "examples": [
                    "The fat wallets of the men from the city brought joy to the peddlers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bulbous; rotund.",
                  "examples": [
                    "So this was my future home, I thought!  […]  Backed by towering hills, the but faintly discernible purple line of the French boundary off to the southwest, a sky of palest Gobelin flecked with fat, fleecy little clouds, it in truth looked a dear little city; the city of one's dreams."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bountiful.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Oily; greasy; unctuous; rich (said of food).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Exhibiting the qualities of a fat animal; coarse; heavy; gross; dull; stupid.",
                  "examples": [
                    "making our western wits fat & mean"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fertile; productive.",
                  "examples": [
                    "a fat soil; a fat pasture"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rich; producing a large income; desirable.",
                  "examples": [
                    "a fat benefice; a fat office;  a fat job"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Abounding in riches; affluent; fortunate.",
                  "examples": [
                    "persons grown fat and wealthy by a long and successful imposture"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, printing) Of a character which enables the compositor to make large wages; said of matter containing blank, cuts, or many leads, etc.",
                  "examples": [
                    "a fat take; a fat page"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) Being a shot in which the ground is struck before the ball.",
                  "examples": [
                    "Hitting a thin shot from a fairway bunker is more productive than hitting a fat shot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) Of a role: significant; major; meaty.",
                  "examples": [
                    "He is what the theatre calls a “fat” role — a man suddenly confronted by a terrible duty. He is called upon to revenge the murder of his father and to right a wrong against the state."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of phat",
                  "examples": [
                    "This isn't a place to talk about “hitting the decks” and making “fat beats”—you're not selling to an industry peer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "fat (usually uncountable, plural fats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(uncountable) A specialized animal tissue with high lipid content, used for long-term storage of energy: fat tissue.",
              "entries": [
                {
                  "meaning": "Such tissue as food: the fatty portion of (or trimmings from) meat cuts.",
                  "examples": [
                    "Ask the butcher for a few pounds of fat for our greens."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A lipid that is solid at room temperature, which fat tissue contains and which is also found in the blood circulation; sometimes, a refined substance chemically resembling such naturally occurring lipids.",
                  "examples": [
                    "Dietary fat is not the evil that it was once misapprehended to be; carbs are increasingly recognized as a bigger driver of atherosclerosis via chronic insulin resistance and the vascular processes that cascade from it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That part of an organization deemed wasteful.",
                  "examples": [
                    "We need to trim the fat in this company"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An erection.",
                  "examples": [
                    "I saw Daniel crack a fat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A poorly played shot where the ball is struck by the top part of the club head. (see also thin, shank, toe)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The best or richest productions; the best part.",
                  "examples": [
                    "to live on the fat of the land"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, printing) Work containing much blank, or its equivalent, and therefore profitable to the compositor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, derogatory) A fat person.",
                  "examples": [
                    "Prefer military, bodybuilders, jocks. No smokers or fats please."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A beef cattle fattened for sale.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fat (third-person singular simple present fats, present participle fatting, simple past and past participle fatted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To make fat; to fatten.",
                  "examples": [
                    "kill the fatted calf"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To become fat; to fatten.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, golf) To hit (a golf ball) with a fat shot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English fat, from Old English fæt (“vat, vessel, jar, cup, casket, division”), from Proto-Germanic *fatą (“vessel”), from Proto-Indo-European *pod- (“vessel”). Cognate with Dutch vat (“barrel, vessel”), German Fass (“barrel, drum”), Swedish fat (“barrel, dish, cask”). See vat."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fat (plural fats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A large tub or vessel for water, wine, or other liquids; a cistern.",
                  "examples": [
                    "In 1431 New College purchases brewing vessels, under the names of a mash fat, for 6s. 10d., a wort fat for 2s., a 'Gilleding' tub for 2s. 6d., and two tunning barrels at 8d. each, a leaden boiler for 24s., another for 12s., and a great copper beer pot for 13s. 4d."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A dry measure, generally equal to nine bushels.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}