{
  "word": "pioneer",
  "etymologies": [
    {
      "description": [
        "From Middle French pionnier (“originally, a foot soldier”), Old French peonier, from peon (“a foot soldier”) (modern French: pion). See pawn in chess."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pioneer (plural pioneers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who goes before, as into the wilderness, preparing the way for others to follow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or other entity who is first or among the earliest in any field of inquiry, enterprise, or progress.",
                  "examples": [
                    "Some people will consider their national heroes to be pioneers of civilization.",
                    "Certain politicians can be considered as pioneers of reform."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, military) A soldier detailed or employed to form roads, dig trenches, and make bridges, as an army advances; a sapper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of any of several European organizations advocating abstinence from alcohol.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(communism) A member of a children’s organization operated by the Communist Party, typically in the second of three stages toward becoming an member of the Party itself.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pioneer (third-person singular simple present pioneers, present participle pioneering, simple past and past participle pioneered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be the first to do or achieve (something), preparing the way for others to follow.",
                  "examples": [
                    "The young doctor pioneered a new life-saving surgical technique."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}