{
  "word": "single",
  "etymologies": [
    {
      "description": [
        "From Middle English single, sengle, from Old French sengle, saingle, sangle, from Latin singulus, a diminutive derived from Proto-Indo-European *sem- (“one”). Akin to Latin simplex (“simple”). See simple, and compare singular."
      ],
      "adjectives": [
        {
          "description": "single (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not accompanied by anything else; one in number.",
                  "examples": [
                    "Synonyms: lone, sole"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not divided in parts.",
                  "examples": [
                    "Synonyms: unbroken, undivided, uniform",
                    "The potatoes left the spoon and landed in a single big lump on the plate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Designed for the use of only one.",
                  "examples": [
                    "a single room"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Performed by one person, or one on each side.",
                  "examples": [
                    "a single combat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not married, and (in modern times) not dating or without a significant other.",
                  "examples": [
                    "Synonyms: unmarried, unpartnered, available",
                    "Forms often ask if a person is single, married, divorced, or widowed. In this context, a person who is dating someone but who has never married puts \"single\".",
                    "Josh put down that he was a single male on the dating website."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Having only one rank or row of petals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Simple and honest; sincere, without deceit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Uncompounded; pure; unmixed.",
                  "examples": [
                    "The most that is required is, that the passage of Scripture, selected as the foundation of the sacred oration, should, like the oration itself, be single, full, and unsuperfluous in its character."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Simple; foolish; weak; silly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "single (plural singles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A 45 RPM vinyl record with one song on side A and one on side B.",
                  "examples": [
                    "Antonym: album"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A popular song released and sold (on any format) nominally on its own though usually having at least one extra track.",
                  "examples": [
                    "The Offspring released four singles from their most recent album."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is not married or does not have a romantic partner.",
                  "examples": [
                    "Antonym: married",
                    "He went to the party, hoping to meet some friendly singles there."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A score of one run.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A hit in baseball where the batter advances to first base.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dominoes) A tile that has a different value (i.e. number of pips) at each end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, informal) A bill valued at $1.",
                  "examples": [
                    "I don't have any singles, so you'll have to make change."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A one-way ticket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canadian football) A score of one point, awarded when a kicked ball is dead within the non-kicking team's end zone or has exited that end zone.",
                  "examples": [
                    "Synonym: (official name in the rules) rouge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis, chiefly in the plural) A game with one player on each side, as in tennis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the reeled filaments of silk, twisted without doubling to give them firmness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Scotland, dialect) A handful of gleaned grain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, programming) A floating-point number having half the precision of a double-precision value.",
                  "examples": [
                    "Coordinate term: double"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) A shot of only one character.",
                  "examples": [
                    "But if the same scene is shot in singles (or “over-the-shoulder” shots where one of the actors is only a lumpy shoulder in the foreground), the editor and the director can almost redirect the scene on film."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single cigarette.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, obsolete) Synonym of single-driver.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "single (third-person singular simple present singles, present participle singling, simple past and past participle singled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To identify or select one member of a group from the others; generally used with out, either to single out or to single (something) out.",
                  "examples": [
                    "Eddie singled out his favorite marble from the bag.",
                    "Yvonne always wondered why Ernest had singled her out of the group of giggling girls she hung around with."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) To get a hit that advances the batter exactly one base.",
                  "examples": [
                    "Pedro singled in the bottom of the eighth inning, which, if converted to a run, would put the team back into contention."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture) To thin out.",
                  "examples": [
                    "The seeds did not germinate in many parts of a row until rains in end of June and thunderplumps in first week of July brought them up later in patches, so that no second sowing was necessary, but singling was done by stages."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a horse) To take the irregular gait called singlefoot.",
                  "examples": [
                    "Many very fleet horses, when overdriven, adopt a disagreeable gait, which seems to be a cross between a pace and a trot, in which the two legs of one side are raised almost but not quite, simultaneously. Such horses are said to single, or to be single-footed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To sequester; to withdraw; to retire.",
                  "examples": [
                    "an agent singling itself from consorts"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To take alone, or one by one; to single out.",
                  "examples": [
                    "men  […]  commendable when they are singled"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce (a railway) to single track.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}