{
  "word": "canonize",
  "etymologies": [
    {
      "description": [
        "From Late Middle English canonizen (“to declare as a saint; to appoint to an ecclesiastical office”), from Old French canonisier (modern French canoniser (“to canonize”)), or from its etymon Medieval Latin, Late Latin canōnizāre, the present active infinitive of Latin canōnizō (“to recognize as a saint, canonize; to declare as authoritative or official”), from Latin canōn (“measuring line; (figurative) precept, rule, canon; authorized catalogue”) + -izō (suffix forming verbs). Canōn is derived from Ancient Greek κᾰνών (kanṓn, “measuring rod; general principle, norm, rule; model, paradigm”); the further etymology is uncertain, but it may be related to κᾰ́ννᾱ (kánnā, “giant reed (Arundo donax); reed mat”), ultimately from Sumerian 𒄀𒈾 (gi.na). The English word is analysable as canon (“general principle, rule; authoritative group of works; catalogue of saints canonized in the Roman Catholic Church”) +‎ -ize."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "canonize (third-person singular simple present canonizes, present participle canonizing, simple past and past participle canonized) (transitive, American spelling, Oxford British English)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Roman Catholicism) To declare (a deceased person) as a saint, and enter them into the canon of saints.",
                  "examples": [
                    "Synonym: saint",
                    "Antonym: uncanonize",
                    "Thomas Becket was canonized in 1173."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To regard as a saint; to glorify, to exalt to the highest honour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) To formally declare (a piece of religious writing) to be part of the biblical canon.",
                  "examples": [
                    "Antonym: uncanonize"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) To regard (an artistic or written work or its creator) as one of a group that are representative of a particular field.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Christianity) Especially of a church: to give official approval to; to authorize, to sanction.",
                  "examples": [
                    "Antonym: uncanonize"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}