{
  "word": "lie",
  "etymologies": [
    {
      "description": [
        "From Middle English lien, liggen, from Old English liċġan, from Proto-West Germanic *liggjan, from Proto-Germanic *ligjaną, from Proto-Indo-European *legʰ-.",
        "Cognate with West Frisian lizze, Dutch liggen, German liegen, Danish and Norwegian Bokmål ligge, Swedish ligga, Icelandic, Faroese and Norwegian Nynorsk liggja, Gothic 𐌻𐌹𐌲𐌰𐌽 (ligan); and with Latin lectus (“bed”), Irish luighe, Russian лежа́ть (ležátʹ), Albanian lag (“troop, band, encampment”).",
        "As a noun for position, the noun has the same etymology above as the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lie (plural lies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) The terrain and conditions surrounding the ball before it is struck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(disc golf) The terrain and conditions surrounding the disc before it is thrown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The position of a fetus in the womb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A manner of lying; relative position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An animal's lair.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lie (third-person singular simple present lies, present participle lying, simple past lay or laid, past participle lain or laid or lien) See usage notes.",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rest in a horizontal position on a surface.",
                  "examples": [
                    "The book lies on the table;  the snow lies on the roof;  he lies in his coffin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be placed or situated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative) To abide; to remain for a longer or shorter time; to be in a certain state or condition.",
                  "examples": [
                    "to lie waste; to lie fallow; to lie open; to lie hidden; to lie grieving; to lie under one's displeasure; to lie at the mercy of the waves",
                    "The paper does not lie smooth on the wall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used with in: to be or exist; to belong or pertain; to have an abiding place; to consist.",
                  "examples": [
                    "He that thinks that diversion may not lie in hard labour, forgets the early rising and hard riding of huntsmen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used with with: to have sexual relations with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used with on/upon: to be incumbent (on); to be the responsibility of a person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To lodge; to sleep.",
                  "examples": [
                    "While I was now trifling at home, I saw London,  […]  where I lay one night only."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be still or quiet, like one lying down to rest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To be sustainable; to be capable of being maintained.",
                  "examples": [
                    "An appeal lies in this case from the ordinary to the arches."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lien (“to lie, tell a falsehood”), from Old English lēogan (“to lie”), from Proto-West Germanic *leugan, from Proto-Germanic *leuganą (“to lie”), from Proto-Indo-European *lewgʰ- (“to lie, swear, bemoan”).",
        "Cognate with West Frisian lige (“to lie”), Low German legen, lögen (“to lie”), Dutch liegen (“to lie”), German lügen (“to lie”), Norwegian ljuge/lyge (“to lie”), Danish lyve (“to lie”), Swedish ljuga (“to lie”), and more distantly with Bulgarian лъжа (lǎža, “to lie”), Russian лгать (lgatʹ, “to lie”), ложь (ložʹ, “falsehood”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "lie (third-person singular simple present lies, present participle lying, simple past and past participle lied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To give false information intentionally with intent to deceive.",
                  "examples": [
                    "When Pinocchio lies, his nose grows.",
                    "If you are found to have lied in court, you could face a penalty.",
                    "While a principle-based approach might claim that lying is always morally wrong, the casuist would argue that, depending upon the details of the case, lying might or might not be illegal or unethical. The casuist might conclude that a person is wrong to lie in legal testimony under oath, but might argue that lying actually is the best moral choice if the lie saves a life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To convey a false image or impression.",
                  "examples": [
                    "Photographs often lie."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial) To be mistaken or unintentionally spread false information.",
                  "examples": [
                    "Sorry, I haven't seen your keys anywhere...wait, I lied! They're right there on the coffee table."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lie, from Old English lyġe (“lie, falsehood”), from Proto-Germanic *lugiz (“lie, falsehood”), from Proto-Indo-European *lewgʰ- (“to tell lies, swear, complain”). Cognate with Old Saxon luggi (“a lie”), Old High German lugī, lugin (“a lie”) (German Lüge), Danish løgn (“a lie”), Bulgarian лъжа́ (lǎžá, “а lie”), Russian ложь (ložʹ, “а lie”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lie (plural lies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An intentionally false statement; an intentional falsehood.",
                  "examples": [
                    "Synonyms: alternative fact, bullshit, deception, falsehood, fib, leasing, prevarication; see also Thesaurus:lie",
                    "Antonym: truth",
                    "I knew he was telling a lie by his facial expression."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A statement intended to deceive, even if literally true.",
                  "examples": [
                    "Synonym: half-truth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Anything that misleads or disappoints.",
                  "examples": [
                    "Wishing this lie of life was o'er."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}