{
  "word": "number",
  "etymologies": [
    {
      "description": [
        "From Middle English number, nombre, numbre, noumbre, from Anglo-Norman noumbre, Old French nombre, from Latin numerus (“number”), ultimately from Proto-Indo-European *nem- (“to divide”). Compare Saterland Frisian Nummer, Nuumer, West Frisian nûmer, Dutch nummer (“number”), German Nummer (“number”), Danish nummer (“number”), Swedish nummer (“number”), Icelandic númer (“number”). Replaced Middle English ȝetæl and rime, more at tell, tale and rhyme."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "number (plural numbers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An abstract entity used to describe quantity.",
                  "examples": [
                    "Zero, one, −1, 2.5, and pi are all numbers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A numeral: a symbol for a non-negative integer.",
                  "examples": [
                    "Synonyms: scalar, (obsolete) rime",
                    "The number 8 is usually made with a single stroke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, mathematics) An element of one of several sets: natural numbers, integers, rational numbers, real numbers, complex numbers, and sometimes extensions such as hypercomplex numbers, etc.",
                  "examples": [
                    "The equation \n  \n    \n      \n        \n          e\n          \n            i\n            π\n          \n        \n        +\n        1\n        =\n        0\n      \n    \n    {\\displaystyle e^{i\\pi }+1=0}\n  \n includes the most important numbers: 1, 0, \n  \n    \n      \n        π\n      \n    \n    {\\displaystyle \\pi }\n  \n, \n  \n    \n      \n        i\n      \n    \n    {\\displaystyle i}\n  \n, and \n  \n    \n      \n        e\n      \n    \n    {\\displaystyle e}\n  \n."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Followed by a numeral; used attributively) Indicating the position of something in a list or sequence. Abbreviations: No or No., no or no. (in each case, sometimes written with a superscript \"o\", like Nº or №). The symbol \"#\" is also used in this manner.",
                  "examples": [
                    "Horse number 5 won the race."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Quantity.",
                  "examples": [
                    "Any number of people can be reading from a given repository at a time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sequence of digits and letters used to register people, automobiles, and various other items.",
                  "examples": [
                    "Her passport number is C01X864TN."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) A telephone number.",
                  "examples": [
                    "“[...] I wonder if you could get hold of him and have him call me here at Interior. I’m in my office, do you have my number?”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Of a word or phrase, the state of being singular, dual or plural, shown by inflection.",
                  "examples": [
                    "Adjectives and nouns should agree in gender, number, and case."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, in the plural) Poetic metres; verses, rhymes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A performance; especially, a single song or song and dance routine within a larger show.",
                  "examples": [
                    "For his second number, he sang \"The Moon Shines Bright\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) A person.",
                  "examples": [
                    "I laughed. \"Don't doubt that. She's a saucy little number.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) An item of clothing, particularly a stylish one.",
                  "examples": [
                    "The trouble was I was wearing my backless glittering number from the night before underneath, so unless I could persuade the office it was National Fancy Dress Day I was doomed to sweat profusely in bottle blue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly US) A marijuana cigarette, or joint; also, a quantity of marijuana bought from a dealer.",
                  "examples": [
                    "These were the two that Tommy had chosen to collect a debt owed  to his family by a dude named Heath who ran numbers out of a grocery store on 131st and Lenox."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) An issue of a periodical publication.",
                  "examples": [
                    "the latest number of a magazine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large amount, in contrast to a smaller amount; numerical preponderance.",
                  "examples": [
                    "Despite last week's woes, the Braves still sport numbers that would make Christie Brinkley blush."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, always indefinite) A large amount of damage",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "number (third-person singular simple present numbers, present participle numbering, simple past and past participle numbered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To label (items) with numbers; to assign numbers to (items).",
                  "examples": [
                    "Number the baskets so that we can find them easily."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To total or count; to amount to.",
                  "examples": [
                    "I don’t know how many books are in the library, but they must number in the thousands."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From numb + -er."
      ],
      "adjectives": [
        {
          "description": "number",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "comparative form of numb: more numb",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}