{
  "word": "squish",
  "etymologies": [
    {
      "description": [
        "Apparently an alteration of squash, influenced by obsolete squiss (“to squeeze”). Cognate with Scots squische, squies (“to crush, squeeze”). Compare also French esquicher from Old Occitan esquichar (“to squeeze, squish”). See also squeeze, squelch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squish (countable and uncountable, plural squishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The sound or action of something, especially something moist, being squeezed or crushed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, politics, informal, derogatory) A political moderate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, UK, slang, archaic) Marmalade.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "squish (third-person singular simple present squishes, present participle squishing, simple past and past participle squished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To squeeze, compress, or crush (especially something moist).",
                  "examples": [
                    "The sandwich tasted fine, even though it had got squished in his lunchbox."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To be compressed or squeezed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "First possible attestation from 1999. Formed by analogy with crush and possibly smash, both of which have senses as types of compression as well as types of attraction. Later coined or recoined in 2007 by the user Raisin on the forums of the Asexual Visibility and Education Network as \"a milder synonym for the word 'crush'\". The same term was used with a similar meaning in a 1997 episode of the TV show Aaahh!!! Real Monsters, though the 2007 (re)coining was apparently independent."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squish (plural squishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A non-romantic and generally non-sexual infatuation with somebody one is not dating, or the object of that infatuation; a platonic crush.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}