{
  "word": "guimpe",
  "etymologies": [
    {
      "description": [
        "From French guimpe, from Middle French guimpe, from Old French guimple (“wimple”), from Frankish *wimpil, *wimpila (“head scarf”), from Proto-Germanic *wimpilaz, from *wīpaną (\"to wind, sling, garland, swing\"; from Proto-Indo-European *wimb-, *weyb- (“to turn, rotate”)) + Proto-Germanic *-ilaz (instrumental suffix). Cognate with Old High German wimpal and winfila (“head scarf”), Middle Dutch wumpel (“cap”), Old English wimpel, winpel (“wimple”), Old Norse vimpill (“hood, veil”). Also influenced by Old French guimpre (“a kind of trimming”), from the same Germanic source. More at wimple."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "guimpe (countable and uncountable, plural guimpes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Gimp; a narrow flat braid or reinforced cord of fabric used for ornamental trimming.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of short, high-necked blouse with sleeves of the late Victorian era, designed to be worn under a low-cut dress, jumper, or pinafore dress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of short chemisette or yoke insert made of lace, embroidery, or the like, worn with a low-necked dress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wimple; a wide, stiffly starched cloth that covers the neck and shoulders, as part of the habit of nuns of certain orders.",
                  "examples": [
                    "All the nuns at the convent wore plain blouses and skirts except for Sister Edgar, who had permission from the motherhouse to fit herself out in the old things with the arcane names, the wimple, cincture and guimpe."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}