{
  "word": "agent",
  "etymologies": [
    {
      "description": [
        "From Latin agēns, present active participle of agere (“to drive, lead, conduct, manage, perform, do”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "agent (plural agents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who exerts power, or has the power to act",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who acts for, or in the place of, another (the principal), by that person's authority; someone entrusted to do the business of another",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who looks for work for another person",
                  "examples": [
                    "Ronald Koeman has agreed a deal with Everton to become their new manager, his agent has reportedly told Dutch media. The agent Rob Jansen said, according to the popular Voetbal International website, that it was now down to Southampton and Everton to agree a compensation package for the Dutchman, who has a year remaining on his contract at St Mary’s."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who works for an intelligence agency",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An active power or cause or substance; something (e.g. biological, chemical, thermal, etc.) that has the power to produce an effect",
                  "examples": [
                    "So far seems to be the work of chemistry alone; at least we have no right to conclude that any other agent interferes; since hay, when it happens to imbibe moisture, exhibits nearly the same processes.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) In the client-server model, the part of the system that performs information preparation and exchange on behalf of a client or server. Especially in the phrase “intelligent agent” it implies some kind of autonomous process which can communicate with other agents to perform some collective task on behalf of one or more humans.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The participant of a situation that carries out the action in this situation, e.g. \"the boy\" in the sentences \"The boy kicked the ball\" and \"The ball was kicked by the boy\".",
                  "examples": [
                    "A verb is typically described as active when its subject is the agent or actor. By contrast, a verb is said to be passive when the subject does not perform the action, but is the patient, target, or undergoer of the action."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) A cheat who is assisted by dishonest casino staff.",
                  "examples": [
                    "Nevada casinos are fleeced out of millions of dollars yearly by agents (cheats acting as players) in collusion with crooked Black Jack dealers and pit bosses."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}