{
  "word": "main",
  "etymologies": [
    {
      "description": [
        "From Middle English mayn, main, maine, mæin, meyn, from main (noun) (see further at etymology 2); compare Old English mægen- (“strong, main, principal”) (used in combination) and Old Norse megn, megenn (“strong, main”).",
        "The word is cognate with Old High German megīn (“strong, mighty”) (modern German Möge, Vermögen (“power, wealth”)), and also akin to Old English magan (“to be able to”). See also may."
      ],
      "adjectives": [
        {
          "description": "main (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of chief or leading importance; prime, principal. [from 15th c.]",
                  "examples": [
                    "Religion direct us rather to ſecure inward peace than outward eaſe, to be more careful to avoid everlaſting and intolerable torment than  ſhort and light afflictions which are but for a moment;  […]  In a word, our main intereſt is to be as happy as we can, and as long as is poſſible; and if we be caſt into ſuch circumſtances, that we muſt be either in part and for a time or elſe wholly and always miſerable, the beſt wiſdom is to chuſe the greateſt and moſt laſting happiness, but the leaſt and ſhorteſt miſery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chief, most important, or principal in extent, size, or strength; consisting of the largest part.",
                  "examples": [
                    "Synonym: largest",
                    "main timbers",
                    "main branch of a river",
                    "main body of an army"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, of force, strength, etc.) Full, sheer, undivided. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) Big; angry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Belonging to or connected with the principal mast in a vessel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Great in size or degree; important, powerful, strong, vast.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "main (comparative more main, superlative most main)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialectal) Exceedingly, extremely, greatly, mightily, very, very much.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "main (third-person singular simple present mains, present participle maining, simple past and past participle mained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) Short for mainline (“to inject (a drug) directly into a vein”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, gaming) To mainly play a specific character or side, or with specific equipment, during a game.",
                  "examples": [
                    "He mains the same character as me in that game.",
                    "What race do you main and what is your favourite race to beat?",
                    "For new players, I recommend maining the dagger and using the axe as a backup weapon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To convert (a road) into a main or primary road.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English mayn, main, maine, mæine, mæȝen, from Old English mæġen (“strength”), from Proto-Germanic *maginą (“strength, power, might”), *maginaz (“strong”), from Proto-Indo-European *megʰ- (“be able”).",
        "The word is cognate with Old High German magen, megin, Old Norse magn, megn, megin, Old Saxon megin. More recent senses are derived from the adjective."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "main (plural mains)",
          "definitionGroups": [
            {
              "group": "That which is chief or principal; the chief or main portion; the bulk, the greater part, gross.",
              "entries": [
                {
                  "meaning": "(video games) The primary character that one plays in a video game in which one can play more than one character.",
                  "examples": [
                    "Antonym: alt",
                    "My WoW main has reached level cap and I’m on my way getting my first alt there as well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large cable or pipe providing utility service to an area or a building, such as a water main or electric main. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Short for main course (“the principal dish of a meal”).",
                  "examples": [
                    "I had scampi and chips for my main and a slice of cheesecake for dessert."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now poetic) The high seas. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic, US dialectal) The mainland. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Short for mainsail. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, except in might and main) Force, power, strength, violent effort. [from 9th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; probably from the adjective main. Evidence is lacking for a derivation from French main (“hand”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "main (plural mains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, gaming) A hand or match in a game of dice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, gaming) The largest throw in a match at dice; in the game of hazard, a number from one to nine called out by a person before the dice are thrown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, gaming) A stake played for at dice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, gaming, sports) A sporting contest or match, especially a cockfighting match.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A banker's shovel for coins.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain, possibly from French main (“hand”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "main (plural mains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A basket for gathering grapes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}