{
  "word": "badge",
  "etymologies": [
    {
      "description": [
        "From Middle English badge, bagge, bage, bagy, from Anglo-Norman bage or Medieval Latin bagea, bagia (“sign, emblem”), of uncertain origin. Possibly derived from Medieval Latin baga (“ring”), from Old Saxon bāg, bōg (“ring, ornament”), from Proto-Germanic *baugaz (“ring, bracelet, armband”); or possibly the Anglo-Norman word is derived from an earlier, unattested English word (compare Old English bēag (“ring, bracelet, collar, crown”). Cognate with Scots bagie, badgie, bawgy (“badge”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "badge (plural badges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distinctive mark, token, sign, emblem or cognizance, worn on one's clothing, as an insignia of some rank, or of the membership of an organization.",
                  "examples": [
                    "the badge of a society; the badge of a policeman"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small nameplate, identifying the wearer, and often giving additional information.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A card, sometimes with a barcode or magnetic strip, granting access to a certain area.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something characteristic; a mark; a token.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, thieves' cant) A brand on the hand of a thief, etc.",
                  "examples": [
                    "He has got his badge, and piked:  He was burned in the hand, and is at liberty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A carved ornament on the stern of a vessel, containing a window or the representation of one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A distinctive mark worn by servants, retainers, and followers of royalty or nobility, who, being beneath the rank of gentlemen, have no right to armorial bearings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graphical user interface) A small overlay on an icon that shows additional information about that item, such as the number of new alerts or messages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, video games) An icon or emblem awarded to a user for some achievement.",
                  "examples": [
                    "When you have checked in to the site from ten different cities, you unlock the Traveller badge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A police officer.",
                  "examples": [
                    "That's why every badge back home wanted to nail him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "badge (third-person singular simple present badges, present participle badging, simple past and past participle badged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark or distinguish with a badge.",
                  "examples": [
                    "The television was badged as 'GE', but wasn't made by them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To show a badge to.",
                  "examples": [
                    "He calmed down a lot when the policeman badged him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To enter a restricted area by showing one's badge.",
                  "examples": [
                    "And Patterson didn't hear that Jack Egger, the studio's director of security, said he'd seen John Orr badge his way through the pedestrian gate sometime before 4:00 pm, when the fire was still raging, [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}