{
  "word": "clothing",
  "etymologies": [
    {
      "description": [
        "From Middle English clothing, clathing; equivalent to clothe +‎ -ing. Cognate with Scots cleeding, cleiding, cleading (“clothing”), Dutch kleding (“clothing”), German Kleidung (“clothing”), Danish klædning (“clothing, dress, attire”), Swedish klädning (“dress”). Doublet of the dialectal English term cleading, from Middle English clething; compare also cladding."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clothing (countable and uncountable, plural clothings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of a wide variety of articles, usually made of fabrics, animal hair, animal skin, or some combination thereof, used to cover the human body for warmth, to preserve modesty, or for fashion.",
                  "examples": [
                    "You should wear warm clothing when it is cold outside.",
                    "All but two pieces of clothing came out of the washing machine stained.",
                    "A poncho is an item of clothing used by many people in Latin America.",
                    "A shirt is an article of clothing that covers the torso and arms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or instance of putting clothes on.",
                  "examples": [
                    "The clothing and unclothing of the idols was of special significance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The art or process of making cloth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A covering of non-conducting material on the outside of a boiler, or steam chamber, to prevent radiation of heat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clothing",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "present participle of clothe",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}