{
  "word": "season",
  "etymologies": [
    {
      "description": [
        "From Middle English sesoun, seson (“time of the year”), from Old French seson, saison (“time of sowing, seeding”), from Latin satiō (“act of sowing, planting”) from satum, past participle of serō (“to sow, plant”) from Proto-Indo-European *seh₁- (“to sow, plant”). Akin to Old English sāwan (“to sow”), sǣd (“seed”). Displaced native Middle English sele (“season”) (from Old English sǣl (“season, time, occasion”)), Middle English tide (“season, time of year”) (from Old English tīd (“time, period, yeartide, season”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "season (plural seasons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Each of the four divisions of a year: spring, summer, autumn (fall) and winter",
                  "examples": [
                    "Synonyms: yeartide, yeartime"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of a year when something particular happens.",
                  "examples": [
                    "mating season",
                    "the rainy season",
                    "the football season"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of the year in which a place is most busy or frequented for business, amusement, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The period over which a series of Test matches are played.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which gives relish; seasoning.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, Australia, broadcasting) A group of episodes of a television or radio program broadcast in regular intervals with a long break between each group, usually with one year between the beginning of each.",
                  "examples": [
                    "Synonym: series (British English)",
                    "The third season of Friends aired from 1996 to 1997."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) An extended, undefined period of time.",
                  "examples": [
                    "So it is in a person when a breach hath been made upon his conscience, quiet, perhaps credit, by his lust, in some eruption of actual sin; — carefulness, indignation, desire, fear, revenge are all set on work about it and against it, and lust is quiet for a season, being run down before them; but when the hurry is over and the inquest is past, the thief appears again alive, and is as busy as ever at his work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) The full set of downloadable content for a game, which can be purchased with a season pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A fixed period of time in a massively multiplayer online game in which new content (themes, rules, modes, etc.) becomes available, sometimes replacing earlier content.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "season (third-person singular simple present seasons, present participle seasoning, simple past and past participle seasoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To habituate, accustom, or inure (someone or something) to a particular use, purpose, or circumstance.",
                  "examples": [
                    "to season oneself to a climate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To prepare by drying or hardening, or removal of natural juices.",
                  "examples": [
                    "The timber needs to be seasoned."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become mature; to grow fit for use; to become adapted to a climate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become dry and hard, by the escape of the natural juices, or by being penetrated with other substance.",
                  "examples": [
                    "The wood has seasoned in the sun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mingle: to moderate, temper, or qualify by admixture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To impregnate (literally or figuratively).",
                  "examples": [
                    "When the male hath once seasoned the female he neuer after toucheth her."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French assaisonner."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "season (third-person singular simple present seasons, present participle seasoning, simple past and past participle seasoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To flavour food with spices, herbs or salt.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}