{
  "word": "trap",
  "etymologies": [
    {
      "description": [
        "From Middle English trappe, from Old English træppe, treppe (“trap, snare”) (also in betræppan (“to trap”)) from Proto-Germanic *trap-, from Proto-Indo-European *drebʰ- (“to step, trip, trample”).",
        "Akin to Old High German trappa, trapa (“trap, snare”), Middle Dutch trappe (“trap, snare”), Middle Low German treppe (“step, stair”) (German Treppe \"step, stair\"), Old English treppan (“to step, tread”). Connection to \"step\" is \"that upon which one steps\". French trappe and Spanish trampa are ultimately borrowings from Germanic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trap (countable and uncountable, plural traps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine or other device designed to catch (and sometimes kill) animals, either by holding them in a container, or by catching hold of part of the body.",
                  "examples": [
                    "Synonym: snare",
                    "I put down some traps in my apartment to try and deal with the mouse problem."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trick or arrangement designed to catch someone in a more general sense; a snare.",
                  "examples": [
                    "Unfortunately she fell into the trap of confusing biology with destiny."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A covering over a hole or opening; a trapdoor.",
                  "examples": [
                    "Close the trap, would you, before someone falls and breaks their neck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A kind of movable stepladder or set of stairs.",
                  "examples": [
                    "There is likewise a cabin trap with five steps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden instrument shaped somewhat like a shoe, used in the game of trapball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The game of trapball itself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any device used to hold and suddenly release an object.",
                  "examples": [
                    "They shot out of the school gates like greyhounds out of the trap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bend, sag, or other device in a waste-pipe arranged so that the liquid contents form a seal which prevents the escape of noxious gases, but permits the flow of liquids.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place in a water pipe, pump, etc., where air accumulates for lack of an outlet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, military, slang) A successful landing on an aircraft carrier using the carrier's arresting gear.",
                  "examples": [
                    "After 100 traps, the arresting cables have to be replaced to minimize the danger of a worn or fatigued cable snapping under an aircraft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A light two-wheeled carriage with springs.",
                  "examples": [
                    "a horse and trap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A person's mouth.",
                  "examples": [
                    "Keep your trap shut."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Synonym of vagina",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) A policeman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) Belongings.",
                  "examples": [
                    "...his cabin-mates in Montana losing small valuables from time to time, until at last, these things having been invariably found on Mr. Twain's person or in his \"trunk\" (newspaper he rolled his traps in)..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A cubicle (in a public toilet).",
                  "examples": [
                    "I've just laid a cable in trap 2 so I'd give it 5 minutes if I were you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) Trapshooting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A geological structure that creates a petroleum reservoir.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An exception generated by the processor or by an external event.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, slang, historical) A mining license inspector during the Australian gold rush.",
                  "examples": [
                    "The miners′ grievances centred on the issue of the compulsory purchase of miners′ licences and the harassment of raids by the licensing police, the ‘traps,’ in search of unlicensed miners."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, African-American Vernacular, also attributive) A vehicle, residential building, or sidewalk corner where drugs are manufactured, packaged, or sold.",
                  "examples": [
                    "trap phone",
                    "trap car"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, informal, sometimes offensive, sometimes derogatory) Someone who is anatomically male but who passes as female.",
                  "examples": [
                    "I love femboys better than trannies, traps are better than futa anyway. We conversed and we started to get close. I chose her. So, she told me to sit down so she can cut my hair. \"I want to dye my hair; how much is that?\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, informal, sometimes considered offensive) A fictional character from anime, or related media, who is coded as or has qualities typically associated with a gender other than the character's ostensible gender; otokonoko, josou.",
                  "examples": [
                    "One way to spot a trap is to look for an adam's apple."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, uncountable) A genre of hip-hop music, with half-time drums and heavy sub-bass.",
                  "examples": [
                    "Synonym: trap music"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) The money earned by a prostitute for a pimp.",
                  "examples": [
                    "The money clip held thirty-nine hundred dollars, combined with her trap money, she had five thousand dollars for her man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, African-American Vernacular, also attributive) An area, especially of a city, with a low level of opportunity and a high level of poverty and crime; a ghetto; a hood.",
                  "examples": [
                    "Maybe T.I was also making connection between fur trapping and living in the trap, or the hood."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trap (third-person singular simple present traps, present participle trapping, simple past and past participle trapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To physically capture, to catch in a trap or traps, or something like a trap.",
                  "examples": [
                    "to trap foxes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ensnare; to take by stratagem; to entrap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with a trap.",
                  "examples": [
                    "to trap a drain",
                    "to trap a sewer pipe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To set traps for game; to make a business of trapping game.",
                  "examples": [
                    "trap for beaver"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, military, slang, intransitive) To successfully land an aircraft on an aircraft carrier using the carrier's arresting gear.",
                  "examples": [
                    "After three consecutive bolters, the pilot finally trapped successfully on the Nimitz."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To leave suddenly, to flee.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, informal, African-American Vernacular, intransitive) To sell illegal drugs, especially in a public area.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, intransitive) To capture (e.g. an error) in order to handle or process it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining, dated) To attend to and open and close a (trap-)door.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, informal, sometimes offensive) Of a 'trap': to trick a (heterosexual) man into having sex, by appearing to be a woman.",
                  "examples": [
                    "Straight cis men persist in believing that my transition is all about them—tricking them, trapping them, ruining them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Swedish trapp (“step, stair, stairway”), from Middle Low German trappe (“stair, step”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trap (countable and uncountable, plural traps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dark coloured igneous rock, now used to designate any non-granitic igneous rock; trap rock.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Akin to Middle English trappe (“trappings, gear”), and perhaps from Old Northern French trape, a byform of Old French drap, a word of the same origin as English drab (“a kind of cloth”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "trap (third-person singular simple present traps, present participle trapping, simple past and past participle trapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dress with ornaments; to adorn (especially said of horses).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trap (plural traps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, bodybuilding, anatomy) The trapezius muscle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}