{
  "word": "caul",
  "etymologies": [
    {
      "description": [
        "From Middle English, from Middle French and Old French cale (“head covering”), from Late Latin calautica."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "caul (plural cauls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A style of close-fitting circular cap worn by women in the sixteenth century and later, often made of linen. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, historical, often capitalized, used on maps) An entry to a mill lead taken from a burn or stream (a mill lead (or mill waterway) is generally smaller than a canal but moves a large volume of water). [chiefly 1800-1950]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy, obsolete except in specific senses) A membrane. [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The thin membrane which covers the lower intestines; the omentum. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amnion which encloses the foetus before birth, especially that part of it which sometimes shrouds a baby’s head at birth (traditionally considered to be good luck). [from 16th c.]",
                  "examples": [
                    "Even in the mid seventeenth century a country gentleman might regard his caul as a treasure to be preserved with great care, and bequeathed to his descendants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The surface of a press that makes contact with panel product, especially a removable plate or sheet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(woodworking) A strip or block of wood used to distribute or direct clamping force.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) Caul fat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}