{
  "word": "pencil",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman and Old French pincil (see the variant pincel, which gave rise to Modern French pinceau (“paintbrush”)), from Latin pēnicillum, diminutive of pēniculus (“brush”), itself a diminutive of pēnis (“tail; penis”). Not related to pen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pencil (plural pencils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly historical) A paintbrush. [from 14th c.]",
                  "examples": [
                    "He requested three things of Sir Joshua Reynolds:—To forgive him thirty pounds which he had borrowed of him; to read the Bible; and never to use his pencil on a Sunday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A writing utensil with a graphite (commonly referred to as lead) shaft, usually blended with clay, clad in wood, and sharpened to a taper. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(optics) An aggregate or collection of rays of light, especially when diverging from, or converging to, a point. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A family of geometric objects with a common property, such as the set of lines that pass through a given point in a projective plane. [from 19th c.]",
                  "examples": [
                    "When, by the pencil becoming oblique to the surface, the vergency produced on the pencil becomes changed, the primary and secondary focal points, V and H, separate  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, obsolete, rare) A small medicated bougie. [19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) Ellipsis of power of the pencil.",
                  "examples": [
                    "And most important of all, Cully now had 'The Pencil', that most coveted of Las Vegas powers."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pencil (third-person singular simple present pencils, present participle (UK) pencilling or (US) penciling, simple past and past participle (UK) pencilled or (US) penciled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To write (something) using a pencil.",
                  "examples": [
                    "I penciled (BrE: pencilled) a brief reminder in my notebook."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark with, or as if with, a pencil.",
                  "examples": [
                    "It pencilled each flower with rich and variegated hues, and threw over its exuberant foliage a vesture of emerald green."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}