{
  "word": "revive",
  "etymologies": [
    {
      "description": [
        "From Middle English reviven, revyven, from Old French revivre and  Latin revīvō, from re- + vīvō (“live”, verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "revive (third-person singular simple present revives, present participle reviving, simple past and past participle revived)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To return to life; to become reanimated or reinvigorated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To return to life; to cause to recover life or strength; to cause to live anew, or to prevent from dying.",
                  "examples": [
                    "The dying puppy was revived by a soft hand.",
                    "Her grandmother refused to be revived if she lost consciousness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To recover from a state of oblivion, obscurity, neglect, or depression.",
                  "examples": [
                    "Classical learning revived in the fifteenth century.",
                    "The Manx language has been revived after dying out and is now taught in some schools on the Isle of Man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To restore, or bring again to life; to reanimate; to make lively again.",
                  "examples": [
                    "This new paint job should revive the surgery waiting room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise from coma, languor, depression, or discouragement; to bring into action after a suspension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To renew in the mind or memory; to bring to recollection; to recall attention to; to reawaken.",
                  "examples": [
                    "The Harry Potter films revived the world's interest in wizardry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To recover its natural or metallic state (e.g. a metal)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To restore or reduce to its natural or metallic state",
                  "examples": [
                    "to revive a metal after calcination"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}