{
  "word": "fan",
  "etymologies": [
    {
      "description": [
        "From Middle English fan, from Old English fann (“a winnowing, fan”), from Latin vannus (“fan for winnowing grain”), from Proto-Indo-European *h₂weh₁- (“to blow”). Cognate with\nLatin ventus (“wind”), Dutch wan (“fan”), German Wanne, Swedish vanna (“a fan for winnowing”), Old English windwian (“to fan, winnow”). More at winnow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fan (plural fans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hand-held device consisting of concertinaed material, or slats of material, gathered together at one end, that may be opened out into the shape of a sector of a circle and waved back and forth in order to move air towards oneself and cool oneself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An electrical or mechanical device for moving air, used for cooling people, machinery, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The action of fanning; agitation of the air.",
                  "examples": [
                    "\"If I cannot be of service, then I certainly don't wish to impose,\" said McGinty, with a quick fan of breeze that indicated a sweeping bow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything resembling a hand-held fan in shape, e.g., a peacock’s tail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instrument for winnowing grain, by moving which the grain is tossed and agitated, and the chaff is separated and blown away.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small vane or sail, used to keep the large sails of a smock mill always in the direction of the wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A section of a tree having a finite number of branches",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fan (third-person singular simple present fans, present participle fanning, simple past and past participle fanned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To blow air on (something) by means of a fan (hand-held, mechanical or electrical) or otherwise.",
                  "examples": [
                    "We enjoyed standing at the edge of the cliff, being fanned by the wind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To slap (a behind, especially).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, usually to fan out) To move or spread in multiple directions from one point, in the shape of a hand-held fan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dispel by waving a hand-held fan.",
                  "examples": [
                    "I attempted to fan the disagreeable odour out of the room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms, transitive) To perform a maneuver that involves flicking the top rear of an old-style gun.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metaphoric) To invigorate, like flames when fanned.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To winnow grain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, transitive) To apply (the air brake) many times in rapid succession.",
                  "examples": [
                    "Fanning the brakes results in the gradual depletion of the pressure in the cars' brake reservoirs, which can eventually cause a loss of all braking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, intransitive) To strike out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, transitive) To strike out (a batter).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of fanatic, originally in US baseball slang. Possibly influenced by fancy (“group of sport or hobby enthusiasts”), i.e. fancy boy (“fan”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fan (plural fans or fen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is fond of something or someone, especially an admirer of a performer or aficionado of a sport.",
                  "examples": [
                    "I am a big fan of libraries."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}