{
  "word": "constellation",
  "etymologies": [
    {
      "description": [
        "From Middle English constellacioun, constillacioun, from Middle French constellation, from Latin cōnstēllātiō, from con- (“together”) + stēllātus (“starred”), from stēlla (“star, astral body”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "constellation (plural constellations)",
          "definitionGroups": [
            {
              "group": "(astronomy) An asterism, an arbitrary formation of stars perceived as a figure or pattern, or a division of the sky including it, especially one officially recognised by astronomers.",
              "entries": [
                {
                  "meaning": "(modern astronomy) Any of the 88 regions of the sky officially recognized by the IAU, including all stars and celestial bodies in the region. [1920s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An image associated with a group of stars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) The configuration of planets at a given time (notably of birth), as used for determining a horoscope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A wide, seemingly unlimited assortment.",
                  "examples": [
                    "A constellation of possibilities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(space flight) A fleet of satellites of the same purpose (such as the set of GPS satellites, or Iridium satcom fleet).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A configuration or grouping.",
                  "examples": [
                    "This software constellation persists today as Microsoft Office, the most popular software tool set in history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A network of connections that exists between people who are in polyamorous relationships, for example between one person, their partner, and that person's partner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}