{
  "word": "kilt",
  "etymologies": [
    {
      "description": [
        "From Middle English kilten (“to tuck up, gird”), apparently from North Germanic, ultimately from Old Norse kelta, kjalta (“skirt; lap”). Perhaps from Proto-Germanic *kelt-, *kelþǭ, *kilþį̄ (“womb”), from Proto-Indo-European *gelt- (“round body; child”).  Cognate with Danish kilte (“to tuck”), Swedish kilta (“to swathe”). Related to English child."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kilt (plural kilts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A traditional Scottish garment, usually worn by men, having roughly the same morphology as a wrap-around skirt, with overlapping front aprons and pleated around the sides and back, and usually made of twill-woven worsted wool with a tartan pattern. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Any Scottish garment from which the above lies in a direct line of descent, such as the philibeg, or the great kilt or belted plaid",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plaid, pleated school uniform skirt sometimes structured as a wraparound, sometimes pleated throughout the entire circumference; also worn by boys in the 19th-century United States.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A variety of non-bifurcated garments made for men and loosely resembling a Scottish kilt, but most often made from different fabrics and not always with tartan plaid designs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "kilt (third-person singular simple present kilts, present participle kilting, simple past and past participle kilted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To gather up (skirts) around the body. [from 14th c.]",
                  "examples": [
                    "Else at her new place worked outdoor and indoor, she'd to kilt her skirts (if they needed kilting – and that was damned little with those short-like frocks) and go out and help at the spreading of dung […]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "kill +‎ -t"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "kilt",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or colloquial, especially Ireland or African-American Vernacular) Nonstandard form of killed: simple past tense and past participle of kill.",
                  "examples": [
                    "But tweren’t so awful long before Marse Hampton got kilt in de big battle, and Marse Thad, too. Dey was both kilt in de charge, right dere on de breastworks, with de guns in dey hands, dem two young masters of mine, right dere in dat Gettysburg battle  […]  And I was eighteen in dat October after dat big fight what Marse Thad and Marse Hampton got kilt in."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}