{
  "word": "technique",
  "etymologies": [
    {
      "description": [
        "Borrowed from French technique (“technicality; branch of knowledge”), noun use of technique (“technical”), from Ancient Greek τεχνικός (tekhnikós, “of or pertaining to art, artistic, skilful”), from τέχνη (tékhnē, “art, handicraft”), from τίκτειν (tíktein, “to bring forth, produce, engender”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "technique (countable and uncountable, plural techniques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The practical aspects of a given art, occupation etc.; formal requirements. [from 19th c.]",
                  "examples": [
                    "Brahms, after realizing that the technique of the piano was developing along mistaken lines, and his own danger of stereotyping his style, keeps away from it for most of his middle age [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Practical ability in some given field or practice, often as opposed to creativity or imaginative skill. [from 19th c.]",
                  "examples": [
                    "Yet those who packed concert halls to listen to him sing, as Indians did for over six decades, rarely mentioned his technique."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A method of achieving something or carrying something out, especially one requiring some skill or knowledge. [from 19th c.]",
                  "examples": [
                    "They said executives were warned about one technique nicknamed \"carpet karaoke\", which involved bending deportees over in aircraft seats to silence them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}