{
  "word": "parish",
  "etymologies": [
    {
      "description": [
        "From Middle English parisshe, from Old French paroisse (compare the obsolete variant paroch, from Anglo-Norman paroche, parosse), from Late Latin parochia, from Ancient Greek παροικία (paroikía, “a dwelling abroad”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parish (plural parishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the Anglican, Eastern Orthodox, Lutheran and Roman Catholic Church, an administrative part of a diocese that has its own church.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The community attending that church; the members of the parish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) An ecclesiastical society, usually not bounded by territorial limits, but composed of those persons who choose to unite under the charge of a particular priest, clergyman, or minister; also, loosely, the territory in which the members of a congregation live.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A civil subdivision of a British county, often corresponding to an earlier ecclesiastical parish.",
                  "examples": []
                }
              ]
            },
            {
              "group": "In some countries, an administrative subdivision of an area.",
              "entries": [
                {
                  "meaning": "An administrative subdivision in the U.S. state of Louisiana that is equivalent to a county in other U.S. states.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "parish (third-person singular simple present parishes, present participle parishing, simple past and past participle parished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place (an area, or rarely a person) into one or more parishes.",
                  "examples": [
                    "[…]  [m]akes possible, through the aid of the rural ministers, the development of the various phases of the District program, such as (a) Parishing of the District; (b) Interdenominational adjustment in the interest of rural religious advance  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To visit residents of a parish.",
                  "examples": [
                    "\"You will take pleasure in parishing. Mother used to parish.\"",
                    "\"How do you know I like parishing?\"",
                    "\"Your uncle said so.\"",
                    "\"Oh! did he?\"",
                    "\"And you may like the rectory people; it's a fine old house, and often full of visitors.\""
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "parish (third-person singular simple present parishes, present participle parishing, simple past and past participle parished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pronunciation spelling of perish, representing Mary-marry-merry English.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}