{
  "word": "winker",
  "etymologies": [
    {
      "description": [
        "wink +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "winker (plural winkers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A screen attached to the bridle of a horse or other domesticated animal preventing it from being able to see things to its side.",
                  "examples": [
                    "[…]  because this Censurer slaundereth manie men, another might say of him, he is the common packhorse of the Papistes, to carrie any fardell of lyes deuised against any Christian man or booke that commeth in his way, and the rather because he weareth a paire of winkers ouer his eyes like a milhorse, being ashamed to shewe either his face or his name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Somebody who winks; somebody who connives.",
                  "examples": [
                    "And so may we iudge of these wilye winkers in Religion, that either they be blindstockes in deede and lacke the light of that Heauenlye wysedome, which they pretende to haue, or els their wicked wysedome is but a cloake of wickednes  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, colloquial) An eye.",
                  "examples": [
                    "With keener stare",
                    "The man’s eyes scanned him, with the flare",
                    "Of yellow light full on his face,",
                    "As though his memory sought to trace",
                    "Something familiar in the lean",
                    "Clearcut young features and the clean",
                    "Blue winkers: then his own hard eyes",
                    "Twinkled  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial) An eyelash.",
                  "examples": [
                    "‘We’re like father and Aunt Nina, hanging on the wall in the library. Mother’s got big black eyes, with winkers a rod long, and her hair shines like my velvet coat, and comes most to her feet.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The winking membrane of a bird's eye; the winking muscle.",
                  "examples": [
                    "There is a third inner eyelid, highly developed and of beautiful mechanism: this is the nictitating membrane, or “winker” (nictito, I wink), a delicate, elastic, translucent, pearly-white fold of the conjunctiva. While the other lids move vertically and have a horizontal commissure, the winker sweeps horizontally or obliquely across the ball, from the side next the beak to the opposite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small bellows in an organ, regulated by a spring, controlling variations of wind pressure.",
                  "examples": [
                    "Where the wind-trunk is short between the reservoir and wind-chests the tone will be steady; but when it is long, and with bends, the elasticity of the air causes an unsteadiness in the tone, which must be obviated by the use of concussion-bellows, sometimes called “winkers,” or by an elastic diaphragm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A player of the game of tiddlywinks.",
                  "examples": [
                    "Synonym: tiddlywinker"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}