{
  "word": "abash",
  "etymologies": [
    {
      "description": [
        "Attested from 1303, as Middle English abaisen, abaishen, abashen (“lose one's composure, be upset”), from the later 14th-century also transitive \"to make ashamed, to perplex or embarass\"; from Anglo-Norman abaïss, from Middle French abair, abaisser (“lose one's composure, be startled, be stunned”), from Old French esbaïr, (French ébahir), from es- (“utterly”) + baïr (“to astonish”), from Medieval Latin *exbadō, from ex- (“out of”) + bado (“I gape, yawn”), an onomatopoeic word imitating a yawn, see also French badaud (“rubbernecker”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "abash (third-person singular simple present abashes, present participle abashing, simple past and past participle abashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make ashamed; to embarrass; to destroy the self-possession of, as by exciting suddenly a consciousness of guilt, mistake, or inferiority; to disconcert; to discomfit. [First attested from around (1150 to 1350).]",
                  "examples": [
                    "Synonyms: bewilder, confuse, confound, daunt, discompose, disconcert, discountenance, dishearten, embarrass, faze, fluster, humble, humiliate, mortify, rattle, shake, shame, snub",
                    "Antonyms: abet, animate, buoy, cheer, countenance, embolden, encourage, incite, inspirit, rally, reassure, uphold"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To lose self-possession; to become ashamed. [Attested from around (1350 to 1470) until the late 16th century.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}