{
  "word": "intrigue",
  "etymologies": [
    {
      "description": [
        "Borrowed from French intrigue, from Italian intricare, from Latin intrīcō (“I entangle, perplex, embarrass”). Doublet of intricate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "intrigue (countable and uncountable, plural intrigues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A complicated or clandestine plot or scheme intended to effect some purpose by secret artifice; conspiracy; stratagem.",
                  "examples": [
                    "[…]  lost in such a jungle of intrigues, pettifoggings, treacheries, diplomacies domestic and foreign  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The plot of a play, poem or romance; the series of complications in which a writer involves their imaginary characters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clandestine intercourse between persons; illicit intimacy; a liaison or affair.",
                  "examples": [
                    "In 1679 and 1680 there were persistent rumors of an intrigue between Mary, Lady Grey, and the Duke of Monmouth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "intrigue (third-person singular simple present intrigues, present participle intriguing, simple past and past participle intrigued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To conceive or carry out a secret plan intended to harm; to form a plot or scheme.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To arouse the interest of; to fascinate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have clandestine or illicit intercourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill with artifice and duplicity; to complicate.",
                  "examples": [
                    "How doth it [sin] perplex and intrigue the whole course of your lives!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}