{
  "word": "will",
  "etymologies": [
    {
      "description": [
        "From Middle English willen, wullen, wollen, from Old English willan (“to want”), from Proto-West Germanic *willjan, from Proto-Germanic *wiljaną, from Proto-Indo-European *welh₁- (“to choose, wish”).",
        "Cognate with Dutch willen, Low German willen, German wollen, Swedish and Norwegian Nynorsk vilja, Norwegian Bokmål ville, Latin velle (“wish”, verb) and Albanian vel (“to satisfy, be stuffed”). The verb is not always distinguishable from Etymology 3, below."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "will (third-person singular simple present will, present participle willing, simple past would, no past participle)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary) Used to express the future tense, sometimes with some implication of volition when used in the first person. Compare shall. [from 10th c.]",
                  "examples": [
                    "One of our salesmen will visit you tomorrow.",
                    "I will pass this exam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary) To be able to, to have the capacity to. [from 14th c.]",
                  "examples": [
                    "Unfortunately, only one of these gloves will actually fit over my hand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary) Expressing a present tense with some conditional or subjective weakening: \"will turn out to\", \"must by inference\". [from 15th c.]",
                  "examples": [
                    "He will be home by now. He always gets home before 6 o'clock.",
                    "I can't find my umbrella. I will have forgotten it home this morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary) To habitually do (a given action). [from 9th c.]",
                  "examples": [
                    "Boys will be boys."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary) To choose or agree to (do something); used to express intention but without any temporal connotations (+ bare infinitive), often in questions and negation. [from 10th c.]",
                  "examples": [
                    "Will you marry me?",
                    "I’ve told him three times, but he won’t take his medicine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now uncommon or literary, transitive) To wish, desire (something). [chiefly 9th–19th c.]",
                  "examples": [
                    "Do what you will."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, intransitive) To wish or desire (that something happen); to intend (that). [9th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Implying will go.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English wille, from Old English willa (compare verb willian), from Proto-Germanic *wiljô (“desire, will”), from Proto-Indo-European *welh₁- (“to choose, wish”). Cognate with Dutch wil, German Wille, Swedish vilja, Norwegian vilje."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "will (plural wills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's independent faculty of choice; the ability to be able to exercise one's choice or intention. [from 9th c.]",
                  "examples": [
                    "Of course, man's will is often regulated by his reason."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of choosing to do something; a person’s conscious intent or volition. [from 10th c.]",
                  "examples": [
                    "Most creatures have a will to live."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's intention or decision; someone's orders or commands. [from 9th c.]",
                  "examples": [
                    "Eventually I submitted to my parents' will."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Firmity of purpose, fixity of intent",
                  "examples": [
                    "Synonyms: determination, firmness, resoluteness, resolve"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A formal declaration of one's intent concerning the disposal of one's property and holdings after death; the legal document stating such wishes. [from 14th c.]",
                  "examples": [
                    "Synonyms: testament, last will, last will and testament"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) That which is desired; one's wish. [from 10th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Desire, longing. (Now generally merged with later senses.) [from 9th c.]",
                  "examples": [
                    "He felt a great will to make a pilgrimage to the Holy Land."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English willen, from Old English willian (“to will”), from Proto-West Germanic *willjōn (“to will”), from Proto-Indo-European *welh₁- (“to choose, wish”). Cognate with German Low German willen, German willen. The verb is not always distinguishable from Etymology 1, above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "will (third-person singular simple present wills, present participle willing, simple past and past participle willed or (rare) would)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To instruct (that something be done) in one's will. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bequeath (something) to someone in one's will (legal document). [from 15th c.]",
                  "examples": [
                    "He willed his stamp collection to the local museum."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exert one's force of will (intention) in order to compel, or attempt to compel, something to happen or someone to do something. [from 10th c.]",
                  "examples": [
                    "All the fans were willing their team to win the game."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}