{
  "word": "hod",
  "etymologies": [
    {
      "description": [
        "Borrowed from Scots hod (“to jog along on horseback”), probably related to hotch (“(verb) to move up and down jerkily, bob; to jog along on horseback; to hop like a frog; to fidget; to shrug; to heave with laughter; to cause to move jerkily; to shift in a sitting position to make room for others; to be overrun with; to swarm; (figuratively) to be angry; (noun) a jerk, jolt; a shrug; a fidget, twitch; a swarm of vermin; large, ungainly woman; untidy woman (figuratively) a hostile encounter, clash; state of disorder and filth, mess”) (whence English hotch (“to move irregularly up and down; to swarm”) (chiefly Scotland)), from Late Middle English hotchen (“to move jerkily, jolt; to attack (someone) (?)”), from Anglo-Norman hocher (“to shake (something) to and fro, jostle; to attack”) and Middle French hocher, Middle French, Old French hochier (“to shake (something) to and fro, jostle; to be unstable or wobbly, shake”) (modern French hocher (“to nod the head”)), from Frankish *hotsōn, *hottisōn, from *hottōn (“to shake; to toss”), perhaps ultimately from Proto-Germanic *hud- (“to shake”), from Proto-Indo-European *(s)ket- or *kwēt- (“to rock back and forth; to shake”), probably originally onomatopoeic.",
        "Compare Scots hotter (“(verb) to move in a jerky, uneven manner; to jolt; to shake; to walk unsteadily, totter; to shiver, shudder; to shake (with laughter); of liquid, etc.: to boil, bubble, seethe, sputter; to crowd, swarm; (noun) jolting or shaking; rattling sound; bubbling of boiling liquid; a shake, shiver; crowd, seething mass; motion or noise of such a crowd; jumbled heap”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hod (third-person singular simple present hods, present participle hodding, simple past and past participle hodded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Scotland, obsolete) To bob up and down on horseback, as an inexperienced rider may do; to jog.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably an alteration of hot (“(Northern England, Scotland) large basket for carrying earth, etc.”), from Middle English hott, hote, hotte (“large basket or pannier for carrying earth, etc.; unit of measure for grain; hut or shed (perhaps originally of wattlework); lump of dirt (?)”) [and other forms], from Anglo-Norman and Old French hote, hotte (“large basket carried on the back”) (modern French hotte (“carrying basket”)), from Frankish *hotta (“basket”), perhaps from Proto-Germanic *hud- (“to shake”) (see further at etymology 1), ultimately an onomatopoeia of the swaying movement of such a basket (compare Middle Dutch hotten (“to jolt; shake”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hod (plural hods)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A three-sided box mounted on a pole for carrying bricks, mortar, or other construction materials over the shoulder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount of material held by a hod (sense 1); a hodful.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blowpipe used by a pewterer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horse racing) A bookmaker's bag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally Britain, dialectal and US) A receptacle for carrying coal, particularly one shaped like a bucket which is designed for loading coal or coke through the door of a firebox.",
                  "examples": [
                    "Coordinate term: scuttle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}