{
  "word": "worry",
  "etymologies": [
    {
      "description": [
        "From Middle English worien, werien, wirien, wirwen, wyryȝen (“to choke, strangle”), from Old English wyrġan, from Proto-Germanic *wurgijaną, from Proto-Indo-European *werǵʰ- (“bind, squeeze”).",
        "Cognate with Dutch worgen, wurgen, German würgen. Compare Latin urgere (“to press, push”), Sanskrit वृहति (vṛhati, “to tear out, pluck”), Lithuanian ver̃žti (“to string; squeeze”), Russian (poetic) отверза́ть (otverzátʹ, “to open”, literally “to untie”). Related to wring."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "worry (countable and uncountable, plural worries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strong feeling of anxiety.",
                  "examples": [
                    "I'm afflicted by worry throughout the night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance or cause of such a feeling.",
                  "examples": [
                    "My main worry is that I'll miss the train."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who causes worry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "worry (third-person singular simple present worries, present participle worrying, simple past and past participle worried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be troubled; to give way to mental anxiety or doubt.",
                  "examples": [
                    "Stop worrying about your test; it’ll be fine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Disturb the peace of mind of; afflict with mental agitation or distress.",
                  "examples": [
                    "Your tone of voice worries me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To harass; to irritate or distress.",
                  "examples": [
                    "The President was worried into military action by persistent advisors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seize or shake by the throat, especially of a dog or wolf.",
                  "examples": [
                    "Your dog’s been worrying sheep again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch repeatedly, to fiddle with.",
                  "examples": [
                    "So what if I wanted to touch my nose to the windshield? Who was it hurting? Why was it that he could repeatedly worry his change and bite his lower lip without the threat of punishment?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, Scotland) To strangle.",
                  "examples": [
                    "We read (Law's Memor. Pref. lix.) that \"one John Brugh, a notorious warlock (wizard) in the parochin of Fossoquhy, by the space of thirty-six years, was worried at a stake and burned, 1643.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}