{
  "word": "gospel",
  "etymologies": [
    {
      "description": [
        "From Middle English gospel, gospell, godspel, godspell, goddspell, from Old English godspell (“gospel”), corresponding to God +‎ spell (“talk, tale, story”), literally “the message of God”, believed to be an alteration of earlier *gōdspell (literally “good news”), used to translate ecclesiastical Latin bona annūntiātiō, itself a translation of Ecclesiastical Latin ēvangelium / Ancient Greek εὐαγγέλιον (euangélion, “evangel”, literally “good news”) (English evangel). Compare Old Saxon gōdspel and godspell (“gospel”), Old High German and Middle High German gotspel (“gospel”), Icelandic guðspjall (“gospel”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gospel (countable and uncountable, plural gospels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The first section of the Christian New Testament scripture, comprising the books of Matthew, Mark, Luke and John, concerned with the birth, ministry, passion, and resurrection of Jesus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An account of those aspects of Jesus' life, generally written during the first several centuries of the Common Era.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Protestantism) The teaching of Divine grace as distinguished from the Law or Divine commandments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A message expected to have positive reception or effect, one promoted as offering important (or even infallible) guiding principles.",
                  "examples": [
                    "Spreading the gospel of dental hygiene in Vermont"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) That which is absolutely authoritative (definitive).",
                  "examples": [
                    "took her words for gospel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Gospel music.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gospellen, from Old English godspellian (“to preach the gospel, evangelise”), from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "gospel (third-person singular simple present gospels, present participle gospelling or (US) gospeling, simple past and past participle gospelled or (US) gospeled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To instruct in, declare, or communicate the gospel; to evangelise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}