{
  "word": "nones",
  "etymologies": [
    {
      "description": [
        "From Latin nōnus (“ninth”).",
        "As a day of the Roman calendar, via nōnae (“ninth days”) from the original Roman practice of counting forward to the next full or new crescent moon, the nones' occurrence 8 days before the ides of every month (9 counting inclusively) following the establishment of a fixed calendar, and from the Latin practice of treating most recurring calendrical days as plurals. Some scholars believe the name is a variant of the nundines (nūndinae fēriae (“ninth-day festival”)), the Roman market days held every eight days (9 counting inclusively), which were likely announced for each coming month by the Roman kings on the first-quarter days.",
        "As a time of day, via the plural form of Middle English, Anglo-Norman, & French none and Latin nōna (“ninth hour”) after the manner of earlier matins, vespers, etc. As a meal, from the time of day, whether from its plural, genitive, or the occasional adverbial sense of -s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nones (plural nones)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, often capitalized) The notional first-quarter day of a Roman month, occurring on the 7th day of the four original 31-day months (March, May, Quintilis or July, and October) and on the 5th day of all other months.",
                  "examples": [
                    "Þa monðas þe habbað iiii nonas æfter kalendas... habbað to idus xiii dagas and to ii kalendas eahtatyne.\nThose months that have 4 nones after the kalends... have 13 days to the ides and eighteen to the second kalends."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, sometimes capitalized) The ninth hour after dawn (about 3 pm).",
                  "examples": [
                    "...the same Liturgy of prayers be used both at Nones and Vespers.[With the note:] Nones was what we call three o'clock in the afternoon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christian) The divine office appointed to the hour.",
                  "examples": [
                    "The Greek monks always listen to their reader recite Psalms 83, 84, and 85 from the Septuagint at nones.",
                    "Synonym: none",
                    "Hypernym: canonical hours"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Alternative form of noon: the sixth hour after dawn; midday (12 pm).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Synonym of lunch: a meal eaten around noon.",
                  "examples": [
                    "I... ouer-seye me at my sopere and some tyme at nones."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "See Nones."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nones pl",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of Nones: atheists or those without religious affiliation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}