{
  "word": "opinion",
  "etymologies": [
    {
      "description": [
        "From English opine +‎ -ion, from Middle English opinion, opinioun, from Anglo-Norman and Middle French opinion, from Latin opīniō, from opīnor (“to opine”). Displaced native Old English wēna."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "opinion (plural opinions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A belief, judgment or perspective that a person has formed, either through objective or subjective reasoning, about a topic, issue, person or thing.",
                  "examples": [
                    "I would like to know your opinions on the new filing system.",
                    "In my opinion, white chocolate is better than milk chocolate.",
                    "Every man is a fool in some man's opinion.",
                    "We invite you to state your opinions about the suggestions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The judgment or sentiment which the mind forms of persons or things; estimation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Favorable estimation; hence, consideration; reputation; fame; public sentiment or esteem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Obstinacy in holding to one's belief or impression; opiniativeness; conceitedness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The formal decision, or expression of views, of a judge, an umpire, a doctor, or other party officially called upon to consider and decide upon a matter or point submitted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(European Union law) a judicial opinion delivered by an Advocate General to the European Court of Justice where he or she proposes a legal solution to the cases for which the court is responsible",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "opinion (third-person singular simple present opinions, present participle opinioning, simple past and past participle opinioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To have or express as an opinion.",
                  "examples": [
                    "But if (as some opinion) King Ahasuerus were Artaxerxes Mnemon [...], our magnified Cyrus was his second Brother"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}