{
  "word": "tissue",
  "etymologies": [
    {
      "description": [
        "From Middle English tissu, from Old French tissu, past participle of tistre, from Latin texere."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tissue (countable and uncountable, plural tissues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Thin, woven, gauze-like fabric.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fine transparent silk material, used for veils, etc.; specifically, cloth interwoven with gold or silver threads, or embossed with figures.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sheet of absorbent paper, especially one that is made to be used as tissue paper, toilet paper or a handkerchief.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Absorbent paper as material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A group of cells (along with their extracellular matrix if any) that are similar in origin and function together to do a specific job.",
                  "examples": [
                    "What they lack is outermost brain tissue that, at least in humans, prompts awareness and interpretation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Web; texture; complicated fabrication; connected series.",
                  "examples": [
                    "a tissue of forgeries, or of lies"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horse racing, slang) The scratch sheet or racing form.",
                  "examples": [
                    "Pricing the first show is a matter of the bookmaker's individual judgment, relying upon advice from all quarters, particularly the tissue; but very soon in the betting exchanges it becomes clear that the sole criterion for the fixing of a horse's price is demand."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tissue (third-person singular simple present tissues, present participle tissuing, simple past and past participle tissued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form tissue of; to interweave.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}