{
  "word": "public",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman publik, public, Middle French public, publique et al., and their source, Latin pūblicus (“pertaining to the people”). Compare people."
      ],
      "adjectives": [
        {
          "description": "public (comparative more public, superlative most public)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Able to be seen or known by everyone; open to general view, happening without concealment. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to the people as a whole (as opposed to a private group); concerning the whole country, community etc. [from 15th c.]",
                  "examples": [
                    "A mere 3% of the more than 1,000 people interviewed said they actually knew what the conference was about. It seems safe to say public awareness of the Convention on Biological Awareness in Nagoya - and its goal of safeguarding wildlife - is close to non-existent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Officially representing the community; carried out or funded by the state on behalf of the community. [from 15th c.]",
                  "examples": [
                    "But culture's total budget is a tiny proportion of all public spending; it is one of the government's most visible success stories."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Open to all members of a community; especially, provided by national or local authorities and supported by money from taxes. [from 15th c.]",
                  "examples": [
                    "Some are left for dead on rubbish tips, in refuge bags or at public toilets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a company) Traded publicly via a stock market.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, object-oriented programming) Accessible to the program in general, not only to the class or any subclasses.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "public (plural publics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The people in general, regardless of membership of any particular group.",
                  "examples": [
                    "Members of the public may not proceed beyond this point."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(public relations) A particular group or demographic to be targeted.",
                  "examples": [
                    "To the extent that you will use them to reach many other publics, the news media will also be one of your publics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A public house; an inn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}