{
  "word": "footed",
  "etymologies": [
    {
      "description": [
        "From foot +‎ -ed."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "footed",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense and past participle of foot",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English foted, i-foted, equivalent to foot +‎ -ed."
      ],
      "adjectives": [
        {
          "description": "footed (comparative more footed, superlative most footed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a foot or feet; (in combination) having a specified form or type of foot or number of feet.",
                  "examples": [
                    "To maintaine therefore that sconce of thine, strongly guarded, and in good reparation, never suffer combe to fasten his teeth there: let thy haire grow thick and bushy like a forest, or some wildernesse; lest those sixe-footed creatures that breed in it, and are Tenants to that crowneland of thine, bee hunted to death by every base barbarous Barber; and so that delicate, and tickling pleasure of scratching, be utterly taken from thee:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetry, usually in combination) Consisting of, or having been put into, metrical feet (of a specified character or number).",
                  "examples": [
                    "As for the strict forms in which the original poems were written, it seemed an empty exercise to force English into those particular strictures, which in Bengali literary tradition are richly associative but which in English are not. The familiar fourteen-syllable payār couplet with its aa bb cc rhymes and the more intricate three-footed tripadi of variable length and rhyme were the first casualties of the process."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a vessel) Having a foot",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}