{
  "word": "comparison",
  "etymologies": [
    {
      "description": [
        "From Middle English comparisoun, from Old French comparison, from Latin comparātiō, from comparātus, perfect passive participle of comparō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "comparison (countable and uncountable, plural comparisons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of comparing or the state or process of being compared.",
                  "examples": [
                    "to bring a thing into comparison with another;  there is no comparison between them"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An evaluation of the similarities and differences of one or more things relative to some other or each other.",
                  "examples": [
                    "He made a careful comparison of the available products before buying anything."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With a negation, the state of being similar or alike.",
                  "examples": [
                    "There really is no comparison between the performance of today's computers and those of a decade ago."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A feature in the morphology or syntax of some languages whereby adjectives and adverbs are inflected to indicate the relative degree of the property they define exhibited by the word or phrase they modify or describe.",
                  "examples": [
                    "In English, adjectives and adverbs have three forms when making a comparison: the plain form \"hot\", the comparative form \"hotter\", and the superlative form \"hottest\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That to which, or with which, a thing is compared, as being equal or like; illustration; similitude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric) A simile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phrenology) The faculty of the reflective group which is supposed to perceive resemblances and contrasts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}