{
  "word": "replay",
  "etymologies": [
    {
      "description": [
        "re- +‎ play"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "replay (plural replays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or instance of replaying (of playing something, such as a game, again); a replaying of (something).",
                  "examples": [
                    "It's a no-frills, no-hype game that's not only original in concept but fun to play while providing massive replay value."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A repeat or subsequent playing of some or all of something which was previously broadcast or performed, or a playing of something which was recorded, such as a live event or a television broadcast, the gameplay of a computer game, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A (video or audio) recording of an action or event that is or can be replayed after being recorded; saved video footage (which is, or can be, replayed) of the gameplay of a computer game, a (portion of a) televised sports match, etc.",
                  "examples": [
                    "Show us that replay one more time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A replayed match, often after the first game or match ended in a draw; a rematch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A repetition of another event, scene, or occurrence; a recurrence or reenactment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "replay (third-person singular simple present replays, present participle replaying, simple past and past participle replayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To play again.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To display a recording of a previous event, especially multiple times.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}