{
  "word": "paean",
  "etymologies": [
    {
      "description": [
        "From Latin paeān (“a hymn, especially a victory hymn, to Apollo or another god”), from Ancient Greek παιᾱ́ν (paiā́n, “a chant or song, especially a thanksgiving or victory hymn, to Apollo under the name Παιᾱ́ν (Paiā́n)”), from the phrase Ἰὼ Παιᾱ́ν (Iṑ Paiā́n, “O Paean!, Thanks to Paean!”). According to Homer, Paián or Paean was the name of the physician of the gods; its further etymology is unclear. It has been suggested that Παιᾱ́ν is derived from *παιάϝων (*paiáwōn, “one who heals illnesses through magic”), from *παῖϝα (*paîwa), *παϝία (*pawía, “to blow”), related to παίω (paíō, “to hit, strike”) (from Proto-Indo-European *pēu-, *pyu-, *pū- (“to hit; to cut”)), or from παύω (paúō, “to bring to an end; to abate, to stop”) (from Proto-Indo-European *peh₂w- (“few, little; smallness”)), or that it may be a Pre-Greek word.",
        "Compare Middle French and French paean (also French péan), Italian peana, Portuguese peã, péan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "paean (plural paeans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Greece, historical) A chant or song, especially a hymn of thanksgiving for deliverance or victory, to Apollo or sometimes another god or goddess; hence any song sung to solicit victory in battle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any loud and joyous song; a song of triumph.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) An enthusiastic expression of praise.",
                  "examples": [
                    "Synonyms: hymn, encomium, praise, tribute"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "paean (third-person singular simple present paeans, present participle paeaning, simple past and past participle paeaned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To sing a paean; to praise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}