{
  "word": "flop",
  "etymologies": [
    {
      "description": [
        "Recorded since 1602, probably a variant of flap with a duller, heavier sound"
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "flop (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Right, squarely, flat-out.",
                  "examples": [
                    "She fell flop on the floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With a flopping sound.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "flop (plural flops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heavy, passive fall; a plopping down.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A complete failure, especially in the entertainment industry.",
                  "examples": [
                    "Synonyms: dud, fiasco, turkey, box office bomb"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) The first three cards turned face-up by the dealer in a community card poker game.",
                  "examples": [
                    "The flop didn't help you but probably did help the other hands."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ponded package of dung, as in a cow-flop.",
                  "examples": [
                    "\"Maybe as you think,\" he said, \"because as I've the misfortune of an accidental slip on a cow-flop therefore I has the inability of an unborn babe, ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A flophouse.",
                  "examples": [
                    "He was kind of worn but the tooth said he'd never lost a fight or slept in a flop."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flop (third-person singular simple present flops, present participle flopping, simple past and past participle flopped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fall heavily due to lack of energy.",
                  "examples": [
                    "He flopped down in front of the television, exhausted from work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to drop heavily.",
                  "examples": [
                    "The tired mule flopped its ears forward and trudged on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To fail completely; not to be successful at all (of a movie, play, book, song etc.).",
                  "examples": [
                    "The latest album flopped and so the studio canceled her contract."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, intransitive) To pretend to be fouled in sports, such as basketball, hockey (the same as to dive in soccer)",
                  "examples": [
                    "It starts with Chris Paul, because Blake didn't really used to flop like that, you know, last year.",
                    "While Stern chastised Vogel for on Thursday calling the Heat \"the biggest flopping team in the NBA,\" he did intimate that he sees merit in the sentiment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To strike about with something broad and flat, as a fish with its tail, or a bird with its wings; to rise and fall; to flap.",
                  "examples": [
                    "The brim of a hat flops."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker, transitive) To have (a hand) using the community cards dealt on the flop.",
                  "examples": [
                    "Both players flopped sets! Cards dealt on the flop: Q95. Player A's hole cards: 55 (making three of a kind: 555). Player B's hole cards: QQ (making three of a kind: QQQ)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To stay, sleep or live in a place.",
                  "examples": [
                    "[…]  not just the old material goal of \"three hots and a place to flop,\"  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To flip; to reverse (an image).",
                  "examples": [
                    "The possibilities of this type of shot are almost limitless. By quartering the screen and duplicating and flopping the picture, a kaleidoscopic effect is achieved."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant capitalization of FLOP, a syllabic acronym of floating-point operations."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flop (plural flops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) One floating-point operation per second, a unit of measure of processor speed.",
                  "examples": [
                    "The gigaflop supercomputers of today are almost useless. What is needed is a teraflop machine. That’s a machine that can run at a trillion flops, a trillion floating-point operations per second, or roughly a thousand times as fast as Cray Y-MP8."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Abbreviation of floating-point operation.",
                  "examples": [
                    "The Correlator can perform 750 billion ‘flops’, or simple calculations, per second."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}