{
  "word": "toy",
  "etymologies": [
    {
      "description": [
        "From Middle English toye (“amorous play, piece of fun or entertainment”), probably from Middle Dutch toy, tuyg (“tools, apparatus, utensil, ornament”) as in Dutch speel-tuig (“play-thing, toy”), from Old Dutch *tiug, from Proto-Germanic *teugą (“stuff, matter, device, gear, lever”, literally “that which is drawn or pulled”), from Proto-Germanic *teuhaną (“to lead, bring, pull”), from Proto-Indo-European *dewk- (“to pull, lead”). Cognate with German Zeug (“stuff”), Danish tøj (“stuff”). Related to tug, tow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "toy (plural toys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something to play with, especially as intended for use by a child. [from 16th c.]",
                  "examples": [
                    "A grown man does not play with a child’s toy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing of little importance or value; a trifle. [from 16th c.]",
                  "examples": [
                    "he had deflowered the abbess, and as many besides of the nuns as he could, and leaves him withal rings, jewels, girdles, and such toys to give them still, when they came to visit him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A simple, light piece of music, written especially for the virginal. [16th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for toy dog.",
                  "examples": [
                    "Since standards are large dogs, they grow much more rapidly than miniatures and toys, which means that they require more supplements."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Love play, amorous dalliance; fondling. [16th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A vague fancy, a ridiculous idea or notion; a whim. [16th–17th c.]",
                  "examples": [
                    "Though they do talk with you, and seem to be otherwise employed, and to your thinking very intent and busy, still that toy runs in their mind, that fear, that suspicion, that abuse, that jealousy […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) An inferior graffiti artist.",
                  "examples": [
                    "It is incorrect to say that toys tag and masters piece; toys just do bad tags, bad throw-ups, and bad pieces."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An old story; a silly tale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, archaic) A headdress of linen or wool that hangs down over the shoulders, worn by old women of the lower classes; called also toy mutch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sex toy (object or device to give sexual pleasure).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, MLE) A gun.",
                  "examples": [
                    "2013 December 23,  Stephen Reynolds; Stephen Reynolds, director,  Vendetta, spoken by Ronnie (Nick Nevern), 48:02 from the start:RONNIE: Now, that is a SIG Sauer P226. JIMMY VICKERS (played by Danny Dyer): Yeah, takes 19 in the clip. It’s effective up to 50 metres. RONNIE: Man knows his toys."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "toy (third-person singular simple present toys, present participle toying, simple past and past participle toyed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To play (with) in an idle or desultory way.",
                  "examples": [
                    "to toy with a piece of food on one’s plate",
                    "Figo is toying with the English defence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To ponder or consider.",
                  "examples": [
                    "I have been toying with the idea of starting my own business."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To stimulate with a sex toy.",
                  "examples": [
                    "He could see her hand go to her slit, and soon she was toying herself along, breathing heavily."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}