{
  "word": "sallow",
  "etymologies": [
    {
      "description": [
        "From Middle English salowe, from Old English salu, from Proto-West Germanic *salu, from Proto-Germanic *salwaz, from Proto-Indo-European *solH.",
        "See also Dutch zaluw, dialectal German sal); also Irish salach (“dirty”), Welsh halog, Latin salīva, Russian соло́вый (solóvyj, “cream-colored”)."
      ],
      "adjectives": [
        {
          "description": "sallow (comparative sallower, superlative sallowest)",
          "definitionGroups": [
            {
              "group": "(of skin) Yellowish.",
              "entries": [
                {
                  "meaning": "(most regions, of light skin) Of a sickly pale colour.",
                  "examples": [
                    "[…]  were it not that his Complexion is sallow, and that he is something short of a Leg, and Blind of one Eye, he would positively be the most lovely of all the human Species."
                  ]
                },
                {
                  "meaning": "(Ireland) Of a tan colour, associated with people from southern Europe or East Asia.",
                  "examples": [
                    "The girls are mostly Slavic-pretty, long-limbed with high cheekbones, sallow skin and green eyes. They are the closest thing to supermodels that Mulhuddart has ever seen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Having skin (especially on the face) of a sickly pale colour.",
                  "examples": [
                    "She put her hand on the arm of her careworn, sallow father, and frothing her light draperies, proceeded over the eternal red carpet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of objects or dim light) Having a similar pale, yellowish colour.",
                  "examples": [
                    "On the opposite bank of the Allier the land kept mounting for miles to the horizon: a tanned and sallow autumn landscape  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Foul; murky; sickly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sallow (third-person singular simple present sallows, present participle sallowing, simple past and past participle sallowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become sallow.",
                  "examples": [
                    "The tan of his sunburnt face and hands contrasted sadly with the sallowing skin of the girl-wife, who, despite his care, was sinking under her task of son-bearing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (someone or something) to become sallow.",
                  "examples": [
                    "The climate of this country is the scape-goat upon which all ill looks and ill health of the ladies is laid; but while they are brought up as effeminately as they are, take as little exercise, live in rooms like ovens during the winter, and marry as early as they do, it will appear evident that many causes combine with an extremely variable climate, to sallow their complexions, and destroy their constitutions."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English salow, salwe, from Old English sealh, from Proto-West Germanic *salh, from Proto-Germanic *salhaz, masculine variant of *salhō, *salhijǭ, from Proto-Indo-European *sh₂lk-, *sh₂lik-.",
        "See also Low German Sal, Saal; Swedish sälg; also Welsh helyg, Latin salix, probably originally a borrowing from some other language."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sallow (plural sallows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A European willow, Salix caprea, that has broad leaves, large catkins and tough wood.",
                  "examples": [
                    "I[f] a man eate the flowers of a sallow or wyllowe tree, or of a Poplet tree, they wyl make cold al the heate of carnall lust in hym."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A willow twig or branch.",
                  "examples": [
                    "[…]  set Sallowes about the bedde, besprinkled with vineger and rose water."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}