{
  "word": "wolf",
  "etymologies": [
    {
      "description": [
        "From Middle English wolf, from Old English wulf, ƿulf, from Proto-West Germanic *wulf, from Proto-Germanic *wulfaz (compare Saterland Frisian Wulf, West Frisian and Dutch wolf, German Wolf, Norwegian and Danish ulv), from Proto-Indo-European *wĺ̥kʷos (compare Sanskrit वृक (vṛ́ka), Persian گرگ‎ (gorg), Lithuanian vilkas, Russian волк (volk), Albanian ujk, Latin lupus, Greek λύκος (lýkos), Tocharian B walkwe). Doublet of lobo and lupus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wolf (plural wolves)",
          "definitionGroups": [
            {
              "group": "Canis lupus; the largest wild member of the canine subfamily.",
              "entries": [
                {
                  "meaning": "Any of several related canines that resemble Canis lupus in appearance, especially those of the genus Canis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A man who makes amorous advances to many women.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A wolf tone or wolf note.",
                  "examples": [
                    "The soft violin solo was marred by persistent wolves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any very ravenous, rapacious, or destructive person or thing; especially, want; starvation.",
                  "examples": [
                    "They toiled hard to keep the wolf from the door.",
                    "the bee wolf"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the destructive, and usually hairy, larvae of several species of beetles and grain moths.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A white worm which infests granaries, the larva of Nemapogon granella, a tineid moth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wolf spider.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An eating ulcer or sore. See lupus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A willying machine, to cleanse wool or willow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wolf (third-person singular simple present wolfs, present participle wolfing, simple past and past participle wolfed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To devour; to gobble; to eat (something) voraciously.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To make amorous advances to many women; to hit on women; to cruise for sex.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hunt for wolves.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}