{
  "word": "loan",
  "etymologies": [
    {
      "description": [
        "From Middle English lone, lane, from Old Norse lán, from Proto-Germanic *laihną, from Proto-Indo-European *leykʷ- (“to leave (over)”).",
        "Cognate with Icelandic lán, Swedish lån, Danish lån, German Lehen (“fief”), Dutch leen (“fief”), West Frisian lien, North Frisian leen (“fief; loan; office”), Scots lane, lain, len, Old English lǣn. More at lend."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loan (plural loans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, banking, finance) An act or instance of lending, an act or instance of granting something for temporary use.",
                  "examples": [
                    "Synonyms: loaning, lending",
                    "Because of the loan that John made to me, I was able to pay my tuition for the upcoming semester."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, banking, finance) A sum of money or other property that a natural or legal person borrows from another with the condition that it be returned or repaid over time or at a later date (sometimes with interest).",
                  "examples": [
                    "Synonym: principal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The contract and array of legal or ethical obligations surrounding a loan.",
                  "examples": [
                    "He made a payment on his loan."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The permission to borrow any item.",
                  "examples": [
                    "Thank you for the loan of your lawn mower."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "loan (third-person singular simple present loans, present participle loaning, simple past and past participle loaned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually ditransitive, US, dated and occasionally proscribed in UK, informal) To lend (something) to (someone).",
                  "examples": [
                    "In the course of a correspondence that passed between us at this period, he mentioned, to my utter astonishment, the fact of his having loaned Neilson 81000 to buy my bill on Maryland; and stated that he could not proceed to make the payment until Neilson refunded the money."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See lawn."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loan (plural loans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A lonnen.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}