{
  "word": "four",
  "etymologies": [
    {
      "description": [
        "From Middle English four, from Old English fēower, from Proto-West Germanic *feuwar, from Proto-Germanic *fedwōr, from previous pre-Grimm *petwṓr, from Proto-Indo-European *kʷetwṓr, the neuter form of *kʷetwóres. Doublet of cuatro and quatre.",
        "Cognates include West Frisian fjouwer, Dutch and German vier, Norwegian Bokmål and Danish fire, Swedish fyra, Gothic 𐍆𐌹𐌳𐍅𐍉𐍂 (fidwōr) and, more distantly, Latin quattuor (whence Spanish cuatro, French quatre), Ancient Greek τέσσαρες (téssares), Irish ceathair, Armenian չորս (čʿors), Lithuanian keturi, Albanian katër, Sanskrit चतुर् (catur)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "four (countable and uncountable, plural fours)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The digit or figure 4; an occurrence thereof.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Anything measuring four units, as length.",
                  "examples": [
                    "Do you have any more fours? I want to make this a little taller."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is four years old.",
                  "examples": [
                    "I'll take the threes, fours and fives and go to the playground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, countable) An event in which the batsmen run four times between the wickets or, more often, a batsman hits a ball which bounces on the ground before passing over a boundary, resulting in an award of 4 runs for the batting team. If the ball does not bounce before passing over the boundary, a six is awarded instead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball, countable) A power forward.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(rowing) Four-man sweep racing shell, with or without a coxswain.",
              "entries": [
                {
                  "meaning": "The shell itself.",
                  "examples": [
                    "The team bought a new four last season."
                  ]
                },
                {
                  "meaning": "The crew rowing in a four boat.",
                  "examples": [
                    "Our four won both races."
                  ]
                },
                {
                  "meaning": "(colloquial) A regatta event for four boats.",
                  "examples": [
                    "We got third place in the varsity four."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A four-pennyworth of spirits.",
                  "examples": [
                    "I was a-strollin' down, thinkin' between ourselves how uncommon handy a four of gin hot would be, when suddenly the glint of a light caught my eye in the window of that same house."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}