{
  "word": "noose",
  "etymologies": [
    {
      "description": [
        "From Middle English nose (“noose, loop”), of unclear origin.",
        "Possibly from Old French nos or Old Occitan nous, nos, nominative singular or accusative plural of nou (“knot”), with a required change in meaning shifting from the \"knot\" itself to the \"loop\" created by the knot. If so, then cognate with French nœud (“knot”), Portuguese nó (“knot”) and Spanish nudo (“knot”). Compare node and knot.",
        "Alternatively, and perhaps more likely, borrowed from Middle Low German nȫse (“loop, noose, snare”), itself of obscure origin. Perhaps derived from an incorrect division of ēn' ȫse (literally “a loop”), from Middle Low German ȫse, from Old Saxon *ōsia, from Proto-West Germanic *ansiju (“eyelet, loop”). Compare also Saterland Frisian Noose (“loop, eyelet”) and Saterland Frisian Oose (“eyelet, loop”), potentially created via the same process."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noose (plural nooses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An adjustable loop of rope, such as the one placed around the neck in hangings, or the one at the end of a lasso.",
                  "examples": [
                    "Put someone's head in a noose"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "noose (third-person singular simple present nooses, present participle noosing, simple past and past participle noosed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tie or catch in a noose; to entrap or ensnare.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}