{
  "word": "wretched",
  "etymologies": [
    {
      "description": [
        "From Middle English wrecched (“(adjective) characterized by or suffering hardship or misfortune, miserable, unfortunate, unhappy; indigent, poor; of low economic or social status, lowly; (noun) miserable person”) [and other forms], from wrecche (“characterized by or suffering hardship or misfortune, miserable, unfortunate, unhappy; indigent, poor; of low economic or social status, lowly; base, contemptible, vile; reprehensible, wicked; miserly, stingy; of little importance, paltry, worthless”) (from Late Old English wrecc, from Old English wreċċa (“an exile, outcast”), ultimately from Proto-Indo-European *wreg- (“to follow, track; to hunt”)) + -ed (suffix forming adjectives). The English word is analysable as wretch (“(obsolete) wretched”, adjective) +‎ -ed (suffix forming adjectives)."
      ],
      "adjectives": [
        {
          "description": "wretched (comparative wretcheder or more wretched, superlative wretchedest or most wretched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characterized by or feeling deep affliction or distress; very miserable.",
                  "examples": [
                    "Synonyms: dejected, (archaic or obsolete) wretchful; see also Thesaurus:lamentable, Thesaurus:sad",
                    "I felt wretched after my wife died."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of an inferior or unworthy nature or social status; contemptible, lowly.",
                  "examples": [
                    "The street was full of wretched beggars dressed in rags."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of an insignificant, mean, or poor nature; miserable, paltry, worthless.",
                  "examples": [
                    "Synonyms: trifling; see also Thesaurus:insignificant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person, etc.: behaving in a manner deserving contempt; base, despicable, wicked.",
                  "examples": [
                    "Synonyms: see Thesaurus:despicable"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of weather: causing much discomfort; very unpleasant; miserable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Used to express annoyance towards or dislike of someone or something: bloody, damned.",
                  "examples": [
                    "Synonyms: blasted, bleeding",
                    "Will you please stop playing that wretched trombone!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}