{
  "word": "pretend",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman pretendre, Middle French pretendre (French prétendre (“to claim, demand”)), from Latin praetendere, present active infinitive of praetendō (“put forward, hold out, pretend”), from prae- (“pre-”) + tendō (“stretch”); see tend."
      ],
      "adjectives": [
        {
          "description": "pretend (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not really what it is represented as being; imaginary, feigned.",
                  "examples": [
                    "As children we used to go on \"spying\" missions around the neighbour's house, but it was all pretend."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pretend (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(childish, informal) the act of engaging in pretend play.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pretend (third-person singular simple present pretends, present participle pretending, simple past and past participle pretended)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To claim, to allege, especially when falsely or as a form of deliberate deception. [from 14th c.]",
                  "examples": [
                    "I have nothing but contempt for people who hire ghost-writers. But at least most faux authors have the decency to pretend that they are sweating blood over \"their\" book."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To feign, affect (a state, quality, etc.). [from 15th c.]",
                  "examples": [
                    "Gap and other clothes manufacturers should stop using small subcontractors because they are difficult to control. Instead, they should open up their own fully-owned production facilities so that they cannot pretend ignorance when abuses are committed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lay claim to (an ability, status, advantage, etc.). [from 15th c.] (originally used without to)",
                  "examples": [
                    "Chiefs shall be grudged the part which they pretend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make oneself appear to do or be doing something; to engage in make-believe.",
                  "examples": [
                    "Luster claimed that the women had consented to sex and were only pretending to be asleep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To hold before, or put forward, as a cloak or disguise for something else; to exhibit as a veil for something hidden.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To intend; to design, to plot; to attempt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To hold before one; to extend.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}