{
  "word": "point",
  "etymologies": [
    {
      "description": [
        "From Middle English point, from Old French point m (“dot; minute amount”), from Latin pūnctum (“a hole punched in; a point, puncture”), substantive use of pūnctus m, perfect passive participle of pungō (“I prick, punch”) (ultimately from Proto-Indo-European *pewǵ- (“prick, punch”)); alternatively, from Old French pointe f (“sharp tip”), from Latin pūncta f (past participle). Displaced native Middle English ord (“point”), from Old English ord (“point”). Doublet of pointe, punctum, punt, and punto."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "point (plural points)",
          "definitionGroups": [
            {
              "group": "A discrete division of something.",
              "entries": [
                {
                  "meaning": "An individual element in a larger whole; a particular detail, thought, or quality. [from 13th c.]",
                  "examples": [
                    "The Congress debated the finer points of the bill."
                  ]
                },
                {
                  "meaning": "A particular moment in an event or occurrence; a juncture. [from 13th c.]",
                  "examples": [
                    "There comes a point in a marathon when some people give up.",
                    "At this point in the meeting, I'd like to propose a new item for the agenda."
                  ]
                },
                {
                  "meaning": "(archaic) Condition, state. [from 13th c.]",
                  "examples": [
                    "She was not feeling in good point."
                  ]
                },
                {
                  "meaning": "A topic of discussion or debate; a proposition. [from 14th c.]",
                  "examples": [
                    "I made the point that we all had an interest to protect."
                  ]
                },
                {
                  "meaning": "A focus of conversation or consideration; the main idea.",
                  "examples": [
                    "The point is that we should stay together, whatever happens."
                  ]
                },
                {
                  "meaning": "A purpose or objective, which makes something meaningful. [from 14th c.]",
                  "examples": [
                    "Since the decision has already been made, I see little point in further discussion."
                  ]
                },
                {
                  "meaning": "(obsolete) The smallest quantity of something; a jot, a whit. [14th–17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A tiny amount of time; a moment. [14th–17th c.]",
                  "examples": [
                    "When time's first point begun / Made he all souls.|title=Of the Soule of Man and the Immortalitie Thereof"
                  ]
                },
                {
                  "meaning": "A specific location or place, seen as a spatial position. [from 14th c.]",
                  "examples": [
                    "We should meet at a pre-arranged point."
                  ]
                },
                {
                  "meaning": "(mathematics, sciences) A zero-dimensional mathematical object representing a location in one or more dimensions; something considered to have position but no magnitude or direction. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "A full stop or other terminal punctuation mark. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(music) A dot or mark used to designate certain tones or time. In ancient music, it distinguished or characterized certain tones or styles (points of perfection, of augmentation, etc.). In modern music, it is placed on the right of a note to raise its value, or prolong its time, by one half.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) A note; a tune.",
                  "examples": []
                },
                {
                  "meaning": "A distinguishing quality or characteristic. [from 15th c.]",
                  "examples": [
                    "Logic isn't my strong point."
                  ]
                },
                {
                  "meaning": "(in the plural, dated) The chief or excellent features.",
                  "examples": [
                    "the points of a horse"
                  ]
                },
                {
                  "meaning": "Something tiny, as a pinprick; a very small mark. [from 15th c.]",
                  "examples": [
                    "The stars showed as tiny points of yellow light."
                  ]
                },
                {
                  "meaning": "(now only in phrases) A tenth; formerly also a twelfth. [from 17th c.]",
                  "examples": [
                    "Possession is nine points of the law."
                  ]
                },
                {
                  "meaning": "Short for percentage point.",
                  "examples": [
                    "We have yet to touch on the idea of stars and directors receiving gross points, which is a percentage of the studio's gross dollar (e.g., the $5.00 studio share of the total box office dollar in Table 4.1). Even if the points are paid on \"first dollar,\" the reference is only to studio share."
                  ]
                },
                {
                  "meaning": "Each of the marks or strokes written above letters, especially in Semitic languages, to indicate vowels, stress etc. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(sports, video games, board games) A unit of scoring in a game or competition. [from 18th c.]",
                  "examples": [
                    "The one with the most points will win the game"
                  ]
                },
                {
                  "meaning": "(mathematics) A decimal point (now especially when reading decimal fractions aloud). [from 18th c.]",
                  "examples": [
                    "10.5 is \"ten point five\", or ten and a half."
                  ]
                },
                {
                  "meaning": "(economics) A unit used to express differences in prices of stocks and shares. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(typography) a unit of measure equal to 1/12 of a pica, or approximately 1/72 of an inch (exactly 1/72 of an inch in the digital era). [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(UK) An electric power socket. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "(navigation, nautical) A unit of bearing equal to one thirty-second of a circle, i.e. 11.25°.",
                  "examples": [
                    "Ship ahoy, three points off the starboard bow!"
                  ]
                },
                {
                  "meaning": "(UK) A unit of measure for rain, equal to 0.254 mm or 0.01 of an inch.",
                  "examples": []
                },
                {
                  "meaning": "(automotive, chiefly in the plural) Either of the two metal surfaces in a distributor which close or open to allow or prevent the flow of current through the ignition coil. There is usually a moving point, pushed by the distributor cam, and a fixed point, and they are built together as a unit.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A sharp extremity.",
              "entries": [
                {
                  "meaning": "The sharp tip of an object. [from 14th c.]",
                  "examples": [
                    "Cut the skin with the point of the knife."
                  ]
                },
                {
                  "meaning": "Any projecting extremity of an object. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "An object which has a sharp or tapering tip. [from 14th c.]",
                  "examples": [
                    "His cowboy belt was studded with points."
                  ]
                },
                {
                  "meaning": "(backgammon) Each of the twelve triangular positions in either table of a backgammon board, on which the stones are played. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "A peninsula or promontory. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "The position at the front or vanguard of an advancing force. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(by extension) An operational or public leadership position in a risky endeavor.",
                  "examples": []
                },
                {
                  "meaning": "Each of the main directions on a compass, usually considered to be 32 in number; a direction. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(nautical) The difference between two points of the compass.",
                  "examples": [
                    "to fall off a point"
                  ]
                },
                {
                  "meaning": "Pointedness of speech or writing; a penetrating or decisive quality of expression. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(rail transport, UK, in the plural) A railroad switch. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(usually in the plural) An area of contrasting colour on an animal, especially a dog; a marking. [from 19th c.]",
                  "examples": [
                    "The point color of that cat was a deep, rich sable."
                  ]
                },
                {
                  "meaning": "A tine or snag of an antler.",
                  "examples": []
                },
                {
                  "meaning": "(fencing) A movement executed with the sabre or foil.",
                  "examples": [
                    "tierce point"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) One of the several different parts of the escutcheon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A short piece of cordage used in reefing sails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A string or lace used to tie together certain garments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lace worked by the needle.",
                  "examples": [
                    "point de Venise; Brussels point"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) An item of private information; a hint; a tip; a pointer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The attitude assumed by a pointer dog when he finds game.",
                  "examples": [
                    "The dog came to a point."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry) The perpendicular rising of a hawk over the place where its prey has gone into cover.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of pointing, as of the foot downward in certain dance positions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The gesture of extending the index finger in a direction in order to indicate something.",
                  "examples": [
                    "[…]  DCDP children are exposed to more points and gesturelike signs in their linguistic environment  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, obsolete) A vaccine point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for point man.",
                  "examples": []
                }
              ]
            },
            {
              "group": "In various sports, a position of a certain player, or, by extension, the player occupying that position.",
              "entries": [
                {
                  "meaning": "(cricket) A fielding position square of the wicket on the off side, between gully and cover. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(lacrosse, ice hockey) The position of the player of each side who stands a short distance in front of the goalkeeper.",
                  "examples": []
                },
                {
                  "meaning": "(baseball) The position of the pitcher and catcher.",
                  "examples": []
                },
                {
                  "meaning": "(hunting) A spot to which a straight run is made; hence, a straight run from point to point; a cross-country run.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English pointen, poynten, from Old French pointier, pointer, poynter, from point from Latin pūnctum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "point (third-person singular simple present points, present participle pointing, simple past and past participle pointed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To extend the index finger in the direction of something in order to show where it is or to draw attention to it.",
                  "examples": [
                    "It's rude to point at other people."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To draw attention to something or indicate a direction.",
                  "examples": [
                    "The arrow of a compass points north",
                    "The skis were pointing uphill.",
                    "The arrow on the map points towards the entrance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To face in a particular direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sometimes figurative) To direct toward an object; to aim.",
                  "examples": [
                    "to point a gun at a wolf, or a cannon at a fort"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give a point to; to sharpen; to cut, forge, grind, or file to an acute end.",
                  "examples": [
                    "to point a dart, a pencil, or (figuratively) a moral"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To indicate a probability of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, masonry) To repair mortar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, masonry) To fill up and finish the joints of (a wall), by introducing additional cement or mortar, and bringing it to a smooth surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(stone-cutting) To cut, as a surface, with a pointed tool.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To direct or encourage (someone) in a particular direction.",
                  "examples": [
                    "If he asks for food, point him toward the refrigerator."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mathematics) To separate an integer from a decimal with a decimal point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark with diacritics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To supply with punctuation marks; to punctuate.",
                  "examples": [
                    "to point a composition"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To direct the central processing unit to seek information at a certain location in memory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Internet) To direct requests sent to a domain name to the IP address corresponding to that domain name.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) To sail close to the wind.",
                  "examples": [
                    "Bear off a little, we're pointing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, hunting) To indicate the presence of game by a fixed and steady look, as certain hunting dogs do.",
                  "examples": [
                    "He treads with caution, and he points with fear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, of an abscess) To approximate to the surface; to head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To give point to (something said or done); to give particular prominence or force to.",
                  "examples": [
                    "‘Oh, it is the great defect in our Indian character!’ – and, as if to point his criticism, the lights of the Civil Station appeared on a rise to the right."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English pointen, poynten, by apheresis of apointen, appointen, appoynten. See appoint."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "point (third-person singular simple present points, present participle pointing, simple past and past participle pointed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To appoint.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}