{
  "word": "big",
  "etymologies": [
    {
      "description": [
        "Inherited from Northern Middle English big, bigge (“powerful, strong”), possibly from a dialect of Old Norse. Ultimately perhaps a derivative of Proto-Germanic *bugja- (“swollen up, thick”), from Proto-Indo-European *bʰew-, *bu- (“to swell”), in which case big would be related to bogey, bugbear, and bug.",
        "Compare dialectal Norwegian bugge (“great man”), Low German Bögge, Boggelmann."
      ],
      "adjectives": [
        {
          "description": "big (comparative bigger, superlative biggest)",
          "definitionGroups": [
            {
              "group": "Of great size, large.",
              "entries": [
                {
                  "meaning": "(informal) Fat.",
                  "examples": [
                    "Synonyms: chubby, plus-size, rotund; see also Thesaurus:overweight",
                    "Gosh, she is big!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes figurative) Large with young; pregnant; swelling; ready to give birth or produce.",
                  "examples": [
                    "Synonyms: full, great, heavy; see also Thesaurus:pregnant",
                    "She was big with child."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Well-endowed, possessing large breasts in the case of a woman or a large penis in the case of a man.",
                  "examples": [
                    "Synonyms: busty, macromastic, stacked; see also Thesaurus:busty",
                    "Whoa, Nadia has gotten pretty big since she hit puberty."
                  ]
                }
              ]
            },
            {
              "group": "(informal) Adult; (of a child) older.",
              "entries": [
                {
                  "meaning": "(informal, slang, rare, of somebody's age) Old, mature. Used to imply that somebody is too old for something, or acting immaturely.",
                  "examples": [
                    "I don't think so, if you're shouting at people across the playground at your big age."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, transitive with of) Mature, conscientious, principled; generous.",
                  "examples": [
                    "That's very big of you; thank you!",
                    "I tried to be the bigger person and just let it go, but I couldn't help myself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Important or significant.",
                  "examples": [
                    "Synonyms: essential, paramount, weighty; see also Thesaurus:important",
                    "What's so big about that? I do it all the time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Popular.",
                  "examples": [
                    "Synonyms: all the rage, in demand, well liked",
                    "That style is very big right now in Europe, especially among teenagers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a city) Populous.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Used as an intensifier, especially of negative-valence nouns",
                  "examples": [
                    "You are a big liar.  Why are you in such a big hurry?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of an industry or other field, or institution(s) therein, often capitalized) Operating on a large scale, especially if therefore having undue or sinister influence.",
                  "examples": [
                    "There were concerns about the ethics of big pharma.",
                    "big money",
                    "Big Tech, Big Steel (large or influential tech or steel companies)",
                    "Big Science (science performed by large terms, of large scope, with government or corporate funding)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, with on) Enthusiastic (about).",
                  "examples": [
                    "Synonyms: fanatical, mad, worked up; see also Thesaurus:enthusiastic"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "big (comparative bigger, superlative biggest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a loud manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a boasting manner.",
                  "examples": [
                    "He's always talking big, but he never delivers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a large amount or to a large extent.",
                  "examples": [
                    "He won big betting on the croquet championship."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "On a large scale, expansively.",
                  "examples": [
                    "You've got to think big to succeed at Amalgamated Plumbing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hard.",
                  "examples": [
                    "He hit him big and the guy just crumpled."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "big (plural bigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An important or powerful person; a celebrity; a big name.",
                  "examples": [
                    "Synonym: big shot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) The big leagues, big time.",
                  "examples": [
                    "Synonym: big leagues"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(university slang) A initiated member of a sorority who acts as a mentor to a new member (the little).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM) The participant in ageplay who acts out the older role.",
                  "examples": [
                    "Antonym: little"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English biggen, byggen, from Old Norse byggja, byggva (“to build, dwell in, inhabit”), a secondary form of Old Norse búa (“to dwell”), related to Old English būan (“to dwell”). Cognate with Danish bygge, Swedish bygga."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "big (third-person singular simple present bigs, present participle bigging, simple past and past participle bigged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, UK dialectal, Northern England, Scotland) To inhabit; occupy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, archaic, UK dialectal, Northern England, Scotland) To locate oneself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, UK dialectal, Northern England, Scotland) To build; erect; fashion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic, UK dialectal, Northern England, Scotland) To dwell; have a dwelling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English byge, from Old Norse bygg (“barley, probably Hordeum vulgare, common barley”), from Proto-Germanic *bewwuz (“crop, barley”). Cognate with Old English bēow (“barley”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "big (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One or more kinds of barley, especially six-rowed barley.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}