{
  "word": "husk",
  "etymologies": [
    {
      "description": [
        "From Middle English huske (“husk”). Perhaps from Old English *husuc, *hosuc (“little covering, sheath”), diminutive of hosu (“pod, shell, husk”), from Proto-West Germanic *hosā, from Proto-Germanic *husǭ, *hausaz (“covering, shell, leggings”), from Proto-Indo-European *kawəs- / kawes- (“cover”). If so, equivalent to hose +‎ -ock.",
        "Alternatively from Middle Low German hūske(n) (“little house, sheath”), Middle Dutch hūskijn (“little house, core of fruit, case”), diminutive of hūs (“house”). Compare Dutch huisje, German Häuschen, both also used for “snailshell”."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "husk (plural husks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The dry, leafy or stringy exterior of certain vegetables or fruits, which must be removed before eating the meat inside.",
                  "examples": [
                    "A coconut has a very thick husk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any form of useless, dried-up, and subsequently worthless exterior of something.",
                  "examples": [
                    "His attorney was a dried-up husk of a man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The supporting frame of a run of millstones.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "husk (third-person singular simple present husks, present participle husking, simple past and past participle husked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove husks from.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Partly imitative, partly from Etymology 1, above, influenced by husky."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "husk (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An infection in cattle caused by a species of Dictyocaulus or lungworm",
                  "examples": [
                    "The symptoms of Husk are a constant cough, rapid loss of flesh, difficulty in breathing and, in the later stages, loss of appetite and diarrhœa."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "husk (third-person singular simple present husks, present participle husking, simple past and past participle husked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To cough, clear one's throat.",
                  "examples": [
                    "Back on the veranda he said to Lace gravely, \"I do believe that poor child's in the family way.\" Lace, tracing the pattern of the matting with his boot, husked, and murmured, \"Yes — I think so."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say huskily, to utter in a husky voice.",
                  "examples": [
                    "The French captain did not immediately respond; he looked at his men with a miserable expression [...]; still he hesitated, drooped, and finally husked, \"Je me rends,\" with a look still more wretched."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}