{
  "word": "canvass",
  "etymologies": [
    {
      "description": [
        "The verb is derived from canvas (“type of coarse cloth woven from hemp”). The connection between “to toss (someone) in a (canvas) sheet; (by extension) to batter, beat, or thrash (someone or something); etc.” and “to seek the support of voters or a constituency in a forthcoming election or poll” is not entirely clear.",
        "The noun is derived from the verb. It has been suggested that noun sense 4.2 (“rejection (at an election, of a suit, etc.)”) may refer to the canvas bag used by journeymen mechanics which they used to pack up their tools after they had completed their jobs, in which case it is not derived from the verb but directly from canvas (noun)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "canvass (countable and uncountable, plural canvasses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A seeking or solicitation of donations, information, opinions, support, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, specifically, politics) A seeking or solicitation, or determination, of support or favourable votes in a forthcoming election or poll.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, politics) A scrutiny of the votes cast in an election to reject irregular votes; also, a tally, audit, and certification of votes.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "(countable) A thorough discussion or investigation. (Possibly; the meaning is unclear.)",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) Rejection (at an election, of a suit, etc.).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "canvass (third-person singular simple present canvasses, present participle canvassing, simple past and past participle canvassed)",
          "definitionGroups": [
            {
              "group": "(transitive, figuratively)",
              "entries": [
                {
                  "meaning": "To thoroughly examine or investigate (something) physically or by discussion; to debate, to gather opinion, to scrutinize.",
                  "examples": []
                },
                {
                  "meaning": "(by extension, politics, obsolete except US, Philippines) To scrutinize (the ballot in an election or the votes cast) and reject irregular votes; also, to challenge or dispute (an election result).",
                  "examples": []
                },
                {
                  "meaning": "To seek or solicit donations, information, opinions, support, etc. from (people or a place)",
                  "examples": [
                    "The police are canvassing the neighbourhood for information about the missing child."
                  ]
                },
                {
                  "meaning": "(specifically, politics) To seek the support of (voters or a constituency) in a forthcoming election or poll through personal solicitation or public addresses.",
                  "examples": [
                    "The electoral candidate canvassed the district for votes."
                  ]
                }
              ]
            },
            {
              "group": "(transitive, obsolete)",
              "entries": [
                {
                  "meaning": "To toss (someone) in a (canvas) sheet for fun or as a punishment; to blanket. [from 1508]",
                  "examples": []
                },
                {
                  "meaning": "(by extension) To batter, beat, or thrash (someone or something).",
                  "examples": []
                },
                {
                  "meaning": "(by extension) To assail or attack (someone or something).",
                  "examples": []
                },
                {
                  "meaning": "(by extension) To severely criticize (a person, a written work, etc.).",
                  "examples": [
                    "1814 July,  [Jane Austen],  chapter XVI, in  Mansfield Park: […], volume III, London:  […]  T[homas] Egerton, […], →OCLC, page 313:So voluntarily, so freely, so coolly to canvass it!"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To debate, to discuss.",
                  "examples": []
                },
                {
                  "meaning": "To seek or solicit donations, information, opinions, support, etc.; to conduct a survey.",
                  "examples": []
                },
                {
                  "meaning": "(specifically, politics) To seek the support of voters or a constituency in a forthcoming election or poll; to campaign.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant of canvas (noun)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "canvass (countable and uncountable, plural canvasses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of canvas",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}