{
  "word": "threshold",
  "etymologies": [
    {
      "description": [
        "From Middle English threschwolde, threscholde, from Old English þresċold, þerxold, þrexwold (“doorsill, entryway”), from Proto-Germanic *þreskudlaz, *þreskūþlijaz, *þreskwaþluz, from Proto-Germanic *þreskaną, *þreskwaną (“to thresh”), from Proto-Indo-European *terh₁- (“to rub, turn”). Cognate with Low German Drüssel (“threshold”), dialectal German Drischaufel, Drissufle, Trüschübel (“threshold”), Danish tærskel (“threshold”), Swedish tröskel (“threshold”), dialectal Swedish träskvald (“threshold”), Icelandic þröskuldur (“threshold”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "threshold (plural thresholds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bottom-most part of a doorway that one crosses to enter; a sill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) An entrance; the door or gate of a house.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any end or boundary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) The outset of something; the point of entry, or the beginning of an action.",
                  "examples": [
                    "I arrived at last, did obeisance to my uncle, and told him everything. He thought it over and said: ' […] At the threshold of death, how dare I give you permission to go to England, to cross the seas? But I will not stand in your way. It is your mother's permission which really matters. If she permit you, then godspeed! Tell her I will not interfere. You will go with my blessings.'"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The start of the landing area of a runway.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) The quantitative point at which an action is triggered, especially a lower limit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The wage or salary at which income tax becomes due.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The point where one is mentally or physically vulnerable in response to a provocation or to other nuisances.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}