{
  "word": "marginal",
  "etymologies": [
    {
      "description": [
        "Borrowing from Medieval Latin marginālis."
      ],
      "adjectives": [
        {
          "description": "marginal (not generally comparable, comparative more marginal, superlative most marginal)",
          "definitionGroups": [
            {
              "group": "(not comparable) Of, relating to, or located at or near a margin or edge; also figurative usages of location and margin (edge).",
              "entries": [
                {
                  "meaning": "Written in the margin of a book.",
                  "examples": [
                    "There were more marginal notes than text."
                  ]
                },
                {
                  "meaning": "(geography) Sharing a border; geographically adjacent.",
                  "examples": [
                    "Monmouthshire is a Welsh county marginal to England."
                  ]
                }
              ]
            },
            {
              "group": "(comparable) Determined by a small margin; having a salient characteristic determined by a small margin.",
              "entries": [
                {
                  "meaning": "Of a value, or having a characteristic that is of a value, that is close to being unacceptable or leading to exclusion from a group or category.",
                  "examples": [
                    "His writing ability was marginal at best.",
                    "Having reviewed the test, there are two students below the required standard and three more who are marginal.",
                    "The pilots lacked experience flying in marginal weather conditions."
                  ]
                },
                {
                  "meaning": "(of land) Barely productive.",
                  "examples": [
                    "He farmed his marginal land with difficulty."
                  ]
                },
                {
                  "meaning": "(politics, chiefly UK, Australia, New Zealand, of a constituency) Subject to a change in sitting member with only a small change in voting behaviour, this usually being inferred from the small winning margin of the previous election.",
                  "examples": [
                    "In Bristol West, Labour had a majority of only 1,000, so the seat is considered highly marginal this time around."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics, not comparable) Pertaining to changes resulting from a unit increase in production or consumption of a good.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "marginal (plural marginals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something or somebody that is marginal.",
                  "examples": [
                    "[…]  discusses those who belong to the discipline's dominant cults, the mainliners, and their relations with the marginals and mavericks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) A constituency won with a small margin.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}