{
  "word": "stoic",
  "etymologies": [
    {
      "description": [
        "From Latin stōicus (noun via Middle English Stoycis pl), from Ancient Greek Στωϊκός (Stōïkós), from Ποικίλη Στοά (Poikílē Stoá, “painted portico”), the portico in Athens where Zeno was teaching."
      ],
      "adjectives": [
        {
          "description": "stoic (comparative more stoic, superlative most stoic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to the Stoics or their ideas.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not affected by pain or distress.",
                  "examples": [
                    "Synonyms: apathetic, impassive, stoical"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not displaying any external signs of being affected by pain or distress.",
                  "examples": [
                    "It makes a tremendous emotional and practical difference to one whether one accept the universe in the drab discolored way of stoic resignation to necessity, or with the passionate happiness of Christian saints."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "stoic (plural stoics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) Proponent of stoicism, a school of thought, from in 300 B.C.E. up to about the time of Marcus Aurelius, who holds that by cultivating an understanding of the logos, or natural law, one can be free of suffering.",
                  "examples": [
                    "The anima mundi, to whose disposal of his own personal destiny the Stoic consents, is there to be respected and submitted to, but the Christian God is there to be loved; and the difference of emotional atmosphere is like that between an arctic climate and the tropics, though the outcome in the way of accepting actual conditions uncomplainingly may seem in abstract terms to be much the same."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person indifferent to pleasure or pain.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}