{
  "word": "thole",
  "etymologies": [
    {
      "description": [
        "From Middle English thōle, from tholen, tholien, from Old English þolian, from Proto-West Germanic *þolēn, from Proto-Germanic *þulāną (“to suffer”), from Proto-Indo-European *telh₂- (“to bear, suffer; to support”), compare Norwegian Bokmål tåle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "thole (third-person singular simple present tholes, present participle tholing, simple past and past participle tholed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To suffer.",
                  "examples": [
                    "That remark of Edith Van Tromp's, to the effect that the illusions would all be swept away, had its confirmation before we had tholed through the first week of our island captivity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now Northern England, Northern Ireland, Scotland) To endure, to put up with, to tolerate.",
                  "examples": [
                    "Before long Ailie was silent and white, while her mother rimed on about men and their ways. And then she could thole it no longer, but must go out and walk by the burn to cool her hot brow and calm her thoughts, while the witch indoors laughed to herself at her devices."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English thō̆le (“a peg”), from Old English þol, þoll (“oar-pin, rowlock; thole”), from Proto-West Germanic *þoll, from Proto-Germanic *þullaz, *þullō (“beam; thole”), from Proto-Indo-European *tūl-, *twel- (“bush; sphere”). The word is cognate with Danish toll (“thole”), Dutch dol (“thole; oarlock”), Low German Doll (“thole; oarlock”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thole (plural tholes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pin in the side of a boat which acts as a fulcrum for the oars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pin, or handle, of the snath (shaft) of a scythe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Anglicization of Latin tholus (“cupola, dome, rotunda”), from Ancient Greek θόλος (thólos, “dome, vault”), further etymology uncertain but possibly cognate with θᾰ́λᾰμος (thálamos, “bedroom; inner chamber”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thole (plural tholes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A cupola, a dome, a rotunda; a tholus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}