{
  "word": "wilt",
  "etymologies": [
    {
      "description": [
        "Recorded since 1691, probably an alteration of welk, itself from Middle English welken, presumed from Middle Dutch (preserved in modern inchoative verwelken) or Middle Low German welken (“to wither”), cognate with Old High German irwelhen (“to become soft”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wilt (countable and uncountable, plural wilts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of wilting or the state of being wilted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phytopathology) Any of various plant diseases characterized by wilting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wilt (third-person singular simple present wilts, present participle wilting, simple past and past participle wilted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To droop or become limp and flaccid (as a dying leaf or flower).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fatigue; to lose strength; to flag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to droop or become limp and flaccid (as a flower).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to fatigue; to exhaust.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English wilt, from Old English wilt, from Proto-West Germanic *wilt, second person singular preterite-present of Proto-West Germanic *willjan. Cognate with Dutch wilt (“wilt”, second-person singular of willen), German willt (archaic second person singular indicative of wollen)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wilt",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) second-person singular simple present form of will",
                  "examples": [
                    "If thou triest my heart, if thou visitest me by night, if thou testest me, thou wilt find no wickedness in me."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}