{
  "word": "triangulation",
  "etymologies": [
    {
      "description": [
        "From Medieval Latin triangulātiōnem (“triangulation”), from triangulāre (“to triangulate”) + -tiōnem (suffix forming nouns relating to some actions or the results of actions). Triangulāre is derived from triangulāris (“triangular”), from triangulus (“triangular; triangle”), from trēs (“three”) + angulus (“angle; corner”). The English word is analysable as triangulate +‎ -ion, and is cognate with French triangulation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "triangulation (countable and uncountable, plural triangulations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, surveying) A technique in which distances and directions are estimated from an accurately measured baseline and the principles of trigonometry; (countable) an instance of the use of this technique.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, surveying) The network of triangles so obtained, that are the basis of a chart or map.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, chess) A delaying move in which the king moves in a triangular path to force the advance of a pawn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, geometry) A subdivision of a planar object into triangles, and by extension the subdivision of a higher-dimension geometric object into simplices.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, navigation, seismology) A process by which an unknown location is found using three known distances from known locations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, politics) The practice of repositioning one's group or oneself on the political spectrum in an attempt to capture the centre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, qualitative research) The use of three (or more) researchers to interview the same people or to evaluate the same evidence to reduce the impact of individual bias.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}