{
  "word": "interthread",
  "etymologies": [
    {
      "description": [
        "inter- +‎ thread"
      ],
      "adjectives": [
        {
          "description": "interthread (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Between threads.",
                  "examples": [
                    "interthread communication"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "interthread (third-person singular simple present interthreads, present participle interthreading, simple past and past participle interthreaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pass (strands of material) over and under one another to create a fabric; (by analogy) to weave long, narrow objects together.",
                  "examples": [
                    "Synonyms: interlace, intertwine, interweave",
                    "the interthreading of warp and weft"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To alter a fabric by weaving additional strands into it; to bring (two or more things) together like the strands in fabric; to bring (one thing) together (with another thing).",
                  "examples": [
                    "Synonyms: blend, combine, mix",
                    "silk fabrics interthreaded with gold and silver"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be present in every part of (something) like strands running through it.",
                  "examples": [
                    "Synonyms: crisscross, pervade, run through"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To integrate (strands of material into a fabric) by weaving.",
                  "examples": [
                    "[…]  Christianity is slowly but steadily, and as surely, interthreading her bright woof-lines into the texture of national and political, as well as social life:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be or become woven or twisted together (with something); to be or become inextricably associated like strands woven or twisted together.",
                  "examples": [
                    "an immense lake of ceaselessly interthreading grays and silvers"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move alternately on either side of people or objects; to weave in and out.",
                  "examples": [
                    "One, two, three, four step forth, and, to and fro,",
                    "Delicately and imperceptibly,",
                    "Now swaying gently in a row,",
                    "Now interthreading slow and rhythmically,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}