{
  "word": "cowl",
  "etymologies": [
    {
      "description": [
        "From Middle English coule, from Old English cūle, from earlier cugele (“hood, cowl”), from Ecclesiastical Latin cuculla (“monk's cowl”), from Latin cucullus (“hood”), of uncertain origin. Doublet of cagoule."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cowl (plural cowls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A monk's hood that can be pulled forward to cover the face; a robe with such a hood attached to it.",
                  "examples": [
                    "And therfore al our monkes whose professyon was neuer to eate fleshe, set vp the Pope and toke dispensacyons bothe for that faste and also for theyr strayte rules, and made theyr strayte rules as wyde as the hodes of theyr cowles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mask that covers the majority of the head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin protective covering over all or part of an engine; also cowling.",
                  "examples": [
                    "[…]  fire was spurting up from the torn engine cowl and glowing in the cockpit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A usually hood-shaped covering used to increase the draft of a chimney and prevent backflow.",
                  "examples": [
                    "I’m sure I’m very sorry, but it’s always this way when the wind’s in the east, sir, and we’ve tried ever so many sorts of cowls and chimney-pots, you’d be surprised."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A ship's ventilator with a bell-shaped top which can be swivelled to catch the wind and force it below.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A vertical projection of a ship's funnel that directs the smoke away from the bridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metonymically) A monk.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cowl (third-person singular simple present cowls, present participle cowling, simple past and past participle cowled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover with, or as if with, a cowl (hood).",
                  "examples": [
                    "Why cowl thy face beneath the Mourner’s hood,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wrap or form (something made of fabric) like a cowl.",
                  "examples": [
                    "When he came downstairs from the bar with the whiskies, she had found a sweater for herself and had cowled a thick raincoat over Sligo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a monk of (a person).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Yorkshire) To scrape together",
                  "examples": [
                    "COWL, scrape together. \"Cowlin t'cinders up.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English cuuel, from Old French cuvel (“vat”), diminutive of cuve, from Latin cūpa (“tub, cask, tun, vat”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cowl (plural cowls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Britain) A vessel carried on a pole, a soe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See caul, probably altered due to semantic association (“something covering the head”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cowl (plural cowls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A caul (the amnion which encloses the foetus before birth, especially that part of it which sometimes shrouds a baby’s head at birth).",
                  "examples": [
                    "According to one of his accounts—and his accounts varied with his audience—he was the seventh son of a seventh son, and born with a cowl on his face  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}