{
  "word": "mousetrap",
  "etymologies": [
    {
      "description": [
        "From Middle English mouse-trappe, mous trappe, mouse trape, equivalent to mouse +‎ trap. Cognate with Dutch muizetrap, muizentrap (“mousetrap”), German Low German Muustrappe, Muustrapp (“mousetrap”). In the Internet sense, refers to a computer mouse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mousetrap (countable and uncountable, plural mousetraps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A device for capturing or killing mice and other rodents.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Internet) A website designed to open another copy of itself when the user tries to close the webpage. Frequently used by advertisers and pornographers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, informal, uncountable) Ordinary, everyday cheese.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New Zealand) A slice of bread or toast topped with cheese and then grilled or microwaved.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) An antisubmarine rocket used mainly during World War II by the US Navy and US Coast Guard.",
                  "examples": [
                    "Besides depth charges, they were armed with smaller forward firing antisubmarine rocket launchers called mousetraps. Fired in groups, these rockets detonated when they contacted a submarine."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mousetrap (third-person singular simple present mousetraps, present participle mousetrapping, simple past and past participle mousetrapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To trap; to trick or fool (someone) into a bad situation.",
                  "examples": [
                    "He hoped to bring the rebels out of their trenches for a showdown battle somewhere south of the Wilderness, that gloomy expanse of scrub oaks and pines where Lee had mousetrapped Joe Hooker exactly a year earlier."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, transitive) To prevent (the user) from leaving a website by opening another copy when it is closed.",
                  "examples": [
                    "The scammer is paid for each new visitor directed to his site. There is nothing wrong except that the user finds it impossible to leave the site because he is mousetrapped."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}