{
  "word": "river",
  "etymologies": [
    {
      "description": [
        "From Middle English ryver, river, rivere, from Anglo-Norman rivere, from Old French riviere, from Vulgar Latin *rīpāria (“riverbank, seashore, river”), from Latin rīpārius (“of a riverbank”), from Latin rīpa (“river bank”), from Proto-Indo-European *h₁reyp- (“to scratch, tear, cut”). Doublet of riviera and rivière. Displaced native Old English ēa."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "river (plural rivers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large and often winding stream which drains a land mass, carrying water down from higher areas to a lower point, oftentimes ending in another body of water, such as an ocean or in an inland sea.",
                  "examples": [
                    "Occasionally rivers overflow their banks and cause floods.",
                    "Synonyms: see Thesaurus:river"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any large flow of a liquid in a single body.",
                  "examples": [
                    "a river of blood"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) The last card dealt in a hand.",
                  "examples": [
                    "He called instantly but was too ashamed to show until the river."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) A visually undesirable effect of white space running down a page, caused by spaces between words on consecutive lines happening to coincide.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "river (third-person singular simple present rivers, present participle rivering, simple past and past participle rivered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) To improve one’s hand to beat another player on the final card in a poker game.",
                  "examples": [
                    "Johnny rivered me by drawing that ace of spades."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "rive +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "river (plural rivers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who rives or splits.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}