{
  "word": "betray",
  "etymologies": [
    {
      "description": [
        "From Middle English betrayen, betraien, equivalent to be- +‎ tray (“to betray”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "betray (third-person singular simple present betrays, present participle betraying, simple past and past participle betrayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deliver into the hands of an enemy by treachery or fraud, in violation of trust; to give up treacherously or faithlessly.",
                  "examples": [
                    "an officer betrayed the city"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prove faithless or treacherous to, as to a trust or one who trusts; to be false to; to deceive.",
                  "examples": [
                    "to betray a person or a cause",
                    "Quresh betrayed Sunil to marry Nuzhat.",
                    "My eyes have been betraying me since I turned sixty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To violate the confidence of, by disclosing a secret, or that which one is bound in honor not to make known.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disclose or indicate, for example something which prudence would conceal; to reveal unintentionally.",
                  "examples": [
                    "Though he had lived in England for many years, a faint accent betrayed his Swedish origin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mislead; to expose to inconvenience not foreseen; to lead into error or sin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lead astray; to seduce (as under promise of marriage) and then abandon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}