{
  "word": "stereo",
  "etymologies": [
    {
      "description": [
        "Shortened form of stereotype, stereoscope or stereophonic, all originally derived from Ancient Greek στερεός (stereós, “solid”)."
      ],
      "adjectives": [
        {
          "description": "stereo (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of sound, music, etc, recorded in stereo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a pair of images: one depicting the view as would be seen from one eye and the other from the other eye, so that when viewed appropriately, they combine to give an impression of three dimensions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "stereo (countable and uncountable, plural stereos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A system of recording or reproducing sound that uses two channels, each playing a portion of the original sound in such a way as to create the illusion of locating the sound at a particular position, each offset from the other, thereby more accurately imitating the location of the original sound when the recorded or reproduced sound is heard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any object or device equipped with audio components that reproduces sound in stereo, such as a stereo console in the home.",
                  "examples": [
                    "He liked to listen to classical music on his stereo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, colloquial) A stereotype.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Myanmar, music) genre of Western-style pop and rock music",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stereo (third-person singular simple present stereos, present participle stereoing, simple past and past participle stereoed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To create a stereophotographic image of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}