{
  "word": "aerialist",
  "etymologies": [
    {
      "description": [
        "aerial +‎ -ist"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "aerialist (plural aerialists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An acrobat performing high off the ground, defying a fall to earth, as on a trapeze or a tightrope.",
                  "examples": [
                    "[…]  I chanced once, when I called during the day, to meet at the rehearsal M’lle Clarisse, the aerialist  […]  I looked at her carefully, and I could not divest myself of the impression that she was, in spite of her compact and strongly built little frame, much too delicate and fragile a person to go flying through the air from trapeze to trapeze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(skiing) A specialist in aerials, a freestyle skiing discipline.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One who operates a flying machine; a balloonist or aviator.",
                  "examples": [
                    "The balloon, however, having been torn in the lower part, both the cords and netting of the railing of the car broke, the wind again forced away the gentlemen from the tree they were strongly clasping; but with the assistance of a new, though last exertion, the aerialists had an opportunity of leaving the car and balloon, which fell upwards of 200 yards farther."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A person whose knowledge of agriculture is purely academic and not derived from experience. [late 18th—early 19th centuries]",
                  "examples": [
                    "Book farmers, the aerialists of Marshal, are those who know agriculture only by reading about it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}