{
  "word": "conscious",
  "etymologies": [
    {
      "description": [
        "Late 16th century in the sense of \"aware of wrongdoing\".[1] From Latin cōnscius (“conscious, conscious of guilt”), itself from con- (a form of com- (“together”)) + scīre (“to know”) + -us."
      ],
      "adjectives": [
        {
          "description": "conscious (comparative more conscious, superlative most conscious)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alert, awake; with one's mental faculties active.",
                  "examples": [
                    "The noise woke me, but it was another few minutes before I was fully conscious."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Aware of one's own existence; aware of one's own awareness.",
                  "examples": [
                    "The best indicator of your level of consciousness is how you deal with life's challenges when they come.  Through those challenges, an already unconscious person tends to become more deeply unconscious, and a conscious person more intensely conscious."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Aware of, sensitive to; observing and noticing, or being strongly interested in or concerned about.",
                  "examples": [
                    "I was conscious of a noise behind me.   a very class-conscious analysis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Deliberate, intentional, done with awareness of what one is doing.",
                  "examples": [
                    "He candidly confesses that it is an effort to account for Joseph Smith upon some other hypothesis than that he was a conscious fraud, bent on deceiving mankind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Known or felt personally, internally by a person.",
                  "examples": [
                    "conscious guilt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Self-conscious, or aware of wrongdoing, feeling guilty.",
                  "examples": [
                    "1811,  [Jane Austen],  chapter XVIII, in  Sense and Sensibility […], volume I, London:  […]  C[harles] Roworth, […], and published by T[homas] Egerton, […], →OCLC, page 229:He coloured very deeply, and giving a momentary glance at Elinor, replied, “Yes; it is my sister’s hair. The setting always casts a different shade on it, you know.” Elinor had met his eye, and looked conscious likewise..",
                    "1869,  Louisa M[ay] Alcott,  Little Women: Or, Meg, Jo, Beth and Amy, part second, Boston, Mass.: Roberts Brothers, →OCLC:They found Aunt Carrol with the old lady, both absorbed in some very interesting subject ; but they dropped it as the girls came in, with a conscious look which betrayed that they had been talking about their nieces.",
                    "c. 1634, John Dryden (translator), Richard Crashaw, Epigrammatum sacrorum liber\nThe conscious water saw its God, and blushed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "conscious (plural consciouses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of the mind that is aware of itself; the consciousness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}