{
  "word": "appearance",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French apparence, from Latin apparentia, from appareo. Morphologically appear +‎ -ance. Displaced native Old English hīew (the way something looks or seems) and ætīewednes (act of appearing or coming into view)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "appearance (countable and uncountable, plural appearances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of appearing or coming into sight; the act of becoming visible to the eye.",
                  "examples": [
                    "His sudden appearance surprised me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing seen; a phenomenon; an apparition.",
                  "examples": [
                    "There was a strange appearance in the sky."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The way something looks; personal presence",
                  "examples": [
                    "Synonyms: aspect, mien"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Apparent likeness; the way which something or someone appears to others.",
                  "examples": [
                    "Some people say I'm shallow because I care so much about my appearance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, theology) That which is not substance, essence, hypostasis; the outward reality as opposed to the underlying reality",
                  "examples": [
                    "Catholicism teaches that the Eucharist, while remaining under the physical appearance of bread and wine, becomes really and truly the body and the blood of Christ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of appearing in a particular place, or in society, a company, or any proceedings; a coming before the public in a particular character.",
                  "examples": [
                    "A person makes his appearance as an historian, an artist, or an orator.",
                    "David Beckham's first appearance with the LA Galaxy at Giants Stadium against the New York Red Bulls last night drew a crowd of 66237."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An instance of someone coming into a court of law to be part of a trial, either in person or represented by an attorney or such like; a court appearance",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Chiefly used by nurses: the act of defecation by a patient.",
                  "examples": [
                    "The patient had a small bowel obstruction and there was no appearance until after the obstruction resolved."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}