{
  "word": "pincushion",
  "etymologies": [
    {
      "description": [
        "The noun is derived from pin +‎ cushion. The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pincushion (plural pincushions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sewing) A device, originally like a small, stuffed cushion, designed to have sewing pins and needles stuck into it to store them safely; some modern pincushions hold the objects magnetically.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The names of various plants with flowers or other parts resembling a pincushion.",
              "entries": [
                {
                  "meaning": "A flowering plant in the genus Leucospermum.",
                  "examples": []
                },
                {
                  "meaning": "A flowering plant in the genus Scabiosa.",
                  "examples": []
                },
                {
                  "meaning": "The coral bead plant, coral moss, or English baby tears (Nertera granadensis), an ornamental plant.",
                  "examples": []
                },
                {
                  "meaning": "The dustymaiden, a flowering plant in the genus Chaenactis.",
                  "examples": []
                },
                {
                  "meaning": "The pincushion cactus, of the genera Escobaria or Mammillaria.",
                  "examples": []
                },
                {
                  "meaning": "The pincushionplant, a flowering plant in the genus Navarretia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, colloquial) A person who is pricked or stabbed multiple times with sharp objects; specifically, someone who receives regular hypodermic needle injections.",
                  "examples": [
                    "Insulin-dependent diabetics are human pincushions."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pincushion (third-person singular simple present pincushions, present participle pincushioning, simple past and past participle pincushioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figuratively) To jab or stick repeatedly with one or more sharp objects, as with pins into a pincushion.",
                  "examples": [
                    "The target was pincushioned with arrows."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To assume the shape of a pincushion; specifically, of the image on a computer display, television, etc., to exhibit pincushion distortion, where the sides curve inwards.",
                  "examples": [
                    "Coordinate term: barrel"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}