{
  "word": "banquet",
  "etymologies": [
    {
      "description": [
        "From Middle English banket, from Middle French banquet, from Italian banchetto (“light repast between meals, snack eaten on a small bench”, literally “a small bench”), from banco (“bench”), from Lombardic *bank, *panch (“bench”), from Proto-Germanic *bankiz (“bench”). Akin to Old High German bank, banch (“bench”), Old English benċ (“bench”). More at bank, bench."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "banquet (plural banquets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large celebratory meal; a feast.",
                  "examples": [
                    "Synonym: reception"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A dessert; a course of sweetmeats.",
                  "examples": [
                    "At Inverkeithing the teetotalers objected to this profligate expenditure, so the Provost and magistrates manfully paid for their “cookies” out of their own pockets. At Dunse, instead of a cake and wine banquet, there was “a fruit conversazione,” whatever that may be."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ceremonial dinner party for many people.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "banquet (third-person singular simple present banquets, present participle banqueting or banquetting, simple past and past participle banqueted or banquetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To participate in a banquet; to feast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To have dessert after a feast.",
                  "examples": [
                    "Then was the banquetting chamber in the tilt yard at Greenewich, to the which place these strangers were conducted by the noblest personages in the court, where they did both sup and banquet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat with a banquet or sumptuous entertainment of food; to feast.",
                  "examples": [
                    "Just in time to banquet",
                    "The illustrious company assembled there."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}