{
  "word": "haywire",
  "etymologies": [
    {
      "description": [
        "hay +‎ wire\nThe original meaning of 'likely to become tangled unpredictably or unusably, or fall apart', as though only bound with the kind of soft, springy wire used to bind hay bales  comes from usage in New England lumber camps circa 1905 where haywire outfit became the common term to refer to slap-dash collections of logging tools. To go haywire has since evolved to represent the act of falling apart or behaving unpredictably, as would wire spooled under tension springing into an unmanageable tangle once a piece had been removed from the factory spool, e.g., \"he took off the back of his watch, removed a gear and the whole works went haywire.\""
      ],
      "adjectives": [
        {
          "description": "haywire (comparative more haywire, superlative most haywire)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Roughly-made, unsophisticated, decrepit (from the use of haywire for temporary repairs).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Behaviorally erratic or uncontrollable, especially of a machine or mechanical process; usually used with the verb \"go\".",
                  "examples": [
                    "\"I got phone orders at Tuolumne Meadows to pack up and come over Sunrise Trail. Started at sunrise. Everything haywire, including cranky pack horse which kept getting off trail. Phoned in at Vernal Falls station. Ordered to hurry down, help catch two auto thieves which broke jail just after breakfast. Assigned to guard Coulterville Road."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "haywire (plural haywires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wire used to bind bales of hay.",
                  "examples": [
                    "MOWERS AND HAY RAKES, HAY PRESSES, HAY TIES AND HAY WIRE."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}