{
  "word": "crusade",
  "etymologies": [
    {
      "description": [
        "From French croisade, introduced in English (in the French spelling) by 1575. The modern spelling emerges c. 1760,. Middle French croisade is introduced in the 15th century, based on Spanish cruzada (late 14th century) and Old Occitan crozada (early 13th century), both reflecting Medieval Latin cruciﾄ》a, cruxiata, the  feminine singular of the adjective cruciﾄ》us used as an abstract noun.",
        "Adjectival cruciﾄ》us originally meant \"tormented; crucified\", but from the 12th century crucesignatus was also used for \"marked with a cross; making the sign of the cross\" and eventually \"taking the cross\" in the sense of \"going on a crusade\".",
        "Old Occitan crozada is used in the sense \"[the Albigensian] crusade\" in the Song of the Albigensian crusade, written c. 1213. From vernacular usage, Middle Latin  cruciﾄ》a also comes to be used in the sense \"crusade\" from about 1270."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crusade (plural crusades)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Any of the Papally-endorsed military expeditions undertaken by the Christians of Latin Europe in the 11th to 13th centuries to reconquer the Levant from the Muslims, as well as expeditions along the Baltic Sea and against the Cathars.",
                  "examples": [
                    "During the crusades, many Muslims and Christians and Jews were slaughtered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any war instigated and blessed by the Church for alleged religious ends, (especially) papal-sanctioned military campaigns against infidels or heretics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A grand concerted effort toward some purportedly worthy cause.",
                  "examples": [
                    "a crusade against drug abuse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, Protestantism, dated) A mass gathering in a political campaign or during a religious revival effort.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A Portuguese coin; a crusado.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crusade (third-person singular simple present crusades, present participle crusading, simple past and past participle crusaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go on a military crusade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a grand concerted effort toward some purportedly worthy cause.",
                  "examples": [
                    "He crusaded against similar injustices for the rest of his life."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}