{
  "word": "upset",
  "etymologies": [
    {
      "description": [
        "From Middle English upset (“the act of setting up; establishment”), from Middle English upsetten, corresponding to up- +‎ set. Cognate with Middle Low German upset (“setup; arrangement”)."
      ],
      "adjectives": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "upset (comparative more upset, superlative most upset)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Angry, distressed, or unhappy.",
                  "examples": [
                    "He was upset when she refused his friendship.",
                    "My children often get upset with their classmates."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a stomach or gastrointestinal tract, referred to as stomach) Feeling unwell, nauseated, or ready to vomit.",
                  "examples": [
                    "His stomach was upset, so he didn't want to move."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "upset (countable and uncountable, plural upsets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Disturbance or disruption.",
                  "examples": [
                    "My late arrival caused the professor considerable upset."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, sports, politics) An unexpected victory of a competitor or candidate that was not favored to win.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automobile insurance) An overturn.",
                  "examples": [
                    "\"collision and upset\": impact with another object or an overturn for whatever reason."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An upset stomach.",
                  "examples": [
                    "\"Bob, let's cancel the babysitter. With this upset stomach, I can't go out tonight.",
                    "\"Try Pepto-Bismol. Hospital tests prove it relieves upsets. And it's great for indigestion or nausea, too!\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) An upper set; a subset (X,≤) of a partially ordered set with the property that, if x is in U and x≤y, then y is in U.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The dangerous situation where the flight attitude or airspeed of an aircraft is outside the designed bounds of operation, possibly resulting in loss of control.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "upset (third-person singular simple present upsets, present participle upsetting, simple past and past participle upset)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (a person) angry, distressed, or unhappy.",
                  "examples": [
                    "I’m sure the bad news will upset him, but he needs to know."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disturb, disrupt or adversely alter (something).",
                  "examples": [
                    "Introducing a foreign species can upset the ecological balance.",
                    "The fatty meat upset his stomach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tip or overturn (something).",
                  "examples": [
                    "But this argument, which first Anaxagoras and later Eudoxus and certain others used, is very easily upset; for it is not difficult to collect many insuperable objections to such a view."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To defeat unexpectedly.",
                  "examples": [
                    "Truman upset Dewey in the 1948 US presidential election."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be upset or knocked over.",
                  "examples": [
                    "The carriage upset when the horse bolted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To set up; to put upright.",
                  "examples": [
                    "with sail on mast upset"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To thicken and shorten, as a heated piece of iron, by hammering on the end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shorten (a tire) in the process of resetting, originally by cutting it and hammering on the ends.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}