{
  "word": "foundress",
  "etymologies": [
    {
      "description": [
        "From Middle English founderess, founderesse, foundress (“female founder or builder of a city; female founder or benefactor of a religious house; (figuratively) female inventor or originator; (figuratively) a source”) [and other forms]; from founder, foundere, foundour (“founder or builder of a building, city, country, etc.; builder or endower of a church, college, monastery, etc.; benefactor or patron of such an institution; charter member of a guild; first head of a religious organization; inventor, originator; (figuratively) earliest of a class of people; (figuratively) a source”) + -esse (“suffix forming female forms of words”). Foundour is derived from Anglo-Norman fundur, Old French fondeor, fondeur (“creator, instigator, founder”) (modern French fondeur), from Latin fundātor (“founder”) (rare), from fundō (“to make by smelting, found”) (ultimately from Proto-Indo-European *ǵʰewd- (“to pour”)) + -tor (suffix forming masculine agent nouns). The English word is analysable as founder +‎ -ess (suffix forming female forms of words)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "foundress (plural foundresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A female founder (“one who founds or establishes”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, specifically) A female animal which establishes a colony.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From founder (“one who founds or casts metals”) +‎ -ess (suffix forming female forms of words). Founder is derived from Middle French fondeur (“owner of a foundry; ironworker in charge of smelting, founder”) (modern French fondeur), from Latin fundātor (“founder”) (rare): see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "foundress (plural foundresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metallurgy, obsolete, rare) A female founder (“one who founds or casts metals”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}