{
  "word": "slash",
  "etymologies": [
    {
      "description": [
        "Originally a verb of uncertain etymology. Possibly from French esclachier (“to break”). Used once in the Wycliffe Bible as slascht but otherwise unattested until 16th century. Conjunctive use from various applications of the punctuation mark ⟨/⟩. See also slash fiction."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "slash (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used to note the sound or action of a slash.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "slash (plural slashes)",
          "definitionGroups": [
            {
              "group": "A slashing action or motion, particularly:",
              "entries": [
                {
                  "meaning": "A swift, broad, cutting stroke made by an edged weapon or whip.",
                  "examples": [
                    "A slash of his blade just missed my ear."
                  ]
                },
                {
                  "meaning": "(cricket) A wild swinging strike of the bat.",
                  "examples": []
                },
                {
                  "meaning": "(ice hockey, lacrosse) A hard swift lateral strike with a hockey or lacrosse stick, usually across another player's arms or legs.",
                  "examples": []
                },
                {
                  "meaning": "Any similar wide striking motion.",
                  "examples": [
                    "He took a wild slash at the ball but the captain saved the team's skin by hacking it clear and setting up the team for a strike on the goal."
                  ]
                },
                {
                  "meaning": "(figuratively) A sharp reduction.",
                  "examples": [
                    "After the war ended, the army saw a 50% slash in their operating budget."
                  ]
                }
              ]
            },
            {
              "group": "A mark made by a slashing motion, particularly:",
              "entries": [
                {
                  "meaning": "A cut or laceration, often deep, made by an edged weapon or whip.",
                  "examples": [
                    "He was bleeding from a slash across his cheek."
                  ]
                },
                {
                  "meaning": "(botany) A deep taper-pointed incision in a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something resembling such a mark, particularly:",
              "entries": [
                {
                  "meaning": "(fashion) A slit in an outer garment exposing a lining or inner garment, usually of a contrasting color or design; any intentional long vertical cut in a garment.",
                  "examples": []
                },
                {
                  "meaning": "(US and Canada) A clearing in a forest, (particularly) those made by logging, fire, or other violent action.",
                  "examples": [
                    "We passed over the shoulder of a ridge and around the edge of a fire slash, and then we had the mountain fairly before us."
                  ]
                },
                {
                  "meaning": "(originally US, typography) The slash mark: the punctuation mark ⟨/⟩, sometimes (often proscribed) inclusive of any mark produced by a similar slashing movement of the pen, as the backslash ⟨\\⟩.",
                  "examples": [
                    "Initial inquiries among professional typists uncover names like slant, slant line, slash, and slash mark. Examination of typing instruction manuals discloses additional names such as diagonal and diagonal mark, and other sources provide the designation oblique."
                  ]
                },
                {
                  "meaning": "(vulgar, slang) Female genitalia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US and Canada) The loose woody debris remaining from a slash, (particularly forestry) the trimmings left while preparing felled trees for removal.",
                  "examples": [
                    "Slash generated during logging may constitute a fire hazard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fandom slang) Slash fiction.",
                  "examples": [
                    "Comments merely allow readers to proclaim themselves mortally offended by the content of a story, despite having been warned in large block letters of INCEST or SLASH (any kind of sex between two men or two women: the term originated with the Kirk/Spock pairing – it described the literal slash between their names)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slash (third-person singular simple present slashes, present participle slashing, simple past and past participle slashed)",
          "definitionGroups": [
            {
              "group": "To cut or attempt to cut, particularly:",
              "entries": [
                {
                  "meaning": "To cut with a swift broad stroke of an edged weapon.",
                  "examples": [
                    "They slashed at him with their swords, but only managed to nick one of his fingers.",
                    "She hacked and slashed her way across the jungle."
                  ]
                },
                {
                  "meaning": "To produce a similar wound with a savage strike of a whip.",
                  "examples": []
                },
                {
                  "meaning": "(ice hockey) To strike swiftly and laterally with a hockey stick, usually across another player's arms or legs.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To reduce sharply.",
                  "examples": [
                    "Competition forced them to slash prices.",
                    "Profits are only up right now because they slashed overhead, but employee morale and product quality have collapsed too."
                  ]
                },
                {
                  "meaning": "(fashion) To create slashes in a garment.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To criticize cuttingly.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To strike violently and randomly, particularly:",
              "entries": [
                {
                  "meaning": "(cricket) To swing wildly at the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move quickly and violently.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To crack a whip with a slashing motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada) To clear land, (particularly forestry) with violent action such as logging or brushfires or (agriculture, uncommon) through grazing.",
                  "examples": [
                    "The province's traditional slash-and-burn agriculture was only sustainable with a much smaller population."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, fandom slang) To write slash fiction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Compare Scots slash (“large splash”), possibly from Old French esclache. Slang use for urination attested from the 1950s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slash (plural slashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A drink of something; a draft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, UK, slang) A piss: an act of urination.",
                  "examples": [
                    "Where's the gents? I need to take a slash."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slash (third-person singular simple present slashes, present participle slashing, simple past and past participle slashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, intransitive) To piss, to urinate.",
                  "examples": [
                    "If you can slash in my bed (I thought) don't tell me you can't suck my cock."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Compare flash (“a marsh; a pool of water”) and British dialectal slashy (“wet and dirty, miry”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slash (plural slashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A swampy area; a swamp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A large quantity of watery food such as broth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slash (third-person singular simple present slashes, present participle slashing, simple past and past participle slashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, intransitive) To work in wet conditions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See slatch"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slash (plural slashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) Alternative form of slatch: a deep trough of finely-fractured culm or a circular or elliptical pocket of coal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}