{
  "word": "fall",
  "etymologies": [
    {
      "description": [
        "Verb from Middle English fallen, from Old English feallan (“to fall, fail, decay, die, attack”), from Proto-West Germanic *fallan (“to fall”), from Proto-Germanic *fallaną (“to fall”).",
        "Cognate with West Frisian falle (“to fall”), Low German fallen (“to fall”), Dutch vallen (“to fall”), German fallen (“to fall”), Danish falde (“to fall”), Norwegian Bokmål falle (“to fall”), Norwegian Nynorsk falla (“to fall”), Icelandic falla (“to fall”), Albanian fal (“forgive, pray, salute, greet”), Lithuanian pùlti (“to attack, rush”).",
        "Noun from Middle English fal, fall, falle, from Old English feall, ġefeall (“a falling, fall”) and Old English fealle (“trap, snare”), from Proto-Germanic *fallą, *fallaz (“a fall, trap”). Cognate with Dutch val, German Fall (“fall”) and German Falle (“trap, snare”), Danish fald, Swedish fall, Icelandic fall.",
        "Sense of \"autumn\" is attested by the 1660s in England as a shortening of fall of the leaf (1540s), from the falling of leaves during this season. Along with autumn, it mostly replaced the older name harvest as that name began to be associated strictly with the act of harvesting. Compare spring, which began as a shortening of “spring of the leaf”."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fall (countable and uncountable, plural falls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of moving to a lower position under the effect of gravity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reduction in quantity, pitch, etc.",
                  "examples": [
                    "“I'm through with all pawn-games,” I laughed. “Come, let us have a game of lansquenet. Either I will take a farewell fall out of you or you will have your sevenfold revenge”."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US, archaic in Britain) The time of the year when the leaves typically fall from the trees; autumn; the season of the year between the autumnal equinox and the winter solstice. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loss of greatness or status.",
                  "examples": [
                    "the fall of Rome"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which falls or cascades.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(sports) A crucial event or circumstance.",
              "entries": [
                {
                  "meaning": "(cricket, of a wicket) The action of a batsman being out.",
                  "examples": []
                },
                {
                  "meaning": "(curling) A defect in the ice which causes stones thrown into an area to drift in a given direction.",
                  "examples": []
                },
                {
                  "meaning": "(wrestling) An instance of a wrestler being pinned to the mat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hairpiece for women consisting of long strands of hair on a woven backing, intended primarily to cover hair loss.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, US) Blame or punishment for a failure or misdeed.",
                  "examples": [
                    "He set up his rival to take the fall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The part of the rope of a tackle to which the power is applied in hoisting (usu. plural).",
                  "examples": [
                    "Have the goodness to secure the falls of the mizzen halyards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An old Scots unit of measure equal to six ells.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short, flexible piece of leather forming part of a bullwhip, placed between the thong and the cracker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lid, on a piano, that covers the keyboard",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fall (third-person singular simple present falls, present participle falling, simple past fell, past participle fallen)",
          "definitionGroups": [
            {
              "group": "(heading, intransitive) To be moved downwards.",
              "entries": [
                {
                  "meaning": "To move to a lower position under the effect of gravity.",
                  "examples": [
                    "Thrown from a cliff, the stone fell 100 feet before hitting the ground."
                  ]
                },
                {
                  "meaning": "To come down, to drop or descend.",
                  "examples": [
                    "The rain fell at dawn."
                  ]
                },
                {
                  "meaning": "To come as if by dropping down.",
                  "examples": [
                    "Once or twice a noise fell upon his quick ear, and we halted, he standing revolver in hand in an attitude of defense. Each time, however, we ascertained that we had no occasion for alarm, the noise being made by some animal or bird  ..."
                  ]
                },
                {
                  "meaning": "To come to the ground deliberately, to prostrate oneself.",
                  "examples": [
                    "He fell to the floor and begged for mercy."
                  ]
                },
                {
                  "meaning": "To be brought to the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive) To move downwards.",
              "entries": [
                {
                  "meaning": "(obsolete) To let fall; to drop.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To sink; to depress.",
                  "examples": [
                    "to fall the voice"
                  ]
                },
                {
                  "meaning": "(UK, US, dialect, archaic) To fell; to cut down.",
                  "examples": [
                    "to fall a tree"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive) To change, often negatively.",
              "entries": [
                {
                  "meaning": "(copulative, in idiomatic expressions) To become.",
                  "examples": [
                    "She has fallen ill.",
                    "The children fell asleep in the back of the car.",
                    "When did you first fall in love?",
                    "fall silent, fall sick, fall pregnant, fall victim to something"
                  ]
                },
                {
                  "meaning": "(intransitive) To collapse; to be overthrown or defeated.",
                  "examples": [
                    "Rome fell to the Goths in 410 AD."
                  ]
                },
                {
                  "meaning": "(intransitive, formal, euphemistic) To die, especially in battle or by disease.",
                  "examples": [
                    "This is a monument to all those who fell in the First World War."
                  ]
                },
                {
                  "meaning": "(intransitive) To become lower (in quantity, pitch, etc.).",
                  "examples": [
                    "The candidate's poll ratings fell abruptly after the banking scandal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To occur (on a certain day of the week, date, or similar); to happen.",
                  "examples": [
                    "Thanksgiving always falls on a Thursday.  Last year, Commencement fell on June 3."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be allotted to; to arrive through chance, fate, or inheritance.",
                  "examples": [
                    "And so it falls to me to make this important decision.  The estate fell to his brother; the kingdom fell into the hands of his rivals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To diminish; to lessen or lower.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To bring forth.",
                  "examples": [
                    "to fall lambs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To issue forth into life; to be brought forth; said of the young of certain animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To descend in character or reputation; to become degraded; to sink into vice, error, or sin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become ensnared or entrapped; to be worse off than before.",
                  "examples": [
                    "to fall into error;  to fall into difficulties"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To assume a look of shame or disappointment; to become or appear dejected; said of the face.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To happen; to come to pass; to chance or light (upon).",
                  "examples": [
                    "Primitive men […] do not make laws, they fall into customs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To begin with haste, ardour, or vehemence; to rush or hurry.",
                  "examples": [
                    "After arguing, they fell to blows."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be dropped or uttered carelessly.",
                  "examples": [
                    "An unguarded expression fell from his lips."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a fabric) To hang down (under the influence of gravity).",
                  "examples": [
                    "An Empire-style dress has a high waistline – directly under the bust – from which the dress falls all the way to a hem as low as the floor."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Perhaps from the north-eastern Scottish pronunciation of whale."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fall (plural falls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The chasing of a hunted whale.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}