{
  "word": "bleak",
  "etymologies": [
    {
      "description": [
        "From Middle English bleke (also bleche, whence the English doublet bleach (“pale, bleak”)), and bleike (due to Old Norse), and earlier Middle English blak, blac (“pale, wan”), from Old English blǣc, blǣċ, blāc (“bleak, pale, pallid”) and Old Norse bleikr (“pale, whitish”), all from Proto-Germanic *blaikaz (“pale, shining”).",
        "Cognate with Dutch bleek (“pale, wan, pallid”), Low German blek (“pale”), German bleich (“pale, wan, sallow”), Danish bleg (“pale”), Swedish blek (“pale, pallid”), Norwegian Bokmål bleik, blek (“pale”), Norwegian Nynorsk bleik (“pale”), Faroese bleikur (“pale”), Icelandic bleikur (“pale, pink”)."
      ],
      "adjectives": [
        {
          "description": "bleak (comparative bleaker, superlative bleakest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Without color; pale; pallid.",
                  "examples": [
                    "When she came out she looked as pale and as bleak as one that were laid out dead."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Desolate and exposed; swept by cold winds.",
                  "examples": [
                    "a bleak and bare rock    a bleak, crater-pocked moonscape",
                    "They escaped across the bleak landscape.",
                    "We hiked across open meadows and climbed bleak mountains."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unhappy; cheerless; miserable; emotionally desolate.",
                  "examples": [
                    "Downtown Albany felt bleak that February after the divorce.",
                    "A bleak future is in store for you.",
                    "The news is bleak.",
                    "The survey paints a bleak picture."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bleke (“small river fish, bleak, blay”), perhaps an alteration (due to English blǣc (“bright”) or Old Norse bleikja) of Old English blǣġe (“bleak, blay, gudgeon”); or perhaps from a diminutive of Middle English *bleye (“blay”), equivalent to blay +‎ -ock or blay +‎ -kin. See blay."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bleak (plural bleaks or bleak)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small European river fish (Alburnus alburnus), of the family Cyprinidae.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}