{
  "word": "flash",
  "etymologies": [
    {
      "description": [
        "In some senses, from Middle English flasshen, a variant of flasken, flaskien (“to sprinkle, splash”), which was likely of imitative origin; in other senses probably of North Germanic origin akin to Swedish dialectal flasa (“to burn brightly, blaze”), related to flare. Compare also Icelandic flasa (“to rush, go hastily”)."
      ],
      "adjectives": [
        {
          "description": "flash (comparative more flash, superlative most flash)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(British, Australia and New Zealand, slang) Expensive-looking and demanding attention; stylish; showy.",
                  "examples": [
                    "The barber man was small and flash, as barbers mostly are,",
                    "He wore a strike-your-fancy sash, he smoked a huge cigar;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, of a person) Having plenty of ready money.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, of a person) Liable to show off expensive possessions or money.",
                  "examples": [
                    "Bit of a flash git, don't you think?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) Occurring very rapidly, almost instantaneously.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, obsolete) Relating to thieves and vagabonds.",
                  "examples": [
                    "the flash language: thieves' cant or slang",
                    "flash notes: counterfeit banknotes"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "flash (countable and uncountable, plural flashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden, short, temporary burst of light.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very short amount of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, US) A flashlight; an electric torch.",
                  "examples": [
                    "I reached a flash out of my car pocket and went down-grade and looked at the car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A sudden and brilliant burst, as of genius or wit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Pizzazz, razzle-dazzle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Material left around the edge of a moulded part at the parting line of the mould.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Cockney) The strips of bright cloth or buttons worn around the collars of market traders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling) A pattern where each prop is thrown and caught only once.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A language, created by a minority to maintain cultural identity, that cannot be understood by the ruling class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) Clipping of camera flash (“a device used to produce a flash of artificial light to help illuminate a scene”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A preparation of capsicum, burnt sugar, etc., for colouring liquor to make it look stronger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A form of military insignia.",
                  "examples": [
                    "I just got my first commando flash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, uncountable) Clipping of flash memory.",
                  "examples": [
                    "The hybrid drive has 500 gigabytes of hard disk space for bulk storage and 2 gigabytes of high-speed flash for caching frequently-accessed files."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various lycaenid butterflies of the genera Artipe, Deudorix and Rapala.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tattoo flash (example design on paper to give an idea of a possible tattoo).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sudden sensation of being \"high\" after taking a recreational drug.",
                  "examples": [
                    "A few seconds following the injection, the user experiences a sudden, intense generalized sensation which has both physiological and psychological characteristics.  […]  pure, commercially produced products do not give a good flash  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A newsflash.",
                  "examples": [
                    "The United Press got the flash \"Germans declare martial law in Ruhr\"  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief exposure or making visible (of a smile, badge, etc).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The (intentional or unintentional) exposure of an intimate body part or undergarment in public.",
                  "examples": [
                    "panty flash"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A butterfly of the genus Rapala",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flash (third-person singular simple present flashes, present participle flashing, simple past and past participle flashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to shine briefly or intermittently.",
                  "examples": [
                    "He flashed the light at the water, trying to see what made the noise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To blink; to shine or illuminate intermittently.",
                  "examples": [
                    "The light flashed on and off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be visible briefly.",
                  "examples": [
                    "The scenery flashed by quickly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make visible briefly.",
                  "examples": [
                    "A number will be flashed on the screen.",
                    "The special agents flashed their badges as they entered the building.",
                    "She flashed me a smile from the car window."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, informal) To expose one's intimate body part or piece of clothing, often momentarily. (Contrast streak.)",
                  "examples": [
                    "She flashed a vocalist at a rock concert.",
                    "Her skirt was so short that she flashed her underpants as she was getting out of her car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To break forth like a sudden flood of light; to show a momentary brilliance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To flaunt; to display in a showy manner.",
                  "examples": [
                    "He flashed a wad of hundred-dollar bills."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To communicate quickly.",
                  "examples": [
                    "The news services flashed the news about the end of the war to all corners of the globe.",
                    "to flash a message along the telephone wires;  to flash conviction on the mind"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move, or cause to move, suddenly.",
                  "examples": [
                    "Flash forward to the present day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To telephone a person, only allowing the phone to ring once, in order to request a call back.",
                  "examples": [
                    "Susan flashed Jessica, and then Jessica called her back, because Susan didn't have enough credit on her phone to make the call."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of liquid) To evaporate suddenly. (See flash evaporation.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, climbing) To climb (a route) successfully on the first attempt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To write to the memory of (an updatable component such as a BIOS chip or games cartridge).",
                  "examples": [
                    "In order to flash a custom ROM to a phone, the boot loader must be unlocked first."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, glassmaking) To cover with a thin layer, as objects of glass with glass of a different colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, glassmaking) To expand (blown glass) into a disc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send by some startling or sudden means.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To burst out into violence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling) To perform a flash.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metallurgy) To release the pressure from a pressurized vessel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To trick up in a showy manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To strike and throw up large bodies of water from the surface; to splash.",
                  "examples": [
                    "The varlet ſaw, when to the flood he came, / How without ſtop or ſtay he fiercely lept, / And deep himſelfe beducked in the ſame, / That in the lake his loftie creſt was ſteept, / Ne of his ſafetie ſeemed care he kept, / But with his raging armes he rudely flaſhd / The waves about, and all his armour ſwept, / That all the bloud and filth away was waſht, / Yet ſtill he bet the water, and the billows daſht."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English flasche, flaske; compare Old French flache, French flaque, which is of Germanic origin, akin to Middle Dutch vlacke (“an estuary, flats with stagnant pools”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flash (plural flashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pool.",
                  "examples": [
                    "their hearts lie lumpish as a Log that lies in a flash of water seven years together"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A reservoir and sluiceway beside a navigable stream, just above a shoal, so that the stream may pour in water as boats pass, and thus bear them over the shoal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}