{
  "word": "thorough",
  "etymologies": [
    {
      "description": [
        "From Middle English thoruȝ, þoruȝ, from Old English þuruh, a byform of Old English þurh, whence comes English through. The adjective derives from the preposition and adverb. The word developed a syllabic form in cases where the word was fully stressed: when it was used as an adverb, adjective, or noun, and less commonly when used as a preposition."
      ],
      "adjectives": [
        {
          "description": "thorough (comparative thorougher, superlative thoroughest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Painstaking and careful not to miss or omit any detail.",
                  "examples": [
                    "The Prime Minister announced a thorough investigation into the death of a father of two in police custody.",
                    "He is the most thorough worker I have ever seen.",
                    "The infested house needs a thorough cleansing before it will be inhabitable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Utter; complete; absolute.",
                  "examples": [
                    "I was elected to the Executive Committee of the Vegetarian Society, and made it a point to attend every one of its meetings, but I always felt tongue-tied. Dr. Oldfield once said to me, 'You talk to me quite all right, but why is it that you never open your lips at a committee meeting? You are a drone.' I appreciated the banter. The bees are ever busy, the drone is a thorough idler. And it was not a little curious that whilst others expressed their opinions at these meetings, I sat quite silent. Not that I never felt tempted to speak. But I was at a loss to know how to express myself. All the rest of the members appeared to me to be better informed than I. Then it often happened that just when I had mustered up courage to speak, a fresh subject would be started. This went on for a long time."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "thorough (plural thoroughs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) A furrow between two ridges, to drain off the surface water.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [
        {
          "description": "thorough",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Through. [9th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}