{
  "word": "philistine",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Philistine, influenced by philister, Philister (“(historical) in German universities: person not associated with the university; person who lacks appreciation of or is antagonistic towards art or culture”), from German Philister (“person from ancient Philistia; (figurative, dated) person not associated with a university; (figurative) person who lacks appreciation of or is antagonistic towards art or culture”), from Late Latin Philistaeus, Philisteus (compare Philistinus and see further at Philistine) + German -er (suffix forming nouns indicating an inhabitant of a place, or a person originating from a place). The figurative senses of the German word are often said to have derived from a 1693 sermon by the ecclesiastical superintendent Georg Heinrich Götze (1667–1728) on the passage “Philister über dir, Simson!” (“The Philistines are upon you, Samson!”; Judges 16:9, 12, 14, and 20) at the funeral of a student from the University of Jena in Jena, Thuringia, Germany, who had died as the result of a town and gown dispute (that is, one between the townspeople and university students), but the Oxford English Dictionary notes that the word was already used in Jena in these senses in 1687.",
        "The adjective is derived from the noun.",
        "The words philister and philistine were introduced into English by the British author Thomas Carlyle (1795–1881) and greatly popularized by the English poet and cultural critic Matthew Arnold (1822–1888), particularly in essays first published in The Cornhill Magazine between 1867 and 1868 which were collected into a book entitled Culture and Anarchy (1869)."
      ],
      "adjectives": [
        {
          "description": "philistine (comparative more philistine, superlative most philistine)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) Ignorant or uneducated; specifically, lacking appreciation for or antagonistic towards art or culture, and having pedestrian tastes.",
                  "examples": [
                    "Synonyms: heathen, (rare) philistinic, philistinish"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "philistine (plural philistines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A person who is ignorant or uneducated; specifically, a person who lacks appreciation of or is antagonistic towards art or culture, and who has pedestrian tastes.",
                  "examples": [
                    "Synonym: heathen"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}