{
  "word": "plunder",
  "etymologies": [
    {
      "description": [
        "Recorded since 1632 during the Thirty Years War, native British use since the Cromwellian Civil War. Borrowed from German plündern (“to loot”), from Middle High German, from Middle Low German plunderen. Cognate with Dutch plunderen, West Frisian plonderje, Saterland Frisian plunnerje. Probably denominal from a word for “household goods, clothes, bedding”; compare Middle Dutch plunder, German Plunder (“stuff”), Dutch and West Frisian plunje (“clothes”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plunder (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of plundering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The loot attained by plundering.",
                  "examples": [
                    "The Hessian kept his choicest plunder in a sack that never left his person, for fear that his comrades would steal it.",
                    "Synonyms: see Thesaurus:booty"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) Baggage; luggage.",
                  "examples": [
                    "[…]  till a long-legged boy brought him out of his revery, by an offer to carry his “plunder,” in whatsoever direction he might desire to direct his steps."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plunder (third-person singular simple present plunders, present participle plundering, simple past and past participle plundered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pillage, take or destroy all the goods of, by force (as in war); to raid, sack.",
                  "examples": [
                    "The mercenaries plundered the small town.",
                    "The shopkeeper was plundered of his possessions by the burglar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take (goods) by pillage.",
                  "examples": [
                    "The mercenaries plundered all the goods they found."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take by force or wrongfully; to commit robbery or looting, to raid.",
                  "examples": [
                    "“Now to plunder, mateys!” screamed a buccaneer, to cries of “Arrgh!” and “Aye!” all around."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make extensive (over)use of, as if by plundering; to use or use up wrongfully.",
                  "examples": [
                    "The miners plundered the jungle for its diamonds till it became a muddy waste."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take unexpectedly.",
                  "examples": [
                    "The Serb teed up Steve Davis, who crossed low for Graziano Pellè to plunder his fifth league goal of the campaign."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}