{
  "word": "lazy",
  "etymologies": [
    {
      "description": [
        "Attested since 1540, origin uncertain. Probably from Low German and Middle Low German lasich (“slack, feeble, lazy”), from las, from Proto-Germanic *lasiwaz, *laskaz (“feeble, weak”), from Proto-Indo-European *las- (“weak”).",
        "Akin to Dutch leuzig (“lazy”), Old Norse lasinn (“limpy, tired, weak”), Old English lesu, lysu (“false, evil, base”). More at lush.",
        "An alternate etymology traces lazy to Early Modern English laysy, a derivative of lay (plural lays +‎ -y) in the same way that tipsy is derived from tip. See lay."
      ],
      "adjectives": [
        {
          "description": "lazy (comparative lazier, superlative laziest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unwilling to do work or make an effort; disinclined to exertion.",
                  "examples": [
                    "Get out of bed, you lazy lout!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Causing or characterised by idleness; relaxed or leisurely.",
                  "examples": [
                    "I love staying inside and reading on a lazy Sunday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Showing a lack of effort or care.",
                  "examples": [
                    "lazy writing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sluggish; slow-moving.",
                  "examples": [
                    "We strolled along beside a lazy stream."
                  ]
                }
              ]
            },
            {
              "group": "Lax:",
              "entries": [
                {
                  "meaning": "Droopy.",
                  "examples": [
                    "a lazy-eared rabbit"
                  ]
                },
                {
                  "meaning": "(optometry) Of an eye, squinting because of a weakness of the eye muscles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a cattle brand) Turned so that (the letter) is horizontal instead of vertical.",
                  "examples": [
                    "Coordinate term: flying"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing theory) Employing lazy evaluation; not calculating results until they are immediately required.",
                  "examples": [
                    "a lazy algorithm"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, obsolete or dialect) Wicked; vicious.",
                  "examples": [
                    "The swilland dropsy enter in The lazy cuke , and swell his skin"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lazy (plural lazies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lazy person.",
                  "examples": [
                    "The “lazies” of the party seized the opportunity of remaining behind—wandering, as they said, though all the cross paths were marked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sloth (animal).",
                  "examples": [
                    "To strenuous minds there is an inquietude in overquietness, and no laboriousness in labour; and to tread a mile after the slow pace of a snail, or the heavy measures of the lazy of Brazilia, were a most tiring pennance, and worse than a race of some furlongs at the Olympicks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lazy (third-person singular simple present lazies, present participle lazying, simple past and past participle lazied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To laze, act in a lazy manner.",
                  "examples": [
                    "“Go to sea,” muttered Mr. Unity Peach. “Work for your living—don’t lazy away your time here!”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}