{
  "word": "rendition",
  "etymologies": [
    {
      "description": [
        "From obsolete French rendition, alteration (after rendre (“to render”)) of reddition (“reddition”). Many senses influenced by render."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rendition (countable and uncountable, plural renditions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An interpretation or performance of an artwork, especially a musical score or musical work. [from 19th c.]",
                  "examples": [
                    "The group's debut, Beloved Symphony, featuring light opera renditions of Mozart, Bach and Chopin, was deemed insufficiently classic for inclusion on the classical charts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A given visual reproduction of something. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Translation between languages, or between forms of a language; a translated text or work. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, chiefly US) Formal deliverance of a verdict. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, chiefly US) The handing-over of someone wanted for justice who has fled a given jurisdiction; extradition. [from 19th c.]",
                  "examples": [
                    "Since then, according to his lawyers and relatives, he has been repeatedly beaten, threatened with a firearm and with further rendition to Guantánamo by Ugandan officials, before being questioned by American officials."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The surrender (of a city, fortress etc.). [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The handing over of a person or thing. [from 17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rendition (third-person singular simple present renditions, present participle renditioning, simple past and past participle renditioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surrender or hand over (a person or thing); especially, for one jurisdiction to do so to another.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}