{
  "word": "clad",
  "etymologies": [
    {
      "description": [
        "From Middle English clad, cladde, cled(e), cledde, past tense and past participle forms of clethen (“(also figurative) to put clothing on, clothe, dress; to provide clothing to; to arm, equip; to cover, envelop; to conceal; to adorn”), from Old English clǣðan (past tense clǣðde, *clædde), probably from clǣþ, clāþ (“cloth; (plural) clothes”), ultimately from Proto-Indo-European *gleh₁y-, *gley- (“to adhere, cling, stick to”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "clad",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) simple past tense and past participle of clothe",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English clad(d), cladde, clade, past tense and past participle forms of clathen, clothen (“to put clothing on, clothe, dress”), from Old English clāðian, clāþian (“to clothe”) (past participle ġeclāded, ġeclaðed, ġeclaðod), from clāþ, clǣþ (“cloth; (plural) clothes”); see further at etymology 1."
      ],
      "adjectives": [
        {
          "description": "clad (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person, preceded by a garment type) Wearing clothing or some other covering (for example, an armour) on the body; clothed, dressed.",
                  "examples": [
                    "Synonyms: attired, beclad, raimented; see also Thesaurus:clothed",
                    "Antonyms: unclad; see also Thesaurus:naked"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of an object, often in compounds) Covered, enveloped in, or surrounded by a cladding, or a specified material or substance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Adorned, ornamented.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Apparently derived from clad (adjective); see etymology 2. Uses of clad as the simple past and past participle form of clad are indistinguishable from uses of the word as the simple past and past participle form of clothe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "clad (third-person singular simple present clads, present participle cladding, simple past and past participle clad or cladded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, literary or obsolete, past tense clad) To clothe, to dress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(past tense clad or cladded) To cover with a cladding or another material (for example, insulation).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, past tense clad) To imbue (with a specified quality); to envelop or surround.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}