{
  "word": "wherry",
  "etymologies": [
    {
      "description": [
        "From Middle English whery (“small boat”), of obscure origin but cognate to French houari and Breton ouari, as well as Welsh chweri (“small boat”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wherry (countable and uncountable, plural wherries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A light ship used to navigate inland waterways.",
                  "examples": [
                    "He went out for Freshman rowing but didn't make any of the crews and took to rowing by himself in a wherry three afternoons a week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, historical) A flat-bottomed vessel once employed by British merchants, notably in East Anglia, sometimes converted into pleasure boats.",
                  "examples": [
                    "Here I used to enjoy myself in playing about the bridge stairs, and often in the watermen's wherries, with other boys. On one of these occasions there was another boy with me in a wherry, and we went out into the current of the river: while we were there two more stout boys came to us in another wherry, and, abusing us for taking the boat, desired me to get into the other wherry-boat. Accordingly I went to get out of the wherry I was in; but just as I had got one of my feet into the other boat the boys shoved it off, so that I fell into the Thames; and, not being able to swim, I should unavoidably have been drowned, but for the assistance of some watermen who providentially came to my relief."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A liquor made from the pulp of crab apples after the verjuice is extracted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}