{
  "word": "immanent",
  "etymologies": [
    {
      "description": [
        "Entered English around 1530, via French, from Late Latin immanēns, present participle of Latin immanēre, from im- (“in”) + manēre (“to dwell, remain, stay”). Cognate with remain and manor."
      ],
      "adjectives": [
        {
          "description": "immanent (comparative more immanent, superlative most immanent)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Naturally part of something; existing throughout and within something; intrinsic.",
                  "examples": [
                    "The theory of evolution, as thus set forth, the theory of the evolution of all from one self-existent immanent principle, is nowadays considered not only as the fullest explanation ever given of the unity and order of the universe, being a system of perfect monism, plainly reasoned out in all its details, but also the only one which, as overcoming any kind of dualism, gives satisfaction to the human mind. For, if one and the self-same principle is not the source of all, existing unity cannot prevail throughout creation. If this one principle is not supposed to be immanent in the world, nature is not explained from itself, but rather is rendered unintelligible; that which is plain and visible in it being accounted for by something unseen and unknown. And, if this one immanent principle is not regarded as absolutely independent and self-existent, it becomes necessary to conceive of the universe as conditioned without perceiving any cause or condition on which it is dependent, and to ascribe the orderly and constant succession of phenomena, not to an agent working according to law, but to arbitrary creative will."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) Of something which has always already been.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Restricted entirely to the mind or a given domain; internal; subjective.",
                  "examples": [
                    "We are born, as the Apostle says, the children of wrath. It is not an impersonal nature which is guilty, for this would be a contradiction, but persons whose immanent, subjective state is opposed to the character and law of God."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, metaphysics, theology, of a deity) Existing within and throughout the mind and the world; dwelling within and throughout all things, all time, etc. Compare transcendent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, of a mental act) Taking place entirely within the mind of the subject and having no effect outside of it. Compare emanant, transeunt.",
                  "examples": [
                    "At the same time it has been common, and we intend to show that it is important, to distinguish one class of volitions from another. Those which terminate on some action of our own, have been called deliberate acts — and imperate acts of the will, and not unfrequently determinate acts — because they are more the result of deliberation, and determine and govern the action on which they fix; while those which contemplate no action as their immediate result, are called immanent acts of the will. They remain in the mind, and do not flow out into action."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being within the limits of experience or knowledge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}