{
  "word": "secrete",
  "etymologies": [
    {
      "description": [
        "First attested in 1678: from Latin sēcrētus (“[having been] separated”)."
      ],
      "adjectives": [
        {
          "description": "secrete (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) Separated.",
                  "examples": [
                    "[…]  they ſuppoſing Two other Divine Hypoſtaſes Superiour thereunto, which were perfectly Secrete from Matter.",
                    "[…]",
                    "This ſo containeth all things, as not being yet ſecrete and diſtinct; whereas in the Second they are diſcerned and diſtinguiſhed by Reaſon; that is, they are Actually diſtinguiſhed in their Ideas; whereas the Firſt is the Simple and Fecund Power of all things."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "First directly attested in 1728; attested as the past-participial adjective secreted in 1707: from Latin sēcrētus, perfect passive participle of sēcernō (“I separate”); reinforced by back-formation from secretion; compare secern; cognate with French sécréter and the Spanish secretar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "secrete (third-person singular simple present secretes, present participle secreting, simple past and past participle secreted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physiology, transitive, of organs, glands, etc.) To extract a substance from blood, sap, or similar to produce and emit waste for excretion or for the fulfilling of a physiological function.",
                  "examples": [
                    "Synonym: (archaic) secern"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To exude or yield.",
                  "examples": [
                    "If you won’t believe my great new doctrine (which, by the bye, is as old as the Greeks), that souls secrete their bodies, as snails do shells, you will remain in outer darkness."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Alteration of secret."
      ],
      "adjectives": [
        {
          "description": "secrete (comparative more secrete, superlative most secrete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Archaic form of secret.",
                  "examples": [
                    "a secrete breach, a secrete bed (Spenser)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "secrete (third-person singular simple present secretes, present participle secreting, simple past and past participle secreted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To conceal.",
                  "examples": [
                    "Plaintiffs filed an affidavit for an attachment, alleging that defendant was about to assign, secrete, and dispose of his property with intent to delay and defraud his creditors, and was about to convert his property into money to place it beyond the reach of his creditors."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}