{
  "word": "pancake",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English pancake, panne cake, pankake, ponkake, equivalent to pan +‎ cake.\nPerhaps adapted from Middle Low German pankôke, pannekôke, from Old Saxon *pannakōko (suggested by derivatives Old Saxon pannakōkilo and pannakōkilīn), where the compound is much older; compare Old High German phankuohho (8th century), whence Middle High German phankuoche, German Pfannkuchen (“pancake”); further\nSaterland Frisian Ponkouke, Ponkuuke (“pancake”), West Frisian pankoek (“pancake”), Dutch pannenkoek (“pancake”), German Low German Pannkook (“pancake”).\nThe juggling sense is by analogy with a pancake being tossed in a pan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pancake (plural pancakes)",
          "definitionGroups": [
            {
              "group": "A thin batter cake fried in a pan or on a griddle in oil or butter; in particular:",
              "entries": [
                {
                  "meaning": "In England, an often unleavened cake similar to a crepe.",
                  "examples": []
                },
                {
                  "meaning": "In the US (and e.g. Scotland), a leavened, thicker, fluffier cake.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A kind of makeup, consisting of a thick layer of a compressed powder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling) A type of throw, usually with a ring where the prop is thrown in such a way that it rotates round an axis of the diameter of the prop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything very thin and flat.",
                  "examples": [
                    "pancake lens"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Composite leather made of scraps, glue and board, by extension of (4), material originally used for insoles, but later used also for heels and even soles.",
                  "examples": [
                    "&hellip in the poorer grades the heel is made of scrap leather and leather board or pulp, finished with a solid leather top lift.  The composite material, called pancake, is made by an operative, usually a girl, called a pancake-maker; it is used sometimes for soles as well as heels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, slang) A box on which an actor stands to make them appear taller.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(volleyball) A defensive play in which the ball bounces off the top of a hand that has been pressed flat against the floor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pancake (third-person singular simple present pancakes, present participle pancaking, simple past and past participle pancaked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a pancake landing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction, demolition) To collapse one floor after another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To flatten violently.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}