{
  "word": "myth",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek μῦθος (mûthos, “word, humour, companion, speech, account, rumour, fable”). Attested in English since 1830. Doublet of mythos."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "myth (plural myths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A traditional story which embodies a belief regarding some fact or phenomenon of experience, and in which often the forces of nature and of the soul are personified; a sacred narrative regarding a god, a hero, the origin of the world or of a people, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Such stories as a genre.",
                  "examples": [
                    "Myth was the product of man's emotion and imagination, acted upon by his surroundings. (E. Clodd, Myths & Dreams (1885), 7, cited after OED)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A commonly-held but false belief, a common misconception; a fictitious or imaginary person or thing; a popular conception about a real person or event which exaggerates or idealizes reality.",
                  "examples": [
                    "Synonym: misconception"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing held in excessive or quasi-religious awe or admiration based on popular legend",
                  "examples": [
                    "Father Flanagan was legendary, his institution an American myth. (Tucson (Arizona) Citizen, 20 September 1979, 5A/3, cited after OED)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing existing only in imagination, or whose actual existence is not verifiable.",
                  "examples": [
                    "As for Mrs. Primmins's bones, they had been myths these twenty years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An invented story, theory, or concept.",
                  "examples": [
                    "His story is a pure myth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}