{
  "word": "spoiler",
  "etymologies": [
    {
      "description": [
        "From spoil +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spoiler (plural spoilers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who spoils; a plunderer; a pillager; a robber; a despoiler.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who corrupts, mars, or renders useless.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A document, review or comment that discloses the ending or some key surprise or twist in a story, or the internal rules controlling the behaviour of a video game, etc. [from 1970s]",
                  "examples": [
                    "Good netiquette dictates that one warn of spoilers before discussing them, so that readers who wish to do so may experience the surprises for themselves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aeronautics) A device to reduce lift and increase drag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) A device to reduce lift and increase downforce.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, chiefly politics, sports) An individual (or organisation etc.), unable to win themselves, who spoils the chances of another's victory.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spoiler (third-person singular simple present spoilers, present participle spoilering, simple past and past participle spoilered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, fandom slang) To mark (a document or message) with a spoiler warning, to prevent readers from accidentally learning details they would prefer not to know.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, fandom slang) To tell (a person) details of how a story ends etc.",
                  "examples": [
                    "I've been spoilered, so I doubt I'll be able to enjoy the final episode."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}