{
  "word": "loot",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle Dutch loet or loete (“scoop, shovel, scraper”), from reconstructed Old Dutch *lōta, from Old Frankish *lōtija (“scoop”), from Proto-Germanic *hlōþþijō (“scoop”), from Proto-Indo-European *kleh₂- (“to lay down, deposit, overlay”).",
        "Related to lade and ladle, and cognate with Dutch loet, Scots lute or luyt (“scoop”), West Frisian loete or lete, Middle Low German lōte (“rake”), and French louche (“ladle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loot (plural loots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland) A scoop used to remove scum from brine pans in saltworks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Hindi लूट (lūṭ, “booty”), either from Sanskrit लोप्त्र (loptra, “booty, stolen property”) or लुण्ट् (luṇṭ, “to rob, plunder”). The figurative meaning developed in American English in the 1920s, resulting in a generalized meaning by the 1950s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loot (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of booty, goods seized from an enemy by violence, particularly (historical) during the sacking of a town in war or (video games) after successful combat.",
                  "examples": [
                    "Loot, plunder, pillage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of sack, the plundering of a city, particularly during war.",
                  "examples": [
                    "He consented to the loot of the city by the men under his command."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, US) Any valuable thing received for free, especially Christmas presents.",
                  "examples": [
                    "Free Loot for Children"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Synonym of money.",
                  "examples": [
                    "Loot, Scottish slang for money received on pay day."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "loot (third-person singular simple present loots, present participle looting, simple past and past participle looted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Synonym of plunder, to seize by violence particularly during the capture of a city during war or (video games) after successful combat.",
                  "examples": [
                    "Gunganarian, the leader of the Chooars, continues his system of looting and murder"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly South Asian) Synonym of rob, to steal something from someone by violence or threat of violence.",
                  "examples": [
                    "He told me... that if I gave him less than to the master of the luggage-boat, he would... declare at Shēr-Gurry that I had ‘looted him!’"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loot (plural loots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US military slang, dated) Clipping of lieutenant.",
                  "examples": [
                    "R-run over an' wake up th' loot at th' station."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}