{
  "word": "glance",
  "etymologies": [
    {
      "description": [
        "From a conflation of Middle English glacen (“to graze, strike a glancing blow”) and Middle English glenten (“to look askance”). Middle English glacen came from Old French glacier (“to slip, make slippery”), which was a derivative of glace (“ice”). Middle English glenten was derived from Old Norse *glenta (“to shine; look”), which ultimately comes from Proto-Germanic *glintaną (“to shine; look”). Middle English glenten is also the source of glint.",
        "The form of the modern word takes largely after its Latinate parent, save for the medial -n-. On the other hand, the most common sense in modern usage, \"to look briefly (at something)\", comes from its Germanic parent. The sense \"to sparkle\" does as well. Most other senses derive from Middle English glacen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "glance (countable and uncountable, plural glances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief or cursory look.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deflection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A stroke in which the ball is deflected to one side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden flash of light or splendour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An incidental or passing thought or allusion.",
                  "examples": [
                    "How fleet is a glance of the mind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mineralogy) Any of various sulphides, mostly dark-coloured, which have a brilliant metallic lustre.",
                  "examples": [
                    "copper glance",
                    "silver glance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mineralogy) Glance coal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "glance (third-person singular simple present glances, present participle glancing, simple past and past participle glanced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To look briefly (at something).",
                  "examples": [
                    "She glanced at her reflection as she passed the mirror."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To graze at a surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sparkle.",
                  "examples": [
                    "The spring sunlight was glancing on the water of the pond."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move quickly, appearing and disappearing rapidly; to be visible only for an instant at a time; to move interruptedly; to twinkle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To strike and fly off in an oblique direction; to dart aside.",
                  "examples": [
                    "I started — I dropped the glass — the fluid flamed and glanced along the floor, while I felt Cornelius's gripe at my throat, as he shrieked aloud, \"Wretch! you have destroyed the labour of my life!\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) To hit lightly with the head, make a deft header.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make an incidental or passing reflection; to allude; to hint; often with at.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ichthyology) A type of interaction between parent fish and offspring in which juveniles swim toward and rapidly touch the sides of the parent, in most cases feeding on parental mucus. Relatively few species glance, mainly some Cichlidae.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}