{
  "word": "mall",
  "etymologies": [
    {
      "description": [
        "Probably from The Mall, a major street in London, England, which was originally a pall mall alley."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mall (countable and uncountable, plural malls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US, Australia, New Zealand) A pedestrianised street, especially a shopping precinct. [from 20th c.]",
                  "examples": [
                    "America′s first pedestrianized shopping mall opened in 1959 in Kalamazoo, Michigan. Like most later pedestrian malls, it was intended to revive what everybody thought was a decaying downtown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enclosed shopping centre. [from 20th c.]",
                  "examples": [
                    "Every day, at about the time the rest of us go to work, groups of retirees gather at many of America′s enclosed shopping malls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An alley where the game of pall mall was played. [17th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A public walk; a level shaded walk, a promenade. [from 18th c.]",
                  "examples": [
                    "Part of the area was laid out in gravel walks, and planted with elms; and these convenient and frequented walks obtained the name of the City Mall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heavy wooden mallet or hammer used in the game of pall mall. [from 17th c.]",
                  "examples": [
                    "I also fell slightly; but his fall proving a severe one, he arose in wrath, and struck me with the mall which he held in his hand, until my blood flowed copiously  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The game of polo. [17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An old game played with malls or mallets and balls; pall mall. [17th–19th c.]",
                  "examples": [
                    "But playing with the Boy ar Mall, (I rue the Time, and ever shall) I struck the Ball, I know not how"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mall (third-person singular simple present malls, present participle malling, simple past and past participle malled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to beat with a mall, or mallet; to beat with something heavy; to bruise",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to build up with the development of shopping malls",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) to shop at the mall",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}