{
  "word": "polygraph",
  "etymologies": [
    {
      "description": [
        "poly- +‎ -graph \"poly\" in Greek means \"many\" while \"graph\" means \"to write\" or in a manner \"he who wrote\" in that same language."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "polygraph (plural polygraphs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device which measures and records several physiological variables such as blood pressure, heart rate, respiration and skin conductivity while a series of questions is being asked to a subject, in an attempt to detect lies.",
                  "examples": [
                    "Synonym: lie detector"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A mechanical instrument for multiplying copies of a writing, resembling multiple pantographs.",
                  "examples": [
                    "Synonyms: manifold writer, autopen"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A collection of different works, either by one or several authors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A group of letters that represent a single phoneme.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any group of letters treated as a single item.",
                  "examples": [
                    "A polygraph consists of an unspecified number of adjacent letters. A polygraph need not be recognisable as a word in a language but if we are attempting to decipher a message which is expected to be in English and we find the heptagraph MEETING it is much more promising than if we find a heptagraph such as DKRPIGX."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An author who writes on many subjects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A multidimensional directed graph; a computad.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "polygraph (third-person singular simple present polygraphs, present participle polygraphing, simple past and past participle polygraphed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To administer a polygraph test to.",
                  "examples": [
                    "The FBI polygraphed the suspect but learned nothing because they already knew he was lying."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}