{
  "word": "commit",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin committō (“to bring together, join, compare, commit (a wrong), incur, give in charge, etc.”), from com- (“together”) + mittō (“to send”). See mission."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "commit (plural commits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, databases) The act of committing (e.g. a database transaction), making it a permanent change; such a change.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) The submission of source code or other material to a source control repository.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "commit (third-person singular simple present commits, present participle committing, simple past and past participle committed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give in trust; to put into charge or keeping; to entrust; to consign; used with to or formerly unto.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To imprison: to forcibly place in a jail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To forcibly evaluate and treat in a medical facility, particularly for presumed mental illness.",
                  "examples": [
                    "Tony should be committed to a nuthouse!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To do (something bad); to perpetrate, as a crime, sin, or fault.",
                  "examples": [
                    "to commit murder",
                    "to commit a series of heinous crimes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To pledge or bind; to compromise, expose, or endanger by some decisive act or preliminary step. (Traditionally used only reflexively but now also without oneself etc.)",
                  "examples": [
                    "to commit oneself to a certain action",
                    "to commit to a relationship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing, databases) To make a set of changes permanent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, programming) To integrate new revisions into the public or master version of a file in a version control system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To enter into a contest; to match; often followed by with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, Latinism) To confound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To commit an offence; especially, to fornicate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To be committed or perpetrated; to take place; to occur.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}