{
  "word": "shock",
  "etymologies": [
    {
      "description": [
        "From Middle Dutch schokken (“to push, jolt, shake, jerk”) or Middle French choquer (“to collide with, clash”), from Old Dutch *skokkan (“to shake up and down, shog”), from Proto-Germanic *skukkaną (“to move, shake, tremble”). Of uncertain origin. Perhaps related to Proto-Germanic *skakaną (“to shake, stir”), from Proto-Indo-European *(s)kek-, *(s)keg- (“to shake, stir”); see shake.",
        "Cognate with Middle Low German schocken (“collide with, deliver a blow to, move back and forth”), Old High German scoc (“a jolt, swing”), Middle High German schocken (“to swing”) (German schaukeln), Old Norse skykkr (“vibration, surging motion”), Icelandic skykkjun (“tremulously”), Middle English schiggen (“to shake”). Doublet of shog."
      ],
      "adjectives": [
        {
          "description": "shock (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Causing intense surprise, horror, etc.; unexpected and shocking.",
                  "examples": [
                    "His shock announcement rocked the tennis world."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "shock (countable and uncountable, plural shocks)",
          "definitionGroups": [
            {
              "group": "A sudden, heavy impact.",
              "entries": [
                {
                  "meaning": "(figuratively) Something so surprising that it is stunning.",
                  "examples": [
                    "Synonyms: see Thesaurus:surprise"
                  ]
                },
                {
                  "meaning": "(psychology) A sudden or violent mental or emotional disturbance.",
                  "examples": []
                },
                {
                  "meaning": "(medicine) Electric shock, a sudden burst of electrical energy hitting a person or animal.",
                  "examples": []
                },
                {
                  "meaning": "(psychology) A state of distress following a mental or emotional disturbance.",
                  "examples": [
                    "Fans were in shock in the days following the singer's death."
                  ]
                },
                {
                  "meaning": "(medicine) Circulatory shock, a medical emergency characterized by the inability of the circulatory system to supply enough oxygen to meet tissue requirements.",
                  "examples": []
                },
                {
                  "meaning": "(physics) A shock wave.",
                  "examples": [
                    "Several reflected shocks enter the bomb core in rapid succession, each helping to compress it to its maximum density."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive, mechanical engineering) A shock absorber (typically in the suspension of a vehicle).",
                  "examples": [
                    "If your truck's been riding rough, it might need new shocks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A discontinuity arising in the solution of a partial differential equation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chemical added to a swimming pool to moderate the chlorine levels.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shock (third-person singular simple present shocks, present participle shocking, simple past and past participle shocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to be emotionally shocked; to cause (someone) to feel surprised and upset.",
                  "examples": [
                    "The disaster shocked the world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give an electric shock to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To subject to a shock wave or violent impact.",
                  "examples": [
                    "Ammonium nitrate can detonate if severely shocked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To meet with a shock; to collide in a violent encounter.",
                  "examples": [
                    "They saw the moment approach when the two parties would shock together."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To add a chemical to (a swimming pool) to moderate the chlorine levels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology, transitive) To deform the crystal structure of a stone by the application of extremely high pressure at moderate temperature, as produced only by hypervelocity impact events, lightning strikes, and nuclear explosions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Variant of shag."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shock (plural shocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An arrangement of sheaves for drying; a stook.",
                  "examples": [
                    "Cause it on shocks to be by and by set."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(commerce, dated) A lot consisting of sixty pieces; a term applied in some Baltic ports to loose goods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A tuft or bunch of something, such as hair or grass.",
                  "examples": [
                    "His head boasted a shock of sandy hair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A small dog with long shaggy hair, especially a poodle or spitz; a shaggy lapdog.",
                  "examples": [
                    "When I read of witty persons, I could not figure them but like the little shock. (translating the German Spitz)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shock (third-person singular simple present shocks, present participle shocking, simple past and past participle shocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To collect, or make up, into a shock or shocks; to stook.",
                  "examples": [
                    "to shock rye"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}