{
  "word": "circuit",
  "etymologies": [
    {
      "description": [
        "From Middle English circuit, from Old French circuit, from Latin circuitus (“a going round”), from circuire (“go round”), from circum (“around”) + ire. As a Chinese administrative division, a calque of Chinese 道 (dào) or 路 (lù)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "circuit (plural circuits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of moving or revolving around, or as in a circle or orbit; a revolution",
                  "examples": [
                    "After 27 days the moon has made one circuit among the stars, moving from west to east. But in those 27 days the sun has likewise moved eastwardly, about 27 degrees. The moon, then, has to make one circuit and a little more in order to be again in the line joining the earth and sun, in order to be again 'new.'"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The circumference of, or distance around, any space; the measure of a line around an area.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which encircles anything, as a ring or crown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The space enclosed within a circle, or within limits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electricity) Enclosed path of an electric current, usually designed for a certain function.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A regular or appointed trip from place to place as part of one's job",
                  "examples": [
                    "Having cut his teeth on London's take-no-prisoners comedy circuit he can handle hecklers too, sometimes with musical accompaniment; recent shows see him armed with a veritable chamber orchestra's worth of instruments, all of which he plays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The jurisdiction of certain judges within a state or country, whether itinerant or not.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(historical) Various administrative divisions of imperial and early Republican China, including:",
              "entries": [
                {
                  "meaning": "The counties at the fringes of the empire, usually with a non-Chinese population, from the Han to the Western Jin.",
                  "examples": []
                },
                {
                  "meaning": "The 10 or so major provinces of the empire from the Tang to the early Yuan.",
                  "examples": []
                },
                {
                  "meaning": "Major provincial divisions from the Yuan to early Republican China.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Abbreviation of circuit court.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Methodism) The basic grouping of local Methodist churches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "By analogy to the proceeding three, a set of theaters among which the same acts circulate; especially common in the heyday of vaudeville.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(motor racing) A track on which a race in held; a racetrack",
                  "examples": [
                    "Interlagos is the 24th track Hamilton has won at in F1, which is more than any other driver in history. The only circuit on the current calendar that Hamilton hasn’t won at is Baku, which only joined the schedule this year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) circumlocution",
                  "examples": [
                    "circuite of words."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scientology) A thought that unconsciously goes round and round in a person's mind and controls that person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A closed path, without repeated vertices allowed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chain of cinemas/movie theaters.",
                  "examples": [
                    "Mike Patrick commented on a theater chain he was considering buying and converting to 99 ¢ theaters with multiplex screens: I'm looking at a circuit of theaters in a major metropolitan area. Now the owner hasn't told me that it is for sale yet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "circuit (third-person singular simple present circuits, present participle circuiting, simple past and past participle circuited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To move in a circle; to go round; to circulate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To travel around.",
                  "examples": [
                    "Having circuited the air."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}