{
  "word": "possession",
  "etymologies": [
    {
      "description": [
        "From Latin possessiō, possessiōnis."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "possession (countable and uncountable, plural possessions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Control or occupancy of something for which one does not necessarily have private property rights.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is owned.",
                  "examples": [
                    "The car quickly became his most prized possession.",
                    "I would gladly give all of my worldly possessions just to be able to do that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ownership; taking, holding, keeping something as one's own.",
                  "examples": [
                    "The car is in my possession.",
                    "I'm in possession of the car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A territory under the rule of another country.",
                  "examples": [
                    "Réunion is the largest of France's overseas possessions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The condition or affliction of being possessed by a demon or other supernatural entity.",
                  "examples": [
                    "Back then, people with psychiatric disorders were sometimes thought to be victims of demonic possession."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The condition of being under the control of strong emotion or madness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) Control of the ball; the opportunity to be on the offensive.",
                  "examples": [
                    "The scoreboard shows a little football symbol next to the name of the team that has possession."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football) A disposal of the ball during a game, i.e. a kick or a handball.",
                  "examples": [
                    "Defender Colin O'Riordan had 41 possessions in the NEAFL last week to continue his outstanding form, while Ryan Clarke had 47 in the Swans' big loss to Brisbane."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A syntactic relationship between two nouns or nominals that may be used to indicate ownership.",
                  "examples": [
                    "Some languages distinguish between a construction like 'my car', which shows alienable possession — the car could become someone else's — and one like 'my foot', which has inalienable possession — my foot will always be mine."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "possession (third-person singular simple present possessions, present participle possessioning, simple past and past participle possessioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To invest with property.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}