{
  "word": "prang",
  "etymologies": [
    {
      "description": [
        "Originally World War II Royal Air Force slang; probably imitative."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "prang (countable and uncountable, plural prangs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) An aeroplane crash.",
                  "examples": [
                    "I remember when a call came through that a crop sprayer had had a plane prang down at Naracoorte, in the south-east of South Australia."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, military slang) A bombing raid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia and New Zealand, UK, informal) An accident involving a motor vehicle, typically minor and without casualties.",
                  "examples": [
                    "Synonyms: (Australia) bingle, collision, crash, (US) fender-bender"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, uncountable) Crack cocaine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "prang (third-person singular simple present prangs, present participle pranging, simple past and past participle pranged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) To crash an aeroplane.",
                  "examples": [
                    "“We have to wear good socks and boots,” said one pilot with a grin, “—as we often prang in the jungle, and have to walk home.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly Australia and New Zealand, UK, informal) To crash; to have an accident while controlling a vehicle.",
                  "examples": [
                    "“Didn′t bump nobody,” I sneer.",
                    "“That′s because you were careful,” says the wife. “Your forecast doesn′t say you will prang. It merely says ‘exercise care today,’ which you did.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly Australia and New Zealand, UK, informal) To damage (the vehicle one is driving) in an accident; to have a minor collision with (another motor vehicle).",
                  "examples": [
                    "Soon after rescuing some silly children from the local caves, the alien prangs his vessel and dies."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Borrowed from Khmer ប្រាង្គ (praang)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "prang (plural prangs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A type of tower or spire featured in some Buddhist temples of Cambodia and Thailand.",
                  "examples": [
                    "The prang is surrounded by walls, which are in turn surrounded by smaller prangs and chedis, some of which are rather precariously supported."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}