{
  "word": "settle",
  "etymologies": [
    {
      "description": [
        "From a merger of two verbs:",
        "German siedeln (“to settle”) is related to the former of the two verbs, but is not an immediate cognate of either of them."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "settle (third-person singular simple present settles, present participle settling, simple past and past participle settled)",
          "definitionGroups": [
            {
              "group": "To conclude or resolve (something):",
              "entries": [
                {
                  "meaning": "(transitive) To determine (something which was exposed to doubt or question); to resolve conclusively; to set or fix (a time, an order of succession, etc).",
                  "examples": [
                    "His fears were settled",
                    "She hopes to settle and questions about the plans.",
                    "The question of the succession to a throne needs to be settled."
                  ]
                },
                {
                  "meaning": "(transitive) To conclude, to cause (a dispute) to finish.",
                  "examples": [
                    "to settle a quarrel"
                  ]
                },
                {
                  "meaning": "(transitive) In particular, to terminate (a lawsuit), usually out of court, by agreement of all parties.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To close, liquidate or balance (an account) by payment, sometimes of less than is owed or due.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, colloquial) To pay (a bill).",
                  "examples": [
                    "to settle a bill"
                  ]
                },
                {
                  "meaning": "(intransitive) To adjust differences or accounts; to come to an agreement on matters in dispute.",
                  "examples": [
                    "He has settled with his creditors."
                  ]
                },
                {
                  "meaning": "(intransitive) To conclude a lawsuit by agreement of the parties rather than a decision of a court.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive) To place or arrange in(to) a desired (especially: calm) state, or make final disposition of (something).",
              "entries": [
                {
                  "meaning": "(transitive) To put into (proper) place; to make sit or lie properly.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To cause to no longer be in a disturbed, confused or stormy; to quiet; to calm (nerves, waters, a boisterous or rebellious child, etc).",
                  "examples": []
                },
                {
                  "meaning": "(Britain, dialectal) To silence, especially by force.",
                  "examples": []
                },
                {
                  "meaning": "To kill.",
                  "examples": [
                    "I poured a charge of powder over the nipple so as not tu miss goin' off if possible. Click! went the match,—up jumped the flock, or tried tu. As they bunched up, Peggy blazed intu 'em, settlin’ how many I didn't know, [...]"
                  ]
                },
                {
                  "meaning": "(transitive) To bring or restore (ground, roads, etc) to a smooth, dry, or passable condition.",
                  "examples": [
                    "clear weather settles the roads"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive) To become calm, quiet, or orderly; to stop being agitated.",
              "entries": [
                {
                  "meaning": "(intransitive) To become firm, dry, and hard, like the ground after the effects of rain or frost have disappeared.",
                  "examples": [
                    "The roads settled late in the spring."
                  ]
                }
              ]
            },
            {
              "group": "To establish or become established in a steady position:",
              "entries": [
                {
                  "meaning": "(transitive) To place in(to) a fixed or permanent condition or position or on(to) a permanent basis; to make firm, steady, or stable; to establish or fix.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) In particular, to establish in life; to fix in business, in a home, etc.",
                  "examples": [
                    "to settle a minister"
                  ]
                },
                {
                  "meaning": "(transitive, US, obsolete) In particular, to establish in pastoral office; to ordain or install as pastor or rector of a church, society, or parish.",
                  "examples": [
                    "to settle a minister"
                  ]
                },
                {
                  "meaning": "(transitive, law) To formally, legally secure (an annuity, property, title, etc) on (a person).",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To become married, or a householder.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, with \"in\") To be established in a profession or in employment.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, usually with \"down\", \"in\", \"on\" or another preposition) To become stationary or fixed; to come to rest.",
                  "examples": [
                    "Chyle [...] runs through all the intermediate colors until it settles in an intense red."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive) To fix one's residence in a place; to establish a dwelling place, home, or colony. (Compare settle down.)",
              "entries": [
                {
                  "meaning": "(transitive, in particular) To colonize (an area); to migrate to (a land, territory, site, etc).",
                  "examples": [
                    "the French first settled Canada",
                    "the Puritans settled New England",
                    "Plymouth was settled in 1620."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (people) to (a land or territory), so as to colonize it; to cause (people) to take residence in (a place).",
                  "examples": []
                }
              ]
            },
            {
              "group": "To sink, or cause (something, or impurities within it) to sink down, especially so as to become clear or compact.",
              "entries": [
                {
                  "meaning": "(transitive) To clear or purify (a liquid) of dregs and impurities by causing them to sink.",
                  "examples": [
                    "to settle coffee, or the grounds of coffee"
                  ]
                },
                {
                  "meaning": "(transitive) To cause to sink down or to be deposited (dregs, sediment, etc).",
                  "examples": [
                    "to settle the sediment out of the water"
                  ]
                },
                {
                  "meaning": "(transitive) To render compact or solid; to cause to become packed down.",
                  "examples": [
                    "to settle the chips in the potato chip bag by shaking it"
                  ]
                },
                {
                  "meaning": "(intransitive) To sink to the bottom of a body of liquid, as dregs of a liquid, or the sediment of a reservoir.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To sink gradually to a lower level; to subside, for example the foundation of a house, etc.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To become compact due to sinking.",
                  "examples": [
                    "The chips in the bag of potato chips settled during shipping."
                  ]
                },
                {
                  "meaning": "(intransitive) To become clear due to the sinking of sediment. (Used especially of liquid. also used figuratively.)",
                  "examples": [
                    "wine settles by standing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To make a jointure for a spouse.",
                  "examples": [
                    "He sighs with most success that settles well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) Of an animal: to make or become pregnant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English settle, setle, setel, setil, seotel, from Old English setl (“that upon which one sits, a seat, a settle, a place to sit”), from Proto-Germanic *setlaz (“a seat; arm-chair”), representing Proto-Indo-European *sed-lo-, from *sed- (“sit”). Cognate with Dutch zetel, German Sessel, Latin sella."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "settle (plural settles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A seat of any kind.",
                  "examples": [
                    "sit on a settle of joy with angels"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A long bench with a high back and arms, often with chest or storage space underneath.",
                  "examples": [
                    "Let us return now to the little girl we left feigning to sleep soundly upon a settle in the kitchen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A place made lower than the rest; a wide step or platform lower than some other part. (Compare a depression.)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}