{
  "word": "mooch",
  "etymologies": [
    {
      "description": [
        "From Middle English moochen, mouchen (“to pretend poverty”), from Old French muchier, mucier, mucer (“to skulk, hide, conceal”), from Frankish *mukkjan (“to hide, conceal oneself”), from Proto-Germanic *mukjaną, *mūkōną (“to hide, ambush”), from Proto-Indo-European *(s)mūg-, *(s)mewgʰ- (“swindler, thief”).",
        "Cognate with Old High German mūhhōn (“to store, cache, plunder”), Middle High German muchen, mucken (“to hide, stash”), Middle English müchen, michen (“to rob, steal, pilfer”). More at mitch.",
        "Alternate etymology derives mooch from Middle English mucchen (“to hoard, be stingy”, literally “to hide coins in one's nightcap”), from Middle English mucche (“nightcap”), from Middle Dutch mutse (“cap, nightcap”), from Medieval Latin almucia (“nightcap”), of unknown origin, possibly Arabic. More at mutch, amice."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mooch (plural mooches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) An aimless stroll.",
                  "examples": [
                    "Jack wouldn't be arriving for another ten minutes, so I had a mooch around the garden."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who mooches; a moocher.",
                  "examples": [
                    "Synonyms: see Thesaurus:scrounger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A unit of time comprising ten days, used to measure how long someone holds a job.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mooch (third-person singular simple present mooches, present participle mooching, simple past and past participle mooched) (colloquial)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) To wander around aimlessly, often causing irritation to others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To beg, cadge, or sponge; to exploit or take advantage of others for personal gain.",
                  "examples": [
                    "Synonyms: see Thesaurus:scrounge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly Britain) To steal or filch.",
                  "examples": [
                    "Synonyms: see Thesaurus:steal"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}