{
  "word": "suck",
  "etymologies": [
    {
      "description": [
        "From Middle English souken, suken, from Old English sūcan (“to suck”), from Proto-West Germanic *sūkan, from Proto-Germanic *sūkaną (“to suck, suckle”), from Proto-Indo-European *sewg-, *sewk- (“to suck”).",
        "Cognate with Scots souke (“to suck”), obsolete Dutch zuiken (“to suck”), Limburgish zuken, zoeken (“to suck”). Akin also to Old English sūgan (“to suck”), West Frisian sûge, sûge (“to suck”), Dutch zuigen (“to suck”), German saugen (“to suck”), Swedish suga (“to suck”), Icelandic sjúga (“to suck”), Latin sugō (“suck”), Welsh sugno (“suck”). Related to soak."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "suck (countable and uncountable, plural sucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of drawing something into one's mouth by inhaling.",
                  "examples": [
                    "Bammer agreed “Probably a good idea,” he agreed with a quick suck on his straw, “won't stop you from picking up any of these chicks, though.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Milk drawn from the breast.",
                  "examples": [
                    "The infant took suck in an instant, pulling strongly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An indrawing of gas or liquid caused by suction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The ability to suck; suction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of a river towards which strong currents converge making navigation difficult.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) A weak, self-pitying person; a person who refuses to go along with others, especially out of spite; a crybaby or sore loser.",
                  "examples": [
                    "“Why're you bothering to take her anywhere? I can't stand traveling with her. You're such a suck,” her sister said. Waved her smoke. “No fucking way I'm going.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sycophant, especially a child.",
                  "examples": [
                    "You are McGlade's suck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A short drink, especially a dram of spirits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar) An act of fellatio.",
                  "examples": [
                    "Nate exhaled a long, slow breath. What the hell was he thinking? He couldn't cruise the steam room looking for married men looking for a quick suck. He needed to shoot his load, but was he really that desperate?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable, sometimes considered vulgar) Badness or mediocrity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "suck (third-person singular simple present sucks, present participle sucking, simple past and past participle sucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use the mouth and lips to pull in (a liquid, especially milk from the breast). [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To perform such an action; to feed from a breast or teat. [from 11th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put the mouth or lips to (a breast, a mother etc.) to draw in milk. [from 11th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To extract, draw in (a substance) from or out of something. [from 14th c.]",
                  "examples": [
                    "That she may sucke their life, and drinke their blood,  With which she from her childhood had bene fed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To inhale (air), to draw (breath).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work the lips and tongue on (an object) to extract moisture or nourishment; to absorb (something) in the mouth. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pull (something) in a given direction, especially without direct contact. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, vulgar) To perform fellatio. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US, intransitive, stative, slang, sometimes considered vulgar) To be inferior or objectionable: a general term of disparagement, sometimes used with at to indicate a particular area of deficiency. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}