{
  "word": "funnel",
  "etymologies": [
    {
      "description": [
        "From Middle English funell, fonel, probably through Old French *founel (compare Middle French fonel, Old Occitan fonilh, enfounilh), from Latin fundibulum, infundibulum (“funnel”), from infundere (“to pour in”);\nin (“in”) + fundere (“to pour”); compare Breton founilh (“funnel”), Welsh ffynel (“air hole, chimney”). See fuse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "funnel (plural funnels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A utensil in the shape of an inverted hollow cone terminating in a narrow pipe, for channeling  liquids or granular material; typically used when transferring said substances from any container into ones with a significantly smaller opening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A passage or avenue for a fluid or flowing substance; specifically, a smoke flue or pipe; the chimney of a steamship or the like.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "funnel (third-person singular simple present funnels, present participle funnelling or funneling, simple past and past participle funnelled or funneled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use a funnel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To proceed through a narrow gap or passageway akin to a funnel; to condense or narrow.",
                  "examples": [
                    "Expect delays where the traffic funnels down to one lane."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To channel, direct, or focus (emotions, money, resources, etc.).",
                  "examples": [
                    "Our taxes are being funnelled into pointless government initiatives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To consume (beer, etc.) rapidly through a funnel, typically as a stunt at a party.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "funnel (plural funnels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of fummel (“hybrid animal”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}