{
  "word": "resurgent",
  "etymologies": [
    {
      "description": [
        "re- +‎ surgent."
      ],
      "adjectives": [
        {
          "description": "resurgent (comparative more resurgent, superlative most resurgent)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Undergoing a resurgence; experiencing renewed vigor or vitality.",
                  "examples": [
                    "All the terror of time, where error and fear were lords of a world of slaves,",
                    "Age on age in resurgent rage and anguish darkening as waves on waves,",
                    "Fell or fled from a face that shed such grace as quickens the dust of graves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) Of a celestial object, moving upwards relative to the horizon after a period of having moved downwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rising again, as from the dead.",
                  "examples": [
                    "[…]  the co-eternal Word and only-begotten Son of the Living God, incarnate, tempted, agonizing  […] , crucified, submitting to Death, resurgent, communicant of his Spirit, ascendent, and obtaining for his Church the Descent and Communion of the Holy Spirit, the Comforter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "resurgent (plural resurgents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who rises again, as from the dead.",
                  "examples": [
                    "The poor man came before the Police, making the bitterest complaints upon being restored to life; and for three years the burden of supporting him fell upon the mistaken Samaritan, who had rescued him from death. During that period, scarcely a day elapsed in which the degraded resurgent did not appear before the European, and curse him with the bitterest curses—as the cause of all his misery and desolation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}