{
  "word": "trombone",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian trombone, from tromba (“trumpet”) +‎ -one (augmentative), literally “large trumpet”.\nThe telecommunications sense alludes to the shape of the musical instrument."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trombone (plural trombones or tromboni)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A musical instrument in the brass family, having a cylindrical bore, and usually a sliding tube (but sometimes piston valves, and rarely both). Most often refers to the tenor trombone, which is the most common type of trombone and has a fundamental tone of B♭ˌ (contra B♭).",
                  "examples": [
                    "Jim plays the trombone very well.",
                    "This trombone is very expensive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The common European bittern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, television) A kind of extendable support for attaching lighting elements to a set.",
                  "examples": [
                    "The trombone  […]  permits an instrument to be positioned over a studio set wall, enabling the set wall to support the weight of the instrument."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trombone (third-person singular simple present trombones, present participle tromboning, simple past and past participle tromboned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telecommunications) To transmit a signal or data back to a central switching point before sending it out to its destination.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, slang, transitive) To extend and retract (the zoom lens); to use it too enthusiastically.",
                  "examples": [
                    "[…]  do things wrong (like rotating the lens turret while shooting or backwinding and doing multiple passes on the same strip of film or doing in-camera fades with the variable shutter or tromboning a zoom lens like a teenager on acid, etc., etc., etc.)  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}