{
  "word": "smock",
  "etymologies": [
    {
      "description": [
        "From Middle English smok, from Old English smocc, smoc, from Proto-Germanic *smukkaz (“something slipped into”); akin to Old High German smocho, Icelandic smokkur, and from the root of Old English smugan (“to creep”), akin to German schmiegen (“to cling to, press close”). Middle High German smiegen, Icelandic smjúga (“to creep through, to put on a garment which has a hole to put the head through”); compare with Lithuanian smukti (“to glide”). See also smug, smuggle."
      ],
      "adjectives": [
        {
          "description": "smock (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to a smock; resembling a smock",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hence, of or pertaining to a woman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "smock (plural smocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of undergarment worn by women; a shift or slip.",
                  "examples": [
                    "Before the folk herselfe stripped she,",
                    "And in her smock, with foot and head all bare,",
                    "Toward her father's house forth is she fare."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blouse; a smock frock.",
                  "examples": [
                    "And women were in that gabarre [boat]; whom the Red Nightcaps were stripping naked; who begged, in their agony, that their smocks might not be stript from them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose garment worn as protection by a painter, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "smock (third-person singular simple present smocks, present participle smocking, simple past and past participle smocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with, or clothe in, a smock or a smock frock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sewing) To apply smocking.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}