{
  "word": "mammoth",
  "etymologies": [
    {
      "description": [
        "From obsolete Russian ма́мант (mámant), modern ма́монт (mámont), probably from a Uralic language, such as Proto-Mansi *mē̮ŋ-ońt (“earth-horn”). Possibly influenced by behemoth.",
        "The Mansi word could mean \"earth stag,\" from Northern Mansi ма̄ (mā, “earth”) and а̄ньт (ānʹt, “horn”). Adjectival use was popularized in the early 1800s by references to the Cheshire Mammoth Cheese presented to American paleontologist and president Thomas Jefferson."
      ],
      "adjectives": [
        {
          "description": "mammoth (comparative more mammoth, superlative most mammoth)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Comparable to a mammoth in its size; very large, huge, gigantic.",
                  "examples": [
                    "“Ha! ha!” he proudly cried, “a fig / For this, your mammoth torso! / Just watch me while I grow as big / As you—or even more so!”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mammoth (plural mammoths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any species of the extinct genus Mammuthus, of large, usually hairy, elephant-like mammals with long curved tusks and an inclined back, which became extinct with the last retreat of ice age glaciers during the late Pleistocene period, and are known from fossils, frozen carcasses, and Paleolithic cave paintings found in North America and Eurasia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A mastodon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something very large of its kind.",
                  "examples": [
                    "That is a lot of ship, about the size of big tankers before they grew so rapidly to become supers, mammoths and oilbergs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}