{
  "word": "bougie",
  "etymologies": [
    {
      "description": [
        "Borrowed from French bougie (“wax candle”), after the Algerian city Bougie (Béjaïa), and the tapered, hand-dipped candles it made. The medical instruments were originally made from waxed linen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bougie (plural bougies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A tapered cylindrical instrument for introducing an object into a tubular anatomical structure, or to dilate such a structure, as with an esophageal bougie.",
                  "examples": [
                    "I was not too sure, as a child, what doctors \"did,\" and glimpses of catheters and bougies in their kidney dishes, retractors and speculums, rubber gloves, catgut thread, and forecepts - all this, I think, rather frightened me, though it fascinated me too."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wax candle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From bourgeoisie."
      ],
      "adjectives": [
        {
          "description": "bougie (comparative bougier, superlative bougiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, usually derogatory) Behaving like or pertaining to people of a higher social status, middle-class / bourgeois people (sometimes carrying connotations of fakeness, elitism, or snobbery).",
                  "examples": [
                    "Hey, look, man, I haven't changed, I'm not gonna change and I'm not down with this bougie stuff."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Canada, slang) Fancy or good-looking, without the same connotations of snobbery or pretentiousness as in sense 1.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bougie (plural bougies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly African-American Vernacular, slang, usually derogatory) A person who exhibits bougie behavior.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}