{
  "word": "neat",
  "etymologies": [
    {
      "description": [
        "From Middle English *nete, net, nette (> Modern net \"after deductions, unadulterated\"), from Anglo-Norman neit (“good, desirable, clean”), a variant of Old French net, nette (\"clean, clear, pure\"; from Latin nitidus (“gleaming”), from niteō (“I shine”)). Cognate with German nett (“nice, kind”)."
      ],
      "adjectives": [
        {
          "description": "neat (comparative neater, superlative neatest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clean, tidy; free from dirt or impurities.",
                  "examples": [
                    "My room is neat because I tidied it this morning.  She has very neat hair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from contaminants; unadulterated, undiluted. Particularly of liquor and cocktails; see usage below.",
                  "examples": [
                    "I like my whisky neat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Conditions with a liquid reagent or gas performed with no standard solvent or cosolvent.",
                  "examples": [
                    "The Arbuzov reaction is performed by adding the bromide to the phosphite, neat.  The molecular beam was neat acetylene."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) With all deductions or allowances made; net.",
                  "examples": [
                    "Why without telling the least title of Falshood, within the space of the last Week’s Play, the Gains of Count Cog, really amounted to no less than Twenty Thousand Pounds Sterling neat Money."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a simple elegance or style; clean, trim, tidy, tasteful.",
                  "examples": [
                    "The front room was neat and carefully arranged for the guests."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Well-executed or delivered; clever, skillful, precise.",
                  "examples": [
                    "Having the two protagonists meet in the last act was a particularly neat touch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Facile; missing complexity or details in the favor of convenience or simplicity.",
                  "examples": [
                    "Courts should not reduce this case to a neat set of legal rules."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, colloquial) Good, excellent, desirable.",
                  "examples": [
                    "Hey, neat convertible, man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete form of net (“remaining after expenses or deductions”).",
                  "examples": [
                    "What is the neat weight of 4 hogsheads of tobacco, each weighing 10cwt. 3qrs. 10lb. gross; — tare 100lb. per hdd.?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "neat (plural neats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An artificial intelligence researcher who believes that solutions should be elegant, clear and provably correct. Compare scruffy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English nete, neat, from Old English nēat (“animal, beast, ox, cow, cattle”), from Proto-Germanic *nautą (“foredeal, profit, property, livestock”), from Proto-Indo-European *newd- (“to acquire, make use of”). Cognate with Dutch noot (“cow, cattle”, in compounds), dialectal German Noß (“livestock”), Alemannic German Nooss (“young sheep or goat”), Swedish nöt (“cattle”), Icelandic naut (“cattle, bull”) and Faroese neyt (“cattle”) More at note."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "neat (plural neat)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A bull or cow.",
                  "examples": [
                    "[…]  I sat down by this water in the shade to dine, on a neat’s tongue I had got from good Mrs. Price  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Cattle collectively.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}