{
  "word": "transition",
  "etymologies": [
    {
      "description": [
        "From Middle French transition, from Latin transitio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "transition (countable and uncountable, plural transitions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The process of change from one form, state, style or place to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A word or phrase connecting one part of a discourse to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A brief modulation; a passage connecting two themes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A change of key.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A point mutation in which one base is replaced by another of the same class (purine or pyrimidine); compare transversion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(some sports) A change from defense to attack, or attack to defense.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The onset of the final stage of childbirth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) Professional special education assistance for children or adults in the process of leaving one educational environment or support program for another to relatively more independent living.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(skating) A change between forward and backward motion without stopping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT) The process or act of changing from one gender role to another, or of bringing one's outward appearance in line with one's internal gender identity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A published procedure for instrument flight, coming between the departure and en-route phases of flight, or between en-route flight and an approach/landing procedure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) Death; passing from life into death.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "transition (third-person singular simple present transitions, present participle transitioning, simple past and past participle transitioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a transition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring through a transition; to change.",
                  "examples": [
                    "The soldier was transitioned from a combat role to a strategic role."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, LGBT) To change from one gender role to another, or bring one's outward appearance in line with one's internal gender identity.",
                  "examples": [
                    "If the transitioning person leaves the family home, there will be moving costs, and costs associated with the acquisition of another home or the renting of an apartment. If the non-transitioning spouse leaves the family home,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}