{
  "word": "undersee",
  "etymologies": [
    {
      "description": [
        "From under- +‎ see. Cognate with Dutch onderzien (“to see below”), German untersehen (“to see below”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "undersee (third-person singular simple present undersees, present participle underseeing, simple past undersaw, past participle underseen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To see or look under or below; see below the surface of.",
                  "examples": [
                    "Newfoundland guides, trying to point out to a fisherman a salmon in the water, may say: \"You have to undersee the shine.\" Ken has a remarkable ability to \"undersee the shine.\" He is not deceived by surfaces."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To look intently into; examine; inspect.",
                  "examples": [
                    "At these less visible but still crucial levels, a substantial military presence would appear to have strengthened the capacity of the government to implement policy, by toughening the chain of command and by enabling officers to play watchdog roles \"underseeing\" civilian ministers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To neglect; fail to see properly or adequately; turn a blind eye to; ignore.",
                  "examples": [
                    "But he didn't read books; he only oversaw, or undersaw, the niggling details of their mass production."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}