{
  "word": "colored",
  "etymologies": [
    {
      "description": [],
      "adjectives": [
        {
          "description": "colored (comparative more colored, superlative most colored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling) Having a color.",
                  "examples": [
                    "Synonyms: see Thesaurus:colored",
                    "Wash colored items separately from whites and darks to prevent the colors from bleeding."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a particular color or kind of color.",
                  "examples": [
                    "The room was red, with a dark-colored rug."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having prominent colors; colorful.",
                  "examples": [
                    "The singer wore a colored shirt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Biased; pervasively (but potentially subtly) influenced in a particular way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, now dated and usually offensive) Of skin color other than white; in particular, black.",
                  "examples": [
                    "[…]  a beautiful silk standard donated to the Third Battalion  by the colored ladies of the city of New York, was formally presented to the  battalion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(South Africa, sometimes capitalized) Belonging to a multiracial ethnic group or category, having ancestry from more than one of the racial groups of southern Africa (black, white, and Asian). (Under apartheid, used as a metadescription for mixed-race people and peoples such as the Cape Coloureds.)",
                  "examples": [
                    "Most of the colored community speaks Afrikaans, whereas languages like Xhosa or Venda are typically spoken by blacks and English is spoken mostly by whites."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly historical) Designated for use by colored people (in either the US or South African sense).",
                  "examples": [
                    "a colored drinking fountain",
                    "a colored hospital"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "colored (plural coloreds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling, US, now dated and offensive) A colored (nonwhite) person.",
                  "examples": [
                    "When a white fellow gets in the ring with an eight ball the eight ball's got no chance. You see, 'cause they call boxing the sweet science. And that's where your colored just runs into trouble. That's just that science part.Yeah, but Joe Louis is a big 'un."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "English Wikipedia has an article on:ColouredsWikipedia (South Africa) A colored person; a person descended from more than one of the racial groups of Southern Africa (black white, Asian, Austronesian).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(laundry) A colored article of clothing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "colored",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling) simple past tense and past participle of color",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}