{
  "word": "very",
  "etymologies": [
    {
      "description": [
        "From Middle English verray, verrai (“true”), from Old French verai (“true”) (modern French vrai), from early Medieval Latin vērāgus, from an alteration of Latin vērāx (“truthful”), from vērus (“true”), ultimately from Proto-Indo-European *weh₁- (“true, benevolent”). Cognate with Old English wǣr (“true, correct”), Dutch waar (“true”), German wahr (“true”), Icelandic alvöru (“earnest”). Displaced native Middle English sore, sār (“very”) (from Old English sār (“grievous, extreme”)) (Compare German sehr, Dutch zeer), Middle English wel (“very”) (from Old English wel (“well, very”)) (Compare German wohl, Dutch wel, Swedish väl), and Middle English swith (“quickly; very”) (from Old English swīþe (“very”)). More at warlock."
      ],
      "adjectives": [
        {
          "description": "very (not generally comparable, comparative verier, superlative veriest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) True, real, actual.",
                  "examples": [
                    "The fierce hatred of a very woman.",
                    "The very blood and bone of our grammar.",
                    "He tried his very best.",
                    "We're approaching the very end of the trip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The same; identical.",
                  "examples": [
                    "He proposed marriage in the same restaurant, at the very table where they first met.",
                    "That's the very tool that I need."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With limiting effect: mere.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "very (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To a great extent or degree.",
                  "examples": [
                    "Synonyms: greatly, drastically, extremely",
                    "That dress is very you.",
                    "Not very many (of them) had been damaged.",
                    "She's very like her mother.",
                    "‘Is she busy?’ ― ‘Not very.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Conforming to fact, reality or rule; true.",
                  "examples": [
                    "Synonyms: truly, actually, authentically"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with superlatives) Used to firmly establish that nothing else surpasses in some respect.",
                  "examples": [
                    "He was the very best runner there.",
                    "This is my very own treehouse."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}