{
  "word": "commonalty",
  "etymologies": [
    {
      "description": [
        "From Middle English communalte, comonalte, from Old French comunalté, comunauté (modern communauté), probably from an alteration of communité, from Latin commūnitās."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "commonalty (countable and uncountable, plural commonalties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The common people; the commonality.",
                  "examples": [
                    "Synonyms: see Thesaurus:commonalty"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of things having similar characteristics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A class composed of persons lacking clerical or noble rank; commoners.",
                  "examples": [
                    "The commonalty spoke of his mighty spear-thrust, of his deft sword-swing, the terror of his wrath, of the fury of his battle-lust, of his laughter and light joy, and the singing that was on his lips when his sword had the silence upon it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or quality of having things in common.",
                  "examples": [
                    "Or is there some way in which the product of that solitude—writing—may none the less be profoundly social, rejoining the commonalty of society, and through its indirections and specificities being the most authentic contribution the writer can offer?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shared feature.",
                  "examples": [
                    "Observant visitors to any prison will quickly recognize commonalties in its inmate population. Not only do shared traits exist among the inmate population of any particular institution (intra-prison commonalties) but commonalties also exist among inmates nationwide (inter-prison commonalties)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}