{
  "word": "submit",
  "etymologies": [
    {
      "description": [
        "From Middle English submitten, borrowed from Latin submittere, infinitive of submittō (“place under, yield”), from sub (“under, from below, up”) + mitto (“to send”). Compare upsend."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "submit (third-person singular simple present submits, present participle submitting, simple past and past participle submitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To yield or give way to another.",
                  "examples": [
                    "They will not submit to the destruction of their rights."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To yield (something) to another, as when defeated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To enter or put forward for approval, consideration, marking etc.",
                  "examples": [
                    "I submit these plans for your approval."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To subject; to put through a process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mixed martial arts, professional wrestling) To win a fight against (an opponent) by submission.",
                  "examples": [
                    "\"[Ronda] Rousey, a former U.S. Olympian in Judo, caps off a perfect year in which she submitted Liz Carmouche in the first-ever UFC female fight and coached opposite [Miesha] Tate in \"The Ultimate Fighter\" reality series.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To let down; to lower.",
                  "examples": [
                    "Sometimes the hill submits itself a while."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To put or place under.",
                  "examples": [
                    "The bristled throat / Of the submitted sacrifice with ruthless steel he cut."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}