{
  "word": "theme",
  "etymologies": [
    {
      "description": [
        "From Middle English teme, from Old French teme, tesme (French thème), from Latin thema, from Ancient Greek θέμα (théma), from τίθημι (títhēmi, “I put, place”), reduplicative from Proto-Indo-European *dʰeh₁- (“to put, place, do”) (whence also English do)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "theme (plural themes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A subject, now especially of a talk or an artistic piece; a topic.",
                  "examples": [
                    "\"Had not you once a beautiful daughter, named Mary?\" said the stranger.\"It is a heartrending question, man,\" said Andrew; \"but certes, I had once a beloved daughter named Mary.\"\"What became of her?\" asked the stranger.Andrew shook his head, turned round, and began to move away; it was a theme that his heart could not brook."
                  ]
                }
              ]
            },
            {
              "group": "A recurring idea; a motif.",
              "entries": [
                {
                  "meaning": "A concept with multiple instantiations.",
                  "examples": [
                    "variations on the theme of entrepreneurial resourcefulness"
                  ]
                },
                {
                  "meaning": "Any of various colors, or color palettes, in which a design is offered; (graphical user interface) any of various skins for an app, affecting the visuals and perhaps other elements such as sound effects.",
                  "examples": [
                    "switch to a dark theme to conserve battery power",
                    "Synonym: colorway"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) An essay written for school.",
                  "examples": [
                    "[…]  his themes and exercises were in constant demand for what we called cogging and American students rather grandly called plagiarization."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The main melody of a piece of music, especially one that is the source of variations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, television) A song, or a snippet of a song, that identifies a film, a TV program, a character, etc. by playing at the appropriate time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The stem of a word.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) thematic relation of a noun phrase to a verb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Theta role in generative grammar and government and binding theory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Topic, what is generally being talked about, as opposed to rheme.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A regional unit of organisation in the Byzantine empire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "theme (third-person singular simple present themes, present participle theming, simple past and past participle themed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give a theme to.",
                  "examples": [
                    "We themed the birthday party around superheroes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, transitive) To apply a theme to; to change the visual appearance and/or layout of (software).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}