{
  "word": "bamboo",
  "etymologies": [
    {
      "description": [
        "Borrowed from Dutch bamboe, from Portuguese bambu, from Malay bambu, from Kannada ಬಂಬು (bambu), variant form of ಬೇವು (bēvu). Cognate with Malayalam വേപ്പ് (vēppŭ), Telugu వేప (vēpa), from Proto-Dravidian *wēmpu (“neem”)."
      ],
      "adjectives": [
        {
          "description": "bamboo (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of the wood of the bamboo.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bamboo (countable and uncountable, plural bamboos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fast-growing grass of the Bambusoideae subfamily, characterised by its woody, hollow, round, straight, jointed stem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The wood of the bamboo plant as a material for building, furniture, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A stick, rod, pole, or cane of bamboo, especially one used for corporal punishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A didgeridoo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A member of the British military or British East India Company who spent so much time in Indonesia, India, or Malaysia that they never went back home.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bamboo (third-person singular simple present bamboos, present participle bambooing, simple past and past participle bambooed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To flog with a bamboo cane.",
                  "examples": [
                    "[…]  the beadle is punished by fine, and sometimes bambooed, if robberies are too frequent within his jurisdiction, or if he fails to secure the person of any malefactor particularly wanted by his superior officers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To paint (furniture, etc.) to give it the appearance of bamboo.",
                  "examples": [
                    "The craze for bambooing furniture and accessories was one of many popular paint techniques in the 18th century and early Victorian era."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India, slang) To penetrate sexually.",
                  "examples": [
                    "If you're just a girl from Lucknow, with no fluid cash, you'll be just one more among thousands going from producer to producer by auto-rickshaw, and every photographer who agrees to take a picture for your portfolio will want to introduce you to his bed upstairs in the loft. And what you'll get out of all this in the end is a lot of bambooing and maybe a dance or two in his videos."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}