{
  "word": "root",
  "etymologies": [
    {
      "description": [
        "From Middle English rote, root, roote (“the underground part of a plant”), from late Old English rōt, from Old Norse rót (Icelandic rót), from Proto-Germanic *wrōts, from Proto-Indo-European *wréh₂ds (“root”); cognate with wort, radish, and radix."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "root (countable and uncountable, plural roots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a plant, generally underground, that anchors and supports the plant body, absorbs and stores water and nutrients, and in some plants is able to perform vegetative reproduction.",
                  "examples": [
                    "Hyponym: taproot",
                    "This tree's roots can go as deep as twenty metres underground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A root vegetable.",
                  "examples": [
                    "[...] two fields which should have been sown with roots in the early summer were not sown because the ploughing had not been completed early enough."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a tooth extending into the bone holding the tooth in place.",
                  "examples": [
                    "Root damage is a common problem of overbrushing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a hair under the skin that holds the hair in place.",
                  "examples": [
                    "The root is the only part of the hair that is alive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a hair near the skin that has not been dyed, permed, or otherwise treated.",
                  "examples": [
                    "He dyed his hair black last month, so the grey roots can be seen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) The primary source; origin.",
                  "examples": [
                    "Synonyms: basis, origin, source",
                    "The love of money is the root of all evil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The section of a wing immediately adjacent to the fuselage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) The bottom of the thread of a threaded object.",
                  "examples": [
                    "Antonym: crest",
                    "The root diameter is the minor diameter of an external thread and the major diameter of an internal one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(arithmetic) Of a number or expression, a number which, when raised to a specified power, yields the specified number or expression.",
                  "examples": [
                    "Hyponyms: cube root, functional root, square root",
                    "The cube root of 27 is 3."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(arithmetic) A square root (understood if no power is specified; in which case, \"the root of\" is often abbreviated to \"root\").",
                  "examples": [
                    "Multiply by root 2."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematical analysis) A zero (of an equation).",
                  "examples": [
                    "Synonym: zero",
                    "Antonym: pole",
                    "Holonym: kernel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory, computing) The single node of a tree that has no parent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistic morphology) The primary lexical unit of a word, which carries the most significant aspects of semantic content and cannot be reduced into smaller constituents. Inflectional stems often derive from roots.",
                  "examples": [
                    "Coordinate term: stem"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A word from which another word or words are derived.",
                  "examples": [
                    "Synonym: etymon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The fundamental tone of any chord; the tone from whose harmonics, or overtones, a chord is composed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lowest place, position, or part.",
                  "examples": [
                    "the roots of the mountains"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) In UNIX terminology, the first user account with complete access to the operating system and its configuration, found at the root of the directory structure; the person who manages accounts on a UNIX system.",
                  "examples": [
                    "Synonyms: superuser, root account, root user",
                    "I have to log in as root before I do that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The highest directory of a directory structure which may contain both files and subdirectories.",
                  "examples": [
                    "I installed the files in the root directory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A penis, especially the base of a penis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "root (third-person singular simple present roots, present participle rooting, simple past and past participle rooted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To grow roots; to enter the earth, as roots; to take root and begin to grow.",
                  "examples": [
                    "The cuttings are starting to root."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To prepare, oversee, or otherwise cause the rooting of cuttings.",
                  "examples": [
                    "We rooted some cuttings last summer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be firmly fixed; to be established.",
                  "examples": [
                    "If any irregularity chanced to intervene and to cause misapprehensions, he gave them not leave to root and fasten by concealment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing slang, transitive) To get root or privileged access on a computer system or mobile phone, often through bypassing some security mechanism.",
                  "examples": [
                    "Synonym: (mobile phone) jailbreak",
                    "We rooted his box and planted a virus on it.",
                    "I want to root my Android phone so I can remove the preinstalled crapware."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English wrōten (“to dig with the snout”), from Old English wrōtan, from Proto-Germanic *wrōtaną (“to dig out, to root”). Related to Old English wrōt (“snout; trunk”). Loss of initial w- probably due to influence from the related noun (Etymology 1)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "root (plural roots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, vulgar, slang) An act of sexual intercourse.",
                  "examples": [
                    "Synonyms: (UK, US) screw, (UK) shag; see also Thesaurus:copulation",
                    "Fancy a root?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, vulgar, slang) A sexual partner.",
                  "examples": [
                    "Synonym: (US) screw"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "root (third-person singular simple present roots, present participle rooting, simple past and past participle rooted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To turn up or dig with the snout.",
                  "examples": [
                    "A pig roots the earth for truffles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) To seek favour or advancement by low arts or grovelling servility; to fawn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rummage; to search as if by digging in soil.",
                  "examples": [
                    "Synonyms: dig out, root out, rummage",
                    "rooting about in a junk-filled drawer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a baby: to turn the head and open the mouth in search of food.",
                  "examples": [
                    "When your baby is rooting, his head will turn to the side and he will open and close his mouth. If you put your finger in your baby's hand, she has a grasping reflex that makes her curl her fingers around yours and hold on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To root out; to abolish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, Ireland, vulgar, slang) To sexually penetrate.",
                  "examples": [
                    "Synonyms: screw, bang, (US) drill, (British) shag; see also Thesaurus:copulate with"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly an alteration of rout (“to make a loud noise”), influenced by hoot."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "root (third-person singular simple present roots, present participle rooting, simple past and past participle rooted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with \"for\" or \"on\", US) To cheer (on); to show support (for) and hope for the success of. (See root for.) [late 19th century]",
                  "examples": [
                    "Synonyms: (Australia, New Zealand) barrack, cheer on"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}