{
  "word": "aulic",
  "etymologies": [
    {
      "description": [
        "Latin aulicus (“of a prince's court”), from aula (“royal court”), from Ancient Greek αὐλή (aulḗ, “courtyard”)."
      ],
      "adjectives": [
        {
          "description": "aulic (comparative more aulic, superlative most aulic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to a royal court; courtly.",
                  "examples": [
                    "Never can there be safety, or indeed peace, in the nations you have redeemed from bondage, while a neighbour is apprehensive of the principles you have laid down, and can hold out ecclesiastical wealth and aulic dignities, to unreflecting avarice and unenlightened ambition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) Of, pertaining to, or resembling a palace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Solemn.",
                  "examples": [
                    "Otherwise, Giacomino's most aulic and rhetorically ambitious piece is a lament for the death of the beloved, Morte, perché m'hai fatta sì gran guerra (Death, Why Have You Warred Against Me So), the oldest Italian example of its kind, together with Pier della Vigne's \"Amando con fin core e con speranza.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "aulic (plural aulics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ceremony at some European universities to confer a Doctor of Divinity degree.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Ancient Greek αὐλός (aulós, “hollow tube, pipe”)."
      ],
      "adjectives": [
        {
          "description": "aulic (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Pertaining to the reproductive ducts of certain organisms.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}