{
  "word": "miracle",
  "etymologies": [
    {
      "description": [
        "From Middle English miracle, from Old French miracle, from Latin mīrāculum (“object of wonder”), from mīror (“to wonder at”), from mīrus (“wonderful”), from Proto-Indo-European *(s)meyh₂- (“to smile, to be astonished”). Doublet of milagro. Partially displaced native wonder, from Old English wundor (“miracle, wonder”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "miracle (plural miracles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An event that appears inexplicable by the laws of nature and so is held to be supernatural in origin.",
                  "examples": [
                    "Many religious beliefs are based on miracles.",
                    "An example of a miracle associated with Muhammad is the splitting of the moon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fortunate outcome that prevails despite overwhelming odds against it.",
                  "examples": [
                    "Secondly, it was a miracle that a document hammered out with such difficulty, satisfying very few of its authors completely and satisfying some of them very little, would turn out to be the most successful political invention in history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An awesome and exceptional example of something",
                  "examples": [
                    "The home of our kings, over which you tread as you pace the immense hall known as the Salle des Pas-Perdus, was a miracle of architecture."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "miracle (third-person singular simple present miracles, present participle miracling, simple past and past participle miracled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To affect by a miracle; to work a miracle upon.",
                  "examples": [
                    "When a patient declares that he has been \"miracled,\" the other pilgrims are apt to rush to him (or her) and ask details; this is not permitted; the miracled invalid is borne or carted away to the Bureau of Medical Certification  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}