{
  "word": "dresser",
  "etymologies": [
    {
      "description": [
        "From Middle English dressure, dressor, dressour, a borrowing from Old French drecëur, drecëure, from the verb dresser."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dresser (plural dressers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An item of kitchen furniture, like a cabinet with shelves, for storing crockery or utensils.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An item of bedroom furniture, like a low chest of drawers, often with a mirror.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English dresser, equivalent to dress +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dresser (plural dressers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who dresses in a particular way.",
                  "examples": [
                    "He's a very snappy dresser."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater, film, television) A wardrobe assistant (who helps actors put on their costume).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A servant to royalty etc. who helps them with tasks such as dressing.",
                  "examples": [
                    "The former royal butler Guy Hunting recalls the uphill task faced by the Princess's dresser, Isobel Mathieson, each morning. 'During her many years with Princess Margaret, the biggest challenge Isobel faced each day was separating the royal body from its bed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A surgeon's assistant who helps to dress wounds etc.",
                  "examples": [
                    "On the very day that I had come to this conclusion, I was standing at the Criterion Bar, when someone tapped me on the shoulder, and turning round I recognized young Stamford, who had been a dresser under me at Bart's."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A football hooligan who wears designer clothing; a casual.",
                  "examples": [
                    "Because we were the first by a long way to turn trendy, we're still the only dressers in Scotland and our enemies were easily recognised: denims and DM's, skinheads and parkas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanical device used in grain mills for bolting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A table or bench on which meat and other things are dressed, or prepared for use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A kind of pick for shaping large coal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who dresses or prepares stone.",
                  "examples": [
                    "At the dressing sheds the slate-dresser saws the blocks into various sizes and then splits the smaller units into sheets."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}