{
  "word": "panel",
  "etymologies": [
    {
      "description": [
        "From Middle English panel (“piece of cloth, saddle pad, pane of glass, piece of ice, part, division, jury list, jury members”), from Anglo-Norman panel, panelle (“piece of cloth, saddle cushion”), from Vulgar Latin *pannellus, diminutive of Latin pannus (“cloth, rag, garment”). Cognate with Old English fana (“a piece of cloth, patch, banner, flag, vane”). Doublet of vane."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "panel (plural panels)",
          "definitionGroups": [
            {
              "group": "A (usually) rectangular section of a surface, or of a covering or of a wall, fence etc.",
              "entries": [
                {
                  "meaning": "(architecture) A sunken compartment with raised margins, moulded or otherwise, as in ceilings, wainscotings, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people gathered to judge, interview, discuss etc. as on a television or radio broadcast for example.",
                  "examples": [
                    "Today’s panel includes John Smith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A portion of text or other material within a book, newspaper, web page, etc. set apart from the main body or separated by a border.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comics) An individual frame or drawing in a comic.",
                  "examples": [
                    "The last panel of a comic strip usually contains a punchline."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graphical user interface) A type of GUI widget, such as a control panel.",
                  "examples": [
                    "admin panel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A document containing the names of persons summoned as jurors by the sheriff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The whole jury.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, Scotland) A prisoner arraigned for trial at the bar of a criminal court.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A piece of cloth serving as a saddle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A soft pad beneath a saddletree to prevent chafing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(joinery) A board having its edges inserted in the groove of a surrounding frame.",
                  "examples": [
                    "the panel of a door"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(masonry) One of the faces of a hewn stone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(masonry) A slab or plank of wood used instead of a canvas for painting on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A heap of dressed ore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) One of the districts divided by pillars of extra size, into which a mine is laid off in one system of extracting coal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dressmaking) A plain strip or band, as of velvet or plush, placed at intervals lengthwise on the skirt of a dress, for ornament.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A portion of a framed structure between adjacent posts or struts, as in a bridge truss.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, historical) A list of doctors who could provide limited free healthcare prior to the introduction of the NHS.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A group of tests or assays, a battery.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "panel (third-person singular simple present panels, present participle panelling or (US) paneling, simple past and past participle panelled or (US) paneled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To enter (jury members) on an official list of jurors; to empanel. [16th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To fit (an animal, especially a mule or ass) with a panel or simple padded saddle. [16th–19th c.]",
                  "examples": [
                    "The knight  […]  arose, and commanded Sancho to saddle his horse and pannel his ass immediately."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fit (a room etc.) with panels. [from 17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}