{
  "word": "parrot",
  "etymologies": [
    {
      "description": [
        "First attested in 1525. From Middle French perrot, either a diminutive of Pierre or a shortened form of perroquet (whence also parakeet). Compare French pierrot and Occitan parrat. A number of origins have been suggested for perroquet, such as Spanish periquito and Italian parrocchetto. The relationship between these various words is disputed. Replaced earlier popinjay."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parrot (plural parrots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of bird, many species of which are colorful and able to mimic human speech, of the order Psittaciformes or (narrowly) of the family Psittacidae.",
                  "examples": [
                    "Synonyms: (bird of the order Psittaciformes) psittacine, popinjay",
                    "I bought a wonderful parrot at the pet store."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A parroter; a person who repeats the words or ideas of others.",
                  "examples": [
                    "Synonyms: copycat, mimic",
                    "What kind of a parrot are you? He just said that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A puffin.",
                  "examples": [
                    "Synonyms: sea-parrot, tomnoddy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology, obsolete) channel coal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, slang) A transponder.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "parrot (third-person singular simple present parrots, present participle parroting, simple past and past participle parroted or parrotted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To repeat (exactly what has just been said) without necessarily showing understanding, in the manner of a parrot.",
                  "examples": [
                    "The interviewee merely parroted the views of her tabloid."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}