{
  "word": "stampede",
  "etymologies": [
    {
      "description": [
        "From Mexican Spanish estampida (“a stampede”), estampido (“a crackling”), akin to estampar (“to stamp”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stampede (plural stampedes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wild, headlong scamper, or running away, of a number of animals; usually caused by fright; hence, any sudden flight or dispersion, as of a crowd or an army in consequence of a panic.",
                  "examples": [
                    "Synonyms: rush, flight, crush, jam, trampling"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A situation in which many people in a crowd are trying to go in the same direction at the same time.",
                  "examples": [
                    "Synonym: rush",
                    "The annual Muslim Hajj in Mecca, Saudi Arabia, which is attended by millions of pilgrims, has increasingly suffered from stampedes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any sudden unconcerted moving or acting together of a number of persons, as from some common impulse.",
                  "examples": [
                    "a stampede toward US bonds in the credit markets"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stampede (third-person singular simple present stampedes, present participle stampeding, simple past and past participle stampeded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To run away in a panic; said of cattle, horses, etc., also of armies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disperse by causing sudden fright, as a herd or drove of animals.",
                  "examples": [
                    "Cattle are usually quiet after dark. Still I've known even a coyote to stampede your white herd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of people) To move rapidly in a mass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}