{
  "word": "argufy",
  "etymologies": [
    {
      "description": [
        "argue +‎ -fy"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "argufy (third-person singular simple present argufies, present participle argufying, simple past and past participle argufied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial, regional) To argue without any aim; to dispute; to disagree.",
                  "examples": [
                    "Synonym: wrangle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial, regional) To dispute (a point, fact, etc.), to argue about (something).",
                  "examples": [
                    "“Why then you are his mistress, and a kept lady to all intents and purposes; so what signifies argufying the matter;  […] ”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, colloquial, archaic) To reason (something) out, to fully consider, think through.",
                  "examples": [
                    "[…]  this Lubberly Whelp here says I talk like a Fool; and sure I have not used the Sea this Thirty Years, but I can Argufie any thing as proper as he can."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial, archaic) To persuade (someone) through argument.",
                  "examples": [
                    "She was thinkin I might find things turned around and changed about so till I wouldn’t hardly know the country, but still she wouldn’t argufy me out of makin the trip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial, archaic) To weary (someone) with arguing.",
                  "examples": [
                    "“Lord, how glad I’ll be to git rid o’ him!” Peters said in an undertone to Hite. “He hev mighty nigh argufied me ter death,—’bout sperits, an’ witches, an’ salvation, an’ law, an’ craps, an’ horse-flesh, an’ weather signs.  […] ”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial, archaic) To be evidence of (something).",
                  "examples": [
                    "[…]  she no sooner set eyes on him than she sent me out; which argufy’d no good, you'll say;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial, archaic) To be of importance or relevance; to make a difference, to be of use.",
                  "examples": [
                    "Well, now who wins?—why, still the same—",
                    "For Sal has lost another game.",
                    "“I’ve done, (she mutter’d;) I was saying,",
                    "“It did not argufy my playing.",
                    "“Some folks will win, they cannot chuse,",
                    "“But think or not think—some must lose."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}