{
  "word": "blazon",
  "etymologies": [
    {
      "description": [
        "From Middle English blason, blasoun (“shield”), from Old French blason (“shield”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blazon (countable and uncountable, plural blazons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A verbal or written description of a coat of arms.",
                  "examples": [
                    "...it should never be forgotten that the best blazon is that which is the most perspicuous"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A formalized language for describing a coat of arms.",
                  "examples": [
                    "We must banish, therefore, the persistent but wholly erroneous notion that the heralds invented many of the terms used in blazon and borrowed the rest from the everyday lexicon of terms..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A coat of arms or a banner depicting a coat of arms.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ostentatious display, verbal or otherwise; publication; description; record.",
                  "examples": [
                    "Obtrude the blazon of their exploits upon the company."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blazon (third-person singular simple present blazons, present participle blazoning, simple past and past participle blazoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To describe a coat of arms.",
                  "examples": [
                    "the following coat of arms, which I will send you in the original language, not being herald enough to blazon it in English"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make widely or generally known, to proclaim.",
                  "examples": [
                    "There pride sits blazoned on th' unmeaning brow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To display conspicuously or publicly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shine; to be conspicuous.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deck; to embellish; to adorn.",
                  "examples": [
                    "She blazons in dread smiles her hideous form."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}