{
  "word": "flan",
  "etymologies": [
    {
      "description": [
        "Borrowed around 1846 from French flan (“cheesecake, custard tart, flan”), or in some uses (in reference to Spanish/Latin American flans) later from Spanish flan (itself from the French), both from Old French flaon (whence also Middle English flaon, flaun (“pie; cake”)), from Late Latin fladō (“flat cake”), from Frankish *flaþō (“flat cake”), from Proto-Indo-European *pleth₂- (“broad, flat”); compare German Fladen. Akin to Old High German flado (“flat cake, offering cake”). Doublet of flathe.",
        "Although the -n is generally believed to derive from the Late Latin accusative form (fladonem) of fladō (“flat cake”), it might alternatively derive from an inflected form of the Frankish word (such as the Frankish accusative *flaþan, or the like). For a similar case, see garden."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flan (plural flans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Australia) Baked tart with sweet or savoury filling in an open-topped pastry case. (Compare quiche.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, Belize) A dessert of congealed custard, often topped with caramel, especially popular in Spanish-speaking countries.",
                  "examples": [
                    "Synonym: crème caramel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(numismatics) A coin die. (Compare planchet.)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "flan (third-person singular simple present flans, present participle flanning, simple past and past participle flanned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) To splay or bevel internally, as a window-pane.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "English, from a slip of the tongue by actor Nathan Fillion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flan (plural flans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, fandom slang) A fan of the U.S. TV series Firefly.",
                  "examples": [
                    "Synonym: Browncoat"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}