{
  "word": "person",
  "etymologies": [
    {
      "description": [
        "From Middle English persoun, personne et al., from Anglo-Norman parsone, persoun et al. (Old French persone (“human being”), French personne), and its source Latin persōna (“mask used by actor; role, part, character”), perhaps a loanword from Etruscan 𐌘𐌄𐌓𐌔𐌖 (φersu, “mask”). In this sense, displaced native man, which came to mean primarily \"adult male\" in Middle English; see Old English mann. Doublet of parson and persona."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "person (plural persons or (by suppletion) people)",
          "definitionGroups": [
            {
              "group": "An individual substance of a rational nature; usually a human being. [from 13th c.]",
              "entries": [
                {
                  "meaning": "A character or part, as in a play; a specific kind or manifestation of individual character, whether in real life, or in literary or dramatic representation; an assumed character.",
                  "examples": [
                    "How different  […] is the same man from himself, as he sustains the person of a magistrate, and  […] that of a friend!"
                  ]
                },
                {
                  "meaning": "(Christianity) Any one of the three hypostases of the Holy Trinity: the Father, Son, or Holy Spirit.",
                  "examples": [
                    "three persons and one God"
                  ]
                },
                {
                  "meaning": "Any sentient or socially intelligent being.",
                  "examples": []
                },
                {
                  "meaning": "(in a compound noun or noun phrase) Someone who likes or has an affinity for (a specified thing). [from 20th c.]",
                  "examples": [
                    "Jack's always been a dog person, but I prefer cats."
                  ]
                },
                {
                  "meaning": "(in a compound noun or noun phrase) A human of unspecified gender (in terms usually constructed with man or woman).",
                  "examples": []
                },
                {
                  "meaning": "(in a compound noun or noun phrase) A worker in a specified function or specialty.",
                  "examples": [
                    "I was able to speak to a technical support person and get the problem solved."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The physical body of a being seen as distinct from the mind, character, etc. [from 14th c.]",
                  "examples": [
                    "At first blush it seemed that what was striking about him rested on the fact that his dress was exotic, his person foreign."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Any individual or formal organization with standing before the courts. [from 14th c.]",
                  "examples": [
                    "At common law a corporation or a trust is legally a person."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, euphemistic) The human genitalia; specifically, the penis.",
                  "examples": [
                    "[E]very Person wilfully, openly, lewdly, and obscenely exposing his Person in any Street, Road, or public Highway, or in the View thereof, or in any Place of public Resort, with Intent to insult any Female ... and being subsequently convicted of the Offence for which he or she shall have been so apprehended, shall be deemed a Rogue and Vagabond, within the true Intent and Meaning of this Act ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A linguistic category used to distinguish between the speaker of an utterance and those to whom or about whom they are speaking. See grammatical person. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A shoot or bud of a plant; a polyp or zooid of the compound Hydrozoa, Anthozoa, etc.; also, an individual, in the narrowest sense, among the higher animals[19th century].",
                  "examples": [
                    "True corms, composed of united personae  […]  usually arise by gemmation,  […]  yet in sponges and corals occasionally by fusion of several originally distinct persons."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "person (third-person singular simple present persons, present participle personing, simple past and past participle personed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To represent as a person; to personify; to impersonate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, gender-neutral) To man, to supply with staff or crew.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}