{
  "word": "gouge",
  "etymologies": [
    {
      "description": [
        "From Middle English gouge (“chisel with concave blade; gouge”), from Old French gouge, goi (“gouge”), from Late Latin goia, gubia, gulbia (“chisel; piercer”), borrowed from Gaulish *gulbiā, from Proto-Celtic *gulbā, *gulbi, *gulbīnos (“beak, bill”). The English word is cognate with Italian gorbia, gubbia (“ferrule”), Old Breton golb, Old Irish gulba (“beak”), Portuguese goiva, Scottish Gaelic gilb (“chisel”), Spanish gubia (“chisel, gouge”), Welsh gylf (“beak; pointed instrument”), gylyf (“sickle”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gouge (countable and uncountable, plural gouges)",
          "definitionGroups": [
            {
              "group": "Senses relating to cutting tools.",
              "entries": [
                {
                  "meaning": "A chisel with a curved blade for cutting or scooping channels, grooves, or holes in wood, stone, etc.",
                  "examples": []
                },
                {
                  "meaning": "A bookbinder's tool with a curved face, used for blind tooling or gilding.",
                  "examples": []
                },
                {
                  "meaning": "An incising tool that cuts blanks or forms for envelopes, gloves, etc., from leather, paper, or other materials.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cut or groove, as left by a gouge or something sharp.",
                  "examples": [
                    "The nail left a deep gouge in the tire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally US, colloquial) An act of gouging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A cheat, a fraud; an imposition.",
                  "examples": [
                    "Synonym: swindle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An impostor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) Soft material lying between the wall of a vein and the solid vein of ore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, slang, uncountable) Information.",
                  "examples": [
                    "As all naval aviators have learned at one time or another in their careers, “There's plenty of bad gouge out there,\" and it has, does, and will get the unwary fliers in trouble."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gouge (third-person singular simple present gouges, present participle gouging, simple past and past participle gouged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a groove, hole, or mark in by scooping with or as if with a gouge.",
                  "examples": [
                    "Synonyms: engrave, grave, incise",
                    "Japanese and Chinese printers used to gouge characters in wood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cheat or impose upon; in particular, to charge an unfairly or unreasonably high price.",
                  "examples": [
                    "Synonyms: defraud, swindle",
                    "The company has no competition, so it tends to gouge its customers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To dig or scoop (something) out with or as if with a gouge; in particular, to use a thumb to push or try to push the eye (of a person) out of its socket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use a gouge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}