{
  "word": "clue",
  "etymologies": [
    {
      "description": [
        "Variant of clew (“a ball of thread or yarn”), from Middle English clewe, from Old English clīewen (“ball”), from Proto-West Germanic *kliuwīn, from Proto-Germanic *kliuwīną, *klewô (“ball, bale”), from Proto-Indo-European *glew- (“to amass, conglomerate; clump, ball, bale”). Sense evolution with reference to the one which the mythical Theseus used to guide him out of the Minotaur's labyrinth. More at clew."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clue (plural clues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A strand of yarn etc. as used to guide one through a labyrinth; something which points the way, a guide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Information which may lead one to a certain point or conclusion.",
                  "examples": [
                    "Give me a clue because the question is too vague."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object or a kind of indication which may be used as evidence.",
                  "examples": [
                    "The detectives were looking for some clues at the scene of the crime."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Insight or understanding (\"to have a clue [about]\" or \"to have clue\". See have a clue, clue stick)",
                  "examples": [
                    "I had little clue that I was being carefully monitored by the CCTV."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clue (third-person singular simple present clues, present participle cluing or clueing, simple past and past participle clued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To provide with a clue.",
                  "examples": [
                    "The crossword compiler wasn't sure how to clue the word \"should\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To provide someone with information which he or she lacks (often used with \"in\" or \"up\").",
                  "examples": [
                    "Smith, clue Jones in on what's been happening.",
                    "You need to clue me what to do, I have no idea."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}