{
  "word": "romantic",
  "etymologies": [
    {
      "description": [
        "From romant +‎ -ic, or borrowed from Late Latin romanticus (“(of a poem) having qualities of a romance”). Compare French romantique, which is borrowed from English. Also compare Spanish romántico, Portuguese romântico, Italian romantico, Dutch romantisch, and German romantisch and Romantiker (“a composer of Romantic music”), all of which are borrowed from English or French."
      ],
      "adjectives": [
        {
          "description": "romantic (comparative more romantic, superlative most romantic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly historical) Of a work of literature, a writer etc.: being like or having the characteristics of a romance, or poetic tale of a mythic or quasi-historical time; fantastic. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Fictitious, imaginary. [17th–20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fantastic, unrealistic (of an idea etc.); fanciful, sentimental, impractical (of a person). [from 17th c.]",
                  "examples": [
                    "R. Jeeves: In my experience, ladies who spell Gladys with a W are seldom noted for their reliability, sir. It gives them romantic notions.B.W. Wooster: With a W, Jeeves? No, no, no, no. You spell it with a G.R. Jeeves: If I might draw your attention to the signature on the portrait, sir.B.W. Wooster: Good Lord! G-W?R. Jeeves: I blame Alfred Lord Tennyson and his Idylls of the King. It also accounts for Kathryn, Ysabel, and Ethyl, all spelt with a Y, but Gwladys is a particularly virulent form, sir."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the qualities of romance (in the sense of something appealing deeply to the imagination); invoking on a powerfully sentimental idea of life; evocative, atmospheric. [from 17th c.]",
                  "examples": [
                    "Somehow she wasn't a real sister, but that only made her the more romantic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to an idealised form of love (originally, as might be felt by the heroes of a romance); conducive to romance; loving, affectionate. [from 18th c.]",
                  "examples": [
                    "Antonyms: platonic, nonsexual",
                    "Their kiss started casually, but it slowly turned romantic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of Romantic [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Experiencing romantic attraction. [from 21st c.]",
                  "examples": [
                    "Synonyms: allo (informal), alloromantic",
                    "Antonym: aromantic"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "romantic (plural romantics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person with romantic character (a character like those of the knights in a mythic romance).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is behaving romantically (in a manner befitting someone who feels an idealized form of love).",
                  "examples": [
                    "Oh, flowers! You're such a romantic."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}