{
  "word": "grasshopper",
  "etymologies": [
    {
      "description": [
        "From Middle English grashoppere, alteration of earlier grashoppe, from Old English græshoppa (“grasshopper”). Equivalent to grass +‎ hopper.",
        "Cognate with Saterland Frisian Gäärshupper, Dutch grashupper, grashipper, German Low German Grashüpper, Gresshüpper, German Grashüpfer, Danish græshoppe, Swedish gräshoppa, Norwegian gresshoppe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grasshopper (plural grasshoppers)",
          "definitionGroups": [
            {
              "group": "A mostly herbivorous insect of the order Orthoptera, noted for its ability to jump long distances and for the habit of some species communicating by stridulation; they are related to but distinct from crickets.",
              "entries": [
                {
                  "meaning": "In the strict sense, refers to insects in the suborder Caelifera, particularly those in the family Acrididae.",
                  "examples": []
                },
                {
                  "meaning": "In a looser sense, also includes the katydids (also known as longhorned grasshoppers or bush crickets), which are members of the family Tettigoniidae, of the suborder Ensifera.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cocktail made with crème de menthe and optionally with crème de cacao.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A young student in initial stages of training who has been chosen on account of their obvious talent.",
                  "examples": [
                    "Although we don't know exactly why Li is chosen to dance, we witness a man assuring officials that the child isn't from bourgeois stock. Phew. There are no known landowners in the family, so the grasshopper passes some cultural purity test, in a state often fixated on class warfare, driven by the cult of personality, and bullied by paranoia."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) In ordinary square or upright pianos of London make, the escapement lever or jack, so made that it can be taken out and replaced with the key.",
                  "examples": [
                    "Synonym: hopper"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}