{
  "word": "swan",
  "etymologies": [
    {
      "description": [
        "From Middle English swan, from Old English swan, from Proto-West Germanic *swan, from Proto-Germanic *swanaz (“swan”, literally “the singing bird”), from Proto-Indo-European *swonh₂-/*swenh₂- (“to sing, make sound”).",
        "Cognate with West Frisian swan, Low German Swaan, swan, Dutch zwaan, German Schwan, Danish svane, Norwegian svane, Swedish svan. Related also to Old English ġeswin (“melody, song”), Old English swinsian (“to make melody”).",
        "Further cognates include (possibly) Russian звон (zvon, “ring, chime”); Latin sonus (“sound”), Sanskrit svan- (“sound”). \nDoublet of sound."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swan (plural swans or swan)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various species of large, long-necked waterfowl, of genus Cygnus (bird family: Anatidae), most of which have white plumage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) One whose grace etc. suggests a swan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) This bird used as a heraldic charge, sometimes with a crown around its neck (e. g. the arms of Buckinghamshire).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swan (third-person singular simple present swans, present participle swanning, simple past and past participle swanned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel or move about in an aimless, idle, or pretentiously casual way.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from dialectal I s’wan, a corruption of I shall warrant; or possibly from a minced form of I swear on."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "swan (third-person singular simple present swans, present participle swanning, simple past and past participle swanned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialectal or colloquial) To declare (chiefly in first-person present constructions).",
                  "examples": [
                    "\"Well, I swan, man, I had a better opinion of you than that.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}