{
  "word": "limn",
  "etymologies": [
    {
      "description": [
        "From Middle English limnen, limyne, lymm, lymn, lymne (“to illuminate (a manuscript)”), a variant of luminen (“to illuminate (a manuscript)”), short form of enluminen (“to shed light on, illuminate; to enlighten; to make bright or clear; to give colour to; to illuminate (a manuscript); to depict, describe; to adorn or embellish with figures of speech or poetry; to make famous, glorious, or illustrious”), from Old French enluminer (“to brighten, light up; to give colour to; to illuminate (a manuscript)”), from Latin illūminō (“to brighten, light up; to adorn; to make conspicuous”), from il- (a variant of in- (prefix meaning ‘in, inside’)) + lūminō (“to brighten, illuminate; to reveal”) (from lūmen (“light; (poetic) brightness”) (from Proto-Indo-European *lewk- (“bright; to shine; to see”)) + -ō (suffix forming regular first-conjugation verbs))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "limn (third-person singular simple present limns, present participle limning, simple past and past participle limned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figuratively) To draw or paint; to delineate.",
                  "examples": [
                    "Synonym: depict"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To illuminate, as a manuscript; to decorate with gold or some other bright colour.",
                  "examples": [
                    "Synonym: (to illuminate (a manuscript)) enlimn"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}