{
  "word": "machine",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French machine, from Latin māchina (“a machine, engine, contrivance, device, stratagem, trick”), from Doric Greek μᾱχᾰνᾱ́ (mākhanā́), cognate with Attic Greek μηχᾰνή (mēkhanḗ, “a machine, engine, contrivance, device”), from which comes mechanical.",
        "Displaced native Old English searu."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "machine (plural machines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device that directs and controls energy, often in the form of movement or electricity, to produce a certain effect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A vehicle operated mechanically, such as an automobile or an airplane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telephony, abbreviation) An answering machine or, by extension, voice mail.",
                  "examples": [
                    "I called you earlier, but all I got was the machine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A computer.",
                  "examples": [
                    "Game developers assume they're pushing the limits of the machine.",
                    "He refuses to turn off his Linux machine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A person or organisation that seemingly acts like a machine, being particularly efficient, single-minded, or unemotional.",
                  "examples": [
                    "Bruce Campbell was a \"demon-killing machine\" because he made quick work of killing demons.",
                    "The government has become a money-making machine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Especially, the group that controls a political or similar organization; a combination of persons acting together for a common purpose, with the agencies which they use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetry) Supernatural agency in a poem, or a superhuman being introduced to perform some exploit.",
                  "examples": [
                    "I am apt to think, that the changing of the Trojan fleet into water-nymphs, which is the most violent machine in the whole Æneid […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, chiefly US) The system of special interest groups that supports a political party, especially in urban areas.",
                  "examples": [
                    "A machine politician cannot see why the straight ticket (as be and his clique of party bosses prepare it) should not be voted by every citizen belonging to that party."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, obsolete) Penis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A contrivance in the Ancient Greek theatre for indicating a change of scene, by means of which a god might cross the stage or deliver a divine message; the deus ex machina.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A bathing machine.",
                  "examples": [
                    "One Machine only was provided for Bathers, the Limitted smoothness of the sands not extending widely enough to admit another."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "machine (third-person singular simple present machines, present participle machining, simple past and past participle machined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make by machinery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shape or finish by machinery; (usually, more specifically) to shape subtractively by metal-cutting with machine-controlled toolpaths.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}