{
  "word": "unfitted",
  "etymologies": [
    {
      "description": [
        "From un- +‎ fitted."
      ],
      "adjectives": [
        {
          "description": "unfitted (comparative more unfitted, superlative most unfitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not suited, not fit (for something).",
                  "examples": [
                    "[…]  let us suppose a small number of persons settled in some sequestered part of the earth, unconnected with the rest  […] . In this state of natural liberty, society will be their first thought. A thousand motives will excite them thereto, the strength of one man is so unequal to his wants, and his mind so unfitted for perpetual solitude, that he is soon obliged to seek assistance and relief of another, who in his turn requires the same."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a garment, not comparable) Not customized, tailored or cut to fit.",
                  "examples": [
                    "As popularized by Jackie Kennedy, the little nothing, its partisans explain, also aims for the look of unostentatious but expensive elegance that goes beyond mere chic. Most little nothings today are essentially grown-up versions of sleeveless, high-necklined junior dresses, unfitted, but figure-suggesting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, dated, not comparable) Of trains, or wagons in the train, not having a through brake pipe, or brakes on the wagons that can be operated from the locomotive (the wagons did have handbrakes however).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "unfitted",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense and past participle of unfit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}