{
  "word": "vestibule",
  "etymologies": [
    {
      "description": [
        "Early 17th century, borrowed from French vestibule (“entrance court”), from Latin vestibulum (“forecourt, entrance court; entrance”), from vestiō (“to dress, clothe, vest”) +‎ -bulum (“place, location”, nominal suffix). Doublet of vestibulum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vestibule (plural vestibules)",
          "definitionGroups": [
            {
              "group": "(architecture) A small entrance hall, antechamber, passage, or room between the outer door and the main hall, lobby, or interior of a building. [from the 17th c.]",
              "entries": [
                {
                  "meaning": "(architecture) A large entrance hall in a temple or palace.",
                  "examples": []
                },
                {
                  "meaning": "(rail transport) An enclosed entrance at the end of a railway passenger car.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(anatomy) Any of a number of body cavities or channels, serving as or resembling an entrance to another bodily space. [from the 18th c.]",
              "entries": [
                {
                  "meaning": "The central cavity of the bony labyrinth of the inner ear or the parts (such as the saccule and utricle) of the membranous labyrinth that it contains.",
                  "examples": []
                },
                {
                  "meaning": "The part of the left ventricle below the aortic orifice.",
                  "examples": []
                },
                {
                  "meaning": "The part of the mouth outside the teeth and gums.",
                  "examples": []
                },
                {
                  "meaning": "Clipping of vulval vestibule: the space in the vulva between the labia minora and into which both the urethra and vagina open.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vestibule (third-person singular simple present vestibules, present participle vestibuling, simple past and past participle vestibuled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with a vestibule or vestibules.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}