{
  "word": "trim",
  "etymologies": [
    {
      "description": [
        "From Middle English trimen, trymen, trümen, from Old English trymman (“to make firm; strengthen”), from Proto-Germanic *trumjaną (“to make fast; strengthen”), from Proto-Germanic *trumaz (“firm; strong; sound”)."
      ],
      "adjectives": [
        {
          "description": "trim (comparative trimmer, superlative trimmest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Physically fit.",
                  "examples": [
                    "He goes jogging every day to keep in trim."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Slender, lean.",
                  "examples": [
                    "a trim figure"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Neat or smart in appearance.",
                  "examples": [
                    "a trim lawn"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "trim (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) In good order; properly managed or maintained.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) With sails well trimmed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "trim (countable and uncountable, plural trims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Decoration; especially, decoration placed along edges or borders.",
                  "examples": [
                    "Paint the house white with blue trim."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A haircut, especially a moderate one to touch up an existing style.",
                  "examples": [
                    "I went to the hairdresser for a trim but came back nearly bald."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dress; gear; ornaments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The manner in which something is equipped or adorned; order; disposition.",
                  "examples": [
                    "The car comes in three different trims.",
                    "to be in good trim"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, aviation, of an aircraft) The state of adjustment of control surfaces such that the desired attitude can be maintained without requiring the continuous application of force to the cockpit controls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, aviation, by extension) The mechanism(s) used to trim an aircraft in roll, pitch, and/or yaw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, mildly vulgar) Sexual intercourse.",
                  "examples": [
                    "\"Take me somewhere.\"",
                    "His response lacked dignity, but in fairness to him I admit that I had left him little chance to be suave.",
                    "He asked, \"You mean, you’re going to give me some trim?\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The fore-and-aft angle of the vessel to the water, with reference to the cargo and ballast; the manner in which a vessel floats on the water, whether on an even keel or down by the head or stern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The arrangement of the sails with reference to the wind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trim (third-person singular simple present trims, present participle trimming, simple past and past participle trimmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce slightly; to cut; especially, to remove excess.",
                  "examples": [
                    "He trimmed his beard before the interview.",
                    "The hedge needs to be trimmed.",
                    "Place the screen material in the frame, secure it in place, and trim the edges.",
                    "The company trimmed jobs for the second time this year.",
                    "A ranch steak is usually trimmed of all excess fat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To decorate or adorn; especially of a Christmas tree.",
                  "examples": [
                    "They traditionally trim the tree on Christmas Eve."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, aviation, of an aircraft) To adjust the positions of control surfaces, sometimes using trim tabs, so as to modify or eliminate the aircraft's tendency to pitch, roll, or yaw when the cockpit controls are released.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical, of a vessel) To modify the angle relative to the water by shifting cargo or ballast; to adjust for sailing; to assume, or cause to assume a certain position, or trim, in the water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical, of a vessel's sails) To modify the angle (of the sails) relative to the wind, especially to set them at the most advantageous angle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To balance; to fluctuate between parties, so as to appear to favour each.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make trim; to put in due order for any purpose; to make right, neat, or pleasing; to adjust.",
                  "examples": [
                    "The hermit trimmed his little fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, carpentry, of timber) To dress; to make smooth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To rebuke; to reprove.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To beat or thrash.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, historical) To cut back the wick of (a lamp) to maintain a clean, bright flame.",
                  "examples": [
                    "The lamp, or candle, which lights the binnacle, is placed in the cabin, of course the expence of one light is saved, and all the inconveniences of blowing out in a squally night, and likewise the trouble of trimming the lamp, are avoided."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To change the carbon rods of (an arc lamp).",
                  "examples": [
                    "To trim an arc lamp, first remove the old carbons and carefully and thoroughly wipe the carbon rods, holders, &c. with a clean, dry rag.  […]  Having cleaned the rods, next wipe out the globe and get ready the fresh carbons."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}