{
  "word": "rover",
  "etymologies": [
    {
      "description": [
        "From Middle English roven (“to wander, to shoot an arrow randomly”)  +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rover (plural rovers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archery, usually in the plural) A randomly selected target.",
                  "examples": [
                    "\"By my hilt! no. There was little Robby Withstaff, and Andrew Salblaster, and Wat Alspaye, who broke the neck of the German. Mon Dieu! what men they were! Take them how you would, at long butts or short, hoyles, rounds, or rovers, better bowmen never twirled a shaft over their thumb-nails."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who roves, a wanderer, a nomad.",
                  "examples": [
                    "But these islands, undisturbed for years, relapsed into their previous obscurity; and it is only recently that anything has been known concerning them. Once in the course of a half century, to be sure, some adventurous rover would break in upon their peaceful repose. and astonished at the unusual scene, would be almost tempted to claim the merit of a new discovery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vagabond, a tramp, an unsteady, restless person, one who by habit doesn't settle down or marry.",
                  "examples": [
                    "She is a rover and dislikes any sort of ties, physical or emotional."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vehicle for exploring extraterrestrial bodies.",
                  "examples": [
                    "NASA's Mars Exploration Rover Opportunity is currently traveling southward over a pavement of outcrop dubbed the \"Erebus Highway.\" \"Erebus Crater,\" the rover's next target, lies less than 100 meters (328 feet) south of its current position"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A remotely-operated vehicle; ROV",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian Rules football) A position that is one of three of a team's followers, who follow the ball around the ground. Formerly a position for short players, rovers in professional leagues are frequently over 183 cm (6').",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A defensive back position whose coverage responsibilities are a hybrid of those of a cornerback, safety and linebacker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(croquet) A ball which has passed through all the hoops and would go out if it hit the stake but is continued in play; also, the player of such a ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The tenth defensive player in slow-pitch softball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A sort of arrow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle Dutch roven (“to rob”). Cognate with Danish and Norwegian røver (“robber, thief, highwayman, brigand”), Swedish rövare, German Räuber. Compare the native English word reaver, which is ultimately the same composition."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rover (plural rovers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pirate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pirate ship.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}