{
  "word": "spread",
  "etymologies": [
    {
      "description": [
        "From Middle English spreden, from Old English sprǣdan (“to spread, expand”), from Proto-Germanic *spraidijaną (“to spread”), from Proto-Indo-European *(s)per- (“to strew, sow, sprinkle”).",
        "Cognate with Saterland Frisian spreede (“to spread”), West Frisian spriede (“to spread”), North Frisian spriedjen (“to spread”), Dutch spreiden (“to spread”), Low German spreden (“to spread”), German spreiten (“to spread, spread out”), Norwegian spre, spreie (“to spread, disseminate”), Swedish sprida (“to spread”), Latin spernō, spargō, Ancient Greek σπείρω (speírō), Persian سپردن‎ (sepordan, “to deposit”), English spurn."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spread (countable and uncountable, plural spreads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of spreading.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that has been spread.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) A layout, pattern or design of cards arranged for a reading.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An expanse of land.",
                  "examples": [
                    "I have got a fine spread of improvable lands."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large tract of land used to raise livestock; a cattle ranch.",
                  "examples": [
                    "- Can't wait till I get my own spread and won't have to put up with Joe Aguirre's crap no more.- I'm savin' for a place myself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of material used as a cover (such as a bedspread).",
                  "examples": [
                    "Linen shawls and spreads show up in secondhand clothing stores like those in the row on St. Marks Place in New York City."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large meal, especially one laid out on a table.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bread, etc.) Any form of food designed to be spread, such as butters or jams.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A set of multiple torpedoes launched on side-by-side, slowly-diverging paths toward one or more enemy ships.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(prison slang, uncountable) Food improvised by inmates from various ingredients to relieve the tedium of prison food.",
                  "examples": [
                    "Synonym: swole"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An item in a newspaper or magazine that occupies more than one column or page.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Two facing pages in a book, newspaper etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A numerical difference.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, economics) The difference between the wholesale and retail prices.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(trading, economics, finance) The difference between the price of a futures month and the price of another month of the same commodity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(trading, finance) The purchase of a futures contract of one delivery month against the sale of another futures delivery month of the same commodity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(trading, finance) The purchase of one delivery month of one commodity against the sale of that same delivery month of a different commodity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(trading) An arbitrage transaction of the same commodity in two markets, executed to take advantage of a profit from price discrepancies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(trading) The difference between bidding and asking price.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) The difference between the prices of two similar items.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) An unlimited expanse of discontinuous points.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The surface in proportion to the depth of a cut gemstone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Excessive width of the trails of ink written on overly absorbent paper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spread (third-person singular simple present spreads, present participle spreading, simple past and past participle spread)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stretch out, open out (a material etc.) so that it more fully covers a given area of space. [from 13th c.]",
                  "examples": [
                    "He spread his newspaper on the table."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To extend (individual rays, limbs etc.); to stretch out in varying or opposing directions. [from 13th c.]",
                  "examples": [
                    "I spread my arms wide and welcomed him home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disperse, to scatter or distribute over a given area. [from 13th c.]",
                  "examples": [
                    "I spread the rice grains evenly over the floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To proliferate; to become more widely present, to be disseminated. [from 13th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disseminate; to cause to proliferate, to make (something) widely known or present. [from 14th c.]",
                  "examples": [
                    "The missionaries quickly spread their new message across the country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take up a larger area or space; to expand, be extended. [from 14th c.]",
                  "examples": [
                    "I dropped my glass; the water spread quickly over the tiled floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To smear, to distribute in a thin layer. [from 16th c.]",
                  "examples": [
                    "She liked to spread butter on her toast while it was still hot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover (something) with a thin layer of some substance, as of butter. [from 16th c.]",
                  "examples": [
                    "He always spreads his toast with peanut butter and strawberry jam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To prepare; to set and furnish with provisions.",
                  "examples": [
                    "to spread a table"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To open one’s legs, especially for sexual favours. [from 20th c.]",
                  "examples": [
                    "This often sounds like the rap of a demented DJ: the way she moves has got to be good news, can't get loose till I feel the juice— suck and spread, bitch, yeah bounce for me baby."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}