{
  "word": "chancellor",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman or Middle English chaunceler, chanceler, canceler (“chief administrative or executive officer of a ruler; chancellor, secretary; private secretary, scribe; Lord Chancellor of England; officer of the ruler's exchequer; a high administrative or executive officer (for example, a deputy or representative of a bishop; the head of a university)”), from Old French cancelier, chancelier (“chancellor”), from Late Latin cancellārius (“secretary; doorkeeper, porter; usher of a court of law stationed at the bars separating the public from the judges”), from Latin cancellī (plural of cancellus (“grate; bars, barrier; railings”), diminutive of cancer (“grid; barrier”), from Proto-Italic *karkros (“enclosure”), ultimately from Proto-Indo-European *(s)ker- (“to bend, turn”)) + -ārius (suffix forming nouns denoting an agent of use).",
        "The word was present as Late Old English canceler, cancheler, from Norman cancheler, but was displaced in the 13th century by the Old French and Anglo-Norman forms mentioned above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chancellor (plural chancellors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A senior secretary or official with administrative or legal duties, sometimes in charge of some area of government such as finance or justice.",
                  "examples": [
                    "Chancellor of the Duchy of Lancaster",
                    "Lord Chancellor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The head of the government in some German-speaking countries.",
                  "examples": [
                    "Synonym: (historical) Reichskanzler",
                    "the Austrian Chancellor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A senior record keeper of a cathedral; a senior legal officer for a bishop or diocese in charge of hearing cases involving ecclesiastical law.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) The head of a university, sometimes purely ceremonial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK politics) Ellipsis of Chancellor of the Exchequer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, law) The foreman of a jury.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, law) The chief judge of a court of chancery (that is, one exercising equity jurisdiction).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}