{
  "word": "peregrination",
  "etymologies": [
    {
      "description": [
        "From Late Middle English peregrinacioun, peregrinacion (“journey; pilgrimage; (figuratively) human journey through life”), from Anglo-Norman peregrinaciun (“human journey through life”), peregrination (“pilgrimage; overseas travel”), and Old French peregrinacion, peregrination (“pilgrimage; overseas travel”) (modern French pérégrination), and from their etymon Latin peregrīnātiō (“overseas sojourn or travel; (Late Latin) pilgrimage; sojourn; human journey through life”), from peregrīnātus (“living or travelling overseas”) + -iō (suffix forming abstract nouns). Peregrīnātus is the perfect passive participle of peregrīnor (“to live or travel overseas; to be overseas; to roam, rove; to be a stranger”), from peregrīnus (“alien, foreign; exotic”) (from peregrē̆ (“abroad; from abroad; heading abroad”) + -īnus (suffix forming adjectives meaning ‘of or pertaining to’)) + -or (suffix forming first-person singular present passive indicative verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "peregrination (countable and uncountable, plural peregrinations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, chiefly theology, archaic) A person's life regarded as a temporary stay on earth and a journey to the afterlife. [from late 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(countable, archaic) A journey made by a pilgrim; a pilgrimage; also (uncountable) the making of pilgrimages. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(countable) A journey or trip, especially by foot; also (uncountable) journeying, travelling. [from mid 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": [
                    "Synonym: perambulation"
                  ]
                },
                {
                  "meaning": "(uncountable) Broad or systematic discussion of a subject; (countable) an instance of this; a discourse. [from early 17th c.]",
                  "examples": [
                    "Synonym: perambulation"
                  ]
                },
                {
                  "meaning": "(uncountable) Straying from the main subject in speech or writing; digression; (countable) an instance of this. [from mid 20th c.]",
                  "examples": [
                    "Synonym: perambulation"
                  ]
                },
                {
                  "meaning": "(uncountable, obsolete) The state of living abroad temporarily; sojourning; (countable) an act of doing this; a sojourn. [17th–18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}