{
  "word": "snow",
  "etymologies": [
    {
      "description": [
        "From Middle English snow, snaw, from Old English snāw (“snow”), from Proto-West Germanic *snaiw, from Proto-Germanic *snaiwaz (“snow”), from Proto-Indo-European *snóygʷʰos (“snow”), from the root *sneygʷʰ-.",
        "Cognate with Scots snaw (“snow”), West Frisian snie (“snow”), Dutch sneeuw (“snow”), German Schnee (“snow”), Danish sne (“snow”), Norwegian snø (“snow”), Swedish snö (“snow”), Icelandic snjór (“snow”), Latin nix (“snow”), Russian снег (sneg), Ancient Greek νίφα (nípha), dialectal Albanian nehë (“place where the snow melts”), Sanskrit स्नेह (snéha, “oil, grease”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "snow (countable and uncountable, plural snows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The frozen, crystalline state of water that falls as precipitation.",
                  "examples": [
                    "The wind had dropped, and the snow, tired of rushing around in circles trying to catch itself up, now fluttered gently down until it found a place on which to rest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Any similar frozen form of a gas or liquid.",
                  "examples": [
                    "Clad in a coldsuit Jael trudged through a thin layer of CO2 snow ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A snowfall; a blanket of frozen, crystalline water.",
                  "examples": [
                    "We have had several heavy snows this year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A shade of the color white.",
                  "examples": [
                    "snow:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The moving pattern of random dots displayed on a television, etc., when no transmission signal is being received.",
                  "examples": [
                    "Synonym: shash"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Cocaine.",
                  "examples": [
                    "Besides, if it wasn't poison, it might be 'snow' or something."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "marine snow",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "snow (third-person singular simple present snows, present participle snowing, simple past and past participle snowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(impersonal) To have snow fall from the sky.",
                  "examples": [
                    "It is snowing.",
                    "It started to snow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) To hoodwink someone, especially by presenting confusing information.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) To bluff in draw poker by refusing to draw any cards.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Low German Snaue, or Dutch snaauw, from Low German Snau (“a snout, a beak”). See snout."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "snow (plural snows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A square-rigged vessel, differing from a brig only in that she has a trysail mast close abaft the mainmast, on which a large trysail is hoisted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}