{
  "word": "nightmare",
  "etymologies": [
    {
      "description": [
        "From Middle English night-mare, from Old English *nihtmare, equivalent to night +‎ mare (“evil spirit believed to afflict a sleeping person”). Cognate with Scots nichtmare and nichtmeer, Dutch nachtmerrie, Middle Low German nachtmār, German Nachtmahr."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nightmare (plural nightmares)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A demon or monster, thought to plague people while they slept and cause a feeling of suffocation and terror during sleep. [from 14th c.]",
                  "examples": [
                    "I started, hourly, from dreams of unutterable fear, to find the hot breath of the thing upon my face, and its vast weight—an incarnate Night-Mare that I had no power to shake off—incumbent eternally upon my heart!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly historical) A feeling of extreme anxiety or suffocation experienced during sleep; Sleep paralysis. [from 16th c.]",
                  "examples": [
                    "Had been afflicted in the night with that strange complaint called the nightmare."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very bad or frightening dream. [from 19th c.]",
                  "examples": [
                    "I had a nightmare that I tried to run but could neither move nor breathe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any bad, miserable, difficult or terrifying situation or experience that arouses anxiety, terror, agony or great displeasure. [from 20th c.]",
                  "examples": [
                    "Cleaning up after identity theft can be a nightmare of phone calls and letters."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nightmare (third-person singular simple present nightmares, present participle nightmaring, simple past and past participle nightmared)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have a nightmare.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}