{
  "word": "liquidate",
  "etymologies": [
    {
      "description": [
        "From Medieval Latin liquidatus (“liquid, clear”), past participle of liquidare. The sense “to kill, do away with” is a semantic loan from Russian ликвиди́ровать (likvidírovatʹ), ultimately from Latin liquidus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "liquidate (third-person singular simple present liquidates, present participle liquidating, simple past and past participle liquidated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To settle (a debt) by paying the outstanding amount.",
                  "examples": [
                    "Friburg was ceded to Zurich by Sigismund to liquidate a debt of a thousand florins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To settle the affairs of (a company), by using its assets to pay its debts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convert (assets) into cash; to redeem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, transitive) To determine by agreement or by litigation the precise amount of (indebtedness); to make the amount of (a debt) clear and certain.",
                  "examples": [
                    "A debt or demand is liquidated whenever the amount due is agreed on by the parties, or fixed by the operation of law."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To do away with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To kill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To make clear and intelligible.",
                  "examples": [
                    "Time only can liquidate the meaning of all parts of a compound system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To make liquid.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}