{
  "word": "wisdom",
  "etymologies": [
    {
      "description": [
        "From Middle English wisdom, from Old English wīsdōm (“wisdom”), from Proto-Germanic *wīsadōmaz (“wisdom”), corresponding to wise +‎ -dom or wise +‎ doom (“judgement”). Cognate with Scots wisdom, wysdom (“wisdom”), West Frisian wiisdom (“wisdom”), Dutch wijsdom (“wisdom”), German Weistum (“legal sentence”), Danish/Norwegian/Swedish visdom (“wisdom”), Icelandic vísdómur (“wisdom”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wisdom (countable and uncountable, plural wisdoms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) An element of personal character that enables one to distinguish the wise from the unwise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A piece of wise advice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The discretionary use of knowledge for the greatest good.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to apply relevant knowledge in an insightful way, especially to different situations from that in which the knowledge was gained.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to make a decision based on the combination of knowledge, experience, and intuitive understanding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) The ability to know and apply spiritual truths.",
                  "examples": [
                    "Wiſdom…is to a man an infinite Treaſure, for ſhe is the Breath of the Power of God, and a pure Influence that floweth from the Glory of the Almighty; ſhe is the Brightneſs of Eternal Light, and an undefiled Mirror of the Majeſty of God, and an Image of his Goodneſs; ſhe teacheth us Soberneſs and Prudence, Righteouſneſs and Strength; ſhe underſtands the Subtilty of words, and Solution of dark ſentences; ſhe foreknoweth Signs and Wonders, and what ſhall happen in time to come."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A group of wombats.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A group of owls.",
                  "examples": [
                    "Synonym: parliament"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}