{
  "word": "family",
  "etymologies": [
    {
      "description": [
        "From Early Modern English familie (not in Middle English), from Latin familia (“the servants in a household, domestics collectively”), from famulus (“servant”) or famula (“female servant”).",
        "Doublet of familia. Displaced native Old English hīred."
      ],
      "adjectives": [
        {
          "description": "family (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Suitable for children and adults.",
                  "examples": [
                    "It's not good for a date, it's a family restaurant.",
                    "Some animated movies are not just for kids, they are family movies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Homosexual.",
                  "examples": [
                    "I knew he was family when I first met him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "family (countable and uncountable, plural families)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A group of people who are closely related to one another (by blood, marriage or adoption); kin; in particular, a set of parents and their children; an immediate family.",
                  "examples": [
                    "Our family lives in town.",
                    "This is a family restaurant, stop making out!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An extended family: a group of people who are related to one another by blood or marriage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A nuclear family: a mother and father who are married and cohabiting and their child or children.",
                  "examples": [
                    "The cultural struggle is for the survival of family values against all manner of atheistic amorality.",
                    "We must preserve the family unit if we want to save civilisation!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Members of one's family collectively.",
                  "examples": [
                    "I have a lot of family in Australia.",
                    "He has a sister, but no other family."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A (close-knit) group of people related by blood, friendship, marriage, law, or custom, especially if they live or work together.",
                  "examples": [
                    "crime family, Mafia family",
                    "This is my fraternity family at the university.",
                    "Our company is one big happy family."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Lineage, especially honorable or noble lineage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, biology, taxonomy) A category in the classification of organisms, ranking below order and above genus; a taxon at that rank.",
                  "examples": [
                    "Synonym: familia",
                    "Magnolias belong to the family Magnoliaceae."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any group or aggregation of things classed together as kindred or related from possessing in common characteristics which distinguish them from other things of the same order.",
                  "examples": [
                    "Doliracetam is a drug from the racetam family."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(set theory, countable) A collection of sets, especially of subsets of a given set.",
                  "examples": [
                    "Let \n  \n    \n      \n        \n          \n            F\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {F}}}\n  \n be a family of subsets over \n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n  \n."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, music) A group of instruments having the same basic method of tone production.",
                  "examples": [
                    "the brass family;  the violin family"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, linguistics) A group of languages believed to have descended from the same ancestral language.",
                  "examples": [
                    "the Indo-European language family;  the Afroasiatic language family"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}