{
  "word": "church",
  "etymologies": [
    {
      "description": [
        "From Middle English chirche, from Old English ċiriċe (“church”), from Proto-West Germanic *kirikā, an early borrowing of Ancient Greek κυριακόν (kuriakón), neuter form of κυριακός (kuriakós, “belonging to the lord”), from κύριος (kúrios, “ruler, lord”), from Proto-Indo-European *ḱewh₁- (“to swell, spread out, be strong, prevail”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "church (countable and uncountable, plural churches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A Christian house of worship; a building where Christian religious services take place. [from 9th c.]",
                  "examples": [
                    "There is a lovely little church in the valley.",
                    "This building used to be a church before being converted into a library."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Christians collectively seen as a single spiritual community; Christianity; Christendom. [from 9th c.]",
                  "examples": [
                    "These worshippers make up the Church of Christ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A local congregation of people who follow the same Christian religious beliefs, local or general. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A particular denomination of Christianity. [from 9th c.]",
                  "examples": [
                    "The Church of England separated from the Roman Catholic Church in 1534."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, countable, as bare noun) Christian worship held at a church; service. [from 10th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Organized religion in general or a specific religion considered as a political institution.",
                  "examples": [
                    "Many constitutions enshrine the separation of church and state."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Any religious group. [from 16th c.]",
                  "examples": [
                    "She goes to a Wiccan church down the road."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Assembly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "church (third-person singular simple present churches, present participle churching, simple past and past participle churched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Christianity, now historical) To conduct a religious service for (a woman after childbirth, or a newly married couple). [from 15th c.]",
                  "examples": [
                    "Nor did it [the Church] accept that the woman should stay indoors until she had been churched."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To educate someone religiously, as in in a church.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}