{
  "word": "widow",
  "etymologies": [
    {
      "description": [
        "From Middle English widwe, from Old English widuwe, from Proto-West Germanic *widuwā, from Proto-Germanic *widuwǭ, from Proto-Indo-European *h₁widʰéwh₂, possibly from *h₁weydʰh₁-, *widʰ- (“to separate, split, cleave, divide”), whence also wood from Old English widu, wudu.",
        "Cognates include German Witwe, Dutch weduwe, Gothic 𐍅𐌹𐌳𐌿𐍅𐍉 (widuwō), Old Irish fedb, Latin vidua, Old Church Slavonic въдова (vŭdova), Sanskrit विधवा (vidhavā) and Persian بیوه‎ (bive, bêva), Middle Persian wēwag, Avestan viðavā- \"widow\" ."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "widow (plural widows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A woman whose spouse has died (and who has not remarried); feminine of widower.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) A person whose spouse has died (and who has not remarried).",
                  "examples": [
                    "Now that he is a widow, he tries to win Olivia back through the songs and the music that brought them together all those years ago, leaving Olivia torn between moving forward with Josh or falling into the arms of the man she truly loves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, in combination) A woman whose husband is often away pursuing a sport, etc.",
                  "examples": [
                    "I had been feeling like a bowling-alley widow, but knew he loved the game, so I suggested we join a mixed league."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) An additional hand of cards dealt face down in some card games, to be used by the highest bidder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) A single line of type that ends a paragraph, carried over to the next page or column.",
                  "examples": [
                    "Antonym: orphan Hyponym: runt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A venomous spider, of the genus Latrodectus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "widow (third-person singular simple present widows, present participle widowing, simple past and past participle widowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a widow or widower of someone; to cause the death of the spouse of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To strip of anything valued.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To endow with a widow's right.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To be widow to.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}