{
  "word": "babble",
  "etymologies": [
    {
      "description": [
        "From Middle English babelen, from Old English *bæblian, also wæflian (“to talk foolishly”), from Proto-West Germanic *bablōn, *wablōn, variants of *babalōn, from Proto-Germanic *babalōną (“to chatter”), from Proto-Indo-European *bʰa-bʰa-, perhaps a reduplication of Proto-Indo-European *bʰeh₂- (“to say”), or a variant of Proto-Indo-European *baba- (“to talk vaguely, mumble”), or a merger of the two, possibly ultimately onomatopoeic/mimicry of infantile sounds (compare babe, baby).",
        "Cognate with Saterland Frisian babbelje (“to babble”), West Frisian babbelje (“to babble”), Dutch babbelen (“to babble, chat”), German Low German babbeln (“to babble”), German babbeln (“to babble”), Danish bable, bavle (“to babble”), Swedish babbla (“to babble”), Icelandic babla (“to babble”). Unrelated to Babel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "babble (usually uncountable, plural babbles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Idle talk; senseless prattle",
                  "examples": [
                    "Synonyms: gabble, twaddle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Inarticulate speech; constant or confused murmur.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sound like that of water gently flowing around obstructions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "babble (third-person singular simple present babbles, present participle babbling, simple past and past participle babbled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To utter words indistinctly or unintelligibly; to utter inarticulate sounds",
                  "examples": [
                    "The men were babbling, so we couldn't make sense of anything."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To talk incoherently; to utter meaningless words.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To talk too much; to chatter; to prattle.",
                  "examples": [
                    "Radical rather than rhetorical, babble like an oracle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a continuous murmuring noise, like shallow water running over stones.",
                  "examples": [
                    "In every babbling brook he finds a friend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To utter in an indistinct or incoherent way; to repeat words or sounds in a childish way without understanding.",
                  "examples": [
                    "These [words] he used to babble indifferently in all companies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reveal; to give away (a secret).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}