{
  "word": "martial",
  "etymologies": [
    {
      "description": [
        "From Middle English martial, marcial, mercial, mercialle (“relating to war, warlike; military; for use in fighting or warfare; brave, hardy; combative, fierce; ruthless, vicious; domineering, overbearing”), from Middle French martial (modern French martial (“martial”)), or directly from its etymon Latin mārtiālis (“of or pertaining to Mars, the Roman god of war”), from Mārtius (“of or pertaining to Mars”) + -ālis (suffix forming adjectives of relationship). The English word is cognate with Italian marziale (“martial”), Portuguese marcial (“martial”), Spanish marcial (“martial”)."
      ],
      "adjectives": [
        {
          "description": "martial (comparative more martial, superlative most martial)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Of, relating to, or suggestive of war; warlike.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Connected with or relating to armed forces or the profession of arms or military life.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Characteristic of or befitting a warrior; having a military bearing; soldierly.",
                  "examples": [
                    "Synonyms: soldierlike, warriorlike"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, astrology, obsolete) Pertaining to the astrological influence of the planet Mars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, astronomy, obsolete) Of or relating to the planet Mars; Martian.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, chemistry, medicine, obsolete) Containing, or relating to, iron (which was symbolically associated with the planet Mars by alchemists); chalybeate, ferric, ferrous.",
                  "examples": [
                    "martial preparations martial flowers (a reddish crystalline salt of iron)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "martial (plural martials)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A soldier, a warrior.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology, obsolete) A celestial object under the astrological influence of the planet Mars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly science fiction, obsolete) Synonym of Martian (“inhabitant of the planet Mars”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}