{
  "word": "rapture",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French rapture, from Latin raptūra, future active participle of rapiō (“snatch, carry off”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rapture (countable and uncountable, plural raptures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Extreme pleasure, happiness or excitement.",
                  "examples": [
                    "Sunderland’s right-back, Santiago Vergini, inadvertently gave Southampton the lead by lashing the ball into his own net in the 12th minute, and that signalled the start of a barmy encounter that had home fans in raptures and Sunderland in tatters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In some forms of fundamentalist Protestant eschatology, the event when Jesus returns and gathers the souls of living and deceased believers. (Usually \"the rapture\".)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of kidnapping or abducting, especially the forceful carrying off of a woman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Rape; ravishment; sexual violation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of carrying, conveying, transporting or sweeping along by force of movement; the force of such movement; the fact of being carried along by such movement.",
                  "examples": [
                    "With the rapture of great winds to blow / About earth's shaken coignes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spasm; a fit; a syncope; delirium.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rapture (third-person singular simple present raptures, present participle rapturing, simple past and past participle raptured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, transitive) To cause to experience great happiness or excitement.",
                  "examples": [
                    "She raptured me in summer by giving me Fitzgerald's flawed and gorgeous masterpiece, the book that held his tortured heart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, intransitive) To experience great happiness or excitement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take (someone) off the Earth and bring (them) to Heaven as part of the Rapture.",
                  "examples": [
                    "\"If she's raptured,\" Ellen said to them on the fifth night after Marylee's disappearance, as they sat on the roof of the building on their old beanbags and rusting garden furniture hauled up from the Museum, \"if that's what happened to her, then  […] \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, intransitive) To take part in the Rapture; to leave Earth and go to Heaven as part of the Rapture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) To state (something, transitive) or talk (intransitive) rapturously.",
                  "examples": [
                    "And then the flowers! May-day indeed. Hester had been in Switzerland at the end of June, years on years before, and often had she raptured to Effie about the day's ride, in which they collected a hundred varieties of flowers, most of them new to them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}