{
  "word": "bundle",
  "etymologies": [
    {
      "description": [
        "From Middle English bundel, from Middle Dutch bondel or Old English byndele, byndelle (“a binding; tying; fastening with bands”); both from Proto-Germanic *bundil-, derivative of *bundą (“bundle”). Compare also English bindle and German Bündel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bundle (plural bundles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of objects held together by wrapping or tying.",
                  "examples": [
                    "a bundle of straw or of paper",
                    "a bundle of old clothes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A package wrapped or tied up for carrying.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of products or services sold together as a unit.",
                  "examples": [
                    "This software bundle includes a wordprocessor, a spreadsheet, and two games."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A large amount, especially of money.",
                  "examples": [
                    "Synonyms: (informal) mint, (slang) pile, (colloquial) small fortune",
                    "The inventor of that gizmo must have made a bundle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A cluster of closely bound muscle or nerve fibres.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, education) A sequence of two or more words that occur in language with high frequency but are not idiomatic; a chunk, cluster, or lexical bundle.",
                  "examples": [
                    "examples of bundles would include in accordance with, the results of and so far."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, Mac OS X) A directory containing related resources such as source code; application bundle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quantity of paper equal to two reams (1000 sheets).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A court bundle, the assemblage of documentation prepared for, and referred to during, a court case.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Topological space composed of a base space and fibers projected to the base space.",
                  "examples": [
                    "Meronym: stalk space"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bundle (third-person singular simple present bundles, present participle bundling, simple past and past participle bundled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tie or wrap together into a bundle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hustle; to dispatch something or someone quickly.",
                  "examples": [
                    "They unmercifully bundled me and my gallant second into our own hackney coach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To prepare for departure; to set off in a hurry or without ceremony; used with away, off, out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dress someone warmly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dress warmly. Usually bundle up",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) To sell hardware and software as a single product.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hurry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Synonym of dogpile: to form a pile of people upon a victim.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hastily or clumsily push, put, carry or otherwise send something into a particular place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, intransitive) To sleep on the same bed without undressing.",
                  "examples": [
                    "They were on the couch for nearly an hour, then in the shower for she didn't know how long — until the hot water started to fail and drove them out, anyway. Then she took him into her bed, where she lay too exhausted and too content to do anything but bundle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}