{
  "word": "sneezeweed",
  "etymologies": [
    {
      "description": [
        "sneeze +‎ weed."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sneezeweed (countable and uncountable, plural sneezeweeds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A plant of the genus Helenium, especially Helenium autumnale.",
                  "examples": [
                    "outracing cyclones and rangefires, switchbacking up the eastern slope of the Rockies through meadows of mule-ear and sneezeweed, on over the great torn crestline, to be delivered at last into these unholy mountains Webb grew to manhood in  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A plant of the genus Centipeda; either of the species Centipeda cunninghami or Centipeda minima, which induce sneezing and are known as a folk remedy for colds and allergic reactions.",
                  "examples": [
                    "Centipeda Two species of sneezeweed are found in wet places, often at the fringes of wetlands where they may be flooded during heavy rain. C. cunninghamii is the larger plant, an upright perennial with coarsely toothed leaves up to 3 cm long; it is found through much of eastern Australia other than Tasmania.",
                    "C. minima is a sprawling annual with leaves less than 1 cm long, smooth-edged or sometimes with a few blunt teeth. This is a widespread plant found across much of non-tropical Australia. Both species are strongly and pleasantly aromatic, and have been used in the treatment of colds and infected eyes or throats."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}