{
  "word": "sliver",
  "etymologies": [
    {
      "description": [
        "From Middle English slivere, sliver from Middle English sliven (“to cut, cleave, split”), from Old English slīfan (as in tōslīfan (“to split, split up”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sliver (plural slivers)",
          "definitionGroups": [
            {
              "group": "A long piece cut or rent off; a sharp, slender fragment; a splinter.",
              "entries": [
                {
                  "meaning": "(regional US) Specifically, a splinter caught under the skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strand, or slender roll, of cotton or other fiber in a loose, untwisted state, produced by a carding machine and ready for the roving or slubbing which precedes spinning.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) Bait made of pieces of small fish. Compare kibblings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, New York) A narrow high-rise apartment building.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small amount of something; a drop in the bucket; a shred.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sliver (third-person singular simple present slivers, present participle slivering, simple past and past participle slivered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut or divide into long, thin pieces, or into very small pieces; to cut or rend lengthwise; to slit.",
                  "examples": [
                    "to sliver wood",
                    "c. 1606 (date written),  William Shakespeare,  “The Tragedie of Macbeth”, in  Mr. William Shakespeares Comedies, Histories, & Tragedies […] (First Folio), London:  […]  Isaac Iaggard, and Ed[ward] Blount, published 1623, →OCLC, [Act IV, scene i]:slips of yew, Sliver'd in the moon's eclipse"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}