{
  "word": "bray",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English brayen, brai, bray, braye (“of a person or animal: to vocalize loudly; of the weather: to make a loud sound, howl, roar”), from Old French brai, braire (“of an animal: to bray; of a person: to cry or shout out”) (modern French braire (“of an animal: to bray; of a person: to shout; to cry, weep”)), possibly from Vulgar Latin *bragiō, from Gaulish *bragu (compare Breton breugiñ (“to bray”), brammañ (“to flatulate”), Cornish bramma, brabma (“to flatulate”), Old Irish braigid (“to flatulate”)), from Proto-Celtic *brageti, *bragyeti (“to flatulate”), from Proto-Indo-European *bʰreHg- (“to flatulate; to stink”); cognate with Latin fragrō (“to smell”). Alternatively, the word could be from a Germanic source, ultimately from Proto-Germanic *brekaną (“to break”), and cognate with frangere (“to break, shatter”).",
        "The noun is derived from the verb, or from Middle English brai, brait (“shriek; outcry”), from Old French brai, brait (“a cry”), from braire (“of an animal: to bray; of a person: to shout; to cry, weep”); see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bray (plural brays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cry of an animal, now chiefly that of animals related to the ass or donkey, or the camel.",
                  "examples": [
                    "Synonym: (ass or donkey) hee-haw"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any discordant, grating, or harsh sound.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bray (third-person singular simple present brays, present participle braying, simple past and past participle brayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of an animal (now chiefly of animals related to the ass or donkey, and the camel): to make its cry.",
                  "examples": [
                    "Synonyms: (archaic, dialectal) blore, (ass or donkey) hee-haw",
                    "Whenever I walked by, that donkey brayed at me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, by extension) To make a harsh, discordant sound like a donkey's bray.",
                  "examples": [
                    "He threw back his head and brayed with laughter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make or utter (a shout, sound, etc.) discordantly, loudly, or in a harsh and grating manner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English brayen (“to break or crush into pieces”), from Anglo-Norman breier, Old French breie, breier, broiier (modern French broyer (“to crush, grind”)), possibly from Frankish *brekan (“to break”), from Proto-Germanic *brekaną (“to break”), from Proto-Indo-European *bʰreg- (“to break”); thus making the English word a doublet of break."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bray (third-person singular simple present brays, present participle braying, simple past and past participle brayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To crush or pound, especially using a pestle and mortar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain, chiefly Yorkshire, by extension) To hit (someone or something).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}