{
  "word": "picayune",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from southern French picaillon, pécaillon, picayon (“type of small foreign coin; (informal, especially in the plural) cash, money”), and from its etymon Occitan picalhon, picaioun (“cheaply made Savoyan-Piedmontese coin that was rapidly demonetized; (by extension) cash, money”), probably from Occitan piquar (“to ring (bells); to knock, strike”) (referring to the clinking of coins in a pocket), originally imitative.",
        "The adjective is derived from the noun."
      ],
      "adjectives": [
        {
          "description": "picayune (comparative more picayune, superlative most picayune) (chiefly US, informal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of little consequence; small and of little importance; petty, trivial.",
                  "examples": [
                    "Synonyms: picayunish; see also Thesaurus:insignificant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Childishly spiteful; tending to go on about unimportant things; small-minded.",
                  "examples": [
                    "Synonyms: peevish, petty"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "picayune (plural picayunes) (chiefly US)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially Louisiana, historical) A small coin of the value of six-and-a-quarter cents; a Spanish coin with a value of half a real; a fippenny bit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, archaic) A coin worth five cents (a nickel) or some other low value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, informal) A person regarded as unworthy of respect or useless; also, something of very little value; a trifle.",
                  "examples": [
                    "(person unworthy of respect or useless): Synonyms: see Thesaurus:nonentity",
                    "(something of very little value): Synonyms: see Thesaurus:trifle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, informal) An argument, fact, or other issue raised (often intentionally) that distracts from a larger issue or fails to make any difference.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}