{
  "word": "stopgap",
  "etymologies": [
    {
      "description": [
        "The noun is derived from stop (“to close or block (an opening)”) +‎ gap, from the phrase to stop a gap. The adjective is from an attributive use of the noun, and the verb is derived from the noun."
      ],
      "adjectives": [
        {
          "description": "stopgap (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short-term; temporary.",
                  "examples": [
                    "They put a stopgap solution in place, but need something more permanent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Filling a gap or pause.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "stopgap (plural stopgaps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) That which stops up or fills a gap or hole.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Something spoken to fill up an uncomfortable pause in speech; a filled pause or filler.",
                  "examples": []
                },
                {
                  "meaning": "A short-term fix or temporary measure used until something better can be obtained; that which serves as an expedient in an emergency; a band-aid solution.",
                  "examples": [
                    "Synonyms: band-aid, bandaid, quick fix; see also Thesaurus:workaround",
                    "The small company used their old product with a few kludged enhancements as a stopgap until they could develop a new product."
                  ]
                },
                {
                  "meaning": "(specifically) A person appointed or hired to fill a position temporarily until a permanent appointment or hire can be made; a temp.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stopgap (third-person singular simple present stopgaps, present participle stopgapping, simple past and past participle stopgapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stop up or fill (a physical gap or hole, or a hiatus).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive) To use something as a short-term fix or temporary measure until a better alternative can be obtained.",
              "entries": [
                {
                  "meaning": "(specifically) To work at a position temporarily until a permanent appointment or hire is made.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}