{
  "word": "choleric",
  "etymologies": [
    {
      "description": [
        "From Middle English colerik, from Old French colerique, from Latin cholericus."
      ],
      "adjectives": [
        {
          "description": "choleric (comparative more choleric, superlative most choleric)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(according to theories of the four humours or temperaments) Having a temperament characterized by an excess of choler; easily becoming angry.",
                  "examples": [
                    "From a choleric man withdraw a little; from him that says nothing for ever."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Showing or expressing anger.",
                  "examples": [
                    "How angry the poor devil is! In fine, thou art as choleric as a cook by a fireside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to cholera (infectious disease).",
                  "examples": [
                    "I now proceed to enumerate those lesions and morbid changes found in the bodies of those cut off by cholera, which must have preceded the appearance of the disease, and which, existing, as they did, in very different organs, had no connection with the choleric symptoms, but nevertheless rendered the chance of recovery much less likely."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Causing an excess of choler.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "choleric (plural cholerics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person with a choleric temperament.",
                  "examples": [
                    "The cholerics show ambition, stubbornness, love of work, courage  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person suffering from cholera (infectious disease).",
                  "examples": [
                    "Persons laboring under pulmonary affections appear to be less liable than others, though I have found softened tubercles in some cholerics."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}