{
  "word": "rotation",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin rotatiō. By surface analysis, rotate +‎ -ion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rotation (countable and uncountable, plural rotations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly uncountable) The act of turning around a centre or an axis.",
                  "examples": [
                    "The earth's rotation about its axis is responsible for its being slightly oblate rather than a sphere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single complete cycle around a centre or an axis.",
                  "examples": [
                    "Earth's moon completes a rotation every twenty-seven days or so."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A regular variation in a sequence, such as to even-out wear, or people taking turns in a task; a duty roster.",
                  "examples": [
                    "Applying crop rotation to a field avoids depleting soil nutrients the way repeated use of a single crop might do.",
                    "In rotation, each member of the group would be responsible for the beacon fire.",
                    "The medical resident finished a two-week rotation in pediatrics and began one in orthopaedics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, geometry) An operation on a metric space that is a continuous isometry and fixes at least one point.",
                  "examples": [
                    "The function mapping (x,y) to (−y,x) is a rotation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The set of starting pitchers of a team.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The step during takeoff when the pilot commands the vehicle to lift the nose wheel off the ground during the takeoff roll. (see also: V2)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Repeated play on a radio station, etc.",
                  "examples": [
                    "The new single enjoyed heavy rotation on MTV."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}