{
  "word": "renew",
  "etymologies": [
    {
      "description": [
        "From Middle English renewen, an alteration (possibly on analogy with Latin renovāre) of earlier anewen (“to renew”), from Old English nīewian (“to restore; renovate; renew”), equivalent to re- +‎ new. Cognate with Old High German giniuwōn (“to renew”), Middle High German geniuwen (“to renew”), Old Norse nýja (“to renew”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "renew (plural renews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of renewal",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "renew (third-person singular simple present renews, present participle renewing, simple past and past participle renewed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (something) new again; to restore to freshness or original condition. [from 14thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To replace (something which has broken etc.); to replenish (something which has been exhausted), to keep up a required supply of. [from 14thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) To make new spiritually; to regenerate. [from 14thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, intransitive) To become new, or as new; to revive. [15th–18thc.]",
                  "examples": [
                    "[…] to such as are in fear they strike a great impression, renew many times, and recal such chimeras and terrible fictions into their minds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To begin again; to recommence. [from 16thc.]",
                  "examples": [
                    "The last great age, foretold by sacred rhymes,Renews its finished course; Saturnian timesRoll round again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) To repeat. [from 17thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To extend a period of loan, especially a library book that is due to be returned.",
                  "examples": [
                    "I'd like to renew these three books.  Did you know that you can renew online?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}