{
  "word": "isochore",
  "etymologies": [
    {
      "description": [
        "From iso- +‎ Ancient Greek χώρα (khṓra, “place”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "isochore (plural isochores)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In general, a place or position with relevant parameters matching other places, as in having the same pressure, chemistry, population etc. Even within a single discipline the parameter might vary according to convenience e.g. in physics alone it might refer to velocity, volume, gravity, and many more. cf. contour, isopleth.",
                  "examples": [
                    "The numerical results are given from which the authors deduce the relation for constant volume and additional reasons are given for believing acetic acid (whose vapour density at ordinary temperatures is abnormal) to be a mixture of C2H4O2 and C4H804, the former preponderating as the temperature rises. The authors ask the Society for a name to designate lines connecting pressure and temperature at constant volume, and for which they suggested “isochore”..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A line drawn on a graph showing the variation of the pressure of a constant volume of gas as it varies with temperature.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A contour showing points of equal vertical thickness of strata; equal to an isopach if strata are horizontal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A sequence of DNA that has a reasonably constant proportion of pairs of guanine and cytosine bases, and is rich in genes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}