{
  "word": "let",
  "etymologies": [
    {
      "description": [
        "From Middle English leten, læten, from Old English lǣtan (“to allow, let go, bequeath, leave, rent”), from Proto-West Germanic *lātan, from Proto-Germanic *lētaną (“to leave behind, allow”), from Proto-Indo-European *leh₁d- (“to let, leave behind”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "let (plural lets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The allowing of possession of a property etc. in exchange for rent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "let (third-person singular simple present lets, present participle letting, simple past let or (obsolete) leet, past participle let or (obsolete) letten)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow to, not to prevent (+ infinitive, but usually without to).",
                  "examples": [
                    "After he knocked for hours, I decided to let him come in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow to be or do without interference; to not disturb or meddle with; to leave (someone or something) alone.",
                  "examples": [
                    "Let me be!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow the release of (a fluid).",
                  "examples": [
                    "The physicians let about a pint of his blood, but to no avail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow possession of (a property etc.) in exchange for rent.",
                  "examples": [
                    "I decided to let the farmhouse to a couple while I was working abroad."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give, grant, or assign, as a work, privilege, or contract; often with out.",
                  "examples": [
                    "to let the building of a bridge;  to let out the lathing and the plastering"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary, transitive) Used to introduce a first or third person imperative verb construction.",
                  "examples": [
                    "Let's put on a show!",
                    "Let us have a moment of silence.",
                    "Let me just give you the phone number.",
                    "Let P be the point where AB and OX intersect."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete except with know) To cause (+ bare infinitive).",
                  "examples": [
                    "Can you let me know what time you'll be arriving?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English letten (“to hinder, delay”), from Old English lettan (“to hinder, delay”; literally, “to make late”), from Proto-West Germanic *lattjan, from Proto-Germanic *latjaną. Akin to Old English latian (“to delay”), Dutch letten, Old English læt (“late”). More at late, delay."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "let (plural lets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An obstacle or hindrance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis) The hindrance caused by the net during serve, only if the ball falls legally.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "let (third-person singular simple present lets, present participle letting, simple past letted, past participle let)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To hinder, prevent, impede, hamper, cumber; to obstruct (someone or something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To prevent someone from doing something; also to prevent something from happening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To tarry or delay.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}