{
  "word": "mosaic",
  "etymologies": [
    {
      "description": [
        "From Middle French mosaïque, from Italian mosaico, from Medieval Latin musaicum, from Late Latin musivum (opus), from Latin museum, musaeum, probably from Ancient Greek Μουσεῖον (Mouseîon), shrine of the Muses (Μοῦσα (Moûsa))."
      ],
      "adjectives": [
        {
          "description": "mosaic (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of an individual) Containing cells of varying genetic constitution.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mosaic (countable and uncountable, plural mosaics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of artwork created by placing colored squares (usually tiles) in a pattern so as to create a picture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "pixelization (method of censorship)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) An individual composed of two or more cell lines of different genetic or chromosomal constitution, but from the same zygote.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phytopathology) Any of several viral diseases that cause mosaic-like patterns to appear on leaves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A composite picture made from overlapping photographs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mosaic (third-person singular simple present mosaics, present participle mosaicing or mosaicking, simple past and past participle mosaiced or mosaicked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To arrange in a mosaic.",
                  "examples": [
                    "Featheredging is a process in preparing the photographs for mosaicking and involves cutting, tearing, and sandpapering the back of the print along its edges in such a way that the edge of the print is thin and will make a smooth match with adjoining prints."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}