{
  "word": "rollover",
  "etymologies": [
    {
      "description": [
        "roll +‎ over, from the verb phrase."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rollover (countable and uncountable, plural rollovers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The process of incrementing, especially back to an initial value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) A road traffic accident in which a vehicle overturns.",
                  "examples": [
                    "“They blink if I step on the brake at the same time, and anybody who don't step on his brakes when he's makin[sic] a turn is lookin[sic] to do a rollover.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A graphic element that changes its appearance when the cursor moves over it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A keyboard feature where each key is scanned independently, so that multiple simultaneous keypresses always register correctly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firefighting) The sudden ignition of flammable gasses (produced by pyrolysis in an oxygen-poor environment) near the ceiling of a room or other enclosed space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) The reinvestment of funds in a new issue of the same or similar investment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A fee paid by a borrower in order to defer full repayment of a loan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) In the National or European lottery, the situation in which a jackpot that has not been won is carried over to the next week.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pinball) A target on the pinball table that is activated when the ball rolls over it.",
                  "examples": [
                    "One thing I hate about some pinball games is that they don't let you know your current objective, what happens when you hit specific targets or rollovers, or what targets you should be aiming for right now."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rollover",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of roll over.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}