{
  "word": "mummer",
  "etymologies": [
    {
      "description": [
        "From Middle English mummer, mommer, equivalent to mum +‎ -er, perhaps conflating with Old French momeor (“jester, entertainer”), from mommer (“to wear a mask”), from momon (“mask”). Compare German Mumme (“mask”), 16th Century German mummen (“to disguise oneself”), Middle Dutch mommen, mummen (“to go about in a mask, to disguise”), Middle Low Saxon mommen (“to wear a mask, to disguise”), Dutch mom (“mask”) and mimmen (“to mask”) as well as Spanish momo (“grimace”).",
        "Perhaps both of the conflated terms are from the same ultimate root, as note Middle Low Saxon mummen (“to speak indistinctly, to disguise oneself”), Dutch mommen (“to speak indistinctly”), German mummen (“to speak indistinctly”), English mump (“to grimace, mumble”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mummer (plural mummers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who dons a disguising costume, as for a parade or a festival.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An actor in a pantomime; one who communicates entirely through gesture and facial expression.",
                  "examples": [
                    "[To] perform as mummers, who act in relays of eight, at the worship of ancestors."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mummer (third-person singular simple present mummers, present participle mummering, simple past and past participle mummered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of mum (“to act in pantomime or dumb show”)",
                  "examples": [
                    "There is a general agreement that niggering [blackface performance] took over from mummering to keep up the old custom."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}