{
  "word": "penthouse",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman pentiz (“pentice”), from apendiz (“appentice”), ultimately from a suffixed form of Latin appendō (“I append”). Altered by folk etymology to appear to be a compound of house. Doublet of appentice and pentice."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "penthouse (plural penthouses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated or historical) An outhouse or other structure (especially one with a sloping roof) attached to the outside wall of a building, sometimes as protection from the weather.",
                  "examples": [
                    "At length, recommending himself to God, he let go one end of his cord, and suffered himself to fall down upon an old shed or penthouse, which, with the weight of his body, fell in with great noise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An apartment or suite found on an upper floor, or floors, of a tall building, especially one that is expensive or luxurious with panoramic views. Sometimes these are located just under \"penthouse mechanical\" floors.",
                  "examples": [
                    "Night of January 16th is the story of a woman on trial for pushing her wealthy boss-lover from a Manhattan penthouse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis) Any of the sloping roofs at the side of a real tennis court.",
                  "examples": [
                    "An odd derivative of real tennis lasted until the latter part of the eighteenth century at Rattray in Perthshire. It was played in the churchyard by two pairs of men, and the method for starting the play was to throw the ball onto the church roof, using it like the sloping penthouse of the tennis court."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "penthouse (third-person singular simple present penthouses, present participle penthousing, simple past and past participle penthoused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with a penthouse, shelter by means of a shed sloping from a wall, or anything similar.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}