{
  "word": "impression",
  "etymologies": [
    {
      "description": [
        "From Old French impression, from Latin impressio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "impression (plural impressions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The indentation or depression made by the pressure of one object on or into another.",
                  "examples": [
                    "His head made an impression on the pillow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The overall effect of something, e.g., on a person.",
                  "examples": [
                    "He tried to make a good impression on his parents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vague recalling of an event, a belief.",
                  "examples": [
                    "I have the impression that he's already left for Paris."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An impersonation, an imitation of the mannerisms of another individual.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An outward appearance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(advertising) An online advertising performance metric representing an instance where an ad is shown once.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(painting) The first coat of colour, such as the priming in house-painting etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engraving) A print on paper from a wood block, metal plate, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) The vivid perception of something as it is experienced, in contrast to ideas or thoughts drawn from memory or the imagination.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) set of copies of a publication printed at one time having the same content, layout, pagination, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "impression (third-person singular simple present impressions, present participle impressioning, simple past and past participle impressioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To manipulate a blank key within a lock so as to mark it with impressions of the shape of the lock, which facilitates creation of a duplicate key.",
                  "examples": [
                    "The trick in impressioning a key is to remove only a small amount of the blank, by filing or cutting, from the pin positions where impressions have been left."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}