{
  "word": "coward",
  "etymologies": [
    {
      "description": [
        "From Middle English coward, from Old French coart, cuard ( > French couard), from coue (“tail”), coe + -ard (pejorative agent noun suffix); coue, coe is in turn from Latin cauda. The reference seems to be to an animal “turning tail”, or having its tail between its legs, especially a dog. Unrelated to English cower. Displaced native Old English earg."
      ],
      "adjectives": [
        {
          "description": "coward (comparative more coward, superlative most coward)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cowardly.",
                  "examples": [
                    "He rais’d the house with loud and coward cries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry, of a lion) Borne in the escutcheon with his tail doubled between his legs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "coward (plural cowards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who lacks courage.",
                  "examples": [
                    "He tortured himself to find out how he could make his declaration to her, and always halting between the fear of displeasing her and the shame of being such a coward, he wept with discouragement and desire. Then he took energetic resolutions, wrote letters that he tore up, put it off to times that he again deferred."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "coward (third-person singular simple present cowards, present participle cowarding, simple past and past participle cowarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To intimidate.",
                  "examples": [
                    "The first he coped with was their captain, whom / His sword sent headless to seek out a tomb. / This cowarded the valour of the rest,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}