{
  "word": "tuft",
  "etymologies": [
    {
      "description": [
        "From Middle English tuft, toft, tofte, an alteration of earlier *tuffe (> Modern English tuff), from Old French touffe, tuffe, toffe, tofe (“tuft”) (modern French touffe), from Late Latin tufa (“helmet crest”) (near Vegezio), from Germanic (compare Old English þūf (“tuft”), Old Norse þúfa (“mound”), Swedish tuva (“tussock; grassy hillock”)), from Proto-Germanic *þūbǭ (“tube”), *þūbaz; akin to Latin tūber (“hump, swelling”), Ancient Greek τῡ́φη (tū́phē, “cattail (used to stuff beds)”). Equivalent to tuff."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tuft (plural tufts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bunch of feathers, grass or hair, etc., held together at the base.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cluster of threads drawn tightly through upholstery, a mattress or a quilt, etc., to secure and strengthen the padding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small clump of trees or bushes.",
                  "examples": [
                    "“Not far from this place, there is a tuft of about a dozen of tall beeches  […] .”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A gold tassel on the cap worn by titled undergraduates at English universities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A person entitled to wear such a tassel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tuft (third-person singular simple present tufts, present participle tufting, simple past and past participle tufted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide or decorate with a tuft or tufts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form into tufts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To secure and strengthen (a mattress, quilt, etc.) with tufts. This hinders the stuffing from moving.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be formed into tufts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}