{
  "word": "breath",
  "etymologies": [
    {
      "description": [
        "From Middle English breeth, breth, from Old English brǣþ (“odor, scent, stink, exhalation, vapor”), from Proto-Germanic *brēþiz (“vapour, waft, exhalation, breath”) (compare German Brodem (“haze, vapor; breath”), of a different but related formation), of unknown origin; perhaps from Proto-Indo-European *gʰwer- (“smell”) or alternatively from *bʰreh₁- (“to blow; breath, vapor, steam”), but without certain Indo-European cognates outside Germanic."
      ],
      "adjectives": [
        {
          "description": "breath (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics, of a consonant or vowel) voiceless, surd; contrasting with voice (breath sounds, voice sounds)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "breath (countable and uncountable, plural breaths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act or process of breathing.",
                  "examples": [
                    "I could hear the breath of the runner behind me.",
                    "The child's breath came quickly and unevenly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A single act of breathing in or out; a breathing of air.",
                  "examples": [
                    "I took a deep breath and started the test."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Air expelled from the lungs.",
                  "examples": [
                    "I could feel the runner's breath on my shoulder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A rest or pause.",
                  "examples": [
                    "Let's stop for a breath when we get to the top of the hill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small amount of something, such as wind, or common sense.",
                  "examples": [
                    "Even with all the windows open, there is hardly a breath of air in here.",
                    "If she had a breath of common sense, she would never have spoken to the man in the first place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Fragrance; exhalation; odor; perfume.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Gentle exercise, causing a quicker respiration.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "breath (third-person singular simple present breaths, present participle breathing, simple past and past participle breathed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of breathe.",
                  "examples": [
                    "In the polar regions one finds dark cold waters with few places to breath."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}