{
  "word": "fix",
  "etymologies": [
    {
      "description": [
        "From Middle English fixen, borrowed from Old French *fixer (attested only as ficher, fichier; > English fitch), from fixe (“fastened; fixed”), from Latin fīxus (“immovable; steady; stable; fixed”), from fīgere (“to drive in; stick; fasten”), from Proto-Indo-European *dʰeygʷ- (“to jab; stick; set”). Related to dig."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fix (plural fixes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A repair or corrective action.",
                  "examples": [
                    "Hyponyms: bugfix, technofix"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A difficult situation; a quandary or dilemma; a predicament.",
                  "examples": [
                    "Synonyms: see Thesaurus:difficult situation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A single dose of a narcotic drug, especially when injected.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prearrangement of the outcome of a supposedly competitive process, such as a sporting event, a game, an election, a trial, or a bid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A determination of location.",
                  "examples": [
                    "We have a fix on your position."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) fettlings (mixture used to line a furnace)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fix (third-person singular simple present fixes, present participle fixing, simple past and past participle fixt or fixed)",
          "definitionGroups": [
            {
              "group": "(transitive, obsolete) To pierce; now generally replaced by transfix.",
              "entries": [
                {
                  "meaning": "(transitive, by extension) (Of a piercing look) to direct at someone.",
                  "examples": [
                    "He fixed me with a sickly grin, and said, \"I told you it wouldn't work!\""
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To attach; to affix; to hold in place or at a particular time.",
              "entries": [
                {
                  "meaning": "(transitive, figuratively, usually in the passive) To focus or determine (oneself, on a concept); to fixate.",
                  "examples": [
                    "She's fixed on the idea of becoming a doctor."
                  ]
                },
                {
                  "meaning": "(transitive, chess) To prevent enemy pawns from advancing by directly opposing the most advanced one with one of one's own pawns so as to threaten to capture any advancing backward pawns.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mend, to repair.",
                  "examples": [
                    "That heater will start a fire if you don't fix it.",
                    "You can't fix stupid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To prepare (food or drink).",
                  "examples": [
                    "She fixed dinner for the kids."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (a contest, vote, or gamble) unfair; to privilege one contestant or a particular group of contestants, usually before the contest begins; to arrange immunity for defendants by tampering with the justice system via bribery or extortion.",
                  "examples": [
                    "A majority of voters believed the election was fixed in favor of the incumbent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, informal) To surgically render an animal, especially a pet, infertile.",
                  "examples": [
                    "Rover stopped digging under the fence after we had the vet fix him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mathematics, semantics) To map a (point or subset) to itself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To take revenge on, to best; to serve justice on an assumed miscreant.",
                  "examples": [
                    "He got caught breaking into lockers, so a couple of guys fixed him after work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To render (a photographic impression) permanent by treating with such applications as will make it insensitive to the action of light.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chemistry, biology) To convert into a stable or available form.",
                  "examples": [
                    "Legumes are valued in crop rotation for their ability to fix nitrogen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become fixed; to settle or remain permanently; to cease from wandering; to rest.",
                  "examples": [
                    "Accuſing ſome malignant Star,Not Britain, for that fateful War,Your kindneſs baniſhes your fear,Reſolv’d to fix for ever here."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become firm, so as to resist volatilization; to cease to flow or be fluid; to congeal; to become hard and malleable, as a metallic substance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, intransitive) To shoot; to inject a drug.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}