{
  "word": "correct",
  "etymologies": [
    {
      "description": [
        "Borrowed from French correct, from Latin correctus (“improved, amended, correct”), past participle of corrigere, conrigere (“to make straight, make right, make better, improve, correct”), from com- (“together”) + combining form of regō, regere (“I rule, make straight”)."
      ],
      "adjectives": [
        {
          "description": "correct (comparative more correct, superlative most correct)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from error; true; accurate.",
                  "examples": [
                    "Your test was completely correct, you get 10 out of 10",
                    "We all agreed they'd made the correct decision."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With good manners; well behaved; conforming with accepted standards of behaviour.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "correct (plural corrects)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A correct response.",
                  "examples": [
                    "Having each day's rates of corrects and incorrects written next to the graph also makes it easier for you to check the  […]  If you also have students count problems incorrect, calling them “not yets,” or “learning opportunities,” or  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English correcten, borrowed from Anglo-Norman correcter, from Latin correctus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "correct (third-person singular simple present corrects, present participle correcting, simple past and past participle corrected)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make something that was wrong become right; to remove error from.",
                  "examples": [
                    "You'll need to correct your posture if you're going to be a professional dancer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, transitive) To grade (examination papers).",
                  "examples": [
                    "The teacher stayed up all night correcting exams."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To inform (someone) of their error.",
                  "examples": [
                    "It's rude to correct your parents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To discipline; to punish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}