{
  "word": "thug",
  "etymologies": [
    {
      "description": [
        "From Hindi ठग (ṭhag, “swindler, fraud, cheat”), from Ashokan Prakrit *𑀞𑀕𑁆𑀕𑁆- (*ṭhagg-), from Sanskrit स्थग (sthaga, “cunning, fraudulent, to cover, to conceal”) hence स्थगति (sthagati, “he/she/it covers, he/she/it conceals”), from Proto-Indo-Aryan *stʰagáti.",
        "Thuggee was an Indian network of secret fraternities who were engaged in murdering and robbing travellers and known for strangling their victims, operating from the 17th century (possibly as early as 13th century) to the 19th century. During British Imperial rule of India, many Indian words passed into common English, and in 1810 thug referred to members of these Indian gangs. The sense was adopted more generally as \"ruffian, cutthroat\" by 1839. See also English thatch, deck."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thug (plural thugs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone with an intimidating and unseemly appearance and mannerisms, who treats others violently and roughly, often for hire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) One of a band of assassins formerly active in northern India who worshipped Kali and offered their victims to her.",
                  "examples": [
                    "Synonym: phansigar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) An over-vigorous plant that spreads and dominates the flowerbed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A punk; a hoodlum; a hooligan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden bat used in the game of miniten, fitting around the player's hand.",
                  "examples": [
                    "I pushed up out of my chaise and headed for the miniten court. Leah handed me her thug as I walked past her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular) One who, usually as a result of social disadvantage, has turned to committing crimes (e.g. selling drugs, robbery, assault, etc.) to make a living; a gangsta.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "thug (third-person singular simple present thugs, present participle thugging, simple past and past participle thugged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To commit acts of thuggery, to live the life of a thug, or to dress and act in a manner reminiscent of someone who does.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}