{
  "word": "thirst",
  "etymologies": [
    {
      "description": [
        "From Middle English thirst, thurst, from Old English þurst, from Proto-West Germanic *þurstu, from Proto-Germanic *þurstuz, from Proto-Indo-European *ters- (“dry”).",
        "Germanic cognates include Old High German thurst, Middle High German durst, German Durst, Old Saxon thurst, Old Dutch thursti, Middle Dutch dorst, dorste, Dutch dorst, Old Norse þorsti (Swedish törst, Icelandic þorsti, Danish tørst, Norwegian tørst). Indo-European cognates include Ancient Greek τέρσομαι (térsomai), Albanian djersë (“sweat”), Sanskrit तृष्णा (tṛṣṇā, “desire; thirst”), Sanskrit तृष्यति (tṛ́ṣyati), Latin terra, Latin torridus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thirst (countable and uncountable, plural thirsts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sensation of dryness in the throat associated with a craving for liquids, produced by deprivation of drink, or by some other cause (such as fear, excitement, etc.) which stops the secretion of the pharyngeal mucous membrane.",
                  "examples": [
                    "We developed quite a thirst during our hike.",
                    "He had quite a thirst on and so headed to his favourite Dublin pub."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The condition producing the sensation of thirst.",
                  "examples": [
                    "If you go out in the desert for long without water, the thirst can drive you mad."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A want and eager desire (for something); a craving or longing.",
                  "examples": [
                    "She had a real thirst for news and that greatly helped her career."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Sexual lust.",
                  "examples": [
                    "He had a thirst for her and she had the same for him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "thirst (third-person singular simple present thirsts, present participle thirsting, simple past and past participle thirsted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be thirsty.",
                  "examples": [
                    "The people thirsted there for water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, usually followed by \"for\") To desire vehemently.",
                  "examples": [
                    "I thirst for knowledge and education will sate me.to be thirsted for one's blood"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}