{
  "word": "toast",
  "etymologies": [
    {
      "description": [
        "From Middle English tost, from the verb tosten (see below)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "toast (countable and uncountable, plural toasts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Toasted bread.",
                  "examples": [
                    "I ate a piece of toast for breakfast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A proposed salutation (e.g. to say \"cheers\") while drinking alcohol.",
                  "examples": [
                    "At the reception, there were many toasts from the well-wishers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A person, group, or notable object to which a salutation with alcohol is made; a person or group held in similar esteem.",
                  "examples": [
                    "He was the toast of high society."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly US, uncountable) Something that will be no more; something subject to impending destruction, harm or injury.",
                  "examples": [
                    "If I ever get my hands on the guy that stole my wallet, he’s toast!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Jamaica) Extemporaneous narrative poem or rap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, graphical user interface) A transient, informational unclickable pop-up overlay, less interactive than a snackbar.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English tosten, from Old French toster (“to roast, grill”), from Latin tostus (“grilled, burnt”), from verb torreō (“to burn, grill”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "toast (third-person singular simple present toasts, present participle toasting, simple past and past participle toasted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lightly cook by browning via direct exposure to a fire or other heat source.",
                  "examples": [
                    "We liked to toast marshmallows around the campfire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To grill, lightly cook by browning specifically under a grill or in a toaster",
                  "examples": [
                    "Top with cheese and toast under the grill for a few minutes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To engage in a salutation and/or accompanying raising of glasses while drinking alcohol in honor of someone or something.",
                  "examples": [
                    "We toasted the happy couple many times over the course of the evening."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To warm thoroughly.",
                  "examples": [
                    "I toasted my feet by the fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Jamaica) To perform extemporaneous narrative poem or rap.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}