{
  "word": "paddle",
  "etymologies": [
    {
      "description": [
        "Partly from the verb paddle (\"to splash, dabble\"; see below) and partly from Middle English padell (“small spade”).\nMiddle English padell is from Medieval Latin padela, itself of uncertain origin: perhaps an alteration of Middle English *spaddle (see also spaddle), a diminutive of spade; or from Latin patella (“pan, plate”), the diminutive of patina, or a merger of the two. Compare Ancient Greek πηδάλιον (pēdálion, “rudder, steering oar”), derived from πηδός (pēdós, “the blade of an oar; an oar”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "paddle (countable and uncountable, plural paddles)",
          "definitionGroups": [
            {
              "group": "A two-handed implement consisting of a shaft with one or two blades attached to the end(s) used to propel a canoe, kayak or a small boat. A paddle is unattached to the boat and freely operated with the hands, compared with an oar which is attached to the boat at a pivot point.",
              "entries": [
                {
                  "meaning": "A single-bladed version is typically used on canoes and some other small boats.",
                  "examples": []
                },
                {
                  "meaning": "A double-bladed version with blades at each end of the shaft is used for kayaking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The use of a paddle to propel a boat; a session of paddling.",
                  "examples": [
                    "We had a nice paddle this morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slat of a paddleboat's wheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A paddlewheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blade of a waterwheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, dated) A game controller with a round wheel used to control player movement along one axis of the video screen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A meandering walk or dabble through shallow water, especially at the seaside.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kitchen utensil shaped like a paddle and used for mixing, beating etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broad, flat spanking implement.",
                  "examples": [
                    "The paddle practically ousted the British cane for spankings in the independent US."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ping pong) A broad, flat device used in striking the ball, analogous to a racket in tennis.",
                  "examples": [
                    "Synonyms: racket, bat (UK)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat board with a number of holes or indentations, used to carry small alcoholic drinks such as shots.",
                  "examples": [
                    "And it really is a paddle, too, with a blade big enough to hold several sampling glasses of different beers (known for some reason as a 'flight') for customers to try. Beer paddles have become very popular in American craft beer bars:  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat limb of an aquatic animal, adapted for swimming.",
                  "examples": [
                    "A sea turtle's paddles make it swim almost as fast as land tortoises are slow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a sluice, a panel that controls the flow of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A handheld electrode used for defibrillation or cardioversion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A person's hand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A flap of attached skin that has been cut away from a wound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, uncountable) Alternative form of padel",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "paddle (third-person singular simple present paddles, present participle paddling, simple past and past participle paddled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To propel something through water with a paddle, oar, hands, etc.",
                  "examples": [
                    "while paddling ducks the standing lake desire"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To row a boat with less than one's full capacity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spank with a paddle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pat or stroke amorously or gently.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To tread upon; to trample.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Recorded since 1530, probably cognate with Low German paddeln (“to tramp about”), frequentative form of padjen (“to tramp, run in short steps”), from pad (also in Dutch dialects). Compare also Saterland Frisian paddelje (“to paddle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "paddle (third-person singular simple present paddles, present participle paddling, simple past and past participle paddled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Britain) To walk or dabble playfully in shallow water, especially at the seaside.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dog paddle in water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To toddle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, intransitive) To toy or caress using hands or fingers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}