{
  "word": "intonate",
  "etymologies": [
    {
      "description": [
        "Latin intonatus, past participle of intonare (“to thunder, resound”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "intonate (third-person singular simple present intonates, present participle intonating, simple past and past participle intonated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, dated) To intone or recite (words), especially emphatically or in a chanting manner.",
                  "examples": [
                    "[…]  we have no doubt whatever that the recitation of verse on the stage was of an artificial and semi-musical character. It was undoubtedly much more sustained and intonated with a slow and measured stateliness, which, whilst harmonizing it with the other circumstances of solemnity in Greek tragedy, would bring it nearer to music."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To say or speak with a certain intonation.",
                  "examples": [
                    "“Is this Mr. O’Connor’s chamber?” inquired a voice of peculiar richness, intonated not unpleasingly with a certain melodious modification of the brogue  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To intone or vocalize (musical notes); to sound the tones of the musical scale; to practise the sol-fa.",
                  "examples": [
                    "The composer so ordered it, that the king’s part should be one holding note, in a pitch proper for a Contratenor, for that was the king’s voice. Nor was he inattentive to other particulars, for he contrived his own part, which was the Bass, in such a manner, that every other note he sung was an octave to that of the king, which prevented his majesty from deviating from that single note which he was to intonate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To thunder or to utter in a sonorous or thunderous voice.",
                  "examples": [
                    "But agaynst all such as contemne the holy scriptures & cast awaye the law of theyr LORDE God, wyllynge neither to enter them selues, nor yet suffryng other, christ intonateth and thonderethe on this manner  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}