{
  "word": "venom",
  "etymologies": [
    {
      "description": [
        "From Middle English venum, venym, etc., from Anglo-Norman venum, venim, venime, etc., from Old French venim, venin, etc., from Vulgar Latin *venīmen (“venom”), from Latin venēnum (“juice; venom”), from Proto-Italic *weneznom (“lust, desire”), from Proto-Indo-European *wenh₁- (“to strive, wish, love”); see also Sanskrit वनति (vanati, “gain, wish, lust”) and Latin Venus (“Roman goddess of love”). Doublet of venin and venene."
      ],
      "adjectives": [
        {
          "description": "venom (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Poisonous, poisoned; (figuratively) pernicious.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "venom (countable and uncountable, plural venoms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An animal toxin intended for offensive use, a biological poison delivered by bite, sting, etc. to protect an animal or to kill its prey.",
                  "examples": [
                    "The serious artist  […]  [is] obsessed by his material; it’s like a venom working in his blood and the art is the antidote."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Feeling or speech marked by spite or malice; vitriol.",
                  "examples": [
                    "[…]  as I was feasting my jaundiced eye one morning with a certain newspaper, which I was in the habit of employing as the vehicle of my venom, I was startled at discovering myself conspicuously pointed out in an angry column as a cowardly defamer  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "venom (third-person singular simple present venoms, present participle venoming, simple past and past participle venomed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To infect with venom; to envenom; to poison.",
                  "examples": [
                    "[…]  washe all the filth away with warme water, and annoynte the place with Hony and Fytch flower myngled together. But beware you touche none of the kirnelles with your bare finger, for feare of venoming the place, which is very apt for a Fistula to breede in."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}