{
  "word": "crocodile",
  "etymologies": [
    {
      "description": [
        "From Middle English cocodrill, cokadrill, cokedril, from Old French cocodril (modern French crocodile), from Medieval Latin cocodrillus, from Latin crocodilus, from Ancient Greek κροκόδειλος (krokódeilos). The word was later refashioned after the Latin and Greek forms. Doublet of krokodil."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crocodile (plural crocodiles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the predatory amphibious reptiles of the family Crocodylidae; (loosely) a crocodilian, any species of the order Crocodilia, which also includes the alligators, caimans and gavials.",
                  "examples": [
                    "Industrial and rural expansion is shrinking and destroying the Nile crocodile's natural habitat. The Nile crocodiles, in particular, have been a source of highly durable leather for a variety of products which can be crafted and manufactured."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long line or procession of people (especially children) walking together.",
                  "examples": [
                    "Sometimes the kids from the slap-up boys' schools in Eastbourne used to be led round in crocodiles to hand out fags and peppermint creams to the 'wounded Tommies', as they called us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) A fallacious dilemma, mythically supposed to have been first used by a crocodile.",
                  "examples": [
                    "We have seen syllogisms, crocodiles, enthymemas, sorites, &c. explained and tried upon a boy of nine or ten years old in playful conversation […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crocodile (third-person singular simple present crocodiles, present participle crocodiling, simple past and past participle crocodiled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To speak one's native language at an Esperanto-language gathering, rather than Esperanto.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}