{
  "word": "skirt",
  "etymologies": [
    {
      "description": [
        "From Middle English skyrte, from Old Norse skyrta, from Proto-Germanic *skurtijǭ. Doublet of shirt. Cognate with Saterland Frisian Skoarte (“apron”), Dutch schort (“apron”), German Schürze (“apron”), Danish skørt (“skirt”), Swedish skört (“hem of a jacket”), Norwegian skjørt (“skirt”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skirt (plural skirts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An article of clothing, usually worn by women and girls, that hangs from the waist and covers the lower part of the body.",
                  "examples": [
                    "\"I like purple best,\" said Maida. \"And old Schlegel has promised to make it for $8. It's going to be lovely. I'm going to have a plaited skirt and a blouse coat trimmed with a band of galloon under a white cloth collar with two rows of—\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a dress or robe, etc., that hangs below the waist.",
                  "examples": [
                    "The petticoats and skirts ordinarily worn are decidedly the heaviest part of the dress ; hence it is necessary that some reform should be effected in these."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose edging to any part of a dress.",
                  "examples": [
                    "A narrow lace, or a small skirt of fine ruffled linen, which runs along the upper part of the stays before, and crosses the breast, being a part of the tucker, is called the modesty piece."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A petticoat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang) A woman.",
                  "examples": [
                    "\"Mate,\" said the Cockney, after we'd finished about half the bottle, \"it comes to me that we're a couple o' blightin' idjits to be workin' for a skirt.\"",
                    "\"What d'ya mean?\" I asked, taking a pull at the bottle.",
                    "\"Well, 'ere's us, two red-blooded 'e-men, takin' orders from a lousy little frail, 'andin' the swag h'over to 'er, and takin' wot she warnts to 'and us, w'en we could 'ave the 'ole lot. Take this job 'ere now--\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, colloquial) Women collectively, in a sexual context.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, colloquial) Sexual intercourse with a woman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Border; edge; margin; extreme part of anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The diaphragm, or midriff, in animals",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "skirt (third-person singular simple present skirts, present participle skirting, simple past and past participle skirted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be on or form the border of.",
                  "examples": [
                    "The plain was skirted by rows of trees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move around or along the border of; to avoid the center of.",
                  "examples": [
                    "skirt a mountain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover with a skirt; to surround.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To avoid or ignore (something); to manage to avoid (something or a problem); to skate by (something).",
                  "examples": [
                    "He skirted the issue of which parties to attend by staying at home instead."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}