{
  "word": "temple",
  "etymologies": [
    {
      "description": [
        "From Middle English temple, from Old English templ, tempel, borrowed from Latin templum (“shrine, temple, area for auspices”). Compare Old High German tempal (“temple”), also a borrowing from the Latin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "temple (plural temples)",
          "definitionGroups": [
            {
              "group": "A house of worship, especially:",
              "entries": [
                {
                  "meaning": "A house of worship dedicated to a polytheistic faith.",
                  "examples": [
                    "The temple of Zeus was very large."
                  ]
                },
                {
                  "meaning": "(Judaism) Synonym of synagogue, especially a non-Orthodox synagogue.",
                  "examples": [
                    "How often do you go to temple?"
                  ]
                },
                {
                  "meaning": "(Mormonism) As opposed to an LDS meetinghouse, a church closed to non-Mormons and necessary for particular rituals.",
                  "examples": []
                },
                {
                  "meaning": "(in Japan) A Buddhist monastery, as opposed to a Shinto shrine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A meeting house of the Oddfellows fraternity; its members.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any place regarded as holding a religious presence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any place seen as an important centre for some activity.",
                  "examples": [
                    "a temple of commerce; a temple of drinking and dining"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Anything regarded as important or minutely cared for.",
                  "examples": [
                    "My body is my temple."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A gesture wherein the forefingers are outstretched and touch pad to pad while the other fingers are clasped together.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "temple (third-person singular simple present temples, present participle templing, simple past and past participle templed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To build a temple for; to appropriate a temple to; to temple a god",
                  "examples": [
                    "though the Heathen (in many places) Templed and adored this drunken God"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English temple, from Old French temple, from Vulgar Latin *temp(u)la, from Latin tempora (“the temples”), plural of tempus (“temple, head, face”). See temporal bone."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "temple (plural temples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The slightly flatter region, on either side of the human head, behind of the eye and forehead, above the zygomatic arch, and forward of the ear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ophthalmology) Either of the sidepieces on a set of spectacles, extending backwards from the hinge toward the ears and, usually, turning down around them.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Latin templum (“a small timber, a purlin”); compare templet and template."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "temple (plural temples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving) A contrivance used in a loom for keeping the web stretched transversely.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}