{
  "word": "gaudy",
  "etymologies": [
    {
      "description": [
        "From Middle English gaudi, from Old French gaudie, from Medieval Latin gaudia. equivalent to gaud (“ornament, trinket”) +‎ -y.",
        "Alternatively, from Middle English gaudi, gawdy (“yellowish”), from Old French gaude, galde (“weld (the plant)”), from Frankish *walda, from Proto-Germanic *walþō, *walþijō, akin to Old English *weald, *wielde (>Middle English welde, wolde and Anglo-Latin walda (“alum”)), Middle Low German wolde, Middle Dutch woude. More at English weld.",
        "A common claim that the word derives from Antoni Gaudí, designer of Barcelona's Sagrada Família Basilica, is incorrect: the word was in use centuries before Gaudí was born."
      ],
      "adjectives": [
        {
          "description": "gaudy (comparative gaudier, superlative gaudiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Very showy or ornamented, now especially when excessive, or in a tasteless or vulgar manner.",
                  "examples": [
                    "Gaudy jewellery might offend some people's sense of style. But former heavyweight champion and grilling-machine entrepreneur George Foreman is philosophical about today's craze for bling-bling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Fun; merry; festive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "gaudy (plural gaudies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) One of the large beads in the rosary at which the paternoster is recited.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Latin gaudium (“joy”). Doublet of joy and jo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gaudy (plural gaudies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Oxford University) A reunion held by one of the colleges of the University of Oxford for alumni, normally held during the long vacation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}