{
  "word": "law",
  "etymologies": [
    {
      "description": [
        "From Middle English lawe, laȝe, from Old English lagu (“law”), borrowed from Old Norse lǫg (“law”, literally “things laid down or firmly established”), originally the plural of lag (“layer, stratum, a laying in order, measure, stroke”), from Proto-Germanic *lagą (“that which is laid down”), from Proto-Indo-European *legʰ- (“to lie”). Cognate with Scots law (“law”), Icelandic lög (“things laid down, law”), Faroese lóg (“law”), Norwegian lov (“law”), Swedish lag (“law”), Danish lov (“law”). Replaced Old English ǣ and ġesetnes. More at lay.",
        "Not related to legal, nor to French loi, Spanish ley, all of which ultimately derive from Latin lēx, from Proto-Indo-European *leǵ- (“to gather”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "law (countable and uncountable, plural laws)",
          "definitionGroups": [
            {
              "group": "(usually with \"the\") The body of binding rules and regulations, customs, and standards established in a community by its legislative and judicial authorities.",
              "entries": [
                {
                  "meaning": "The body of such rules that pertain to a particular topic.",
                  "examples": [
                    "property law",
                    "commercial hunting and fishing law"
                  ]
                },
                {
                  "meaning": "Common law, as contrasted with equity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A binding regulation or custom established in a community in this way.",
                  "examples": [
                    "There is a law against importing wallabies.",
                    "A new law forbids driving on that road.",
                    "The court ruled that the executive order was not law and nullified it."
                  ]
                }
              ]
            },
            {
              "group": "(more generally) A rule, such as:",
              "entries": [
                {
                  "meaning": "Any rule that must or should be obeyed, concerning behaviours and their consequences. (Compare mores.)",
                  "examples": [
                    "\"Do unto others as you wish them to do unto you\" is a good law to follow.",
                    "the law of self-preservation"
                  ]
                },
                {
                  "meaning": "A rule or principle regarding the construction of language or art.",
                  "examples": [
                    "the laws of playwriting and poetry"
                  ]
                },
                {
                  "meaning": "A statement (in physics, etc) of an (observed, established) order or sequence or relationship of phenomena which is invariable under certain conditions. (Compare theory.)",
                  "examples": [
                    "Synonyms: see Thesaurus:law of nature"
                  ]
                },
                {
                  "meaning": "(mathematics, logic) A statement (of relation) that is true under specified conditions; a mathematical or logical rule.",
                  "examples": [
                    "Mathematical laws can be proved purely through mathematics, without scientific experimentation."
                  ]
                },
                {
                  "meaning": "Any statement of the relation of acts and conditions to their consequences.",
                  "examples": [
                    "the law of scarcity",
                    "the law of supply and demand"
                  ]
                },
                {
                  "meaning": "(linguistics) A sound law; a regular change in the pronunciation of a language.",
                  "examples": [
                    "Grimm's law",
                    "Dahl's law"
                  ]
                },
                {
                  "meaning": "(cricket) One of the official rules of cricket as codified by the its (former) governing body, the MCC.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The control and order brought about by the observance of such rules.",
                  "examples": [
                    "They worked to maintain law and order.",
                    "It was a territory without law, marked by violence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A person or group that act(s) with authority to uphold such rules and order (for example, one or more police officers).",
                  "examples": [
                    "Here comes the law — run!",
                    "then the law arrived on the scene"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The profession that deals with such rules (as lawyers, judges, police officers, etc).",
                  "examples": [
                    "He is studying for a career in law.",
                    "She has practiced law in New York for twenty years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Jurisprudence, the field of knowledge which encompasses these rules.",
                  "examples": [
                    "She went to university to study law."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Litigation; legal action (as a means of maintaining or restoring order, redressing wrongs, etc).",
                  "examples": [
                    "They were quick to go to law."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now uncommon) An allowance of distance or time (a head start) given to a weaker (human or animal) competitor in a race, to make the race more fair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A mode of operation of the flight controls of a fly-by-wire aircraft.",
                  "examples": [
                    "normal law; alternate law; direct law"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fantasy) One of two metaphysical forces ruling the world in some fantasy settings, also called order, and opposed to chaos.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, chiefly historical) An oath sworn before a court, especially disclaiming a debt. (Chiefly in the phrases \"wager of law\", \"wage one's law\", \"perform one's law\", \"lose one's law\".)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "law (third-person singular simple present laws, present participle lawing, simple past and past participle lawed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To work as a lawyer; to practice law.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, chiefly dialectal) To prosecute or sue (someone), to litigate.",
                  "examples": [
                    "Your husband's [...] so given to lawing, they say. I doubt he'll leave you poorly off when he dies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard) To rule over (with a certain effect) by law; to govern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To enforce the law.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To subject to legal restrictions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lawe, from Old English hlāw (“burial mound”). Also spelled low."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "law (plural laws)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A tumulus of stones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England, Scotland, archaic) A hill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lagh, from Old Norse lag (“that which is lying or laid, position, price, way, sting, blow”), from Proto-Germanic *lagą (“that which is laid”). Cognate with Scots lauch (“one's tavern-reckoning or one's share of the cost, a score; a payment for drink or entertainment”), Middle English lai (“one's share of expenses, one's bill or account”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "law (plural laws)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal or obsolete) A score; share of expense; legal charge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Compare la and Lawd."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Etymology in ODS"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}