{
  "word": "streamer",
  "etymologies": [
    {
      "description": [
        "From Middle English stremer, stremere, equivalent to stream +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "streamer (plural streamers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, narrow flag, or piece of material used or seen as a decoration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Strips of paper or other material used as confetti.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) A newspaper headline that runs along the top of a page.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A data storage system, mainly used to produce backups, in which large quantities of data are transferred to a continuously moving tape; a tape drive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(networking) Any mechanism for streaming data.",
                  "examples": [
                    "However, integration of a bandwidth estimation algorithm into an adaptive video streamer is not an easy task. Firstly, bandwidth estimation requires sending extra burst packets that brings a considerable overhead into the system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, Internet) A subscription streaming service.",
                  "examples": [
                    "Coordinate term: broadcaster"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A person who streams activities on their computer (especially video gaming) to a live online audience.",
                  "examples": [
                    "Most streamers are on Twitch",
                    "Hypernym: creator"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) In fly fishing, a variety of wet fly designed to mimic a minnow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) One who searches for stream tin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stream or column of light shooting upward from the horizon, constituting one of the forms of the aurora borealis.",
                  "examples": [
                    "While overhead the North's dumb streamers shoot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, education, in combination) A pupil belonging to a particular stream (division by perceived ability).",
                  "examples": [
                    "Since he also demonstrated that the A-streamers in his sample showed enhancement of measured intelligence over their primary school careers while the B-streamers showed deterioration, it can be seen what a far-reaching effect such decisions may have had upon child performance."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}