{
  "word": "cloister",
  "etymologies": [
    {
      "description": [
        "Recorded since about 1300 as Middle English cloistre, borrowed from Old French cloistre, clostre, or via Old English clauster, both from Medieval Latin claustrum (“portion of monastery closed off to laity”), from Latin claustrum (“place shut in, bar, bolt, enclosure”), a derivation of the past participle of claudere (“to close”). Doublet of claustrum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cloister (plural cloisters)",
          "definitionGroups": [
            {
              "group": "A covered walk with an open colonnade on one side, running along the walls of buildings that face a quadrangle; especially:",
              "entries": [
                {
                  "meaning": "such an arcade in a monastery;",
                  "examples": []
                },
                {
                  "meaning": "such an arcade fitted with representations of the stages of Christ's Passion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place, especially a monastery or convent, devoted to religious seclusion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The monastic life.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cloister (third-person singular simple present cloisters, present participle cloistering, simple past and past participle cloistered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become a Roman Catholic religious.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To confine in a cloister, voluntarily or not.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To deliberately withdraw from worldly things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with a cloister or cloisters.",
                  "examples": [
                    "The architect cloistered the college just like the monastery which founded it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To protect or isolate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}