{
  "word": "flip",
  "etymologies": [
    {
      "description": [
        "Alteration of earlier fillip, from Middle English filippen (“to make a signal or sound with thumb and right forefinger, snap the fingers”), an attenuated variation of flappen (“to flap, clap, slap, strike”). Cognate with Dutch flappen (“to flap”), German flappen (“to flap”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flip (countable and uncountable, plural flips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A maneuver which rotates an object end over end.",
                  "examples": [
                    "We'll decide this on a flip of a coin.",
                    "The diver did a couple of flips before landing in the pool."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A complete change of direction, decision, movement etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A fillip or light blow.",
                  "examples": [
                    "[…]  who looked at Dean a moment, crossed over the stage to him, raised himself on his toes, dashed his own hat firmly down to his ears, and every one on the stage supposed Dean was about to receive a flip on the ear or nose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A whit or jot; the tiniest amount.",
                  "examples": [
                    "I don't care a flip for what he says."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A slingshot.",
                  "examples": [
                    "He loaded his flip and took careful aim at what he considered to be Emily's most vulnerable spot  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hairstyle popular among boys in the 1960s–70s and 2000s–10s, in which the hair goes halfway down the ears, at which point it sticks out",
                  "examples": [
                    "Justin Bieber and Zac Efron are among the celebrities who wore a flip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) The purchase of an asset (usually a house) which is then improved and sold quickly for profit.",
                  "examples": [
                    "What they bring to the table is hard-won brass-tacks knowledge from over fifteen years of personal investing as well as riding shotgun on over 1,000 flips with their clients."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms, uncountable) The tendency of a gun's barrel to jerk about at the moment of firing.",
                  "examples": [
                    "In the case of rifles flip is counteracted by the sighting of the weapons, and it is because of flip that the sights cannot be set so that the line of sight is exactly parallel to the axis of the bore."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flip (third-person singular simple present flips, present participle flipping, simple past and past participle flipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To throw so as to turn over.",
                  "examples": [
                    "Synonyms: turn, turn over",
                    "You need to flip the pancake onto the other side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put into a quick revolving motion through a snap of the thumb and index finger.",
                  "examples": [
                    "Synonym: toss",
                    "If you can't decide which option to go for, flip a coin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US politics) To win a state (or county) won by another party in the preceding elections.",
                  "examples": [
                    "Wisconsin had been Democratic for decades, but the Republicans flipped it in 2016."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US) To turn state's evidence; to agree to testify against one's co-conspirators in exchange for concessions from prosecutors.",
                  "examples": [
                    "The mafioso flipped on his superiors to get a lighter sentence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US) To induce someone to turn state's evidence; to get someone to agree to testify against their co-conspirators in exchange for concessions.",
                  "examples": [
                    "The district attorney was able to strengthen his case against the bank robber by flipping the getaway driver."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To go berserk or crazy.",
                  "examples": [
                    "I'd flip if anyone broke my phone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To buy an asset (usually a house), improve it and sell it quickly for profit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, finance, slang) To refinance (a loan), accruing additional fees.",
                  "examples": [
                    "The bill makes it illegal to encourage borrowers to repeatedly refinance, or \"flip,\" a loan primarily to collect more fees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To invert a bit (binary digit), changing it from 0 to 1 or from 1 to 0.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To hand over or pass along.",
                  "examples": [
                    "\"Flip me the details, and I'll have a sneaky beaky round for you.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To switch to another task, etc.",
                  "examples": [
                    "I flipped from the calendar app to the email app and logged in to view Cooper's. The unreads were staggering; I'd have to triage them later."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Apparently a euphemism for fuck."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of flippant"
      ],
      "adjectives": [
        {
          "description": "flip (comparative flipper, superlative flippest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, informal) Having the quality of playfulness, or lacking seriousness of purpose.",
                  "examples": [
                    "I hate to be flip, but perhaps we could steal a Christmas tree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sarcastic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Disrespectful, flippant.",
                  "examples": [
                    "Don't get flip with me or I'll knock you into next Tuesday!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Compare English dialect flip (“nimble, flippant, also, a slight blow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flip (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mixture of beer, spirit, etc., stirred and heated by a hot iron (a \"flip dog\").",
                  "examples": [
                    "I frequently took of large potations, though not of champagne certainly, but port, strong ales, and punch, and when our funds were low as sometimes happened, hot flip  […] ."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}