{
  "word": "wean",
  "etymologies": [
    {
      "description": [
        "From Middle English wenen, from Old English wenian (“to accustom; habituate; train; prepare; make fit”), from Proto-Germanic *wanjaną (“to make wont; accustom”), from Proto-Indo-European *wenh₁- (“to strive for; wish; love”). Cognate with Dutch wennen, German gewöhnen, Danish vænne, Swedish vänja, Icelandic venja. Related via PIE to wone, wont, and wonder, and perhaps win."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wean (third-person singular simple present weans, present participle weaning, simple past and past participle weaned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cease giving breast milk to an offspring; to accustom and reconcile (a child or young animal) to a want or deprivation of mother's milk; to take from the breast or udder.",
                  "examples": [
                    "The cow has weaned her calf."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To cease to depend on the mother's milk for nutrition.",
                  "examples": [
                    "The kittens are finally weaning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension, normally \"wean off\") To cause to quit something to which one is addicted, dependent, or habituated.",
                  "examples": [
                    "He managed to wean himself off heroin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, by extension) To cease to depend.",
                  "examples": [
                    "She is weaning from her addiction to tobacco."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension, obsolete) To raise, to help grow toward maturity",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Scots wean (literally “wee one”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wean (plural weans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Ulster) A small child.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}