{
  "word": "take",
  "etymologies": [
    {
      "description": [
        "From Middle English taken (“to take, lay hold of, grasp, strike”), from Old English tacan (“to grasp, touch”), of North Germanic origin, from Old Norse taka (“to touch, take”), from Proto-Germanic *tēkaną (“to touch”), from pre-Germanic *deh₁g- (“to touch”), possibly a phonetically altered form of Proto-Indo-European *teh₂g- (“to touch, take”) (see there for more). Gradually displaced Middle English nimen (\"to take\"; see nim), from Old English niman (“to take”). Cognate with Icelandic and Norwegian Nynorsk taka (“to take”), Norwegian Bokmål ta (“to take”), Swedish ta (“to take”), Danish tage (“to take, seize”), Middle Dutch taken (“to grasp”), Dutch taken (“to take; grasp”), Middle Low German tacken (“to grasp”). Compare tackle. Unrelated to Lithuanian tèkti (“to receive, be granted”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "take (plural takes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The or an act of taking.",
                  "examples": [
                    "The 1994 Amendments address the incidental take of marine mammals in the course of commercial fishing, not the direct lethal take of pinnipeds for management purposes."
                  ]
                }
              ]
            },
            {
              "group": "Something that is taken; a haul.",
              "entries": [
                {
                  "meaning": "Money that is taken in, (legal or illegal) proceeds, income; (in particular) profits.",
                  "examples": [
                    "Money is still the main answer: Almost all prominent climate deniers are on the fossil-fuel take."
                  ]
                },
                {
                  "meaning": "The or a quantity of fish, game animals or pelts, etc which have been taken at one time; catch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An interpretation or view, opinion or assessment; perspective; a statement expressing such a position.",
                  "examples": [
                    "What's your take on this issue, Fred?",
                    "Another unsolicited maths take: talking about quotients in terms of \"equivalence classes\" or cosets is really unnatural."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An approach, a (distinct) treatment.",
                  "examples": [
                    "a new take on a traditional dish"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) A scene recorded (filmed) at one time, without an interruption or break; a recording of such a scene.",
                  "examples": [
                    "It's a take.",
                    "Act seven, scene three, take two."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A recording of a musical performance made during an uninterrupted single recording period.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A visible (facial) response to something, especially something unexpected; a facial gesture in response to an event.",
                  "examples": [
                    "did a double-take and then a triple-take",
                    "I did a take when I saw the new car in the driveway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An instance of successful inoculation/vaccination.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby, cricket) A catch of the ball (in cricket, especially one by the wicket-keeper).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) The quantity of copy given to a compositor at one time.",
                  "examples": [
                    "A take usually consists of a little more than a stickful of matter, but it varies sometimes, for if a new paragraph occurs it is not overlooked. These takes are carefully numbered, and a list is kept of the compositors who take the several pieces."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "take (third-person singular simple present takes, present participle taking, simple past took, past participle taken or (archaic or Scotland) tane)",
          "definitionGroups": [
            {
              "group": "(transitive) To get into one's hands, possession, or control, with or without force.",
              "entries": [
                {
                  "meaning": "(transitive) To seize or capture.",
                  "examples": [
                    "take the guards prisoner",
                    "take prisoners",
                    "After a bloody battle, they were able to take the city."
                  ]
                },
                {
                  "meaning": "(transitive) To catch or get possession of (fish or game).",
                  "examples": [
                    "took ten catfish in one afternoon"
                  ]
                },
                {
                  "meaning": "(transitive, cricket) To catch the ball; especially as a wicket-keeper and after the batsman has missed or edged it.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To appropriate or transfer into one's own possession, sometimes by physically carrying off.",
                  "examples": [
                    "Billy took her pencil."
                  ]
                },
                {
                  "meaning": "(transitive) To exact.",
                  "examples": [
                    "take a toll",
                    "take revenge"
                  ]
                },
                {
                  "meaning": "(transitive) To capture or win (a piece or trick) in a game.",
                  "examples": [
                    "took the next two tricks",
                    "took Smith's rook"
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To receive or accept (something) (especially something given or bestowed, awarded, etc).",
              "entries": [
                {
                  "meaning": "(transitive) To receive or accept (something) as payment or compensation.",
                  "examples": [
                    "The store doesn't take checks.",
                    "She wouldn't take any money for her help.",
                    "Do you take credit?",
                    "The vending machine only takes bills, it doesn't take coins."
                  ]
                },
                {
                  "meaning": "(transitive) To accept and follow (advice, etc).",
                  "examples": [
                    "take my advice"
                  ]
                },
                {
                  "meaning": "(transitive) To receive into some relationship.",
                  "examples": [
                    "take a wife",
                    "The school only takes new students in the fall.",
                    "The therapist wouldn't take him as a client."
                  ]
                },
                {
                  "meaning": "(transitive, intransitive, law) To receive or acquire (property) by law (e.g. as an heir).",
                  "examples": [
                    "There was no intestacy, and they did not take under the will as heirs,  […]"
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To remove.",
              "entries": [
                {
                  "meaning": "(transitive) To remove or end by death; to kill.",
                  "examples": [
                    "The earthquake took many lives.",
                    "The plague took rich and poor alike.",
                    "Cancer took her life.",
                    "He took his life last night."
                  ]
                },
                {
                  "meaning": "(transitive) To subtract.",
                  "examples": [
                    "Take one from three and you are left with two."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To have sex with.",
              "entries": [
                {
                  "meaning": "(vulgar) To admit (a penis or the penis of) into one’s bodily cavity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To defeat (someone or something) in a fight.",
                  "examples": [
                    "Don't try to take that guy. He's bigger than you.",
                    "The woman guarding us looks like a professional, but I can take her!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grasp or grip.",
                  "examples": [
                    "He took her hand in his."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To select or choose; to pick.",
                  "examples": [
                    "Take whichever bag you like.",
                    "She took the best men with her and left the rest to garrison the city.",
                    "I'll take the blue plates.",
                    "I'll take two sugars in my coffee, please."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adopt (select) as one's own.",
                  "examples": [
                    "She took his side in every argument.",
                    "take a stand on the important issues"
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To carry or lead (something or someone).",
              "entries": [
                {
                  "meaning": "(transitive, especially of a vehicle) To transport or carry; to convey to another place.",
                  "examples": [
                    "The next bus will take you to Metz.",
                    "I took him for a ride",
                    "I took him down to London."
                  ]
                },
                {
                  "meaning": "(transitive, of a path, road, etc.) To lead (to a place); to serve as a means of reaching.",
                  "examples": [
                    "These stairs take you down to the basement.",
                    "Stone Street took us right past the store."
                  ]
                },
                {
                  "meaning": "(transitive) To pass (or attempt to pass) through or around.",
                  "examples": [
                    "She took the steps two or three at a time/",
                    "He took the curve / corner too fast.",
                    "The pony took every hedge and fence in its path."
                  ]
                },
                {
                  "meaning": "(transitive) To escort or conduct (a person).",
                  "examples": [
                    "He took her to lunch at the new restaurant, took her to the movies, and then took her home."
                  ]
                },
                {
                  "meaning": "(reflexive) To go.",
                  "examples": [
                    "Nicholas then took himself to Avignon where in August 1330 he formally renounced his claim to the papacy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use as a means of transportation.",
                  "examples": [
                    "take the ferry",
                    "I took a plane.",
                    "He took the bus to London, and then took a train to Manchester.",
                    "He's 96 but he still takes the stairs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To visit; to include in a course of travel.",
                  "examples": [
                    "Almost a year since, R. B. and B. F. took that city, in the way from Frederickstadt to Amsterdam, and gave them a visit."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To obtain for use by payment or lease.",
              "entries": [
                {
                  "meaning": "(transitive) To obtain or receive regularly by (paid) subscription.",
                  "examples": [
                    "They took two magazines.",
                    "I used to take The Sunday Times."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To consume.",
              "entries": [
                {
                  "meaning": "(transitive) To receive (medicine) into one's body, e.g. by inhalation or swallowing; to ingest.",
                  "examples": [
                    "take two of these and call me in the morning",
                    "take the blue pill",
                    "I take aspirin every day to thin my blood."
                  ]
                },
                {
                  "meaning": "(transitive) To partake of (food or drink); to consume.",
                  "examples": [
                    "The general took dinner at seven o'clock."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To experience, undergo, or endure.",
              "entries": [
                {
                  "meaning": "(transitive) To undergo; to put oneself into, to be subjected to.",
                  "examples": [
                    "take sun-baths",
                    "take a shower",
                    "She made the decision to take chemotherapy."
                  ]
                },
                {
                  "meaning": "(transitive) To experience or feel.",
                  "examples": [
                    "She takes pride in her work.",
                    "I take offence at that.",
                    "to take a dislike",
                    "to take pleasure in his opponent's death"
                  ]
                },
                {
                  "meaning": "(transitive) To submit to; to endure (without ill humor, resentment, or physical failure).",
                  "examples": [
                    "took a pay cut",
                    "take a joke",
                    "If you're in an abusive relationship, don't just sit and take it; you can get help.",
                    "The hull took a lot of punishment before it broke.",
                    "I can take the noise, but I can't take the smell.",
                    "That truck bed will only take two tons."
                  ]
                },
                {
                  "meaning": "(transitive) To suffer; to endure (a hardship or damage).",
                  "examples": [
                    "The ship took a direct hit and was destroyed.",
                    "Her career took a hit."
                  ]
                },
                {
                  "meaning": "(transitive) To participate in.",
                  "examples": [
                    "She took a vacation to France but spent the whole time feeling miserable that her husband couldn't be there with her.",
                    "Aren't you supposed to take your math final today?",
                    "Despite my misgivings, I decided to take a meeting with the Russian lawyer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to change to a specified state or condition.",
                  "examples": [
                    "He had to take it apart to fix it.",
                    "She took down her opponent in two minutes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To regard in a specified way.",
                  "examples": [
                    "He took the news badly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To conclude or form (a decision or an opinion) in the mind.",
                  "examples": [
                    "took the decision to close its last remaining outlet",
                    "took a dim view of city officials"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To understand (especially in a specified way).",
                  "examples": [
                    "Don't take my comments as an insult.",
                    "if she took my meaning"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To accept or be given (rightly or wrongly); assume (especially as if by right).",
                  "examples": [
                    "He took all the credit for the project, although he had done almost none of the work.",
                    "She took the blame, in the public's eyes, although the debacle was more her husband's fault than her own."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To believe, to accept the statements of.",
                  "examples": [
                    "take her word for it",
                    "take him at his word"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assume or suppose; to reckon; to regard or consider.",
                  "examples": [
                    "take it from her comments she won't be there.",
                    "I took him to be a person of honor.",
                    "He was often taken to be a man of means.",
                    "Do you take me for a fool?",
                    "Do you take me to be stupid?",
                    "Looking at him as he came into the room, I took him for his father."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To draw, derive, or deduce (a meaning from something).",
                  "examples": [
                    "I'm not sure what moral to take from that story."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To derive (as a title); to obtain from a source.",
                  "examples": [
                    "\"As I Lay Dying\" takes its title from Book XI of Homer's \"Odyssey\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To catch or contract (an illness, etc).",
                  "examples": [
                    "took a chill"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To come upon or catch (in a particular state or situation).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To captivate or charm; to gain or secure the interest or affection of.",
                  "examples": [
                    "took her fancy",
                    "took her attention"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a material) To absorb or be impregnated by (dye, ink, etc); to be susceptible to being treated by (polish, etc).",
                  "examples": [
                    "cloth that takes dye well",
                    "paper that takes ink",
                    "the leather that takes a certain kind of polish"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a ship) To let in (water).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To require.",
                  "examples": [
                    "It takes a while to get used to the smell.",
                    "Looks like it's gonna take a taller person to get that down.",
                    "Finishing this on schedule will take a lot of overtime."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To proceed to fill.",
                  "examples": [
                    "He took a seat in the front row."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill, to use up (time or space).",
                  "examples": [
                    "Hunting that whale takes most of his free time.",
                    "His collection takes a lot of space.",
                    "The trip will take about ten minutes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To avail oneself of.",
                  "examples": [
                    "He took that opportunity to leave France."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To practice; perform; execute; carry out; do.",
                  "examples": [
                    "take a walk",
                    "take action/steps/measures to fight drug abuse",
                    "take a trip",
                    "take aim",
                    "take the tempo slowly",
                    "The kick is taken from where the foul occurred.",
                    "Pirès ran in to take the kick.",
                    "The throw-in is taken from the point where the ball crossed the touch-line."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To assume or perform (a form or role).",
              "entries": [
                {
                  "meaning": "(transitive) To assume (a form).",
                  "examples": [
                    "took the form of a duck",
                    "took shape",
                    "a god taking the likeness of a bird"
                  ]
                },
                {
                  "meaning": "(transitive) To perform (a role).",
                  "examples": [
                    "take the part of the villain/hero"
                  ]
                },
                {
                  "meaning": "(transitive) To assume and undertake the duties of (a job, an office, etc).",
                  "examples": [
                    "take office",
                    "take the throne"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bind oneself by.",
                  "examples": [
                    "he took the oath of office last night"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move into.",
                  "examples": [
                    "the witness took the stand",
                    "the next team took the field"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To go into, through, or along.",
                  "examples": [
                    "go down two blocks and take the next left",
                    "take the path of least resistance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have and use one's recourse to.",
                  "examples": [
                    "take cover/shelter/refuge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ascertain or determine by measurement, examination or inquiry.",
                  "examples": [
                    "take her pulse / temperature / blood pressure",
                    "take a census"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To write down; to get in, or as if in, writing.",
                  "examples": [
                    "He took a mental inventory of his supplies.",
                    "She took careful notes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (a photograph, film, or other reproduction of something).",
                  "examples": [
                    "She took a video of their encounter.",
                    "Could you take a picture of us?",
                    "The police took his fingerprints."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To take a picture, photograph, etc of (a person, scene, etc).",
                  "examples": [
                    "The photographer will take you sitting down.",
                    "to take a group/scene"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To obtain money from, especially by swindling.",
                  "examples": [
                    "took me for ten grand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now chiefly by enrolling in a class or course) To apply oneself to the study of.",
                  "examples": [
                    "As a child, she took ballet.",
                    "I plan to take math, physics, literature and flower arrangement this semester."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deal with.",
                  "examples": [
                    "take matters as they arise"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To consider in a particular way, or to consider as an example.",
                  "examples": [
                    "I've had a lot of problems recently: take last Monday, for example. My car broke down on the way to work. Then  […]  etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To decline to swing at (a pitched ball); to refrain from hitting at, and allow to pass.",
                  "examples": [
                    "He'll probably take this one."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To accept as an input to a relation.",
              "entries": [
                {
                  "meaning": "(transitive, grammar) To have to be used with (a certain grammatical form, etc).",
                  "examples": [
                    "This verb takes the dative; that verb takes the genitive."
                  ]
                },
                {
                  "meaning": "(transitive, mathematics, computing) To accept (zero or more arguments).",
                  "examples": [
                    "The function takes two arguments, an array of size n and an integer k."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To get or accept (something) into one's possession.",
                  "examples": [
                    "My husband and I have a dysfunctional marriage. He just takes and takes; he never gives."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive) To engage, take hold or have effect.",
              "entries": [
                {
                  "meaning": "(Of ink; dye; etc.) To adhere or be absorbed properly.",
                  "examples": [
                    "the dye didn't take",
                    "Boiling pasta with a bit of the sauce in the water will help the sauce \"take.\""
                  ]
                },
                {
                  "meaning": "(of a plant, etc) To begin to grow after being grafted or planted; to (literally or figuratively) take root, take hold.",
                  "examples": [
                    "not all grafts take",
                    "I started some tomato seeds last spring, but they didn't take."
                  ]
                },
                {
                  "meaning": "(of a mechanical device) To catch; to engage.",
                  "examples": [
                    "At the depot, Hook climbed out, slamming the door twice before the latch took."
                  ]
                },
                {
                  "meaning": "(possibly dated) To win acceptance, favor or favorable reception; to charm people.",
                  "examples": [
                    "Each wit may praise it for his own dear sake, / And hint he writ it, if the thing should take."
                  ]
                },
                {
                  "meaning": "To have the intended effect.",
                  "examples": [
                    "\"When I was young,\" I said, \"I was vaccinated with religion, but the vaccination didn't take.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative) To become; to be affected in a specified way.",
                  "examples": [
                    "They took ill within 3 hours.",
                    "She took sick with the flu."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, possibly dated) To be able to be accurately or beautifully photographed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dialectal, proscribed) An intensifier.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To deliver, bring, give (something) to (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete outside dialects and slang) To give or deliver (a blow, to someone); to strike or hit.",
                  "examples": [
                    "He took me a blow on the head."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}