{
  "word": "form",
  "etymologies": [
    {
      "description": [
        "From Middle English forme (“shape, figure, manner, bench, frame, seat, condition, agreement, etc.”), borrowed from Old French forme, from Latin fōrma (“shape, figure, image, outline, plan, mold, frame, case, etc., manner, sort, kind, etc.”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "form (countable and uncountable, plural forms)",
          "definitionGroups": [
            {
              "group": "(heading, physical) To do with shape.",
              "entries": [
                {
                  "meaning": "The shape or visible structure of a thing or person.",
                  "examples": [
                    "Study gives strength to the mind; conversation, grace: the first apt to give stiffness, the other suppleness: one gives substance and form to the statue, the other polishes it."
                  ]
                },
                {
                  "meaning": "A thing that gives shape to other things as in a mold.",
                  "examples": []
                },
                {
                  "meaning": "Regularity, beauty, or elegance.",
                  "examples": []
                },
                {
                  "meaning": "(philosophy) The inherent nature of an object; that which the mind itself contributes as the condition of knowing; that in which the essence of a thing consists.",
                  "examples": []
                },
                {
                  "meaning": "Characteristics not involving atomic components.",
                  "examples": []
                },
                {
                  "meaning": "(dated) A long bench with no back.",
                  "examples": [
                    "I can see the old schoolroom yet: the broken-down desks and the worn-out forms with knots in that got stuck into your backside […]."
                  ]
                },
                {
                  "meaning": "(fine arts) The boundary line of a material object. In painting, more generally, the human body.",
                  "examples": []
                },
                {
                  "meaning": "(crystallography) The combination of planes included under a general crystallographic symbol. It is not necessarily a closed solid.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(social) To do with structure or procedure.",
              "entries": [
                {
                  "meaning": "An order of doing things, as in religious ritual.",
                  "examples": []
                },
                {
                  "meaning": "Established method of expression or practice; fixed way of proceeding; conventional or stated scheme; formula.",
                  "examples": [
                    "Those whom form of laws  Condemned to die."
                  ]
                },
                {
                  "meaning": "Constitution; mode of construction, organization, etc.; system.",
                  "examples": [
                    "a republican form of government"
                  ]
                },
                {
                  "meaning": "Show without substance; empty, outside appearance; vain, trivial, or conventional ceremony; conventionality; formality.",
                  "examples": [
                    "a matter of mere form"
                  ]
                },
                {
                  "meaning": "(archaic) A class or rank in society.",
                  "examples": [
                    "ladies of a high form"
                  ]
                },
                {
                  "meaning": "(UK) A criminal record; loosely, past history (in a given area).",
                  "examples": [
                    "It's fair to say she has form on this: she has criticised David Cameron's proposal to create all-women shortlists for prospective MPs, tried to ban women wearing high heels at work as the resulting pain made them take time off work, and tried to reduce the point at which an abortion can take place from 24 to 21 weeks."
                  ]
                },
                {
                  "meaning": "Level of performance.",
                  "examples": [
                    "The team's form has been poor this year.",
                    "The orchestra was on top form this evening."
                  ]
                },
                {
                  "meaning": "(UK, education) A class or year of school pupils (often preceded by an ordinal number to specify the year, as in sixth form).",
                  "examples": [
                    "One other day after afternoon school, Mr. Percival came behind me and put his hand on me. \"Let me see, what's your name? Which form are you in? […]\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blank document or template to be filled in by the user.",
                  "examples": [
                    "To apply for the position, complete the application form."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specimen document to be copied or imitated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A grouping of words which maintain grammatical context in different usages; the particular shape or structure of a word or part of speech.",
                  "examples": [
                    "participial forms;  verb forms"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The den or home of a hare.",
                  "examples": [
                    "The Egyptians therefore in their hieroglyphics expressed a melancholy man by a hare sitting in her form, as being a most timorous and solitary creature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, programming) A window or dialogue box.",
                  "examples": [
                    "While it is quite amazing how much one can do with Visual Basic with the code attached to a single form, to take full advantage of VB you'll need to start using multiple forms and having the code on all the forms in your project interact."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(taxonomy) An infraspecific rank.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) The type or other matter from which an impression is to be taken, arranged and secured in a chase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A quantic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, fitness) A specific way of performing a movement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "form (third-person singular simple present forms, present participle forming, simple past and past participle formed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assume (a certain shape or visible structure).",
                  "examples": [
                    "When you kids form a straight line I'll hand out the lollies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give (a shape or visible structure) to a thing or person.",
                  "examples": [
                    "Roll out the dough to form a thin sheet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take shape.",
                  "examples": [
                    "When icicles start to form on the eaves you know the roads will be icy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put together or bring into being; assemble.",
                  "examples": [
                    "The socialists did not have enough MPs to form a government.",
                    "Paul McCartney and John Lennon formed The Beatles in Liverpool in 1960."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, linguistics) To create (a word) by inflection or derivation.",
                  "examples": [
                    "By adding \"-ness\", you can form a noun from an adjective."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To constitute, to compose, to make up.",
                  "examples": [
                    "Teenagers form the bulk of extreme traffic offenders."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mould or model by instruction or discipline.",
                  "examples": [
                    "Singing in a choir helps to form a child's sociality."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To provide (a hare) with a form.",
                  "examples": [
                    "The melancholy hare is formed in brakes and briers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical, historical, transitive) To treat (plates) to prepare them for introduction into a storage battery, causing one plate to be composed more or less of spongy lead, and the other of lead peroxide. This was formerly done by repeated slow alternations of the charging current, but later the plates or grids were coated or filled, one with a paste of red lead and the other with litharge, introduced into the cell, and formed by a direct charging current.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}