{
  "word": "quisling",
  "etymologies": [
    {
      "description": [
        "Named after Norwegian military officer Vidkun Quisling (1887–1945), who ruled the Nazi collaborationist government of Norway during World War Two. From Quislinus, Latinization of Quislin, based on the Danish place name Kvislemark.",
        "The name is seemingly supposed to mean \"one who is from Kvislemark\", and is equivalent to Kvisle(mark) +‎ -ing (suffix designating a person of a certain origin or with certain qualities). However, the earlier form of the name, Quislinus/Quislin, appears to have been a fanciful coinage based upon Kvisle(mark) + Latin -inus (“suffix indicating a relationship of position, possession, or origin”), and only later on came to be reinterpreted as containing Norwegian -ing (“suffix designating a person of a certain origin or with certain qualities”). Kvislemark is composed of Danish kvissel (“cleft branch”) +‎ mark (compare Danmark). kvissel itself is a derivative of Old Norse kvísl (“fork [as in a 'fork in the road']”), which ultimately comes (by dissimilation) from Proto-Germanic *twīsilō. Cognates include Old English twisla (“confluence, junction, fork of a river or road”) and Old High German zwisila (“forked implement, twig, branch”).",
        "Ultimately related to English twistle, twissel, and twizzle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quisling (plural quislings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A traitor who collaborates with the enemy. [from 1940]",
                  "examples": [
                    "Synonyms: collaborator, traitor, rat"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quisling",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "present participle of quisle",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}