{
  "word": "pump",
  "etymologies": [
    {
      "description": [
        "From Middle English pumpe, possibly from Middle Dutch pompe (“pipe, water conduit”) or Middle Low German pumpe (“pump”). Compare Dutch pompen, German pumpen, and Danish pompe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pump (plural pumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for moving or compressing a liquid or gas.",
                  "examples": [
                    "This pump can deliver 100 gallons of water per minute."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of the action of a pump; one stroke of a pump; any action similar to pumping",
                  "examples": [
                    "It takes thirty pumps to get 10 litres; he did 50 pumps of the weights."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for dispensing liquid or gas to be sold, particularly fuel.",
                  "examples": [
                    "This pump is out of order, but you can gas up at the next one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bodybuilding, climbing) A swelling of the muscles caused by increased blood flow following high intensity weightlifting.",
                  "examples": [
                    "Want a skin-stretching pump? Up the volume by using high-rep sets.",
                    "A great pump is better than coming. (Arnold Schwarzenegger)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A ride on a bicycle given to a passenger, usually on the handlebars or fender.",
                  "examples": [
                    "She gave the other girl a pump on her new bike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) The heart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, vulgar, British slang) The vagina.",
                  "examples": [
                    "Synonyms: see Thesaurus:vagina"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pump (third-person singular simple present pumps, present participle pumping, simple past and past participle pumped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To use a pump; to move (water or other liquid) by means of a pump. [from 16th c.]",
                  "examples": [
                    "I've been pumping for over a minute but the water isn't coming through.",
                    "I've pumped over 1000 gallons of water in the last ten minutes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To put (a person or part of the body) under a stream of water from a pump, as a punishment or as a form of medical treatment; to force a pump of water upon or on someone. [16th–19th c.]",
                  "examples": [
                    "Pump him soundly, impudent Fellow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To gain information from (a person) by persistent questioning. [from 17th c.]",
                  "examples": [
                    "Synonyms: grill, interrogate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(British slang) To copulate. [from 18th c.]",
                  "examples": [
                    "Synonyms: bang; see also Thesaurus:copulate, Thesaurus:copulate with"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To express milk from (a breast) by means of a breast pump. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, often followed by up) To fill with air by means of a pump; to inflate. [from 19th c.]",
                  "examples": [
                    "He pumped up the air-bed by hand, but used the service station air to pump up the tyres."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move rhythmically, as the motion of a pump. [from 19th c.]",
                  "examples": [
                    "I pumped my fist with joy when I won the race."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bodybuilding) To enlarge the body by means of weightlifting or steroid use. [from 20th c.]",
                  "examples": [
                    "Synonyms: big up, lift, pump iron"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shake (a person's hand) vigorously. [from 10th c.]",
                  "examples": [
                    "Synonym: handshake"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, intransitive, slang) Of music: to be loud, to have strong bass and rhythms; (by extension) to be full of energy. [from 20th c.]",
                  "examples": [
                    "The waves were really pumping this morning.",
                    "Last night's party was really pumping."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) To kick, throw, or hit the ball far and high.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang, vulgar) To pass gas; to fart quietly.",
                  "examples": [
                    "Synonyms: trump; see also Thesaurus:flatulate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) To pass (messages) into a program so that it can obey them.",
                  "examples": [
                    "Sure enough, rather than pumping a message to the Console window, you will now see a message box displaying your message"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) To inject silicone into the body in order to try to achieve a fuller or curvier look.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The etymology of the term is unclear and disputed. One possibility is that it comes from pomp (“ornamentation”). Another is that it refers to the sound made by the foot moving inside the shoe when dancing. The Oxford English Dictionary claims that it appeared in the 16th century, and lists its origin as \"obscure\". It has also been linked to the Dutch pampoesje, possibly borrowed from Javanese pampus, ultimately from Persian پاپوش‎ (pâpuš), borrowed from Arabic بَابُوش‎ (bābūš)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pump (plural pumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A low-top shoe with a rubber sole and a canvas upper; a low-top canvas sneaker.",
                  "examples": [
                    "Synonyms: gym shoe, (UK) dap, (UK) plimsoll, (US) sneaker"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US) A type of women's shoe which leaves the instep uncovered and has a relatively high heel, especially a stiletto (with a very high and thin heel)",
                  "examples": [
                    "Synonym: court shoe",
                    "She was wearing a lovely new pair of pumps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dancing shoe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of shoe without a heel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}