{
  "word": "fridge",
  "etymologies": [
    {
      "description": [
        "The noun is a clipping of refrigerator, perhaps influenced by the Frigidaire brand of refrigerators, or frigerator (“(dated) refrigerator”). The verb is derived from the noun.",
        "The fandom slang verb sense alludes to the phrase \"women in refrigerators\" coined by the American comic book writer Gail Simone. Simone was referencing a plot point in Green Lantern (volume 3, issue 54, 1994), in which the Green Lantern's girlfriend is murdered by a villain, and her body placed in a refrigerator for him to find."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fridge (plural fridges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A refrigerator. [from 1920s]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fridge (third-person singular simple present fridges, present participle fridging, simple past and past participle fridged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To place (something) inside a refrigerator to chill; to refrigerate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, fandom slang) To gratuitously kill, disempower, or otherwise remove (a character, usually female) from a narrative, often strictly to hurt another character (usually male) and motivate vengeance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably imitative of the sound of chafing or rubbing."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fridge (third-person singular simple present fridges, present participle fridging, simple past and past participle fridged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, chiefly Britain, dialectal) To chafe or rub (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive, obsolete)",
              "entries": [
                {
                  "meaning": "To chafe or rub.",
                  "examples": []
                },
                {
                  "meaning": "Synonym of fidge (“to jostle or shake; to fidget, to fig, to frig”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}