{
  "word": "parthenogenesis",
  "etymologies": [
    {
      "description": [
        "From parthen- +‎ -o- +‎ -genesis, from Ancient Greek παρθένος (parthénos, “virgin”) and γένεσις (génesis, “origin, creation, generation”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parthenogenesis (usually uncountable, plural parthenogeneses)",
          "definitionGroups": [
            {
              "group": "(biology) Referring to various aspects of asexual reproduction:",
              "entries": [
                {
                  "meaning": "(biology, countable, uncountable) (An instance of) reproduction by the development of a single gamete (an ovum or ovule) without fertilisation by a gamete of the opposite sex; compare metagenesis, heterogamy.",
                  "examples": [
                    "Scientists say the birth is the second confirmed instance of a shark being conceived by parthenogenesis, a process in which an unfertilised egg develops into a new individual."
                  ]
                },
                {
                  "meaning": "(biology, uncountable, formerly) Asexual reproduction in toto; agamogenesis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable and uncountable) figurative uses of the biological senses",
                  "examples": [
                    "We may learn, to be sure, plenty of lessons from Shakespeare. We are not likely to have kingdoms to divide, crowns foretold us by weird sisters, a father’s death to avenge, or to kill our wives from jealously ; but Lear may teach us to draw the line more clearly between a wise generosity and a loose-handed weakness of giving ; Macbeth, how one sin involves another, and forever another, by a fatal parthenogenesis, and that the key which unlocks forbidden doors to our will or passion leaves a stain on the hand, that may not be so dark as blood, but that will not out ; Hamlet, that all the noblest gifts of person, temperament, and mind slip like sand through the grasp of an infirm purpose ; Othello, that the perpetual silt of some one weakness, the eddies of a suspicious temper depositing their one impalpable layer after another, may build up a shoal on which an heroic life and an otherwise magnanimous nature may bilge and go to pieces."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) Virgin birth, in reference to the Virgin Mary and Jesus Christ.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}