{
  "word": "genocide",
  "etymologies": [
    {
      "description": [
        "Coined by Polish legal scholar Raphael Lemkin in 1943 or 1944 in reference to the Armenian Genocide and the Jewish Holocaust. From the stem of Ancient Greek γένος (génos, “race, kind”) (cognate with Latin gēns (“tribe, clan”), whence genus) + -cide (“killing, killer”). Compare genticide."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "genocide (countable and uncountable, plural genocides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The systematic and deliberate destruction of a group of people, typically by killing substantial numbers of them, on the basis of their ethnicity, religion, or nationality.",
                  "examples": [
                    "For the German occupying authorities war thus appears to offer the most appropriate occasion for carrying out their policy of genocide."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The systematic killing of substantial numbers of people on other grounds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The systematic suppression of ideas or practices on the basis of cultural or ethnic origin; culturicide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, roguelikes) The elimination of an entire class of monsters by the player.",
                  "examples": [
                    "I used genocide in my first ascension, but have been genocideless ever since. Makes the game much more interesting, but then again, if one hasn't ascended yet, it will be interesting anyway."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "genocide (third-person singular simple present genocides, present participle genociding, simple past and past participle genocided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To commit genocide (against); to eliminate (a group of people) completely.",
                  "examples": [
                    "Even though the Soviet constitution and that of the Ukrainian SSR contain provisions guaranteeing freedom of religion and other fundamental liberties, the Soviet government genocided the Ukrainian Autocephalous Orthodox Church in the 1930's [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}