{
  "word": "strain",
  "etymologies": [
    {
      "description": [
        "From Middle English streen, strene, streon, istreon (“race, stock, generation”), from Old English strēon, ġestrēon (“gain, wealth”), from Proto-Germanic *streuną (“heap, treasure, profit, gain”), from Proto-Indo-European *strew- (“to spread, strew”) (cognate with Old Saxon gistriuni, Old High German gistriuni (“gain, property, wealth, business”), Latin strues (“heap”)). Confused in Middle English with the related noun strend, strynd, strund, from Old English strȳnd (“race; stock”), from strēonan, strȳnan (“to beget; acquire”). Related also to Dutch struinen (“to prowl, root about, rout”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "strain (plural strains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Race; lineage, pedigree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A particular variety of a microbe, virus, or other organism, usually a taxonomically infraspecific one.",
                  "examples": [
                    "They say this year's flu virus is a particularly virulent strain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Hereditary character, quality, tendency, or disposition.",
                  "examples": [
                    "Synonyms: propensity, proneness",
                    "There is a strain of madness in her family."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, poetry) Any sustained note or movement; a song; a distinct portion of an ode or other poem; also, the pervading note, or burden, of a song, poem, etc.",
                  "examples": [
                    "Synonyms: theme, motive, manner, style"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Language that is eloquent, poetic, or otherwise heightened.",
                  "examples": [
                    ""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A kind or sort (of person etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Treasure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The blood-vessel in the yolk of an egg.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English straynen, streinen, streynen, from Old French estreindre (whence French étreindre (“to grip”)), from Latin stringō (“to draw tight together, to tie”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "strain (countable and uncountable, plural strains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of straining, or the state of being strained.",
                  "examples": [
                    "If the Menai Bridge, for instance, were loaded at that rate, the entire strain on the  main chains would be about 2000 tons ; while the chains containing 260 square  inches of iron would bear, at 9 tons per square inch, 2340 tons, without stretching  ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A violent effort; an excessive and hurtful exertion or tension, as of the muscles.",
                  "examples": [
                    "he jumped up with a strain",
                    "the strain upon the sailboat's rigging"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An injury resulting from violent effort; a sprain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, engineering) A dimensionless measure of object deformation either referring to engineering strain or true strain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The track of a deer.",
                  "examples": [
                    "When they have shot a Deere by land, they follow him like bloud-hounds by the bloud, and straine, and oftentimes so take them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "strain (third-person singular simple present strains, present participle straining, simple past and past participle strained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To hold tightly, to clasp.",
                  "examples": [
                    "\"Farewell!\"—the mother strained her child to her heart again, and again put her from her, to embrace her more closely."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To apply a force or forces to by stretching out.",
                  "examples": [
                    "to strain a rope; to strain the shrouds of a ship",
                    "Relations between the United States and Guatemala traditionally have been close, although at times strained by human rights and civil/military issues."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To damage by drawing, stretching, or the exertion of force.",
                  "examples": [
                    "The gale strained the timbers of the ship."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act upon, in any way, so as to cause change of form or volume, as when bending a beam.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To exert or struggle (to do something), especially to stretch (one's senses, faculties etc.) beyond what is normal or comfortable.",
                  "examples": [
                    "Sitting in back, I strained to hear the speaker."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To stretch beyond its proper limit; to do violence to, in terms of intent or meaning.",
                  "examples": [
                    "to strain the law in order to convict an accused person"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To separate solid from liquid by passing through a strainer or colander",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To percolate; to be filtered.",
                  "examples": [
                    "water straining through a sandy soil"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make uneasy or unnatural; to produce with apparent effort; to force; to constrain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To urge with importunity; to press.",
                  "examples": [
                    "to strain a petition or invitation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) hug somebody; to hold somebody tightly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English strenen (“to beget, father, procreate”), from Old English strēonan, strīenan, strȳnan (“to beget, generate, gain, acquire”), from Proto-Germanic *striunijaną (“to furnish, decorate, acquire”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "strain (third-person singular simple present strains, present participle straining, simple past and past participle strained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To beget, generate (of light), engender, copulate (both of animals and humans), lie with, be born, come into the world.",
                  "examples": [
                    "A man straineth, liveth, then dieth.",
                    "Man, look at that cat straining that kitty."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}