{
  "word": "shield",
  "etymologies": [
    {
      "description": [
        "From Middle English scheld, shelde, from Old English scield (“shield”), from Proto-West Germanic *skeldu, from Proto-Germanic *skelduz (“shield”), from Proto-Indo-European *(s)kelH- (“cut, split”). Cognate with West Frisian skyld, Dutch schild (“shield”), German Schild (“shield”), Danish skjold (“shield”), Icelandic skjöldur (“shield”) and Faroese skjøldur (“shield”).",
        "Compare Latin scūtum (“shield”), Irish sciath (“shield”), Latgalian škīda (“shield”), Lithuanian skydas (“shield”), Russian щит (ščit, “shield”), from Proto-Indo-European *(s)kewH- (“to cover, protect”), *skey- (“to cut, split”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shield (plural shields)",
          "definitionGroups": [
            {
              "group": "Anything that protects or defends; defense; shelter; protection.",
              "entries": [
                {
                  "meaning": "A broad piece of defensive armor, held in hand, formerly in general use in war, for the protection of the body.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) One who protects or defends.",
                  "examples": []
                },
                {
                  "meaning": "(lichenology) In lichens, a hardened cup or disk surrounded by a rim and containing the fructification, or asci.",
                  "examples": []
                },
                {
                  "meaning": "(mining, tunnelling) A framework used to protect workmen in making an adit under ground, and capable of being pushed along as excavation progresses.",
                  "examples": []
                },
                {
                  "meaning": "(science fiction) A field of energy that protects or defends.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A shape like that of a shield; usually, an inverted triangle with sides that curve inward to form a pointed bottom, commonly used for police identifications and company logos.",
              "entries": [
                {
                  "meaning": "(heraldry) The escutcheon or field on which are placed the bearings in coats of arms.",
                  "examples": []
                },
                {
                  "meaning": "(Scotland, euphemistic, obsolete) A toilet seat.",
                  "examples": []
                },
                {
                  "meaning": "A spot resembling, or having the form of a shield.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A coin, the old French crown, or écu, having on one side the figure of a shield.",
                  "examples": []
                },
                {
                  "meaning": "(transport) A sign or symbol, usually containing numbers and sometimes letters, identifying a highway route.",
                  "examples": []
                },
                {
                  "meaning": "(colloquial, law enforcement) A police badge.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(geology) A large expanse of exposed stable Precambrian rock.",
              "entries": [
                {
                  "meaning": "(geology) A wide and relatively low-profiled volcano, usually composed entirely of lava flows.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, Scotland, euphemistic, obsolete) A place with a toilet seat: an outhouse; a lavatory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive, British) Parts at the front and back of a vehicle which are meant to absorb the impact of a collision",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English shelden, from Old English scildan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "shield (third-person singular simple present shields, present participle shielding, simple past and past participle shielded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To protect, to defend.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, intransitive) To shelter; to protect oneself.",
                  "examples": [
                    "The government has updated its guidance for people who are shielding taking into account that COVID-19 disease levels have decreased over the last few weeks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electricity) to protect from the influence of",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}