{
  "word": "hunt",
  "etymologies": [
    {
      "description": [
        "From Middle English hunten, from Old English huntian (“to hunt”), from Proto-Germanic *huntōną (“to hunt, capture”), possibly from Proto-Indo-European *ḱent- (“to catch, seize”). Related to Old High German hunda (“booty”), Gothic 𐌷𐌿𐌽𐌸𐍃 (hunþs, “body of captives”), Old English hūþ (“plunder, booty, prey”), Old English hentan (“to catch, seize”). More at hent, hint.\nIn some areas read as a collective form of hound by folk etymology."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hunt (plural hunts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of hunting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hunting expedition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An organization devoted to hunting, or the people belonging to it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pack of hunting dogs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hunt (third-person singular simple present hunts, present participle hunting, simple past and past participle hunted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To find or search for an animal in the wild with the intention of killing the animal for its meat or for sport.",
                  "examples": [
                    "State Wildlife Management areas often offer licensed hunters the opportunity to hunt on public lands.",
                    "Her uncle will go out and hunt for deer, now that it is open season."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To try to find something; search (for).",
                  "examples": [
                    "The little girl was hunting for shells on the beach.",
                    "The police are hunting for evidence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive; to chase; with down, from, away, etc.",
                  "examples": [
                    "to hunt down a criminal",
                    "He was hunted from the parish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use or manage (dogs, horses, etc.) in hunting.",
                  "examples": [
                    "Did you hunt that pony last week?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use or traverse in pursuit of game.",
                  "examples": [
                    "He hunts the woods, or the country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bell-ringing, transitive) To move or shift the order of (a bell) in a regular course of changes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bell-ringing, intransitive) To shift up and down in order regularly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering, intransitive) To be in a state of instability of movement or forced oscillation, as a governor which has a large movement of the balls for small change of load, an arc-lamp clutch mechanism which moves rapidly up and down with variations of current, etc.; also, to seesaw, as a pair of alternators working in parallel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}