{
  "word": "chorus",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Medieval Latin chorus (“church choir”), Latin chorus (“group of dancers and singers; dance”), from Ancient Greek χορός (khorós, “group of dancers and singers, choir, chorus; dance accompanied by song; round dance”); further etymology uncertain, perhaps from Proto-Indo-European *ǵʰer- (“to encircle, enclose”) or *ǵʰoros. Doublet of choir and hora.",
        "The plural form chori is from Latin chorī, from Ancient Greek χοροί (khoroí).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chorus (plural choruses or chorusses or chori)",
          "definitionGroups": [
            {
              "group": "(Ancient Greece, historical)",
              "entries": [
                {
                  "meaning": "A group of singers and dancers in a theatrical performance or religious festival who commented on the main performance in speech or song.",
                  "examples": []
                },
                {
                  "meaning": "A song performed by the singers of such a group.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, chiefly Britain, theater, historical) An actor who reads the prologue and epilogue of a play, and sometimes also acts as a commentator or narrator; also, a portion of a play read by this actor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of singers performing together; a choir; specifically, such a group singing together in a musical, an opera, etc., as distinct from the soloists; an ensemble.",
                  "examples": [
                    "The performance of the chorus was awe-inspiring and exhilarating."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A group of people in a performance who recite together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of singing by a group of people.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "A group of people, animals, or inanimate objects who make sounds together.",
                  "examples": [
                    "a chorus of crickets    a chorus of whiners"
                  ]
                },
                {
                  "meaning": "The noise or sound made by such a group.",
                  "examples": [
                    "a chorus of shouts and catcalls"
                  ]
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "A group of people who express a unanimous opinion.",
                  "examples": []
                },
                {
                  "meaning": "The opinion expressed by such a group.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(music)",
              "entries": [
                {
                  "meaning": "A piece of music, especially one in a larger work such as an opera, written to be sung by a choir in parts (for example, by sopranos, altos, tenors, and basses).",
                  "examples": []
                },
                {
                  "meaning": "A part of a song which is repeated between verses; a refrain.",
                  "examples": [
                    "The catchiest part of most songs is the chorus."
                  ]
                },
                {
                  "meaning": "The main part of a pop song played after the introduction.",
                  "examples": []
                },
                {
                  "meaning": "A group of organ pipes or organ stops intended to be played simultaneously; a compound stop; also, the sound made by such pipes or stops.",
                  "examples": []
                },
                {
                  "meaning": "(often attributively) A feature or setting in electronic music that makes one instrument sound like many.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A simple, often repetitive, song intended to be sung in a group during informal worship.",
                  "examples": []
                },
                {
                  "meaning": "(jazz) The improvised solo section in a small group performance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chorus (third-person singular simple present choruses, present participle chorusing or chorussing, simple past and past participle chorused or chorussed)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To sing (a song), express (a sentiment), or recite or say (words) in chorus.",
                  "examples": [
                    "Synonym: (of two people) duet"
                  ]
                },
                {
                  "meaning": "To express concurrence with (something said by another person); to echo.",
                  "examples": []
                },
                {
                  "meaning": "(rare) To provide (a song) with a chorus or refrain.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To sing the chorus or refrain of a song.",
                  "examples": [
                    "Malcolm sung an Erse song, the chorus of which was 'Hatyin foam foam eri', with words of his own.  […]  the boatmen and Mr M’Queen chorused, and all went well."
                  ]
                },
                {
                  "meaning": "To sing, express, or say in, or as if in, unison.",
                  "examples": [
                    "Six State Commissioners of Education gloomily chorused about retrenchments, pay cuts and shut-down schools in Alabama, Missouri, Tennessee, Washington, Massachusetts and Maine."
                  ]
                },
                {
                  "meaning": "To echo in unison another person's words.",
                  "examples": [
                    "Then she shouted: \"Viva our Lady of Grace,\" and the crowd chorused."
                  ]
                },
                {
                  "meaning": "Of animals: to make cries or sounds together.",
                  "examples": [
                    "Then the cocks began to crow in the town beneath the hill, and the birds chorused in the fields, and a pale yellow poppy colored the east."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}