{
  "word": "overweight",
  "etymologies": [
    {
      "description": [
        "over- +‎ weight"
      ],
      "adjectives": [
        {
          "description": "overweight (comparative more overweight, superlative most overweight)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Having a higher weight, especially body fat, than what is generally considered healthy for a given body type and height.",
                  "examples": [
                    "Before her diet, Jane was noticeably overweight, but she shed five kilos in the next two months."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transport, law, of a vehicle) Weighing more than what is allowed for safety or legal commerce.",
                  "examples": [
                    "All States allow oversized vehicles if a special permit is obtained, although most States will grant overweight permits only for non-divisible loads."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(investment, finance, followed by a noun or prepositional phrase indicating a security or type of security) Having a portfolio relatively heavily invested in.",
                  "examples": [
                    "Our portfolio is very overweight (in) Asian technology stocks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "overweight (countable and uncountable, plural overweights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, chiefly transport, law) An excess of weight.",
                  "examples": [
                    "[…]  and shall pay not only the amount of the permit fee for overlength, overheight, overwidth or overweight as might be due, but an additional civil penalty of fifty dollars for the first offense, one hundred dollars for the second offense and one hundred fifty dollars for each additional offense;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, healthcare) The condition of being overweight.",
                  "examples": [
                    "SCHOOL MEAL ISSUES FOR CHILDREN AT RISK FOR OVERWEIGHT"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An overweight person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, investment, finance) A security or class of securities in which one has a heavy concentration.",
                  "examples": [
                    "Apple common stock is one of our overweights."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "overweight (third-person singular simple present overweights, present participle overweighting, simple past and past participle overweighted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To weigh down: to put too heavy a burden on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place excessive weight or emphasis on; to overestimate the importance of. [from 17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}