{
  "word": "convey",
  "etymologies": [
    {
      "description": [
        "From Middle English conveien, from Old French conveier (French convoyer), from Vulgar Latin *convio, from Classical Latin via (“way”). Compare convoy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "convey (third-person singular simple present conveys, present participle conveying, simple past and past participle conveyed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move (something) from one place to another.",
                  "examples": [
                    "Air conveys sound. Water is conveyed through the pipe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To take or carry (someone) from one place to another.",
                  "examples": [
                    "[…]  the false Tyrant seiz’d the Princely Maid,",
                    "And to a Lodge in distant Woods convey’d;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To communicate; to make known; to portray.",
                  "examples": [
                    "to convey an impression; to convey information"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To transfer legal rights (to).",
                  "examples": [
                    "He conveyed ownership of the company to his daughter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To manage with privacy; to carry out.",
                  "examples": [
                    "I shall so conuey my matters, that he shall dysclose all together hym selfe, what busynesse is betwene you  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To carry or take away secretly; to steal; to thieve.",
                  "examples": [
                    "Suppose you are good at the lift, who be more cunning then we women, in that we are more trusted, for they little suspect vs, and we haue as close conueyance as you men, though you haue Cloakes, we haue skirts of gownes, handbaskets, the crownes of our hattes, our plackardes, and for a need, false bagges vnder our smockes, wherein we can conuey more closely then you."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}