{
  "word": "user",
  "etymologies": [
    {
      "description": [
        "From Middle English usere, equivalent to use +‎ -er. Cognate with Scots usar, uiser (“user”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "user (plural users)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who uses or makes use of something, a consumer/client or an express or implied licensee (free user) or a trespasser.",
                  "examples": [
                    "The most vulnerable road users are pedestrians, cyclists, motorcyclists and horse riders. It is particularly important to be aware of children, older and disabled people, and learner and inexperienced drivers and riders. https://www.gov.uk/guidance/the-highway-code/road-users-requiring-extra-care-204-to-225"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who uses drugs, especially illegal drugs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A person who uses a computer or a computing network, especially a person who has received a user account.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) An exploiter, an abuser (a person who \"uses\" people, that is treats and regards people unfairly, selfishly and/or unethically).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, dated) In land law, meaning either 1. or 2. above or use. Usually in singular form to mean use wherever there is assiduous re-use of precedents and aloof textbooks verbatim.",
                  "examples": [
                    "As to evidence of user...",
                    "As to quality of user (i.e. was use by the public \"as of right\"), the inspector found that the grass over the whole of the application land has been regularly cut...",
                    "...which the inspector did not find sufficient of itself to render user permissive. Moreover, the defendant could not, the inspector advised, rely on communication to users that access to the land was regulated. Deferment to users of the organised pitches..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}