{
  "word": "rest",
  "etymologies": [
    {
      "description": [
        "From Middle English rest, reste, from Old English ræst, from Proto-West Germanic *rastu, from Proto-Germanic *rastō, from Proto-Indo-European *ros-, *res-, *erH- (“rest”). Cognate with West Frisian rêst (“rest”), Dutch rust (“rest”), German Rast (“rest”), Swedish rast (“rest”), Norwegian rest (“rest”), Icelandic röst (“rest”), Old Irish árus (“dwelling”), German Ruhe (“calm”), Albanian resht (“to stop, pause”), Welsh araf (“quiet, calm, gentle”), Lithuanian rovà (“calm”), Ancient Greek ἐρωή (erōḗ, “rest, respite”), Avestan 𐬀𐬌𐬭𐬌𐬨𐬈‎ (airime, “calm, peaceful”), Sanskrit रमते (rámate, “he stays still, calms down”), Gothic 𐍂𐌹𐌼𐌹𐍃 (rimis, “tranquility”). Related to roo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rest (countable and uncountable, plural rests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, of a person or animal) Relief from work or activity by sleeping; sleep.",
                  "examples": [
                    "I need to get a good rest tonight; I was up late last night.",
                    "The sun sets, and the workers go to their rest.",
                    "Synonyms: sleep, slumber"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any relief from exertion; a state of quiet and relaxation.",
                  "examples": [
                    "We took a rest at the top of the hill to get our breath back.",
                    "Synonyms: break, repose, time off"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Peace; freedom from worry, anxiety, annoyances; tranquility.",
                  "examples": [
                    "It was nice to have a rest from the phone ringing when I unplugged it for a while."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, of an object or concept) A state of inactivity; a state of little or no motion; a state of completion.",
                  "examples": [
                    "The boulder came to rest just behind the house after rolling down the mountain.",
                    "The ocean was finally at rest.",
                    "Now that we're all in agreement, we can put that issue to rest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, uncountable) A final position after death.",
                  "examples": [
                    "She was laid to rest in the village cemetery.",
                    "Synonym: peace"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, countable) A pause of a specified length in a piece of music.",
                  "examples": [
                    "Remember there's a rest at the end of the fourth bar.",
                    "Hyponyms: breve rest, demisemiquaver rest, hemidemisemiquaver rest, minim rest, quaver rest, semibreve rest, semiquaver rest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, countable) A written symbol indicating such a pause in a musical score such as in sheet music.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, uncountable) Absence of motion.",
                  "examples": [
                    "The body's centre of gravity may affect its state of rest.",
                    "Antonym: motion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, countable) A stick with a U-, V- or X-shaped head used to support the tip of a cue when the cue ball is otherwise out of reach.",
                  "examples": [
                    "Higgins can't quite reach the white with his cue, so he'll be using the rest.",
                    "Hypernym: bridge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any object designed to be used to support something else.",
                  "examples": [
                    "She put the phone receiver back in its rest.",
                    "He placed his hands on the arm rests of the chair.",
                    "Synonyms: (of a telephone) cradle, support",
                    "Hyponyms: arm rest, elbow rest, foot rest, head rest, leg rest, neck rest, wrist rest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A projection from the right side of the cuirass of armour, serving to support the lance.",
                  "examples": [
                    "their visors closed, their lances in the rest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where one may rest, either temporarily, as in an inn, or permanently, as, in an abode.",
                  "examples": [
                    "halfway houses and travellers' rests"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetry) A short pause in reading poetry; a caesura.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The striking of a balance at regular intervals in a running account. Often, specifically, the intervals after which compound interest is added to capital.",
                  "examples": [
                    "a new account was opened under the heading \"Irondale Mine\" and so continued witli semiannual rest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A set or game at tennis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English resten, from Old English restan, from Proto-West Germanic *rastijan (“to rest”), from Proto-Indo-European *ros-, *res-, *erH- (“rest”). Cognate with Dutch rusten (“to rest”), Middle Low German resten (“to rest”), German rasten (“to rest”), Danish raste (“to rest”), Swedish rasta (“to rest”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rest (third-person singular simple present rests, present participle resting, simple past and past participle rested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To cease from action, motion, work, or performance of any kind; stop; desist; be without motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come to a pause or an end; end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be free from that which harasses or disturbs; be quiet or still; be undisturbed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive, reflexive, copulative) To be or to put into a state of rest.",
                  "examples": [
                    "And thereby at a pryory they rested them all nyght."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stay, remain, be situated.",
                  "examples": [
                    "The blame seems to rest with your father."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, reflexive) To lean, lie, or lay.",
                  "examples": [
                    "A column rests on its pedestal.",
                    "I rested my head in my hands.",
                    "She rested against my shoulder.",
                    "I rested against the wall for a minute."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive, law, US) To complete one's active advocacy in a trial or other proceeding, and thus to wait for the outcome (however, one is still generally available to answer questions, etc.)",
                  "examples": [
                    "The defense rests, your Honor.",
                    "I rest my case."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To sleep; slumber.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lie dormant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To sleep the final sleep; sleep in death; die; be dead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rely or depend on.",
                  "examples": [
                    "On him I rested, after long debate, / And not without considering, fixed fate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be satisfied; to acquiesce.",
                  "examples": [
                    "to rest in Heaven's determination"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English reste, from Old French reste, from Old French rester (“to remain”), from Latin restō (“to stay back, stay behind”), from re- + stō (“to stand”). Replaced native Middle English lave (“rest, remainder”) (from Old English lāf (“remnant, remainder”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rest (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) That which remains.",
                  "examples": [
                    "She ate some of the food, but was not hungry enough to eat it all, so she put the rest in the refrigerator to finish later.",
                    "Synonyms: lave, remainder"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Those not included in a proposition or description; the remainder; others.",
                  "examples": [
                    "Plato and the rest of the philosophers"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, finance) A surplus held as a reserved fund by a bank to equalize its dividends, etc.; in the Bank of England, the balance of assets above liabilities.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English resten, from Old French rester, from Latin restō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rest (third-person singular simple present rests, present participle resting, simple past and past participle rested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(no object, with complement) To continue to be, remain, be left in a certain way.",
                  "examples": [
                    "You can rest assured that a sick child will say when it's again ready to eat, so it won't starve and doesn't need to be cajoled into eating.",
                    "Rest you merry. (\"Be glad, be joyful\"; later: \"Good luck to you.\")"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To keep a certain way.",
                  "examples": [
                    "God rest you merry, gentlemen. (\"May God grant you happiness and peace, gentlemen\"; literally: \"May God keep you happy and in peace, gentlemen.\")"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Aphetic form of arrest."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rest (third-person singular simple present rests, present participle resting, simple past and past participle rested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, colloquial) To arrest.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}