{
  "word": "handball",
  "etymologies": [
    {
      "description": [
        "From hand +‎ ball."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "handball (countable and uncountable, plural handballs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A team sport where two teams of seven players each (six players and a goalkeeper) pass and bounce a ball trying to throw it in the goal of the opposing team.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The medium-sized inflated ball used in this sport.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, soccer) The offence of a player other than the goalkeeper touching the ball with the hand or arm on the field during play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, US, Ireland) A sport in which players alternately strike the ball against a wall with their hand. Irish and American variants have slightly different rules.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US) The small rubber ball used in this sport.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Australian Rules Football) An act of passing a football by holding it with one hand and hitting it with the other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, Australia) A schoolyard game in which a tennis ball is struck with the hand, played on a improvised court on the asphalt or pavement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "handball (third-person singular simple present handballs, present participle handballing, simple past and past participle handballed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To manually load or unload a container, trailer, or to otherwise manually move bulk goods (often on pallets) from one type of transport receptacle to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) To illegally touch the ball with the hand or arm.",
                  "examples": [
                    "If the defender handballs in the penalty area, a penalty is awarded.",
                    "Synonym: handle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football) To (legally) pass a football by holding it with one hand and hitting it with the other.",
                  "examples": [
                    "Meanwhile, you can introduce the basic concept of Aussie rules through a game like lineball, a lead-up game introduced in the basketball section of chapter 10, but with the ball handballed, not thrown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sexuality, slang) To insert a hand into someone's anus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}