{
  "word": "squeegee",
  "etymologies": [
    {
      "description": [
        "Probably from squeege, an intensified form of squeeze. Compare earlier squill-gee, squillgee."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squeegee (plural squeegees)",
          "definitionGroups": [
            {
              "group": "A tool consisting of a rubber or similar blade attached at a right angle to a handle, particularly",
              "entries": [
                {
                  "meaning": "(nautical) A long-handled tool used on ships for swabbing the decks and spreading protective coatings. [1844]",
                  "examples": [
                    "Holy-stoning the decks... is the worst description of nervous torture of which I ever heard, excepting perhaps, the infliction of the squee gee."
                  ]
                },
                {
                  "meaning": "Similar long-handled tools used for drying or leveling surfaces such as paths and roadways. [1884]",
                  "examples": []
                },
                {
                  "meaning": "A short-handled tool, especially as used on car windshields and home windows. [1918]",
                  "examples": []
                }
              ]
            },
            {
              "group": "A roller used to similar effect, particularly",
              "entries": [
                {
                  "meaning": "(photography) A tool used to remove excess moisture from a print. [1878]",
                  "examples": []
                },
                {
                  "meaning": "(historical) A street-cleaning machine consisting of a roller made of squeegee blades pulled by a horse.",
                  "examples": []
                },
                {
                  "meaning": "(printing) A tool used to force the ink through the stencil in silk-screen printing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A person who uses a squeegee, especially one who \"cleans\" the windshield of a car stopped at a traffic light and then demands payment. [1991]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "squeegee (third-person singular simple present squeegees, present participle squeegeeing, simple past and past participle squeegeed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To use a squeegee. [1883]",
                  "examples": [
                    "It is then ‘squeegeed’ down on the glass and developed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}