{
  "word": "boss",
  "etymologies": [
    {
      "description": [
        "From Dutch baas, from Middle Dutch baes (“master of a household, friend”), from Old Dutch *baso (“uncle, kinsman”), from Proto-West Germanic *baswō, from Proto-Germanic *baswô (“uncle”), perhaps from Proto-Germanic *ba-, *bō- (“father, older male relative”), source also of the English terms babe, boy, bub, bully. Cognate with Middle Low German bās (“supervisor, foreman”), Old Frisian bas (“master”), hence Saterland Frisian Boas (“boss”), Old High German basa (“father's sister, cousin”), hence German Base (“aunt, cousin”).",
        "Originally a term of respect used to address an older relative. Later, in New Amsterdam, it began to mean a person in charge who is not a master. The representation of Dutch -aa- by English -o- is due to the older unrounded pronunciation of this letter, which is still used in North America and parts of Ireland, but was formerly found in some British accents as well.",
        "The video game sense is borrowed from Japanese ボス (bosu)."
      ],
      "adjectives": [
        {
          "description": "boss (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, US, Canada, Liverpudlian) Of excellent quality, first-rate.",
                  "examples": [
                    "That is a boss Zefron poster."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "boss (plural bosses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who oversees and directs the work of others; a supervisor.",
                  "examples": [
                    "we have some vindictive people as bosses, and you don’t want to be the target of their wrath."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person in charge of a business or company.",
                  "examples": [
                    "Synonym: employer",
                    "Chat turned to whisper when the boss entered the conference room.",
                    "My boss complains that I'm always late to work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A leader, the head of an organized group or team.",
                  "examples": [
                    "Synonyms: head, leader",
                    "They named him boss because he had good leadership skills."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The head of a political party in a given region or district.",
                  "examples": [
                    "Synonym: leader",
                    "He is the Republican boss in Kentucky."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, especially India and MLE) A term of address to a man.",
                  "examples": [
                    "Yes, boss."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) An enemy, often at the end of a level, that is particularly challenging and must be beaten in order to progress.",
                  "examples": [
                    "Synonym: guardian"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(humorous) Wife.",
                  "examples": [
                    "There's no olive oil; will sunflower oil do? — I'll have to run that by the boss."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "boss (third-person singular simple present bosses, present participle bossing, simple past and past participle bossed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exercise authoritative control over; to tell (someone) what to do, often repeatedly.",
                  "examples": [
                    "Synonyms: lord over, boss around"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bos, bose, boce, from Old French boce (“lump, bulge, protuberance, knot”), from Frankish *bottja, from Proto-Germanic *bautaną (“to hit, strike, beat”). Doublet of beat; see there for more."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boss (plural bosses)",
          "definitionGroups": [
            {
              "group": "A swelling, lump or protuberance in an animal, person or object.",
              "entries": [
                {
                  "meaning": "(geology) A lump-like mass of rock, especially one projecting through a stratum of different rock.",
                  "examples": []
                },
                {
                  "meaning": "A convex protuberance in hammered work, especially the rounded projection in the centre of a shield.",
                  "examples": []
                },
                {
                  "meaning": "(mechanics) A protrusion, frequently a cylinder of material that extends beyond a hole.",
                  "examples": []
                },
                {
                  "meaning": "(architecture) A knob or projection, usually at the intersection of ribs in a vault.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archery) A target block, made of foam but historically made of hay bales, to which a target face is attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden vessel for the mortar used in tiling or masonry, hung by a hook from the laths, or from the rounds of a ladder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A head or reservoir of water.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "boss (third-person singular simple present bosses, present participle bossing, simple past and past participle bossed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To decorate with bosses; to emboss.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Apparently a corruption of bass."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boss (plural bosses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A hassock or small seat, especially made from a bundle of straw.",
                  "examples": [
                    "All were waiting : uncle Charles, who sat far away in the shadow of the window, Dante and Mr Casey, who sat in the easy chairs at either side of the hearth, Stephen, seated on a chair between them, his feet resting on a toasting boss."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}