{
  "word": "scene",
  "etymologies": [
    {
      "description": [
        "From Middle French scene, from Latin scaena, scēna, from Ancient Greek σκηνή (skēnḗ, “scene, stage”). Doublet of scena."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scene (plural scenes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The location of an event that attracts attention.",
                  "examples": [
                    "the scene of the crime"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, theater) The stage.",
                  "examples": [
                    "They stood in the centre of the scene."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) The decorations; furnishings and backgrounds of a stage, representing the place in which the action of a play is set",
                  "examples": [
                    "to paint scenes",
                    "to change the scenes",
                    "behind the scenes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater, film, television, radio) A part of a dramatic work that is set in the same place or time. In the theatre, generally a number of scenes constitute an act.",
                  "examples": [
                    "The play is divided into three acts, and in total twenty-five scenes.",
                    "The most moving scene is the final one, where he realizes he has wasted his whole life.",
                    "There were some very erotic scenes in the movie, although it was not classified as pornography."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The location, time, circumstances, etc., in which something occurs, or in which the action of a story, play, or the like, is set up",
                  "examples": [
                    "The world is a vast scene of strife."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A combination of objects or events in view or happening at a given moment at a particular place.",
                  "examples": [
                    "He assessed the scene to check for any danger, and agreed it was safe.",
                    "They saw an angry scene outside the pub."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A landscape, or part of a landscape; scenery.",
                  "examples": [
                    "A sylvan scene with various greens was drawn, / Shades on the sides, and in the midst a lawn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An exhibition of passionate or strong feeling before others, creating embarrassment or disruption; often, an artificial or affected action, or course of action, done for effect; a theatrical display",
                  "examples": [
                    "The headmistress told the students not to cause a scene.",
                    "The crazy lady made a scene in the grocery store."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An element of fiction writing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A social environment consisting of an informal, vague group of people with a uniting interest; their sphere of activity; a subculture.",
                  "examples": [
                    "She got into the emo scene at an early age."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A youth subculture that was popular in Canada and the United States in the 2000s and early 2010s.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scene (third-person singular simple present scenes, present participle scening, simple past and past participle scened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exhibit as a scene; to make a scene of; to display.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}