{
  "word": "ferry",
  "etymologies": [
    {
      "description": [
        "From Middle English ferien (“to carry, convey, convey in a boat”), from Old English ferian (“to carry, convey, bear, bring, lead, conduct, betake oneself to, be versed in, depart, go”), from Proto-West Germanic *farjan, from Proto-Germanic *farjaną (“to make or let go, transfer, ferry”), from Proto-Indo-European *per- (“to bring or carry over, transfer, pass through”).",
        "Cognate with German dialectal feren, fähren (“to row, sail”), Danish færge (“to ferry”), Swedish färja (“to ferry”), Icelandic ferja (“to ferry”), Old Norse ferja. Related to fare."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ferry (plural ferries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ship used to transport people, smaller vehicles and goods from one port to another, usually on a regular schedule.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where passengers are transported across water in such a ship.",
                  "examples": [
                    "to row us o'er the ferry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The legal right or franchise that entitles a corporate body or an individual to operate such a service.",
                  "examples": [
                    ""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ferry (third-person singular simple present ferries, present participle ferrying, simple past and past participle ferried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carry; transport; convey.",
                  "examples": [
                    "Trucks plowed through the water to ferry flood victims to safety."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move someone or something from one place to another, usually repeatedly.",
                  "examples": [
                    "Being a good waiter takes more than the ability to ferry plates of food around a restaurant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carry or transport over a contracted body of water, as a river or strait, in a boat or other floating conveyance plying between opposite shores.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass over water in a boat or by ferry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}