{
  "word": "communicate",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin commūnicātus, perfect passive participle of commūnicō (“share, impart; make common”), from commūnis (“common”). Doublet of commune."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "communicate (third-person singular simple present communicates, present participle communicating, simple past and past participle communicated)",
          "definitionGroups": [
            {
              "group": "To impart",
              "entries": [
                {
                  "meaning": "(transitive) To impart or transmit (information or knowledge) to someone; to make known, to tell. [from 16th c.]",
                  "examples": [
                    "It is vital that I communicate this information to you."
                  ]
                },
                {
                  "meaning": "(transitive) To impart or transmit (an intangible quantity, substance); to give a share of. [from 16th c.]",
                  "examples": [
                    "to communicate motion by means of a crank"
                  ]
                },
                {
                  "meaning": "(transitive) To pass on (a disease) to another person, animal etc. [from 17th c.]",
                  "examples": [
                    "The disease was mainly communicated via rats and other vermin."
                  ]
                }
              ]
            },
            {
              "group": "To share",
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To share (in); to have in common, to partake of. [16th–19th c.]",
                  "examples": [
                    "We shall now consider those functions of intelligence which man communicates with the higher beasts."
                  ]
                },
                {
                  "meaning": "(intransitive, Christianity) To receive the bread and wine at a celebration of the Eucharist; to take part in Holy Communion. [from 16th c.]",
                  "examples": [
                    "It seems that now [the Devil] was driving Alison hard. She had been remiss of late — fewer souls sent to hell, less zeal in quenching the Spirit, and, above all, the crowning offense that her bairn had communicated in Christ's kirk."
                  ]
                },
                {
                  "meaning": "(transitive, Christianity) To administer the Holy Communion to (someone). [from 16th c.]",
                  "examples": [
                    "She [the church]  […]  may communicate him."
                  ]
                },
                {
                  "meaning": "(intransitive) To express or convey ideas, either through verbal or nonverbal means; to have intercourse, to exchange information. [from 16th c.]",
                  "examples": [
                    "Many deaf people communicate with sign language.",
                    "I feel I hardly know him; I just wish he'd communicate with me a little more."
                  ]
                },
                {
                  "meaning": "(intransitive) To be connected with (another room, vessel etc.) by means of an opening or channel. [from 16th c.]",
                  "examples": [
                    "The living room communicates with the back garden by these French windows."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}