{
  "word": "carve",
  "etymologies": [
    {
      "description": [
        "From Middle English kerven, from Old English ceorfan, from Proto-West Germanic *kerban, from Proto-Germanic *kerbaną, from Proto-Indo-European *gerbʰ- (“to scratch”). Cognate with West Frisian kerve, Dutch kerven, Low German karven, German kerben (“to notch”); also Old Prussian gīrbin (“number”), Old Church Slavonic жрѣбии (žrěbii, “lot, tallymark”), Ancient Greek γράφειν (gráphein, “to scratch, etch”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carve (plural carves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A carucate.",
                  "examples": [
                    "... half a carve of arable land in Ballyncore, one carve of arable land in Pales, a quarter of arable land in Clonnemeagh, half a carve of arable land in Ballyfaden, half a carve of arable land in Ballymadran, ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of carving",
                  "examples": [
                    "give that turkey a careful carve"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "carve (third-person singular simple present carves, present participle carving, simple past carved, past participle carved or (archaic) carven)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To cut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut meat in order to serve it.",
                  "examples": [
                    "You carve the roast and I’ll serve the vegetables."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shape to sculptural effect; to produce (a work) by cutting, or to cut (a material) into a finished work.",
                  "examples": [
                    "to carve a name into a tree"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snowboarding) To perform a series of turns without pivoting, so that the tip and tail of the snowboard take the same path.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To take or make, as by cutting; to provide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lay out; to contrive; to design; to plan.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}