{
  "word": "electric",
  "etymologies": [
    {
      "description": [
        "1640s (Thomas Browne), from New Latin ēlectricus (“electrical; of amber”), from ēlectrum (“amber”) +‎ -icus (“adjectival suffix”), from Ancient Greek ἤλεκτρον (ḗlektron, “amber”), related to ἠλέκτωρ (ēléktōr, “shining sun”), of unknown origin; see there for further information. The Latin term was apparently used first with the sense “electrical” in 1600 by the English physician and scientist William Gilbert in his work De Magnete."
      ],
      "adjectives": [
        {
          "description": "electric (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, relating to, produced by, operated with, or utilising electricity; electrical.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to an electronic version of a musical instrument that has an acoustic equivalent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being emotionally thrilling; electrifying.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "electric (plural electrics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, usually with definite article) Electricity; the electricity supply.",
                  "examples": [
                    "We had to sit in the dark because the electric was cut off."
                  ]
                }
              ]
            },
            {
              "group": "(informal) An electric powered version of something that was originally or is more commonly not electric.",
              "entries": [
                {
                  "meaning": "(rare, countable) An electric car.",
                  "examples": []
                },
                {
                  "meaning": "An electric toothbrush.",
                  "examples": [
                    "The beautiful VIOlight bathroom unit takes up very little space (it's about the size of a cup), yet it holds up to 4 toothbrushes - even electrics!"
                  ]
                },
                {
                  "meaning": "An electric typewriter.",
                  "examples": [
                    "Richard's old Olivetti electric had been put aside for the time being on top of one of the filing cabinets. “It serves the purpose,” Richard said. He nodded at the word processor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A substance or object which can be electrified; an insulator or non-conductor, like amber or glass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) Fencing with the use of a body wire, box, and related equipment to detect when a weapon has touched an opponent.",
                  "examples": [
                    "Antonym: steam"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}