{
  "word": "daylight",
  "etymologies": [
    {
      "description": [
        "From Middle English daye-lighte, dey liȝht, dailiȝt, day-liht, dai-liht (also as days lyȝt, daies liht), equivalent to day +‎ light. Cognate with Saterland Frisian Deegeslucht, Daisljoacht (“daylight”), West Frisian deiljocht (“daylight”), Dutch daglicht (“daylight”), German Tageslicht (“daylight”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "daylight (countable and uncountable, plural daylights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The light from the Sun, as opposed to that from any other source.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light source that simulates daylight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, photometry) The intensity distribution of light over the visible spectrum generated by the Sun under various conditions or by other light sources intended to simulate natural daylight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The period of time between sunrise and sunset.",
                  "examples": [
                    "We should get home while it's still daylight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Daybreak.",
                  "examples": [
                    "We had only two hours to work before daylight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Exposure to public scrutiny.",
                  "examples": [
                    "Budgeting a spy organization can't very well be done in daylight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A clear, open space.",
                  "examples": [
                    "All small running backs instinctively run to daylight.",
                    "He could barely see daylight through the complex clockwork.",
                    "Finally, after weeks of work on the project, they could see daylight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, machinery) The space between platens on a press or similar machinery.",
                  "examples": [
                    "The minimum and maximum daylights on an injection molding machine determines the sizes of the items it can make."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Emotional or psychological distance between people, or disagreement.",
                  "examples": [
                    "We completely agree. There's no daylight between us on the issue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The gap between the top of a drinking-glass and the level of drink it is filled with.",
                  "examples": [
                    "Coordinate term: heeltap"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "daylight (third-person singular simple present daylights, present participle daylighting, simple past and past participle daylighted or daylit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To expose to daylight",
                  "examples": [
                    "[…]  she was not looking at the daylit, sunny world which she so wanted to see."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) To provide sources of natural illumination such as skylights or windows.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To allow light in, as by opening drapes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(landscaping, civil engineering) To run a drainage pipe to an opening from which its contents can drain away naturally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To gain exposure to the open.",
                  "examples": [
                    "The seam of coal daylighted at a cliff by the river."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}