{
  "word": "context",
  "etymologies": [
    {
      "description": [
        "From Latin contextus."
      ],
      "adjectives": [
        {
          "description": "context (comparative more context, superlative most context)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Knit or woven together; close; firm.",
                  "examples": [
                    "The skynne is composed & context and woven with thredes and vaynes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "context (countable and uncountable, plural contexts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The surroundings, circumstances, environment, background or settings that determine, specify, or clarify the meaning of an event or other occurrence.",
                  "examples": [
                    "In what context did your attack on him happen? - We had a pretty tense relationship at the time, and when he insulted me I snapped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) The text in which a word or passage appears and which helps ascertain its meaning.",
                  "examples": [
                    "Without any context, I can't tell you if the \"dish\" refers to the food, or the thing you eat it on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) The surroundings and environment in which an artifact is found and which may provide important clues about the artifact's function and/or cultural meaning.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mycology) The trama or flesh of a mushroom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) For a formula: a finite set of variables, which set contains all the free variables in the given formula.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "context (third-person singular simple present contexts, present participle contexting, simple past and past participle contexted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To knit or bind together; to unite closely.",
                  "examples": [
                    "The whole worlds frame, which is contexted onely by commerce and contracts."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}