{
  "word": "spoil",
  "etymologies": [
    {
      "description": [
        "From Middle English spoilen, spuylen, borrowed from Old French espoillier, espollier, espuler, from Latin spoliāre, present active infinitive of spoliō (“pillage, ruin, spoil”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spoil (plural spoils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Also in plural: spoils) Plunder taken from an enemy or victim.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The act of taking plunder from an enemy or victim; spoliation, pillage, rapine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Material (such as rock or earth) removed in the course of an excavation, or in mining or dredging. Tailings. Such material could be utilised somewhere else.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spoil (third-person singular simple present spoils, present participle spoiling, simple past and past participle spoiled or spoilt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To strip (someone who has been killed or defeated) of their arms or armour. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To strip or deprive (someone) of their possessions; to rob, despoil. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, archaic) To plunder, pillage (a city, country etc.). [from 14th c.]",
                  "examples": [
                    "Outlaws, which, lurking in woods, used to break forth to rob and spoil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To carry off (goods) by force; to steal. [14th–19th c.]",
                  "examples": [
                    "They must likewise endeavour to be careful in looking after the rest of the Servants, that every one perform their duty in their several places, that they keep good hours in their up-rising and lying down, and that no Goods be either spoiled or embezelled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ruin; to damage (something) in some way making it unfit for use. [from 16th c.]",
                  "examples": [
                    "\"I don't want to spoil any comparison you are going to make,\" said Jim, \"but I was at Winchester and New College.\" ¶ \"That will do,\" said Mackenzie. \"I was dragged up at the workhouse school till I was twelve. […]\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ruin the character of, by overindulgence; to coddle or pamper to excess. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of food, to become bad, sour or rancid; to decay. [from 17th c.]",
                  "examples": [
                    "Make sure you put the milk back in the fridge, otherwise it will spoil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To render (a ballot paper) invalid by deliberately defacing it. [from 19th c.]",
                  "examples": [
                    "Dr Jonathan Grant (Letters, April 22) feels the best way to show his disaffection with political parties over Iraq is to spoil his ballot paper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reveal the ending or major events of (a story etc.); to ruin (a surprise) by exposing it ahead of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) To reduce the lift generated by an airplane or wing by deflecting air upwards, usually with a spoiler.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}