{
  "word": "should",
  "etymologies": [
    {
      "description": [
        "From Middle English scholde, from Old English scolde, first and third person preterite form of sculan (“should,” “have to,” “to owe”), the ancestor of English shall. Related to shild and shildy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "should (plural shoulds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that ought to be the case as opposed to already being the case.",
                  "examples": [
                    "When the golf ball is there, the whole self-interference package — the hopes, worries, and fears; the thoughts on how-to and how-not-to; the woulds, the coulds, and the shoulds — is there too."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "should",
          "definitionGroups": [
            {
              "group": "(auxiliary) Ought to; indicating opinion, advice, or instruction, about what is required or desirable.",
              "entries": [
                {
                  "meaning": "Used to issue an instruction (traditionally seen as carrying less force of authority than alternatives such as 'shall' or 'must').",
                  "examples": [
                    "You should never drink and drive.",
                    "The law is clear that you should always wear a seat belt.",
                    "The manual says that this switch should be in the 'off' position."
                  ]
                },
                {
                  "meaning": "Used to give advice or opinion that an action is, or would have been, beneficial or desirable.",
                  "examples": [
                    "You should go and see that film. I think you'll enjoy it.",
                    "I should exercise more often, but I’m too lazy.",
                    "She should not have been so rude."
                  ]
                },
                {
                  "meaning": "(informal) With verbs such as 'see' or 'hear', usually in the second person, used to point out something remarkable in either a good or bad way.",
                  "examples": [
                    "You should see his new apartment. It's like a palace!",
                    "If you think her piano playing is bad, you should hear her sing!"
                  ]
                },
                {
                  "meaning": "In questions, asks what is correct, proper, desirable, etc.",
                  "examples": [
                    "What do you think? What should I do?"
                  ]
                }
              ]
            },
            {
              "group": "(auxiliary) Ought to; expressing expectation.",
              "entries": [
                {
                  "meaning": "Indicates that something is expected to have happened or to be the case now.",
                  "examples": [
                    "They should have finished by now; I'll call them to check.",
                    "My fruit trees should be in flower, but the cold spring has set them back."
                  ]
                },
                {
                  "meaning": "Will be likely to (become or do something); indicates a degree of possibility or probability that the stated thing will happen or be true in the future.",
                  "examples": [
                    "They should have it finished by Friday.",
                    "When you press this button, the pilot flame should ignite.",
                    "You should be warm enough with that coat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary, subjunctive) Used to form a variant of the present subjunctive, expressing a state or action that is hypothetical, potential, mandated, etc.",
                  "examples": [
                    "If I should be late, go without me.",
                    "Should you need extra blankets, you will find them in the closet.",
                    "The man demanded that he should be allowed entry.",
                    "I'm surprised that he should say that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary) Simple past tense of shall.",
                  "examples": [
                    "I told him that I should be busy tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(auxiliary) An alternative to would with first person subjects.",
              "entries": [
                {
                  "meaning": "(formal or literary) Used to express a conditional outcome.",
                  "examples": [
                    "If I had not been so tired, I should have laughed heartily."
                  ]
                },
                {
                  "meaning": "(formal or literary outside certain combinations such as with 'imagine' or 'think') Used to impart a tentative, conjectural or polite nuance.",
                  "examples": [
                    "I should imagine that they have arrived by now.",
                    "I should think you would apologize.",
                    "I should be very grateful to receive your prompt reply. (formal or old-fashioned)",
                    "We should very much like to meet her. (formal or old-fashioned)"
                  ]
                },
                {
                  "meaning": "Used to express what the speaker would do in another person's situation, as a means of giving a suggestion or recommendation.",
                  "examples": [
                    "It's disgraceful the way that they've treated you. I should write and complain."
                  ]
                }
              ]
            }
          ]
        },
        {
          "description": "should (third-person singular simple present shoulds, present participle shoulding, simple past and past participle shoulded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a statement of what ought to be true, as opposed to reality.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}