{
  "word": "penultimate",
  "etymologies": [
    {
      "description": [
        "From Latin paenultimus, from paene (“almost”) + ultimus (“last”)."
      ],
      "adjectives": [
        {
          "description": "penultimate (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, in US usually formal, literary or scholarly) Next to last, second to last; immediately preceding the end of a sequence, list, etc.",
                  "examples": [
                    "But it should frequently happen that offspring should resemble its penultimate rather than its latest phase, and should thus be more like a grand-parent than a parent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Of or pertaining to a penult.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, rare) Relating to or denoting an element of a related collection of curves that is arbitrarily close to a degenerate form.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(proscribed) pre-eminent, ultimate, best; par excellence, top-quality",
                  "examples": [
                    "This Book is the Proud Purple Penultimate!!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "penultimate (plural penultimates)",
          "definitionGroups": [
            {
              "group": "(uncommon) A penult, a next to last, particularly:",
              "entries": [
                {
                  "meaning": "(obsolete, rare) The penultimate day of a month.",
                  "examples": [
                    "At Woodstock, the penultimate of August."
                  ]
                },
                {
                  "meaning": "(linguistics, literature, uncommon) The penultimate syllable of a word or metrical line.",
                  "examples": [
                    "Antepenultimate is that before the Penultimate, or the last but two."
                  ]
                },
                {
                  "meaning": "(mathematics, obsolete, rare) The penultimate element of a collection of curves.",
                  "examples": []
                },
                {
                  "meaning": "(card games, uncommon) The penultimate (next to lowest) card in a suit.",
                  "examples": [
                    "Penultimate, the. — Beginning with the lowest card but one of the suit you lead originally, if it contains more than four cards."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}