{
  "word": "tear",
  "etymologies": [
    {
      "description": [
        "From Middle English teren, from Old English teran (“to tear, lacerate”), from Proto-Germanic *teraną (“to tear, tear apart, rip”), from Proto-Indo-European *der- (“to tear, tear apart”).",
        "Cognate with Scots tere, teir, tair (“to rend, lacerate, wound, rip, tear out”), Dutch teren (“to eliminate, efface, live, survive by consumption”), German zehren (“to consume, misuse”), German zerren (“to tug, rip, tear”), Danish tære (“to consume”), Swedish tära (“to fret, consume, deplete, use up”), Icelandic tæra (“to clear, corrode”). Outside Germanic, cognate to Ancient Greek δέρω (dérō, “to skin”), Albanian ther (“to slay, skin, pierce”). Doublet of tire."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tear (plural tears)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hole or break caused by tearing.",
                  "examples": [
                    "A small tear is easy to mend, if it is on the seam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A rampage.",
                  "examples": [
                    "to go on a tear"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tear (third-person singular simple present tears, present participle tearing, simple past tore, past participle torn or (now colloquial and nonstandard) tore)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rend (a solid material) by holding or restraining in two places and pulling apart, whether intentionally or not; to destroy or separate.",
                  "examples": [
                    "He suffered, poor man, at seeing her so badly dressed, with laceless boots, and the arm-holes of her pinafore torn down to the hips; for the charwoman took no care of her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To injure as if by pulling apart.",
                  "examples": [
                    "He has a torn ligament.",
                    "He tore some muscles in a weight-lifting accident."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To destroy or reduce abstract unity or coherence, such as social, political or emotional.",
                  "examples": [
                    "He was torn by conflicting emotions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (an opening) with force or energy.",
                  "examples": [
                    "A piece of debris tore a tiny straight channel through the satellite.",
                    "His boss will tear him a new one when he finds out.",
                    "The artillery tore a gap in the line."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, often with off or out) To remove by tearing.",
                  "examples": [
                    "Tear the coupon out of the newspaper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of structures, with down) To demolish",
                  "examples": [
                    "The slums were torn down to make way for the new development."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become torn, especially accidentally.",
                  "examples": [
                    "My dress has torn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move or act with great speed, energy, or violence.",
                  "examples": [
                    "He went tearing down the hill at 90 miles per hour.",
                    "The tornado lingered, tearing through town, leaving nothing upright.",
                    "He tore into the backlog of complaints."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To smash or enter something with great force.",
                  "examples": [
                    "The chain shot tore into the approaching line of infantry."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English teer (“tear”), from Old English tēar, from Proto-West Germanic *tahr, from Proto-Germanic *tahrą (“tear”), from Proto-Indo-European *dáḱru- (“tears”).",
        "Cognates include Old Norse tár (Danish tåre and Norwegian tåre), Old High German zahar (German Zähre), Gothic 𐍄𐌰𐌲𐍂 (tagr), Irish deoir and Latin lacrima."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tear (plural tears)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drop of clear, salty liquid produced from the eyes by crying or irritation.",
                  "examples": [
                    "There were big tears rolling down Lisa's cheeks.",
                    "Ryan wiped the tear from the paper he was crying on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something in the form of a transparent drop of fluid matter; also, a solid, transparent, tear-shaped drop, as of some balsams or resins.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(glass manufacture) A partially vitrified bit of clay in glass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which causes or accompanies tears; a lament; a dirge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tear (third-person singular simple present tears, present participle tearing, simple past and past participle teared)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce tears.",
                  "examples": [
                    "Her eyes began to tear in the harsh wind."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}