{
  "word": "closet",
  "etymologies": [
    {
      "description": [
        "From Middle English closet, from Old French closet, from clos (“private space”) +‎ -et (“forming diminutives”), from Latin clausum. Equivalent to close +‎ -et, but generally applied in French solely to small open-air enclosures."
      ],
      "adjectives": [
        {
          "description": "closet (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) private",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "closeted, secret (especially with reference to gay people who are in the closet)",
                  "examples": [
                    "He's a closet case."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Denoting anything kept a secret or private.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "closet (plural closets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small room within a house used to store clothing, food, or other household supplies.",
                  "examples": [
                    "A Closet full of shelves... it... should therefore be called a Cupboard rather than a Closet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any private space, (particularly) bowers in the open air.",
                  "examples": [
                    "A slepe hym toke / In hys closet."
                  ]
                }
              ]
            },
            {
              "group": "(now rare) Any private or inner room, (particularly):",
              "entries": [
                {
                  "meaning": "(obsolete) A private room used by women to groom and dress themselves.",
                  "examples": [
                    "Closet for a lady to make her redy in, chamberette."
                  ]
                },
                {
                  "meaning": "(archaic) A private room used for prayer or other devotions.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively, archaic) A place of (usually, fanciful) contemplation and theorizing.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) The private residence or private council chamber of a monarch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pew or side-chapel reserved for a monarch or other feudal lord.",
                  "examples": [
                    "Chaplayneȝ to þe chapeles chosen þe gate... / Þe lorde loutes þerto, & þe lady als, / In-to a comly closet coyntly ho entreȝ."
                  ]
                }
              ]
            },
            {
              "group": "A private cabinet, (particularly):",
              "entries": [
                {
                  "meaning": "(obsolete) One used to store valuables.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) One used to store curiosities.",
                  "examples": [
                    "Mr. Tradescant and his wife told me they had been long considering upon whom to bestow their closet of curiosities when they died."
                  ]
                },
                {
                  "meaning": "(figuratively) A secret or hiding place, (particularly) the hiding place in English idioms such as in the closet and skeleton in the closet.",
                  "examples": [
                    "Went the sonne of god oute of the pryuy closet of the maydens wombe."
                  ]
                },
                {
                  "meaning": "(slang, uncommon) Clipping of closet case.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(now chiefly Scotland, Ireland) Any small room or side-room, (particularly):",
              "entries": [
                {
                  "meaning": "(US, Philippines) One intended for storing clothes or bedclothes.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Clipping of closet of ease, (later, UK) clipping of water closet: a room containing a toilet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) An ordinary similar to a bar but half as broad.",
                  "examples": [
                    "Coordinate term: barrulet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, obsolete) A sewer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A state or condition of secrecy, privacy, or obscurity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "closet (third-person singular simple present closets, present participle closeting, simple past and past participle closeted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shut away for private discussion.",
                  "examples": [
                    "The ambassador has been closeted with the prime minister all afternoon. We're all worried what will be announced when they exit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put into a private place for a secret interview or interrogation.",
                  "examples": [
                    "He was to call a new legislature, to closet its members."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shut up in, or as in, a closet for concealment or confinement.",
                  "examples": [
                    "See what contempt is fallen on human kind;  […]  See Bedlam's closeted and handcuff'd charge / Surpass'd in frenzy by the mad at large;"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}