{
  "word": "windmill",
  "etymologies": [
    {
      "description": [
        "From Middle English wyndmylne, wyndmylle, equivalent to wind +‎ mill. Cognate with Scots wyndmyln, wyndmyl, Saterland Frisian Wíendmäälne, West Frisian wynmûne, Dutch windmolen, Afrikaans windmeul, Dutch Low Saxon windmölle (Achterhooks), wiendmeule (Drents, Veluws), German Low German Windmöhl, German Windmühle, Danish vindmølle, Norwegian Bokmål vindmølle, Norwegian Nynorsk vindmølle, vindmylne, Swedish vindmölla, Icelandic vindmylla."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "windmill (plural windmills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine which translates linear motion of wind to rotational motion by means of adjustable vanes called sails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The structure containing such machinery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A child's toy consisting of vanes mounted on a stick that rotate when blown by a person or by the wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) A dunk where the dunker swings his arm in a circular motion before throwing the ball through the hoop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A pitch where the pitcher swings his arm in a circular motion before throwing the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A guitar move where the strumming hand mimics a turning windmill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A breakdancing move in which the dancer rolls his/her torso continuously in a circular path on the floor, across the upper chest, shoulders and back, while twirling the legs in a V shape in the air.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various muscle exercises in which a large deal of the body makes a great circle, typically one where a kettlebell is raised overhead and the torso is rotated to the other side with the hand reaching its foot (hitting the core, glutes, hamstrings, trapezius, rhomboids, deltoids and rotator cuffs) but sometimes even a windshield wiper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various large papilionid butterflies of the genus Byasa, the wings of which resemble the vanes of a windmill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling) The false shower.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) An imaginary enemy, but presented as real.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "windmill (third-person singular simple present windmills, present participle windmilling, simple past and past participle windmilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To rotate with a sweeping motion.",
                  "examples": [
                    "She ran down the hill, windmilling her arms with glee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a rotating part of a machine, to (become disengaged and) rotate freely.",
                  "examples": [
                    "The axle broke and the wheel windmilled in place briefly before careening through the wall."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}