{
  "word": "spot",
  "etymologies": [
    {
      "description": [
        "From Middle English spot, spotte, partially from Middle Dutch spotte (“spot, speck”), and partially merging with Middle English splot, from Old English splott (“spot, plot of land”). Cognate with North Frisian spot (“speck, piece of ground”), Low German spot (“speck”), Old Norse spotti (“small piece”). See also splot, splotch."
      ],
      "adjectives": [
        {
          "description": "spot (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(commerce, finance) Available on the spot; for immediate payment or delivery.",
                  "examples": [
                    "spot wheat",
                    "spot cash",
                    "a spot contract"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "spot (plural spots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A round or irregular patch on the surface of a thing having a different color, texture etc. and generally round in shape.",
                  "examples": [
                    "The leopard is noted for the spots of color in its fur.",
                    "Why do ladybugs have spots?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stain or disfiguring mark.",
                  "examples": [
                    "I have tried everything, and I can’t get this spot out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pimple, papule or pustule.",
                  "examples": [
                    "That morning, I saw that a spot had come up on my chin.",
                    "I think she's got chicken pox; she's covered in spots."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, unspecified amount or quantity.",
                  "examples": [
                    "Do come 'round on Sunday for a spot of tea, won't you?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, US) A bill of five-dollar or ten-dollar denomination in dollars.",
                  "examples": [
                    "Here's the twenty bucks I owe you, a ten spot and two five spots."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A location or area.",
                  "examples": [
                    "I like to eat lunch in a pleasant spot outside.",
                    "For our anniversary we went back to the same spot where we first met."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A parking space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) An official determination of placement.",
                  "examples": [
                    "The fans were very unhappy with the referee's spot of the ball."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bright lamp; a spotlight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, advertising) A brief advertisement or program segment on television.",
                  "examples": [
                    "Did you see the spot on the news about the shoelace factory?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A difficult situation.",
                  "examples": [
                    "Synonyms: predicament; see also Thesaurus:difficult situation",
                    "She was in a real spot when she ran into her separated husband while on a date."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gymnastics, dance, weightlifting) One who spots (supports or assists a maneuver, or is prepared to assist if safety dictates); a spotter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) Penalty spot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of spotting or noticing something.",
                  "examples": [
                    "You've misspelled \"terrapin\" here. —Whoops. Good spot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A variety of the common domestic pigeon, so called from a spot on its head just above the beak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A food fish (Leiostomus xanthurus) of the Atlantic coast of the United States, with a black spot behind the shoulders and fifteen oblique dark bars on the sides.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The southern redfish, or red horse (Sciaenops ocellatus), which has a spot on each side at the base of the tail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, brokers' slang, dated) Commodities, such as merchandise and cotton, sold for immediate delivery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An autosoliton.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A decimal point; point.",
                  "examples": [
                    "Twelve spot two five pounds sterling. ― £12.25"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various points marked on the table, from which balls are played, in snooker, pool, billiards, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the balls marked with spots in the game of pool, which one player aims to pot, the other player taking the stripes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spot (third-person singular simple present spots, present participle spotting, simple past and past participle spotted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To see, find; to pick out, notice, locate, distinguish or identify.",
                  "examples": [
                    "Try to spot the differences between these two pictures."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) To loan a small amount of money to someone.",
                  "examples": [
                    "I’ll spot you ten dollars for lunch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To stain; to leave a spot (on).",
                  "examples": [
                    "Hard water will spot if it is left on a surface.",
                    "a garment spotted with mould"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove, or attempt to remove, a stain.",
                  "examples": [
                    "I spotted the carpet where the child dropped spaghetti."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To retouch a photograph on film to remove minor flaws.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gymnastics, dance, weightlifting, climbing) To support or assist a maneuver, or to be prepared to assist if safety dictates.",
                  "examples": [
                    "I can’t do a back handspring unless somebody spots me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance) To keep the head and eyes pointing in a single direction while turning.",
                  "examples": [
                    "Most figure skaters do not spot their turns like dancers do."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To stain; to blemish; to taint; to disgrace; to tarnish, as reputation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut or chip (timber) in preparation for hewing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly snooker and billiards) To place an object at a location indicated by a spot.",
                  "examples": [
                    "The referee had to spot the pink on the blue spot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, military, transitive) To position (an aircraft) on the deck of an aircraft carrier ready for launch by catapult.",
                  "examples": [
                    "The aircraft is spotted on the catapult, and the console operator turns the crank to FIRST READY, causing the exhaust valve to close."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, transitive) To position (a locomotive or car) at a predetermined point, e.g., for loading or unloading.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}