{
  "word": "encyclopedic",
  "etymologies": [
    {
      "description": [
        "1824, encyclopedia +‎ -ic."
      ],
      "adjectives": [
        {
          "description": "encyclopedic (comparative more encyclopedic, superlative most encyclopedic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to the characteristics of an encyclopedia; concerning all subjects, having comprehensive information or knowledge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(lexicography) Relating to or containing descriptive information rather than only linguistic or lexical information; about facts and concepts, and not only a word or term; including proper names, biographical and geographical information and illustrations.",
                  "examples": [
                    "[p 151] Although separate encyclopedic sections have nothing to do with the dictionary proper, there are no compelling logical reasons for condemning them.",
                    "[p 212] Terms derived from names fall into three categories. Some, like Chomskyan, refer to a person and the work done by that person, or to a place or a person from that place (Virginian, Londoner), and should be defined only in relation to the person or place. They are essentially encyclopedic entries and, if the dictionary contains an entry for the person or place in question, could well be run on without a separate definition.",
                    "[p 359] The difficulty of distinguishing between lexical units and items in a nomenclature is especially nettlesome in specialized dictionaries, which are by their nature more encyclopedic than general dictionaries."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}