{
  "word": "sleeve",
  "etymologies": [
    {
      "description": [
        "From Middle English sleve, slefe, from Old English slīef and slīefe (“sleeve”). Cognate with Saterland Frisian Sleeuwe (“sleeve”), West Frisian slúf, Dutch sloof (“apron”), Low German sluve, dialectal German Schlaube.",
        "The Canadian sense of “measure smaller than a pint” is due to a former conflict between federal law and provincial law in British Columbia. According to federal law, a pint must be 20 imperial ounces (~568 ml), but according to provincial law at the time, the maximum individual serving size was 500 ml, so an individual portion could not be called a “pint” in British Columbia, and required a different term. The provincial law has been changed, allowing servings of up to 24 oz (~682 ml), but the term remains in use. The term sleeve itself for a cylindrical glass of beer is also found in the UK and Australia (as sleever), and may be due to stacked glasses resembling a sleeve."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sleeve (plural sleeves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a garment that covers the arm. [from 10th c.]",
                  "examples": [
                    "The sleeves on my coat are too long."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A (usually tubular) covering or lining to protect a piece of machinery etc. [from 19th c.]",
                  "examples": [
                    "This bearing requires a sleeve so the shaft will fit snugly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A protective jacket or case, especially for a record, containing art and information about the contents; also the analogous leaflet found in a packaged CD. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tattoo covering the whole arm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A narrow channel of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sleave; untwisted thread.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(British Columbia) A serving of beer smaller than a pint, typically measuring between 12 and 16 ounces.",
                  "examples": [
                    "For example, you may serve a patron a 12 oz sleeve of beer and a 5 oz glass of wine (or alternately 1.5 oz spirits) at the same time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A long, cylindrical plastic bag of cookies or crackers.",
                  "examples": [
                    "A three-alarm fire tore through a family home on Newark's East Side early Saturday morning, completely gutting the two-story residence and tragically claiming a half-sleeve of Oreo cookies that was trapped inside a cupboard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical engineering) A double tube of copper into which the ends of bare wires are pushed so that when the tube is twisted an electrical connection is made. The joint thus made is called a McIntire joint.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sleeve (third-person singular simple present sleeves, present participle sleeving, simple past and past participle sleeved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fit and attach a sleeve to an upper garment (e.g. to a shirt, blouse, sweater, jacket, coat, etc.) or to a folder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(magic tricks) To hide something up one's sleeve.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}