{
  "word": "swoop",
  "etymologies": [
    {
      "description": [
        "From Middle English swopen, from Old English swāpan (“to sweep”). See also sweep, which was probably the basis for analogical restoration of /w/ in this word."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swoop (plural swoops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance, or the act of suddenly plunging downward.",
                  "examples": [
                    "The quality of decision is like the well-timed swoop of a falcon which enables it to strike and destroy its victim. – Sun Tzu"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden act of seizing.",
                  "examples": [
                    "Fortune's a right whore. If she give ought, she deals it in small parcels, that she may take away all at one swoop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A quick passage from one note to the next.",
                  "examples": [
                    "Originally, computers' attempts at making music were recognizable by their beeps and boops and weird swoops."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swoop (third-person singular simple present swoops, present participle swooping, simple past and past participle swooped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fly or glide downwards suddenly; to plunge (in the air) or nosedive.",
                  "examples": [
                    "The lone eagle swooped down into the lake, snatching its prey, a small fish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move swiftly, as if with a sweeping movement, especially to attack something.",
                  "examples": [
                    "The dog had enthusiastically swooped down on the bone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fall on at once and seize; to catch while on the wing.",
                  "examples": [
                    "And his Eagles, which can with the same ease as a kite swoops a chicken, snatch up a strong built Chamber of wood 12 foot square, & well crampt & fortified with Iron, with all its furniture, & a man besides, & carry it to the Clouds?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seize; to catch up; to take with a sweep.",
                  "examples": [
                    "And now at last you come to swoop it all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass with pomp; to sweep.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, prison slang) To search the ground for discarded cigarette butts that can be made into new cigarettes.",
                  "examples": [
                    "He was forever diving into dustbins or swooping on to the ground for cigarette ends."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}