{
  "word": "measure",
  "etymologies": [
    {
      "description": [
        "From Middle English mesure, from Old French mesure, from Latin mēnsūra (“a measure”), from mēnsus, past participle of mētīrī (“to measure”). Displaced native Old English metan (“to measure”) and ġemet (“a measure”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "measure (plural measures)",
          "definitionGroups": [
            {
              "group": "A prescribed quantity or extent.",
              "entries": [
                {
                  "meaning": "(obsolete) Moderation, temperance. [13th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A limit that cannot be exceeded; a bound. (Now chiefly in set phrases.) [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "An (unspecified) portion or quantity. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "The act or result of measuring.",
              "entries": [
                {
                  "meaning": "(now chiefly cooking) A receptacle or vessel of a standard size, capacity etc. as used to deal out specific quantities of some substance. [from 14th c.]",
                  "examples": [
                    "a measure of salt"
                  ]
                },
                {
                  "meaning": "A standard against which something can be judged; a criterion. [from 14th c.]",
                  "examples": [
                    "Honesty is the true measure of a man."
                  ]
                },
                {
                  "meaning": "Any of various standard units of capacity. [from 14th c.]",
                  "examples": [
                    "The villagers paid a tithe of a thousand measures of corn."
                  ]
                },
                {
                  "meaning": "A unit of measurement. [from 14th c.]",
                  "examples": [
                    "The fragments shrank by increments of about three kilodaltons (a measure of molecular weight)."
                  ]
                },
                {
                  "meaning": "The size of someone or something, as ascertained by measuring. (Now chiefly in make to measure.) [from 14th c.]",
                  "examples": [
                    "The measure thereof is longer than the earth, and broader than the sea."
                  ]
                },
                {
                  "meaning": "(now rare) The act or process of measuring. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "A ruler, measuring stick, or graduated tape used to take measurements. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(mathematics, now rare) A number which is contained in a given number a number of times without a remainder; a divisor or factor. [from 16th c.]",
                  "examples": [
                    "the greatest common measure of two or more numbers"
                  ]
                },
                {
                  "meaning": "(geology) A bed or stratum. [from 17th c.]",
                  "examples": [
                    "coal measures; lead measures"
                  ]
                },
                {
                  "meaning": "(mathematics) A function that assigns a non-negative number to a given set following the mathematical nature that is common among length, volume, probability and the like. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "Metrical rhythm.",
              "entries": [
                {
                  "meaning": "(now archaic) A melody. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now archaic) A dance. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(poetry) The manner of ordering and combining the quantities, or long and short syllables; meter; rhythm; hence, a metrical foot. [from 15th c.]",
                  "examples": [
                    "a poem in iambic measure"
                  ]
                },
                {
                  "meaning": "(music) A musical designation consisting of all notes and or rests delineated by two vertical bars; an equal and regular division of the whole of a composition; a bar. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "A course of action.",
              "entries": [
                {
                  "meaning": "(in the plural) Actions designed to achieve some purpose; plans. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "A piece of legislation. [from 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "measure (third-person singular simple present measures, present participle measuring, simple past and past participle measured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To ascertain the quantity of a unit of material via calculated comparison with respect to a standard.",
                  "examples": [
                    "We measured the temperature with a thermometer.   You should measure the angle with a spirit level."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(stative) To be of (a certain size), to have (a certain measurement)",
                  "examples": [
                    "The window measured two square feet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To estimate the unit size of something.",
                  "examples": [
                    "I measure that at 10 centimetres."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To judge, value, or appraise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To obtain or set apart; to mark in even increments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) To traverse, cross, pass along; to travel over.",
                  "examples": [
                    "\"And for a very sensible reason; there never was but one like her; or, that is, I have always thought so until to-day,\" replied the tar, glancing toward Natalie; \"for my old eyes have seen pretty much everything they have got in this little world. Ha! I should like to see the inch of land or water that my foot hasn't measured.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To adjust by a rule or standard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To allot or distribute by measure; to set off or apart by measure; often with out or off.",
                  "examples": [
                    "With what measure ye mete, it shall be measured to you again."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}