{
  "word": "boast",
  "etymologies": [
    {
      "description": [
        "From Middle English bosten,  from bost (“boast, glory, noise, arrogance, presumption, pride, vanity”), probably of North Germanic origin, ultimately from Proto-Germanic *bausuz (“inflated, swollen, puffed up, proud, arrogant, bad”). Cognate with Scots bost, boist (“to threaten, brag, boast”), Anglo-Norman bost (“ostentation”) (from Germanic). Related to Norwegian baus (“proud, bold, daring”), dialectal German baustern (“to swell”), German böse (“evil, bad, angry”), Dutch boos (“evil, wicked, angry”), West Frisian boas (“bad, wicked, angry, shrewd, clever”). Compare also dialectal Norwegian bausta, busta (“to rush onward, make a noise”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boast (plural boasts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brag; ostentatious positive appraisal of oneself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that one brags about.",
                  "examples": [
                    "It was his regular boast that he could eat two full English breakfasts in one sitting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(squash) A shot where the ball is driven off a side wall and then strikes the front wall.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "boast (third-person singular simple present boasts, present participle boasting, simple past and past participle boasted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To brag; to talk loudly in praise of oneself.",
                  "examples": [
                    "On no account will he or any other kind be able to boast that he's escaped the pursuit of those who can follow so detailed and comprehensive a method of enquiry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To speak of with pride, vanity, or exultation, with a view to self-commendation; to extol.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To speak in exulting language of another; to glory; to exult.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(squash) To play a boast shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ergative) To possess something special (e.g. as a feature).",
                  "examples": [
                    "The hotel boasts one of the best views of the sea.",
                    "His family boasted a famous name."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "boast (third-person singular simple present boasts, present participle boasting, simple past and past participle boasted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(masonry) To dress, as a stone, with a broad chisel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sculpting) To shape roughly as a preparation for the finer work to follow; to cut to the general form required.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}