{
  "word": "pantograph",
  "etymologies": [
    {
      "description": [
        "From French pantographe, from panto- (from Ancient Greek παντός (pantós), genitive singular of πᾶν (pân, “all”)), and -graphe (from γράφειν (gráphein, “to write”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pantograph (plural pantographs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanical linkage based on parallelograms causing two objects to move in parallel; notably as a drawing aid.",
                  "examples": [
                    "A pantograph can be adjusted to make either scaled or exact copies.",
                    "Synonym: lazy tongs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "By extension, a structure of crosswise bars linked in such a way that it can extend and compress like an accordion, such as in a pantograph mirror or a scissor lift.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pattern printed on a document to reduce the ease of photocopying.",
                  "examples": [
                    "I was impressed by the quality of the pantograph; I hadn't noticed it on the original, but the copies were covered in unpleasant lines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A similarly-formed conductive device, now usually Z-shaped, that collects electric current from overhead lines for trains and trams.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pantograph (third-person singular simple present pantographs, present participle pantographing, simple past and past participle pantographed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To engrave by means of a pantograph (parallel linkage) system.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}