{
  "word": "mango",
  "etymologies": [
    {
      "description": [
        "Borrowed from Portuguese manga, from Malayalam മാങ്ങ (māṅṅa) ultimately from Proto Dravidian (reconstructed Proto-Dravidian *mām-kāy (“unripe mango”), a compound of *mām (“mango tree”) + *kāy (“unripe fruit”)). First used for the fruit as early as the 1580s and the tree by the 1670s.; Oxford English Dictionary says it ultimately stems from Malayalam മാങ്ങ (māṅṅa, “unripe mango”) (മാവ് (māvŭ, “mango tree”) + കായ (kāya, “unripe fruit”)), while the Online Etymology Dictionary points to Tamil மாங்காய் (māṅkāy, “unripe mango”) (மா (mā, “mango”) + காய் (kāy, “unripe fruit”)). The etymology of the -o ending is not certain."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mango (countable and uncountable, plural mangoes or mangos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tropical Asian fruit tree, Mangifera indica.",
                  "examples": [
                    "On the hot days, he would lie in the shade of a mango and let little Eugenia clamber over his belly and tug at his beard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fruit of the mango tree.",
                  "examples": [
                    "And I have one [bezoar] form'd round the Stone of that great Plum, which comes pickled from thence, and is called Mango."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pickled vegetable or fruit with a spicy stuffing; a vegetable or fruit which has been mangoed.",
                  "examples": [
                    "In Pennsylvania and western Maryland, mangoes were generally made with green bell peppers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, chiefly southern Midwestern US, dated) A green bell pepper suitable for pickling.",
                  "examples": [
                    "Mango peppers by the dozen, if owned by the careful housewife, would gladden the appetite or disposition of any epicure or scold."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of muskmelon, Cucumis melo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various hummingbirds of the genus Anthracothorax.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A yellow-orange color, like that of mango flesh.",
                  "examples": [
                    "mango:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mango (third-person singular simple present mangoes, present participle mangoing, simple past and past participle mangoed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) To stuff and pickle (a fruit).",
                  "examples": [
                    "Although any melon may be used before it is quite ripe, yet there is a particular sort for this purpose, which the gardeners know, and should be mangoed soon after they are gathered."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}