{
  "word": "assimilate",
  "etymologies": [
    {
      "description": [
        "Borrowed from Late Latin assimilātus, variant of Latin assimulātus (“made similar, imitated”), perfect passive participle of assimulō, from ad + simulō (“imitate, copy”), from similis (“like, similar”), ultimately from Proto-Indo-European *sem- (“together, one”). Doublet of assemble."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "assimilate",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is or has been assimilated.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "assimilate (third-person singular simple present assimilates, present participle assimilating, simple past and past participle assimilated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To incorporate nutrients into the body, especially after digestion.",
                  "examples": [
                    "Food is assimilated and converted into organic tissue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To incorporate or absorb (knowledge) into the mind.",
                  "examples": [
                    "The teacher paused in her lecture to allow the students to assimilate what she had said."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To absorb (a person or people) into a community or culture.",
                  "examples": [
                    "The aliens in the science-fiction film wanted to assimilate human beings into their own race."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare, used with \"to\" or \"with\") To liken, compare to something similar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring to a likeness or to conformity; to cause a resemblance between.",
                  "examples": [
                    "to assimilate our law in respect to the law of Scotland"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become similar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be incorporated or absorbed into something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}