{
  "word": "cakewalk",
  "etymologies": [
    {
      "description": [
        "From cake +‎ walk. Originally an African-American form of dance and music that developed after the Civil War, later popularised by minstrel shows. It was danced at social events, with the best dancers often receiving cake as a prize. It derives from dance competitions by plantation slaves in which the style of dance lampooned the ballroom dances of the slaveowners. Slaveowners seem to have found the competitions entertaining and the habit of offering cake may originate from this period. The name is sometimes also applied to the dance's precursor on the plantations. Doing the cakewalk well required virtuosity, and a major esthetic aspect of that virtuosity was the apparent ease with which the dance was performed. This gave rise to the idiom as easy as a cakewalk, which in turn led to the sense of cakewalk as something that is easy.",
        "See the linked Wikipedia article for more."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cakewalk (plural cakewalks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A contest in which cake was offered for the best dancers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The style of music associated with such a contest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(performing arts) The dance, or strutting style of dance associated with such a contest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(idiomatic) Something that is easy or simple, or that does not present a great challenge.",
                  "examples": [
                    "Synonyms: see Thesaurus:easy thing"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cakewalk (third-person singular simple present cakewalks, present participle cakewalking, simple past and past participle cakewalked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To perform the cakewalk dance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}