{
  "word": "wife",
  "etymologies": [
    {
      "description": [
        "From Middle English wyf, wif, from Old English wīf (“woman, wife”), from Proto-West Germanic *wīb, from Proto-Germanic *wībą (“woman, wife”).",
        "Germanic cognates include Scots wife (“wife”), West Frisian wiif (“wife, woman”), Saterland Frisian Wieuw (“woman, lady, female”), North Frisian wüf (“wife, woman”), Dutch wijf (“woman, female”), Low German Wief (“woman, female”), German Weib (“woman, wife, female”), Danish viv (“wife, woman”), Norwegian viv (“wife, woman, girl”), Swedish viv (“woman”), Faroese vív (“wife, woman”), Icelandic víf (“woman”).",
        "The further etymology is unknown, with a number of disputed suggestions. One suggestion connects Tocharian A/B kip/kwīpe (“genitals, female pudenda”), for a hypothetical Indo-European *gʰwíbʰ- (“pudenda”).\nAnother suggestion connects Old English wǣfan (“wrap, clothe”), Old Norse vífa (“wrap, veil”) for a suggested original motive of \"married woman wearing a scarf\".",
        "Yet another suggestion  connects Old High German weibon (“move to and fro”), Old Norse veifa (“swing, throw”), for a motive of \"one who is moving busily; housekeeper, maidservant\" (cf. German Weibel (“manservant, usher”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wife (plural wives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A married woman, especially in relation to her spouse.",
                  "examples": [
                    "The Fisherman and His Wife"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The female of a pair of mated animals.",
                  "examples": [
                    "A new wife for the gander is introduced into the pen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) Synonym of woman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wife (third-person singular simple present wifes, present participle wifing, simple past and past participle wifed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, African-American Vernacular) to marry (a woman)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}