{
  "word": "wash",
  "etymologies": [
    {
      "description": [
        "From Middle English wasshen, waschen, weschen, from Old English wasċan, from Proto-West Germanic *waskan, from Proto-Germanic *waskaną, *watskaną (“to wash, get wet”), from Proto-Indo-European *wed- (“wet; water”).",
        "Cognate with Saterland Frisian waaske (“to wash”), West Frisian waskje (“to wash”), Dutch wassen, wasschen (“to wash”), Low German waschen (“to wash”), German waschen (“to wash”), Danish vaske (“to wash”), Norwegian Bokmål vaske (“to wash”), Swedish vaska (“to wash”), Icelandic vaska (“to wash”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wash (plural washes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The process or an instance of washing or being washed by water or other liquid.",
                  "examples": [
                    "I'm going to have a quick wash before coming to bed.",
                    "My jacket needs a wash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A liquid used for washing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lotion or other liquid with medicinal or hygienic properties.",
                  "examples": [
                    "mouth wash",
                    "hand wash"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quantity of clothes washed at a time.",
                  "examples": [
                    "There's a lot in that wash: maybe you should split it into two piles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) A smooth and translucent painting created using a paintbrush holding a large amount of solvent and a small amount of paint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The breaking of waves on the shore; the onwards rush of shallow water towards a beach.",
                  "examples": [
                    "I could hear the wash of the wave."
                  ]
                }
              ]
            },
            {
              "group": "The bow wave, wake, or vortex of an object moving in a fluid, in particular:",
              "entries": [
                {
                  "meaning": "The bow wave or wake of a moving ship, or the vortex from its screws.",
                  "examples": [
                    "The ship left a big wash",
                    "Sail away from the wash to avoid rocking the boat."
                  ]
                },
                {
                  "meaning": "The turbulence left in the air by a moving airplane.",
                  "examples": []
                },
                {
                  "meaning": "The backward current or disturbed water caused by the action of oars, or of a steamer's screw or paddles, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The blade of an oar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ground washed away to the sea or a river.",
                  "examples": [
                    "The wash of pastures, fields, commons, and roads,  […] where rain water hath a long time settled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of ground washed by the action of water, or sometimes covered and sometimes left dry; the shallowest part of a river, or arm of the sea; also, a bog; a marsh.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shallow body of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In arid and semi-arid regions, the normally dry bed of an intermittent or ephemeral stream; an arroyo or wadi.",
                  "examples": [
                    "In some desert-wash systems (which have been termed “xero-riparian”)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A situation in which losses and gains or advantages and disadvantages are equivalent; a situation in which there is no net change.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, slang) A fictitious kind of sale of stock or other securities between parties of one interest, or by a broker who is both buyer and seller, and who minds his own interest rather than that of his clients.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Waste liquid, the refuse of food, the collection from washed dishes, etc., from a kitchen, often used as food for pigs; pigwash.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In distilling, the fermented wort before the spirit is extracted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mixture of dunder, molasses, water, and scummings, used in the West Indies for distillation.",
                  "examples": [
                    "In order to augment the vinosity of the wash, many substances are recommended by Dr. Shaw, such as tartar, nitre, common salt, and the vegetable or mineral acids."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin coat of paint or metal laid on anything for beauty or preservation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ten strikes, or bushels, of oysters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The upper surface of a member or material when given a slope to shed water; hence, a structure or receptacle shaped so as to receive and carry off water.",
                  "examples": [
                    "a carriage wash in a stable"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A lighting effect that fills a scene with a chosen colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(stagecraft) A lighting fixture that can cast a wide beam of light to evenly fill an area with light, as opposed to a spotlight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wash (third-person singular simple present washes, present participle washing, simple past washed, past participle washed or (archaic) washen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To clean with water.",
                  "examples": [
                    "The car is so dirty, we need to wash it.",
                    "Dishwashers wash dishes much more efficiently than most humans."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move or erode by the force of water in motion.",
                  "examples": [
                    "Heavy rains wash a road or an embankment.",
                    "The flood washed away houses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) To separate valuable material (such as gold) from worthless material by the action of flowing water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To clean oneself with water.",
                  "examples": [
                    "I wash every morning after getting up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with water or any liquid; to wet; to fall on and moisten.",
                  "examples": [
                    "Waves wash the shore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move with a lapping or swashing sound; to lap or splash.",
                  "examples": [
                    "to hear the water washing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be eroded or carried away by the action of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To be cogent, convincing; to withstand critique.",
                  "examples": [
                    "The king is running out of ideas as well as cash. His favourite shock-absorbing tactic—to blame his governments and sack his prime ministers—hardly washes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bear without injury the operation of being washed.",
                  "examples": [
                    "Some calicoes do not wash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be wasted or worn away by the action of water, as by a running or overflowing stream, or by the dashing of the sea; said of road, a beach, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover with a thin or watery coat of colour; to tint lightly and thinly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To overlay with a thin coat of metal.",
                  "examples": [
                    "steel washed with silver"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause dephosphorization of (molten pig iron) by adding substances containing iron oxide, and sometimes manganese oxide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pass (a gas or gaseous mixture) through or over a liquid for the purpose of purifying it, especially by removing soluble constituents.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}