{
  "word": "ell",
  "etymologies": [
    {
      "description": [
        "From Middle English elle, elne, from Old English eln (“the length of the forearm from the elbow to the tip of the middle finger; a unit of measure”), from Proto-Germanic *alinō, from Proto-Indo-European *Heh₃l-én-eh₂, from *Heh₃l- (“elbow, forearm”). Cognate with Dutch el (“ell”), German Low German Ell (“ell”), German Elle (“ell”), Swedish aln (“cubit; ell”), Icelandic alin (“cubit; ell”), Latin ulna (“forearm”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ell (plural ells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A measure of length. An English ell was 1¼ yards (45 inches or 114 cm), a Scottish ell was about 37 inches (94 cm), a Flemish ell was ¾ yard (27 inches or 69 cm), while certain European ells were less than 50 cm.",
                  "examples": [
                    "At certain times in the ice-mountains of Switzerland there happen cracks which have shewn the great thickness of the ice, as some of these cracks have measured three or four hundred ells deep."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the name of the letter L."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ell (plural ells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The name of the Latin-script letter L. (more commonly el)",
                  "examples": [
                    "I have drunk en-ee-cee-tee-ay-ar from the ef-ell-oh-doubleyou-ee-ar-ess in his gee-ay-ar-dee-ee-en many a time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An extension usually at right angles to one end of a building.",
                  "examples": [
                    "I could hear them snapping and tearing around, and then one managed to get on the roof by jumping from the low ell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is L-shaped.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}