{
  "word": "gape",
  "etymologies": [
    {
      "description": [
        "Middle English gapen, from Old Norse gapa (“to gape”) (compare Swedish gapa, Danish gabe), from Proto-Germanic *gapōną (descendants Middle English geapen, Dutch gapen, German gaffen), perhaps from Proto-Indo-European *ǵʰеh₂b-. Cognates include Russian зяпа (zjapa)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gape (countable and uncountable, plural gapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) An act of gaping; a yawn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large opening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A disease in poultry caused by gapeworm in the windpipe, a symptom of which is frequent gaping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The width of an opening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) The maximum opening of the mouth (of a bird, fish, etc.) when it is open.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gape (third-person singular simple present gapes, present participle gaping, simple past and past participle gaped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To open the mouth wide, especially involuntarily, as in a yawn, anger, or surprise.",
                  "examples": [
                    "She stretches, gapes, unglues her eyes, / And asks if it be time to rise;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stare in wonder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To open wide; to display a gap.",
                  "examples": [
                    "\"Nor is he deterr'd from the belief of the perpetual flying of the Manucodiata, by the gaping of the feathers of her wings, (which seem thereby less fit to sustain her body) but further makes the narration probable by what he has observed in Kites hovering in the Aire, as he saith, for a whole hour together without any flapping of their wings or changing place.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a cat) To open the passage to the vomeronasal organ, analogous to the flehming in other animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pornography) To depict a dilated anal or vaginal cavity upon penetrative sexual activity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}