{
  "word": "whittle",
  "etymologies": [
    {
      "description": [
        "From Middle English whittel (“large knife”), an alteration of thwitel, itself from thwiten (“to whittle”), from Old English þwītan (“to strike down, whittle”), from Proto-Germanic *þwītaną, from Proto-Indo-European *tweys- (“to shake, hurl, toss”). Compare Old Norse þveita (“to hurl”), Ancient Greek σείω (seíō, “I shake”). Related to thwite and thwaite."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whittle (plural whittles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A knife; especially, a pocket knife, sheath knife, or clasp knife.",
                  "examples": [
                    "A butcher's whittle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "whittle (third-person singular simple present whittles, present participle whittling, simple past and past participle whittled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To cut or shape wood with a knife.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce or gradually eliminate something (such as a debt).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To make eager or excited; to excite with liquor; to inebriate.",
                  "examples": [
                    "When men are well whitled, their toungs run at randome"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English whytel, from Old English hwītel (“cloak, blanket”), from Proto-West Germanic *hwītil, from Proto-Germanic *hwītilaz, equivalent to white +‎ -le; akin to Icelandic hvítill (“white bedcover, sheet, linen”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whittle (plural whittles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A coarse greyish double blanket worn by countrywomen, in the west of England, over the shoulders, like a cloak or shawl.",
                  "examples": [
                    "Her figure is tall , graceful , and slight ; the severity of its outlines suiting well with the severity of her dress , with the brown stuff gown , and plain gray whittle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A whittle shawl; a kind of fine woollen shawl, originally and especially a white one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}