{
  "word": "mend",
  "etymologies": [
    {
      "description": [
        "From Middle English menden, by apheresis for amenden (“to amend”); see amend."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mend (plural mends)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place, as in clothing, which has been repaired by mending.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of repairing or recovering.",
                  "examples": [
                    "My trousers have a big rip in them and need a mend."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mend (third-person singular simple present mends, present participle mending, simple past and past participle mended)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To repair (something that is torn, broken, defaced, decayed, or otherwise damaged)",
                  "examples": [
                    "My trousers have a big rip in them and need mending.",
                    "When your car breaks down, you can take it to the garage to have it mended."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put in a better state; to set right; to reform;",
                  "examples": [
                    "Her stutter was mended by a speech therapist.",
                    "My broken heart was mended."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To quicken",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To help, to advance, to further; to add to.",
                  "examples": [
                    "Though in some lands the grass is but short, yet it  […] mends garden herbs and fruit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To grow better; to advance to a better state; to become improved.",
                  "examples": [
                    "We have had terrible rains these two or three days. I intended to dine at lord treasurer's, but went to see lady Abercorn, who is come to town, and my lord; and I dined with them, and visited lord treasurer this evening. His porter is mending."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}