{
  "word": "party",
  "etymologies": [
    {
      "description": [
        "From Middle English party, partye, partie, from Anglo-Norman partie, from Medieval Latin partīta (“a part, party”), from Latin partīta, feminine of partītus, past participle of partior (“to divide”); see part. Doublet of partita."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "party (plural parties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A person or group of people constituting a particular side in a contract or legal action.",
                  "examples": [
                    "The contract requires that the party of the first part pay the fee."
                  ]
                }
              ]
            },
            {
              "group": "A person.",
              "entries": [
                {
                  "meaning": "(slang, dated) A person; an individual.",
                  "examples": [
                    "He is a queer party."
                  ]
                },
                {
                  "meaning": "With to: an accessory, someone who takes part.",
                  "examples": [
                    "I can't possibly be a party to that kind of reckless behaviour."
                  ]
                }
              ]
            },
            {
              "group": "(now rare in general sense) A group of people forming one side in a given dispute, contest etc.",
              "entries": [
                {
                  "meaning": "(role-playing games, online gaming) Active player characters organized into a single group.",
                  "examples": []
                },
                {
                  "meaning": "(video games) A group of characters controlled by the player.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) A political group considered as a formal whole, united under one specific political platform of issues and campaigning to take part in government.",
                  "examples": [
                    "The green party took 12% of the vote."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A discrete detachment of troops, especially for a particular purpose.",
                  "examples": [
                    "The settlers were attacked early next morning by a scouting party."
                  ]
                }
              ]
            },
            {
              "group": "A group of persons collected or gathered together for some particular purpose.",
              "entries": [
                {
                  "meaning": "A gathering of usually invited guests for entertainment, fun and socializing.",
                  "examples": [
                    "I'm throwing a huge party for my 21st birthday."
                  ]
                },
                {
                  "meaning": "A group of people traveling or attending an event together, or participating in the same activity.",
                  "examples": [
                    "We're expecting a large party from the London office.",
                    "Do you have a table available for a party of four?"
                  ]
                },
                {
                  "meaning": "A gathering of acquaintances so that one of them may offer items for sale to the rest of them.",
                  "examples": [
                    "Tupperware party",
                    "lingerie party"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small group of birds or mammals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A part or division.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "party (third-person singular simple present parties, present participle partying, simple past and past participle partied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To celebrate at a party, to have fun, to enjoy oneself.",
                  "examples": [
                    "We partied until the early hours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, euphemistic) To take recreational drugs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in flings, to have one-night stands, to sow one's wild oats.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming, intransitive) To form a party (with).",
                  "examples": [
                    "If you want to beat that monster, you should party with a healer."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English party, from Old French parti (“parted”), from Latin partītus (“parted”), past participle of partiri (“to divide”). More at part."
      ],
      "adjectives": [
        {
          "description": "party (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a fence or wall: shared by two properties and serving to divide them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, except in compounds) Divided; in part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) Parted or divided, as in the direction or form of one of the ordinaries.",
                  "examples": [
                    "an escutcheon party per pale"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}