{
  "word": "science",
  "etymologies": [
    {
      "description": [
        "From Middle English science, scyence, borrowed from Old French science, escience, from Latin scientia (“knowledge”), from sciens, the present participle stem of scire (“to know”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "science (countable and uncountable, plural sciences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A particular discipline or branch of learning, especially one dealing with measurable or systematic principles rather than intuition or natural ability. [from 14th c.]",
                  "examples": [
                    "Of course in my opinion Social Studies is more of a science than an art."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specifically the natural sciences.",
                  "examples": [
                    "My favorite subjects at school are science, mathematics, and history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, archaic) Knowledge gained through study or practice; mastery of a particular discipline or area. [from 14th c.]",
                  "examples": [
                    "If we conceive God's sight or science, before the creation, to be extended to all and every part of the world, seeing everything as it is,  […]  his science or sight from all eternity lays no necessity on anything to come to pass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now only theology) The fact of knowing something; knowledge or understanding of a truth. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The collective discipline of study or learning acquired through the scientific method; the sum of knowledge gained from such methods and discipline. [from 18th c.]",
                  "examples": [
                    "I have found no better expression than \"religious\" for confidence in the rational nature of reality […] Whenever this feeling is absent, science degenerates into uninspired empiricism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Knowledge derived from scientific disciplines, scientific method, or any systematic effort.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, collective) The scientific community.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, with definite article) Synonym of sweet science (“the sport of boxing”)",
                  "examples": [
                    "From a conviction, that the science is universally understood, the strong are taught humility, and the weak confidence. Many have laughed at the idea, that Boxing is of national service, but they have laughed at the expence[sic] of truth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "science (third-person singular simple present sciences, present participle sciencing, simple past and past participle scienced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To cause to become versed in science; to make skilled; to instruct.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial, humorous) To use science to solve a problem.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See scion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "science",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of scion",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}