{
  "word": "position",
  "etymologies": [
    {
      "description": [
        "From Middle English posicioun, from Old French posicion, from Latin positio (“a putting, position”), from ponere, past participle positus (“to put, place”); see ponent. Compare apposition, composition, deposition; see pose."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "position (plural positions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place or location.",
                  "examples": [
                    "Synonym: (obsolete) stead"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A post of employment; a job.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A status or rank.",
                  "examples": [
                    "Chief of Staff is the second-highest position in the army."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An opinion, stand, or stance.",
                  "examples": [
                    "My position on this issue is unchanged."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A posture.",
                  "examples": [
                    "Stand in this position, with your arms at your side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A situation suitable to perform some action.",
                  "examples": [
                    "The school is not in a position to provide day-care after 4:00 pm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(team sports) A place on the playing field, together with a set of duties, assigned to a player.",
                  "examples": [
                    "Stop running all over the field and play your position!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) An amount of securities, commodities, or other financial instruments held by a person, firm, or institution.",
                  "examples": [
                    "long position",
                    "naked position"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A commitment, or a group of commitments, such as options or futures, to buy or sell a given amount of financial instruments, such as securities, currencies or commodities, for a given price.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(arithmetic) A method of solving a problem by one or two suppositions; also called the rule of trial and error.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) The full state of a chess game at any given turn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker)  The order in which players are seated around the table.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "position (third-person singular simple present positions, present participle positioning, simple past and past participle positioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put into place.",
                  "examples": [
                    "While other small nations with large banking sectors, such as Iceland and Ireland, have been undone by their reckless lending practices, the debt-free Channel Islands have always positioned themselves as dependable repositories of riches."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}