{
  "word": "nigger",
  "etymologies": [
    {
      "description": [
        "Probably immediately from French nègre or Spanish and Portuguese negro (“a black African”); ultimately from Latin niger (“black”), thus a doublet of negro and noir. Compare Danish nigger, Swedish nigger, German Nigger, Dutch nikker.",
        "The expected Modern English pronunciation would be with /iː/; compare neger. The modern pronunciation with /ɪ/ may be due to influence from the Latin etymon (compare the older Southern US pronunciation of negro with /ɪ/), but compare the dialectal American pronunciations of eagle and eager as /ˈɪɡəl/ and /ˈɪɡɚ/."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nigger (plural niggers, feminine niggeress)",
          "definitionGroups": [
            {
              "group": "(offensive, ethnic slur, vulgar, see usage notes) A black person; a person of black African descent.",
              "entries": [
                {
                  "meaning": "(offensive, ethnic slur, vulgar, slang) A person of black African descent who acts in an unapproved manner (whether positive or negative).",
                  "examples": [
                    "...and as I was leaving it occurred to me. \"Hey, hey, Renee, quick question[...] Why is it that I can say the word ‘nigger’ with impunity but I can't say the word ‘faggot’?\" And she said, \"Because, David, you are not gay.\" I said, \"Well, Renee... I'm not a nigger either.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(offensive, ethnic slur, vulgar, see usage notes) A member of any typically dark-skinned people (now especially in combinations like prairie nigger or sand nigger).",
                  "examples": [
                    "Many of the rank and file had no better conception of the proud and sensitive Maori than was implied in the degrading ‘nigger’ theory, invariably applied by the unthinking Briton to all coloured races."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular) A friend, particularly a fellow black person, often used as an informal term of address.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, especially African-American Vernacular, otherwise offensive) A person of any kind (particularly as a term of abuse).",
                  "examples": [
                    "People be surprised. I have friends who're all kinds a letters. Everybody loves me an' I love everybody. I got friends who are Ls, I got friends who are Bs, and I got friends who are Gs. But the Ts hate my fucking guts. And I don't blame 'em! It's not their fault. It's mine. I can't stop tellin' jokes about these niggas."
                  ]
                }
              ]
            },
            {
              "group": "(now offensive) Any of various dark animals:",
              "entries": [
                {
                  "meaning": "(now offensive) A fish, the luderick (Girella tricuspidata).",
                  "examples": []
                },
                {
                  "meaning": "(now offensive, dated) A dark brown nymphalid butterfly, Orsotriaena medus, of south Asia, southeast Asia, and Australia.",
                  "examples": []
                },
                {
                  "meaning": "(UK, Cornwall, fishing, archaic) A kind of sea cucumber, Holothuria forskali, the cotton-spinner.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) The larva of the turnip sawfly, an agricultural pest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, electrical) An impurity in the covering of an electrical conductor which serves to make a partial short circuit, and thus becomes sufficiently heated to burn and destroy the insulation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A strong iron-bound timber with sharp teeth or spikes protruding from its front face, forming part of the machinery of a sawmill, and used in canting logs, etc.",
                  "examples": [
                    "A sawyer will come along and be touted and recommended as the best in the country when his chief qualifications will be his ability to jerk the carriage back and forth in a hurry without striking the bumper or to turn the log with the nigger  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, US) A steam-capstan on some Mississippi river boats, used to haul the boat over bars and snags by a rope fastened to a tree on the bank.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, dated) A black screen used in conjunction with the camera to block light or produce special lighting effects.",
                  "examples": [
                    "Care should be taken to check visually from the position occupied by the subject and from the camera also, to ascertain that the nigger is positioned correctly and does not obstruct the picture area."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nigger (third-person singular simple present niggers, present participle niggering, simple past and past participle niggered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To clear land by laying light pieces of round timber across the trunks of the trees and setting fire to them at the point of contact, by which means the trees are slowly burned through.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To exhaust (soil) by cropping it year by year without manure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now offensive) To perform in blackface.",
                  "examples": [
                    "There is a general agreement that niggering took over from mummering to keep up the old custom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, offensive) To behave as a stereotypical black person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon, transitive, offensive) To treat as inferior.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}