{
  "word": "chapel",
  "etymologies": [
    {
      "description": [
        "From Middle English chapele, chapel, from Old French chapele, from Late Latin cappella (“little cloak; chapel”), diminutive of cappa (“cloak, cape”). Doublet of capelle.",
        "(printing office): Said to be because printing was first carried on in England in a chapel near Westminster Abbey."
      ],
      "adjectives": [
        {
          "description": "chapel (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Wales) Describing a person who attends a nonconformist chapel.",
                  "examples": [
                    "The village butcher is chapel."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "chapel (plural chapels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially Christianity) A place of worship, smaller than or subordinate to a church.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place of worship in another building or within a civil institution such as a larger church, airport, prison, monastery, school, etc.; often primarily for private prayer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A funeral home, or a room in one for holding funeral services.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A trade union branch in printing or journalism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A printing office.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A choir of singers, or an orchestra, attached to the court of a prince or nobleman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chapel (third-person singular simple present chapels, present participle chapelling, simple past and past participle chapelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive) To cause (a ship taken aback in a light breeze) to turn or make a circuit so as to recover, without bracing the yards, the same tack on which she had been sailing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To deposit or inter in a chapel; to enshrine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}