{
  "word": "mugwump",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Massachusett mugquomp, mummugquomp (“war leader”). Folk etymology reinterpreted it as referring to a person who sat on the fence with their mug (“face”) on one side and wump (“rump”) on the other, which influenced political cartoons during the 1884 United States presidential election.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mugwump (plural mugwumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly humorous) A (male) leader; an important (male) person.",
                  "examples": [
                    "Synonyms: see Thesaurus:important person",
                    "Antonyms: see Thesaurus:nonentity"
                  ]
                }
              ]
            },
            {
              "group": "(politics)",
              "entries": [
                {
                  "meaning": "(US, historical) A member of the Republican Party who declined to support the party's nominee James G. Blaine (1830–1893) during the 1884 United States presidential election, believing him to be corrupt, and instead supported the Democratic Party's candidate Grover Cleveland (1837–1908).",
                  "examples": []
                },
                {
                  "meaning": "(by extension) A person who purports to stay aloof from party politics.",
                  "examples": []
                },
                {
                  "meaning": "(Australia, US, by extension) One who switches from supporting one political party to another, especially for personal benefit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, US, by extension, colloquial, somewhat derogatory) A person who stays neutral or non-committal; a fence sitter; also, a person who maintains an aloof and often self-important demeanour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A foolish person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mugwump (third-person singular simple present mugwumps, present participle mugwumping, simple past and past participle mugwumped) (chiefly US)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To behave like a mugwump.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To purport to stay aloof and independent, especially from party politics.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}