{
  "word": "quintessence",
  "etymologies": [
    {
      "description": [
        "From Middle English, borrowed from Middle French, from Medieval Latin quinta essentia (“fifth essence, aether”). \"Essence\" in this context is a synonym for \"element\". In pre-atomic/Aristotlean theory, there are four known elements or essences — Earth, Air, Fire and Water — and a putative fifth element (aether), which is considered to be of exceptional superior quality to the other four basic elements."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quintessence (countable and uncountable, plural quintessences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing that is the most perfect example of its type; the most perfect embodiment of something; epitome, prototype.",
                  "examples": [
                    "Synonyms: see Thesaurus:model"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pure substance.",
                  "examples": [
                    "Synonyms: see Thesaurus:non-mixture",
                    ""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The essence of a thing in its purest and most concentrated form.",
                  "examples": [
                    "Synonyms: see Thesaurus:gist"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alchemy) The fifth alchemical element, or essence, after earth, air, fire, and water that fills the universe beyond the terrestrial sphere.",
                  "examples": [
                    "Synonym: aether"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A hypothetical form of dark energy postulated to explain observations of an accelerating universe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quintessence (third-person singular simple present quintessences, present participle quintessencing, simple past and past participle quintessenced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce to its purest and most concentrated essence.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}