{
  "word": "engineer",
  "etymologies": [
    {
      "description": [
        "The noun is derived from:",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "engineer (plural engineers)",
          "definitionGroups": [
            {
              "group": "(military, also figuratively)",
              "entries": [
                {
                  "meaning": "A soldier engaged in designing or constructing military works for attack or defence, or other engineering works.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A soldier in charge of operating a weapon; an artilleryman, a gunner.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "A person professionally engaged in the technical design and construction of large-scale private and public works such as bridges, buildings, harbours, railways, roads, etc.; a civil engineer.",
                  "examples": []
                },
                {
                  "meaning": "Originally, a person engaged in designing, constructing, or maintaining engines or machinery; now (more generally), a person qualified or professionally engaged in any branch of engineering, or studying to do so.",
                  "examples": []
                },
                {
                  "meaning": "A person trained to operate an engine; an engineman.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly historical) A person who operates a steam engine; specifically (nautical), a person employed to operate the steam engine in the engine room of a ship.",
                  "examples": []
                },
                {
                  "meaning": "(US, firefighting) A person who drives or operates a fire engine.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly US, rail transport) A person who drives or operates a locomotive; a train driver.",
                  "examples": []
                },
                {
                  "meaning": "Preceded by a qualifying word: a person who uses abilities or knowledge to manipulate events or people.",
                  "examples": [
                    "a political engineer"
                  ]
                },
                {
                  "meaning": "(often derogatory) A person who formulates plots or schemes; a plotter, a schemer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "engineer (third-person singular simple present engineers, present participle engineering, simple past and past participle engineered)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To employ one's abilities and knowledge as an engineer to design, construct, and/or maintain (something, such as a machine or a structure), usually for industrial or public use.",
                  "examples": []
                },
                {
                  "meaning": "(specifically) To use genetic engineering to alter or construct (a DNA sequence), or to alter (an organism).",
                  "examples": []
                },
                {
                  "meaning": "To plan or achieve (a goal) by contrivance or guile; to finagle, to wangle.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To formulate plots or schemes; to plot, to scheme.",
                  "examples": [
                    "Synonym: machinate"
                  ]
                },
                {
                  "meaning": "(rare) To work as an engineer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}