{
  "word": "empiricism",
  "etymologies": [
    {
      "description": [
        "empiric +‎ -ism"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "empiricism (countable and uncountable, plural empiricisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, now chiefly historical) Medicine as practised by an empiric, founded on mere experience, without the aid of science or a knowledge of principles; folk medicine, quackery. [from 17th c.]",
                  "examples": [
                    "Empiricism is not peculiar to Denmark; and I know of no way of rooting it out, though it be a remnant of exploded witchcraft, till the acquiring a general knowledge of the component parts of the human frame, become a part of public education."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) A doctrine which holds that the only or, at least, the most reliable source of human knowledge is experience, especially perception by means of the physical senses. (Often contrasted with rationalism.) [from 18th c.]",
                  "examples": [
                    "Empiricism teaches us that we are unceasingly and intimately in contact with a full, living, breathing Reality, that experience is a constant communion with the real."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pursuit of knowledge purely through experience, especially by means of observation and sometimes by experimentation. [from 19th c.]",
                  "examples": [
                    "Our whole life in some of its highest and most important aspects is simply empiricism. Empiricism is only another word for experience."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(social sciences, political science, sociology) used to describe research based on methodology shaped from empirical philosophy (see above), e.g. surveys, statistics, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}