{
  "word": "sight",
  "etymologies": [
    {
      "description": [
        "From Middle English siȝht, siȝt, siht, from Old English siht, sihþ (“something seen; vision”), from Proto-West Germanic *sihti, equivalent to see +‎ -th. Cognate with Scots sicht, Saterland Frisian Sicht, West Frisian sicht, Dutch zicht, German Low German Sicht, German Sicht, Danish sigte, Swedish sikte."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sight (countable and uncountable, plural sights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the singular) The ability to see.",
                  "examples": [
                    "He is losing his sight and now can barely read."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of seeing; perception of objects by the eye; view.",
                  "examples": [
                    "to gain sight of land"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something seen.",
                  "examples": [
                    "He's a really remarkable man and it's very hard to get him in one's sights;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something worth seeing; a spectacle, either good or bad.",
                  "examples": [
                    "We went to London and saw all the sights – Buckingham Palace, Tower Bridge, and so on.",
                    "You really look a sight in that ridiculous costume!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device used in aiming a projectile, through which the person aiming looks at the intended target.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small aperture through which objects are to be seen, and by which their direction is settled or ascertained.",
                  "examples": [
                    "the sight of a quadrant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now colloquial) a great deal, a lot; frequently used to intensify a comparative.",
                  "examples": [
                    "a sight of money",
                    "This is a darn sight better than what I'm used to at home!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a drawing, picture, etc., that part of the surface, as of paper or canvas, which is within the frame or the border or margin. In a frame, the open space, the opening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The instrument of seeing; the eye.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mental view; opinion; judgment.",
                  "examples": [
                    "In their sight it was harmless."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sight (third-person singular simple present sights, present participle sighting, simple past and past participle sighted)",
          "definitionGroups": [
            {
              "group": "(transitive) To see; to get sight of (something); to register visually.",
              "entries": [
                {
                  "meaning": "(transitive) To observe though, or as if through, a sight, to check the elevation, direction, levelness, or other characteristics of, especially when surveying or navigating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply sights to; to adjust the sights of.",
                  "examples": [
                    "to sight a rifle or a cannon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To observe or aim (at something) using a (gun) sight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}