{
  "word": "front",
  "etymologies": [
    {
      "description": [
        "From Middle English front, frunt, frount, from Old French front, frunt, from Latin frōns, frontem (“forehead”)."
      ],
      "adjectives": [
        {
          "description": "front (comparative further front, superlative furthest front)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Located at or near the front.",
                  "examples": [
                    "The front runner was thirty meters ahead of her nearest competitor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable, phonetics) Pronounced with the highest part of the body of the tongue toward the front of the mouth, near the hard palate (most often describing a vowel).",
                  "examples": [
                    "The English word dress has a front vowel in most dialects."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Closest or nearest, of a set of futures contracts which expire at particular times, or of the times they expire; (typically, the front month or front year is the next calender month or year after the current one).",
                  "examples": [
                    "Synonym: prompt",
                    "Antonym: back"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "front (countable and uncountable, plural fronts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The foremost side of something or the end that faces the direction it normally moves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The side of a building with the main entrance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A field of activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or institution acting as the public face of some other, covert group.",
                  "examples": [
                    "Officially it's a dry-cleaning shop, but everyone knows it's a front for the mafia."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) The interface or transition zone between two airmasses of different density, often resulting in precipitation. Since the temperature distribution is the most important regulator of atmospheric density, a front almost invariably separates airmasses of different temperature.",
                  "examples": [
                    "We need to take the clothes off the line. The news reported a front is coming in from the east, and we can expect heavy rain and maybe hail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An area where armies are engaged in conflict, especially the line of contact.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The lateral space occupied by an element measured from the extremity of one flank to the extremity of the other flank.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The direction of the enemy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) When a combat situation does not exist or is not assumed, the direction toward which the command is faced.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A major military subdivision of the Soviet Army.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Cheek; boldness; impudence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An act, show, façade, persona: an intentional and false impression of oneself.",
                  "examples": [
                    "He says he likes hip-hop, but I think it's just a front.",
                    "You don't need to put on a front. Just be yourself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) That which covers the foremost part of the head: a front piece of false hair worn by women.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The most conspicuous part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The beginning.",
                  "examples": [
                    "So the faulty bridge was moved to the front of the song, creating in the process one of the most striking opening moments in Beatles music."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A seafront or coastal promenade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The forehead or brow, the part of the face above the eyes; sometimes, also, the whole face.",
                  "examples": [
                    "His front yet threatens, and his frowns command."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, hotels, dated) The bellhop whose turn it is to answer a client's call, which is often the word \"front\" used as an exclamation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, in the plural) A grill (jewellery worn on front teeth).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "front (third-person singular simple present fronts, present participle fronting, simple past and past participle fronted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To face (on, to); to be pointed in a given direction.",
                  "examples": [
                    "The door fronted on a narrow run, like a footbridge over a gully, that filled the gap between the house wall and the edge of the bank."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To face, be opposite to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To face up to, to meet head-on, to confront.",
                  "examples": [
                    "But Dagley immediately fronted him, and Fag at his heels growled low  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adorn with, at the front; to put on the front.",
                  "examples": [
                    "Three tiers of balconies fronted with roped columns supporting arched openings looked down on the marble hall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics, transitive, intransitive) To pronounce with the tongue in a front position.",
                  "examples": [
                    "The velar plosives are often fronted through the influence of a following front vowel, and retracted through the influence of a following back vowel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, transitive) To move (a word or clause) to the start of a sentence (or series of adjectives, etc).",
                  "examples": [
                    "[…]  in the clause, only the adjective may be fronted; but if both a past participle and a verbal particle are present, either may be fronted. Topicalization, in which maximal projections are fronted to express pragmatics such as contrast, emphasis, ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To act as a front (for); to cover (for).",
                  "examples": [
                    "Everybody knew Skopas fronted for the fight mob even though he was officially the arena manager."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lead or be the spokesperson of (a campaign, organisation etc.).",
                  "examples": [
                    "Ray Winstone is fronting a campaign for the Football Association that aims to stop pushy parents shouting abuse at their children during the grassroots football season."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) Of an alter in dissociative identity disorder: to be the currently actively presenting member of (a system), in control of the patient's body.",
                  "examples": [
                    "Fronting can be understood as a representation of who controls the system, that is, the person to whom you are speaking. Emilia was typically the person fronting her system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To provide money or financial assistance in advance to.",
                  "examples": [
                    "I'm prepared to say that I fronted you the money for a business deal with me, and the investment paid off brilliantly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To assume false or disingenuous appearances.",
                  "examples": [
                    "Synonyms: put on airs, feign"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To deceive or attempt to deceive someone with false or disingenuous appearances (on).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To appear before.",
                  "examples": [
                    "to front court"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}