{
  "word": "elevate",
  "etymologies": [
    {
      "description": [
        "From Latin ēlevātus, past participle of ēlevāre (“to raise, lift up”), from ē- (“out”) + levāre (“to make light, to lift”), from levis (“light”); see levity and lever."
      ],
      "adjectives": [
        {
          "description": "elevate (comparative more elevate, superlative most elevate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Elevated; raised aloft.",
                  "examples": [
                    "The sayde crosse was .iii. tymes deuoutly eleuate, and at euery exaltacion, ye Moores beyng within the cytie, roared, howled and cryed,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "elevate (third-person singular simple present elevates, present participle elevating, simple past and past participle elevated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise (something) to a higher position.",
                  "examples": [
                    "Synonyms: lift, raise",
                    "Antonyms: drop, lower",
                    "The doctor told me elevating my legs would help reduce the swelling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To promote (someone) to a higher rank.",
                  "examples": [
                    "Synonyms: exalt, promote",
                    "Antonym: demote"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To confer honor or nobility on (someone).",
                  "examples": [
                    "Synonyms: ennoble, exalt, honor",
                    "The traditional worldview elevates man as the pinnacle of creation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (something or someone) more worthy or of greater value.",
                  "examples": [
                    "A talented chef can elevate everyday ingredients into gourmet delights."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To direct (the mind, thoughts, etc.) toward more worthy things.",
                  "examples": [
                    "[…]  the devout Christian improves the Blessings he receives of this inferiour World, to elevate his mind above it:"
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To increase the intensity or degree of (something).",
              "entries": [
                {
                  "meaning": "(dated) To increase the loudness of (a sound, especially one's voice).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To lift the spirits of (someone)",
                  "examples": [
                    "Synonyms: cheer up, elate",
                    "Antonyms: depress, sadden"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, colloquial, humorous) To intoxicate in a slight degree; to make (someone) tipsy.",
                  "examples": [
                    "Steele entertained them till he was tipsy; when the same wine that stupified him, only served to elevate Addison, who took up the ball just as Steele dropt it, and kept it up for the rest of the evening."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Latinism) To attempt to make (something) seem less important, remarkable, etc.",
                  "examples": [
                    "Synonyms: lessen, detract, disparage"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}