{
  "word": "alum",
  "etymologies": [
    {
      "description": [
        "From Middle English alum, alum, alym, alyme, from Anglo-Norman alum, alun, from Latin alūmen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "alum (countable and uncountable, plural alums)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An astringent salt, usually occurring in the form of pale crystals, much used in the dyeing and tanning trade and in certain medicines, and now understood to be a double sulphate of potassium and aluminium (K2SO4·Al2(SO4)3·24H2O). [from 14th c.]",
                  "examples": [
                    "Venice also needed alum for trade, since it was the point of departure for overland transportation of alum to southern Germany and its cloth-manufacturing Free Cities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Any similar double sulphate in which either or both of the potassium and aluminium is wholly or partly replaced by other univalent or tervalent cations. [from 17th c.]",
                  "examples": [
                    "With weld and cochineal, which are colouring matters the most sensible to the action of sulphate of iron, the purified alums gave us colours more brilliant, fresh, and in a slight degree lighter; while those with our common alums were all duller, and evidently of a deeper hue."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "alum (third-person singular simple present alums, present participle aluming, simple past and past participle alumed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To steep in, or otherwise impregnate with, a solution of alum; to treat with alum.",
                  "examples": [
                    "The silk should be boiled at the rate of 20 parts of soap per cent. , and then alumed. The aluming need not be so strong as for the fine crimson"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From alumnus and alumna (> alumn- > alum), by the removal of the originally Latin gender-specific nominative singular case endings -us (masculine) and -a (feminine)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "alum (plural alums or alumni)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shortening, Canada, US) A past attendee or graduate (of either gender) of a college, university or other educational institution.",
                  "examples": [
                    "Evanston-North Shore alums are happy to open their homes to Sigma actives for special social events."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}