{
  "word": "none",
  "etymologies": [
    {
      "description": [
        "From Middle English none, noon, non (“not one”), from Old English nān (“not one, not any, none”), from Proto-West Germanic *nain, from Proto-Germanic *nainaz (“none, nought, nothing”), equivalent to ne (“not”) +‎ one. (Regarding the different phonological development of only and one, see the note in one.)",
        "Cognate with Scots nane (“none”), Saterland Frisian naan, neen (“no, not any, none”), West Frisian neen & gjin (“no, none”), Dutch neen & geen (“no, none”), Low German nēn, neen (“none, no one”), German nein & kein (“no, none”), Latin nōn (“not”)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "none (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To no extent, in no way. [from 11th c.]",
                  "examples": [
                    "I felt none the worse for my recent illness.",
                    "1973,  Paul Simon (lyrics and music),  “Kodachrome”:my lack of education hasn't hurt me none"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not at all, not very. [from 13th c.]",
                  "examples": [
                    "He was none too pleased with the delays in the program that was supposed to be his legacy.",
                    "We could hear none too well from the back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) No, not. [14th–16th c.]",
                  "examples": [
                    "And up into his contour-hous gooth he / To rekene with hymself, wel may be, / Of thilke yeer how that it with hym stood, / And how that he despended hadde his good, / And if that he encresses were or noon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From the first sense, since they respond “none” when asked about their religion; also a play of words on nun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "none (plural nones)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly American) A person without religious affiliation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From French none, from Latin nōna (“ninth; ninth hour”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "none (plural nones)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of nones: the ninth hour after dawn; (Christian) the religious service appointed to this hour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Synonym of midafternoon: the time around or following noon or nones.",
                  "examples": [
                    "The last, which began at the middle of the Afternoon, i.e. at half the Time between Noon and Sun-setting, was called None, because it began at the Ninth Hour."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}