{
  "word": "policy",
  "etymologies": [
    {
      "description": [
        "From Middle French policie, from Late Latin politia (“citizenship; government”), classical Latin polītīa (in Cicero), from Ancient Greek πολιτεία (politeía, “citizenship; polis, (city) state; government”), from πολίτης (polítēs, “citizen”). Compare police and polity."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "policy (countable and uncountable, plural policies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A principle of behaviour, conduct etc. thought to be desirable or necessary, especially as formally expressed by a government or other authoritative body. [from 15th c.]",
                  "examples": [
                    "The Communist Party has a policy of returning power to the workers.",
                    "It's company policy that all mobile phones are forbidden in meetings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wise or advantageous conduct; prudence, formerly also with connotations of craftiness. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Specifically, political shrewdness or (formerly) cunning; statecraft. [from 15th c.]",
                  "examples": [
                    "Whether he believed himself a god, or only took on the attributes of divinity from motives of policy, is a question for the psychologist, since the historical evidence is indecisive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, now chiefly in the plural) The grounds of a large country house. [from 18th c.]",
                  "examples": [
                    "Now and then about a gentleman’s house stands a small plantation, which in Scotch is called a policy, but of these there are few, and those few all very young."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The art of governance; political science. [14th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A state; a polity. [14th–16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A set political system; civil administration. [15th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A trick; a stratagem. [15th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Motive; object; inducement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "policy (third-person singular simple present policies, present participle policying, simple past and past participle policied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To regulate by laws; to reduce to order.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle French police, from Italian polizza, from Medieval Latin apodissa (“receipt for money”), from Ancient Greek ἀπόδειξις (apódeixis, “proof, declaration”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "policy (plural policies)",
          "definitionGroups": [
            {
              "group": "(law)",
              "entries": [
                {
                  "meaning": "A contract of insurance.",
                  "examples": []
                },
                {
                  "meaning": "A document containing or certifying this contract.",
                  "examples": [
                    "Your insurance policy covers fire and theft only."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An illegal daily lottery in late nineteenth and early twentieth century USA on numbers drawn from a lottery wheel (no plural)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number pool lottery",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}