{
  "word": "fitment",
  "etymologies": [
    {
      "description": [
        "fit +‎ -ment"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fitment (plural fitments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing fitted to another in order to accomplish a specific purpose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An item of permanent furniture or equipment.",
                  "examples": [
                    "A good sanitary fitment should be of the simplest possible design, constructed so as to be self-cleansing, and, as far as possible, free from any moving working parts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of furnishing with fitments; an instance of such an act.",
                  "examples": [
                    "Upon such an indictment against the owner, charging him with fitting out the ship with intent to employ her in the illegal voyage, evidence is admissible, that he commanded, authorized, and superintended the fitment, through the instrumentality of his agents, without being personally present."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The proper positioning and orientation of a thing for it to serve its designed purpose.",
                  "examples": [
                    "He told Sancho to pick up the helmet, and he taking it in his hands said:",
                    "\"By God the basin is a good one, and worth a real of eight if it is worth a maravedis,\" and handed it to his master, who immediately put it on his head, turning it round, now this way, now that, in search of fitment, and not finding it he said, \"Clearly the pagan to whose measure this famous head-piece was first forged must have had a very large head; but the worst of it is half of it is wanting.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) The categorisation of an employee, for the purpose of calculating salary or allowances.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Something that suits or fits.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}