{
  "word": "surplus",
  "etymologies": [
    {
      "description": [
        "From Middle English surplus, from Middle French surplus. Compare French surplus."
      ],
      "adjectives": [
        {
          "description": "surplus (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being or constituting a surplus; more than sufficient.",
                  "examples": [
                    "surplus population",
                    "surplus words",
                    "The latest shipment of goods is surplus to our needs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "surplus (countable and uncountable, plural surpluses or surplusses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which remains when use or need is satisfied, or when a limit is reached; excess; overplus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specifically, an amount in the public treasury at any time greater than is required for the ordinary purposes of the government.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The remainder of a fund appropriated for a particular purpose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) assets left after liabilities and debts, including capital stock have been deducted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "surplus (third-person singular simple present surpluses or surplusses, present participle surplussing or surplusing, simple past and past participle surplussed or surplused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat as surplus to requirements; to sell off or dismiss from employment, etc.",
                  "examples": [
                    "This employee was engaged to direct asphalt plants and inasmuch as the work for which he had been employed was completed, he was surplused and his return travel was approved  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}