{
  "word": "juggle",
  "etymologies": [
    {
      "description": [
        "From Middle English jogelen, partly a back-formation of Middle English jogeler (“juggler”), and partly a borrowing from Old French jogler, jongler (“to have fun with someone”), a conflation of Latin joculāri (“to jest; joke”) and Old French jangler (“to regale; entertain; have fun; trifle with; tease; mess around; gossip; boast; meddle”), from Frankish *jangalōn (“to chit-chat with; gossip”), akin to Middle Dutch jankelen (“to murmur; whisper; mumble; grumble”), frequentative of Middle Dutch janken (“to moan; groan; complain”). Related also to Middle Low German janken (“to sigh; moan; lament”), Dutch jengelen (“to whine; whimper”) Dutch janken (“to whine; wimper”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "juggle (plural juggles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling) The act of throwing and catching each prop at least twice, as opposed to a flash.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The handling or managing of many tasks at once.",
                  "examples": [
                    "Quit the juggle and monotask."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The performance of a magic trick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A deceit or imposture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "juggle (third-person singular simple present juggles, present participle juggling, simple past and past participle juggled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To manipulate objects, such as balls, clubs, beanbags, rings, etc. in an artful or artistic manner. Juggling may also include assorted other circus skills such as the diabolo, devil sticks, hat, and cigar box manipulation as well.",
                  "examples": [
                    "She can juggle flaming torches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To handle or manage many tasks at once.",
                  "examples": [
                    "He juggled home, school, and work for two years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To deceive by trick or artifice.",
                  "examples": [
                    "I think they are juggling the company's books."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To joke or jest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To perform magic tricks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}