{
  "word": "want",
  "etymologies": [
    {
      "description": [
        "From Middle English wanten (“to lack”), from Old Norse vanta (“to lack”), from Proto-Germanic *wanatōną (“to be wanting, lack”), from *wanô (“lack, deficiency”), from Proto-Indo-European *h₁weh₂- (“empty”). Cognate with Middle High German wan (“not full, empty”), Middle Dutch wan (“empty, poor”), Old English wana (“want, lack, absence, deficiency”), Latin vanus (“empty”). See wan, wan-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "want (countable and uncountable, plural wants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A desire, wish, longing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, often followed by of) Lack, absence, deficiency.",
                  "examples": [
                    "A want of sense."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Poverty.",
                  "examples": [
                    "Nothing is so hard for those who abound in riches, as to conceive how others can be in want."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something needed or desired; a thing of which the loss is felt.",
                  "examples": [
                    "Habitual superfluities become actual wants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, mining) A depression in coal strata, hollowed out before the subsequent deposition took place.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "want (third-person singular simple present wants, present participle wanting, simple past and past participle wanted)",
          "definitionGroups": [
            {
              "group": "(transitive) To wish for or desire (something); to feel a need or desire for; to crave or demand. [from 18th c.]",
              "entries": [
                {
                  "meaning": "(by extension) To make it easy or tempting to do something undesirable, or to make it hard or challenging to refrain from doing it.",
                  "examples": [
                    "The game developers of Candy Crush want you to waste large, copious amounts of your money on in-game purchases to buy boosters and lives.",
                    "Depression wants you to feel like the world is dark and that you are not worthy of happiness. The first step to making your life better from this day forward is to stop believing these lies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, in particular) To wish, desire, or demand to see, have the presence of or do business with.",
                  "examples": [
                    "Ma’am, you are exactly the professional we want for this job.",
                    "Danish police want him for embezzlement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To desire (to experience desire); to wish.",
                  "examples": [
                    "You can leave if you want."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, usually second person, often future tense) To be advised to do something (compare should, ought).",
                  "examples": [
                    "You’ll want to repeat this three or four times to get the best result."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now colloquial) To lack and be in need of or require (something, such as a noun or verbal noun). [from 15th c.]",
                  "examples": [
                    "The lady, it is said, will inherit a fortune of three hundred pounds a year, with two cool thousands left by an uncle, on her arriving at the age of twenty-one, of which she wants but a few months."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To have occasion for (something requisite or useful); to require or need.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To be lacking or deficient or absent. [from 13th c.]",
                  "examples": [
                    "There was something wanting in the play."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To be in a state of destitution; to be needy; to lack.",
                  "examples": [
                    "The paupers desperately want."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To lack and be without, to not have (something). [from 13th c.]",
                  "examples": [
                    "Not what we wish, but what we want, / Oh, let thy grace supply!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, by extension) To lack and (be able to) do without.",
                  "examples": [
                    "For Law, Physick and Divinitie, need so the help of tongs and sciences, as thei can not want them, and yet thei require so a hole mans studie, as thei may parte with no tyme to other lerning, ..."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English wont (“mole”), from Old English wand, wond, from Proto-Germanic *wanduz."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "want (plural wants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) A mole (Talpa europea).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}