{
  "word": "explore",
  "etymologies": [
    {
      "description": [
        "From Middle French explorer, from Latin explōrāre (“to investigate, search out”), itself said to be originally a hunters' term meaning \"to set up a loud cry\", from ex- (“out”) + plōrāre (“to cry”), but the second element is also explained as \"to make to flow\" (from pluere (“to flow”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "explore (plural explores)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An exploration; a tour of a place to see what it is like.",
                  "examples": [
                    "Daylight was fading quickly, but I was still keen to have a little explore of the town and beach."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "explore (third-person singular simple present explores, present participle exploring, simple past and past participle explored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To seek for something or after someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To examine or investigate something systematically.",
                  "examples": [
                    "The committee has been exploring alternative solutions to the problem at hand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To travel somewhere in search of discovery.",
                  "examples": [
                    "It was around that time that the expedition began exploring the Arctic Circle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, medicine) To examine diagnostically.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To (seek) experience first hand.",
                  "examples": [
                    "It is normal for a boy of this age to be exploring his sexuality."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be engaged exploring in any of the above senses.",
                  "examples": [
                    "He was too busy exploring to notice his son needed his guidance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To wander without any particular aim or purpose.",
                  "examples": [
                    "The boys explored all around till cold and hunger drove them back to the campfire one by one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seek sexual variety, to sow one's wild oats.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}