{
  "word": "pepper",
  "etymologies": [
    {
      "description": [
        "From Middle English peper, piper, from Old English piper, from Proto-West Germanic *piper, from Latin piper, from an Indo-Aryan source; compare Sanskrit पिप्पलि (pippali, “long pepper”). The name was given to the capsicum fruit because of its unusual spicy taste, not unlike the Old World spice.",
        "Cognate with Scots pepar, Saterland Frisian Pieper, West Frisian piper, Dutch peper, German Low German Peper, German Pfeffer, Danish peber, Swedish peppar, Icelandic pipar.  Doublet of falafel and peepul."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pepper (countable and uncountable, plural peppers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plant of the family Piperaceae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A spice prepared from the fermented, dried, unripe berries of this plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, US, Ireland and Canada) A bell pepper, a fruit of the capsicum plant: red, green, yellow or white, hollow and containing seeds, and in very spicy and mild varieties.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A game used by baseball players to warm up where fielders standing close to a batter rapidly return the batted ball to be hit again",
                  "examples": [
                    "Some ballparks have signs saying \"No pepper games\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cryptography) A randomly-generated value that is added to another value (such as a password) prior to hashing. Unlike a salt, a new one is generated for each value and it is held separately from the value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing, slang) A beating; a thrashing.",
                  "examples": [
                    "He means to snatch the laurels from his brow, / At all his boasted pluck and prowess smile, / And give him pepper in superior style."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pepper (third-person singular simple present peppers, present participle peppering, simple past and past participle peppered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To add pepper to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike with something made up of small particles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with lots of (something made up of small things).",
                  "examples": [
                    "After the hailstorm, the beach was peppered with holes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To add (something) at frequent intervals.",
                  "examples": [
                    "He liked to pepper his conversation with long words."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To beat or thrash.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}