{
  "word": "curvet",
  "etymologies": [
    {
      "description": [
        "From Italian corvetta, diminutive of corva, an early form of curva (“curve”), from Latin curva, feminine of curvus (“bent, curved”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "curvet (plural curvets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular leap in which a horse raises both forelegs at once, equally advanced, and, as the forelegs are falling, raises the hind legs, so that all the legs are in the air at once.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prank; a frolic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "curvet (third-person singular simple present curvets, present participle curveting or curvetting, simple past and past participle curveted or curvetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a horse or, by extension, another animal: to leap about, to frolic.",
                  "examples": [
                    "The boy turns into a dog and bow-wows—a cock, he flaps his wings and crows—a cow, he fetches a long drawn moo—a horse broke loose, he curvets, prances and kicks fearfully among his nursery blocks—a big bull, he waxes dangerous as he bellows and paws the carpet—a locomotive, he blows his steam whistle and dashes round the nursery with puffs and yells spasmodic, or taming down, sticks a feather in his cap and struts a soldier."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to leap about, dart or jump.",
                  "examples": [
                    "[…]  I could no more travel the same Path, again and again, than I could have Patience to mount a managed Horse, in the Riding-House, and curvet it in the same Spot, for three Hours together."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a bird) To fly or swim with darting movements.",
                  "examples": [
                    "The west wind was the music, the motion, the force / To which the swans curveted, a will to change, / A will to make iris frettings on the blank."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) (of a person) To prance; to caper, frolic.",
                  "examples": [
                    "He curvetted back into the living-room  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) (of an object) To jump, skip, shake.",
                  "examples": [
                    "The earth shook itself like an animal on whose back a predator has lodged. It spasmed, curvetted, tossed and writhed, to throw that malignity from its shoulders."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}