{
  "word": "beta",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek βῆτα (bêta). Doublet of beth."
      ],
      "adjectives": [
        {
          "description": "beta (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Identifying a molecular position in an organic chemical compound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Designates the second in an order of precedence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Preliminary; prerelease. Refers to an incomplete version of a product released for initial testing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person, object or action) Associated with the beta male/female archetype.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "beta (countable and uncountable, plural betas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The second letter of the Greek alphabet (Β,  β), preceded by alpha (Α,  α) and followed by gamma, (Γ,  γ). In modern Greek it represents the voiced labiodental fricative sound of v found in the English words have and vase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education, rare) An academic grade better than a gamma and worse than an alpha.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) Average sensitivity of a security's price to overall securities market prices.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, video games, uncountable) The phase of development after alpha testing and before launch, in which software, while not complete, has been released to potential users for testing.",
                  "examples": [
                    "The company is offering a public beta program to test the software."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, video games, countable) Software in such a phase; a preliminary version.",
                  "examples": [
                    "He quickly deduced our goal—ship a quality beta—but he also quickly discerned that we had no idea about the quality of the product because of our pile of untriaged bugs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) Information about a route which may aid someone in climbing it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A beta particle or beta ray.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) Sideslip angle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The range of engine power settings in which the blade pitch angle of a constant-speed propeller is controlled directly by the angle of the engine's throttle lever (rather than varying with engine torque and airspeed to maintain a constant propeller RPM), allowing the propeller to be disked to generate high drag and slow the aircraft quickly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of betta (“fish in the genus Betta”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, manosphere, masculism) Ellipsis of beta male, a man who is less competent or desirable than an alpha male.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fandom slang) In omegaverse fiction, a person of a secondary sex similar to normal humans, lacking the biological drives of alphas and omegas but generally capable of bonding and mating with either.",
                  "examples": [
                    "Many A/B/O stories posit societies where biological imperatives divide people based on wolf pack hierarchies into sexual dominants (alphas), sexual submissives (omegas), and everyone else (betas)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "beta (third-person singular simple present betas, present participle betaing, simple past and past participle betaed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) To preliminarily release computer software for initial testing prior to final release.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Internet) To beta-read a text.",
                  "examples": [
                    "My thanks to Heather; who read it and betaed it. Thank you."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}