{
  "word": "dumb",
  "etymologies": [
    {
      "description": [
        "From Middle English dumb (“silent, speechless, mute, ineffectual”), from Old English dumb (“silent, speechless, mute, unable to speak”), from Proto-West Germanic *dumb, from Proto-Germanic *dumbaz (“dull, dumb”), from Proto-Indo-European *dʰewbʰ- (“to whisk, smoke, darken, obscure”).",
        "The senses of stupid, unintellectual, and pointless, which are found regularly since the 19th century only, probably developed under the influence of German dumm and Dutch dom. Just like the English word, these originally meant \"lacking the power of speech\", but they developed the mentioned senses early on."
      ],
      "adjectives": [
        {
          "description": "dumb (comparative dumber, superlative dumbest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Unable to speak; lacking power of speech (kept in \"deaf, dumb, and blind\").",
                  "examples": [
                    "Synonyms: mute, speechless, wordless",
                    "His younger brother was born dumb, and communicated with sign language."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Silent; unaccompanied by words.",
                  "examples": [
                    "dumb show"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, derogatory, especially of a person) Extremely stupid.",
                  "examples": [
                    "Synonyms: feeble-minded, idiotic, moronic, stupid; see also Thesaurus:stupid",
                    "You are so dumb! You don't even know how to make toast!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Pointless, foolish, lacking intellectual content or value.",
                  "examples": [
                    "Synonyms: banal, brainless, dopey, silly, stupid, ridiculous, vulgar",
                    "This is dumb! We're driving in circles! We should have asked for directions an hour ago!",
                    "Brendan had the dumb job of moving boxes from one conveyor belt to another."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lacking brightness or clearness, as a colour.",
                  "examples": [
                    "Her stern, which was painted of a dumb white or dun color."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English dumben, from Old English dumbian (more commonly in compound ādumbian (“to become mute or dumb; keep silence; hold one’s peace”)), from Proto-Germanic *dumbijaną, *dumbōną (“to be silent, become dumb”), from Proto-Indo-European *dʰewbʰ- (“to whisk, smoke, darken, obscure”). Cognate with German verdummen (“to become dumb”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "dumb (third-person singular simple present dumbs, present participle dumbing, simple past and past participle dumbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To silence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make stupid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To represent as stupid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce the intellectual demands of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}