{
  "word": "hob",
  "etymologies": [
    {
      "description": [
        "Related to hub, but the ultimate origin of both words is obscure."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hob (plural hobs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of cutting tool, used to cut the teeth of a gear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The flat projection or iron shelf at the side of a fire grate, where things are put to be kept warm.",
                  "examples": [
                    "They went into a dingy room lined with books and littered with papers, where there was a blazing fire. A kettle steamed upon the hob, and in the midst of the wreck of papers a table shone, with plenty of wine upon it, and brandy, and rum, and sugar, and lemons."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Australia, New Zealand) The top cooking surface on a cooker; a cooktop. It typically comprises several cooking elements (often four), also known as 'rings'.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rounded peg used as a target in several games, especially in quoits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male ferret.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The hub of a wheel.",
                  "examples": [
                    "the wheels of the carriages sinking up to the hobs rendered it impossible for our whole force to drag them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hob (third-person singular simple present hobs, present participle hobbing, simple past and past participle hobbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To create (a gear) by cutting with a hob.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in the process of cutting gears with a hob.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English Hob (a diminutive of Robin, an Old French [Term?] diminutive of Robert), through its connection with Robin Goodfellow and (later) the devil. Compare hobgoblin; see robin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hob (plural hobs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A fairy; a sprite; an elf; a bogey.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A countryman; a rustic or yokel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}