{
  "word": "grue",
  "etymologies": [
    {
      "description": [
        "From Middle English gruen, probably from Middle Low German gruwen or Middle Dutch gruwen (compare Dutch gruwen), both from Proto-Germanic *grūwijaną, perhaps ultimately an imitative derivative of Proto-Indo-European *ǵʰers- (“to bristle”), or instead from *gʰer- (“to rub, stroke, grind”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grue (plural grues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shiver, a shudder.",
                  "examples": [
                    "One man only worked on the place, a doited lad who had long been a charge to the parish, and who had not the sense to fear danger or the wit to understand it. Upon all others the sight of Alison, were it but for a moment, cast a cold grue, not to be remembered without terror."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grue (third-person singular simple present grues, present participle gruing, simple past and past participle grued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To be frightened; to shudder with fear.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Back-formation from gruesome."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grue (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any byproduct of a gruesome event, such as gore, viscera, entrails, blood and guts.",
                  "examples": [
                    "The butcher was covered in the accumulated grue of a hard day's work",
                    "There was grue everywhere after the accident"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from gruesome; first used in Jack Vance's Dying Earth universe in the 1940s, but popularized by the text-based computer game Zork in 1980."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grue (plural grues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fictional man-eating predator that dwells in the dark.",
                  "examples": [
                    "I managed to get into the house through the front once, but I was plunged into darkness and eaten by a monster called a grue."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Blend of green +‎ blue. The philosophy sense was coined by American philosopher Nelson Goodman in 1955 to illustrate concepts in the philosophy of science. The linguistic sense was coined by American linguist Paul Kay in 1975 as a translation from languages such as Welsh that have a basic cover term that covers both the hues called \"green\" and \"blue\" in English."
      ],
      "adjectives": [
        {
          "description": "grue (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) Of an object, green when first observed before a specified time or blue when first observed after that time.",
                  "examples": [
                    "The grue property is defined as: x is grue if and only if x is green and is observed before the year 2000, or x is blue and is not observed before the year 2000."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A single color inclusive of both green and blue as different shades, used in translations from languages such as old Welsh and Chinese that lacked a distinction between green and blue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grue (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Nutraloaf, a bland mixture of foods served in prisons.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}