{
  "word": "derogate",
  "etymologies": [
    {
      "description": [
        "Borrowed from (the participle stem of) Latin dērogāre (“to annul, repeal part of a law, take away, detract from”), from de- (“from”) + rogāre (“to propose a law, ask”). Compare abrogate, arrogate, interrogate."
      ],
      "adjectives": [
        {
          "description": "derogate (comparative more derogate, superlative most derogate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) debased",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "derogate (third-person singular simple present derogates, present participle derogating, simple past and past participle derogated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To partially repeal (a law etc.). [16th–17th c.]",
                  "examples": [
                    "By several contrary customs,  […]  many of the civil and canon laws are controlled and derogated."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To detract from (something); to disparage, belittle. [from 16th c.]",
                  "examples": [
                    "I never thought the human frailty of erring in cases of religion, infamy to a state, no more than to a council: it had therefore been neither civil nor christianly, to derogate the honour of the state for that cause [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To take away (something from something else) in a way which leaves it lessened. [from 16th c.]",
                  "examples": [
                    "Anything  […]  that should derogate, minish, or hurt his glory and his name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To remove a part, to detract from (a quality of excellence, authority etc.). [from 16th c.]",
                  "examples": [
                    "God does not have the attributes of a Christian Providence, for it would derogate from His perfection to think about anything except what is perfect, i.e. Himself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act in a manner below oneself; to debase oneself. [from 17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}