{
  "word": "blood",
  "etymologies": [
    {
      "description": [
        "From Middle English blood, from Old English blōd, from Proto-West Germanic *blōd, from Proto-Germanic *blōþą, possibly from Proto-Indo-European *bʰel- (\"to swell\") + -ó- (thematic vowel) + -to (nominalizer), i.e. \"that which bursts out\". Cognate with Saterland Frisian Bloud, West Frisian bloed, Dutch bloed, German Blut, Danish, Swedish and Norwegian blod."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blood (countable and uncountable, plural bloods)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vital liquid flowing in the bodies of many types of animals that usually conveys nutrients and oxygen. In vertebrates, it is colored red by hemoglobin, is conveyed by arteries and veins, is pumped by the heart and is usually generated in bone marrow.",
                  "examples": [
                    "The cultists gathered around a chalice of blood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A family relationship due to birth, such as that between siblings; contrasted with relationships due to marriage or adoption (see blood relative, blood relation, by blood).",
                  "examples": [
                    "a friend of our own blood"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) One of the four humours in the human body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, countable) A blood test or blood sample.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sap or juice which flows in or from plants.",
                  "examples": [
                    "It is no tautology to call the blood of the grape red or purple, because the juice of that fruit was sometimes white and sometimes black or dark. The arterial blood of our bodies is red, but the venous is called \"black blood.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic) The juice of anything, especially if red.",
                  "examples": [
                    "He washed […] his clothes in the blood of grapes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Temper of mind; disposition; mood",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A lively, showy man; a rake; a dandy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blood horse, one of good pedigree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Bloodshed.",
                  "examples": [
                    "They came looking for blood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative letter-case form of Blood (member of a certain gang).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially African-American Vernacular) A friend or acquaintance, especially one who is black and male.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, MLE, slang) Alternative form of blud (“Informal address to a male.”)",
                  "examples": [
                    "Blood I swear she just gave man extra chicken? Two fat pieces of chicken."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blood (third-person singular simple present bloods, present participle blooding, simple past and past participle blooded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause something to be covered with blood; to bloody.",
                  "examples": [
                    "The French gentleman and Mr Adderly, at the desire of their commanding officer, had raised up the body of Jones, but as they could perceive but little (if any) sign of life in him, they again let him fall, Adderly damning him for having blooded his wastecoat  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, historical) To let blood (from); to bleed.",
                  "examples": [
                    "Mr Western, who imputed these symptoms in his daughter to her fall, advised her to be presently blooded by way of prevention."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To initiate into warfare or a blood sport, traditionally by smearing with the blood of the first kill witnessed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}