{
  "word": "voice",
  "etymologies": [
    {
      "description": [
        "From Middle English voice, voys, vois, borrowed from Anglo-Norman voiz, voys, voice, Old French vois, voiz (Modern French voix), from Latin vōcem, accusative form of vōx (“voice”), from Proto-Indo-European *wṓkʷs, root noun from *wekʷ- (“to utter, speak”). Cognate with Sanskrit वाच् (vāc), Ancient Greek ὄψ (óps), Persian آواز‎ (âvâz). Displaced native Middle English steven (“voice”), from Old English stefn (see steven). Compare advocate, advowson, avouch, convoke, epic, vocal, vouch, vowel. Doublet of vox."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "voice (plural voices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sound uttered by the mouth, especially by human beings in speech or song; sound thus uttered considered as possessing some special quality or character",
                  "examples": [
                    "The human voice is the oldest musical instrument in history.",
                    "She has a pleasant voice.",
                    "His low voice allowed him to become a bass in the choir."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) Sound made through vibration of the vocal cords; sonant, or intonated, utterance; tone; — distinguished from mere breath sound as heard in whispering and voiceless consonants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tone or sound emitted by an object",
                  "examples": [
                    "O Marcus, I am warm’d; my heart Leaps at the trumpet’s voice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The faculty or power of utterance",
                  "examples": [
                    "to cultivate the voice"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is communicated; message; meaning.",
                  "examples": [
                    "Let us call on God in the voice of his church."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An expressed opinion, choice, will, desire, or wish; the right or ability to make such expression or to have it considered",
                  "examples": [
                    "Like many of the 7 million other first time voters, she came of age during half a decade of military rule that has governed the country since former general turned Prime Minister Prayut Chan-o-cha seized power in a 2014 coup. \"We have had our voice taken away for five years,\" she says."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Command; precept.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who speaks; a speaker.",
                  "examples": [
                    "The inclusion of transgender voices further disrupts the homonormalization of sex and identity evident in popular LGBTQ cinema."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literature) A particular style or way of writing that expresses a certain tone or feeling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A particular way of inflecting or conjugating verbs, or a particular form of a verb, by means of which is indicated the relation of the subject of the verb to the action which the verb expresses.",
                  "examples": [
                    "The verbal system of Latin has two voices, active and passive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) In harmony, an independent vocal or instrumental part in a piece of composition.",
                  "examples": [
                    "The theme of this piece constantly migrates between the three voice parts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, IRC) A flag associated with a user on a channel, determining whether or not they can send messages to the channel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English voysen, voicen, from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "voice (third-person singular simple present voices, present participle voicing, simple past and past participle voiced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give utterance or expression to; to utter; to publish; to announce",
                  "examples": [
                    "He voiced the sentiments of the nation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, phonology) To utter audibly, with tone and not just breath.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fit for producing the proper sounds; to regulate the tone of",
                  "examples": [
                    "voice the pipes of an organ"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To vote; to elect; to appoint",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To clamor; to cry out",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Internet, IRC) To assign the voice flag to a user on IRC, permitting them to send messages to the channel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, film) To act as a voice actor to portray a character.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}