{
  "word": "fillet",
  "etymologies": [
    {
      "description": [
        "From Middle English filet, vylette, felet, filette, flette, from Old French filet, diminutive of fil (“thread”), from Latin fīlum (“thread”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fillet (plural fillets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A headband; a ribbon or other band used to tie the hair up, or keep a headdress in place, or for decoration.",
                  "examples": [
                    "She was talking of Raymond Duncan, a walking absurdity who dressed in an ancient handwoven Greek costume and wore his hair in long braids reaching to his waist, adding, on ceremonial occasions, a fillet of bay-leaves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin strip of any material, in various technical uses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) A heavy bead of waterproofing compound or sealant material generally installed at the point where vertical and horizontal surfaces meet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering, drafting, CAD) A rounded relief or cut at an edge, especially an inside edge, added for a finished appearance and to break sharp edges.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strip or compact piece of meat or fish from which any bones and skin and feathers have been removed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A premium cut of meat, especially beef, taken from below the lower back of the animal, considered to be lean and tender; also called tenderloin.",
                  "examples": [
                    "fillet steak"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A thin featureless moulding/molding used as separation between broader decorative mouldings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The space between two flutings in a shaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) An ordinary equal in breadth to one quarter of the chief, to the lowest portion of which it corresponds in position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The thread of a screw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A colored or gilded border.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The raised moulding around the muzzle of a gun.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(woodworking) Any scantling smaller than a batten.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A fascia; a band of fibres; applied especially to certain bands of white matter in the brain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The loins of a horse, beginning at the place where the hinder part of the saddle rests.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fillet (third-person singular simple present fillets, present participle filleting, simple past and past participle filleted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To slice, bone or make into fillets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply, create, or specify a rounded or filled corner to.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}