{
  "word": "verge",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French verge (“rod or wand of office”), hence \"scope, territory dominated\", from Latin virga (“shoot, rod stick”), of unknown origin. Earliest attested sense in English is now-obsolete meaning \"male member, penis\" (c.1400). Modern sense is from the notion of 'within the verge' (1509, also as Anglo-Norman dedeinz la verge), i.e. \"subject to the Lord High Steward's authority\" (as symbolized by the rod of office), originally a 12-mile radius round the royal court, which sense shifted to \"the outermost edge of an expanse or area.\" Doublet of virga."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "verge (plural verges)",
          "definitionGroups": [
            {
              "group": "A rod or staff of office, e.g. of a verger.",
              "entries": [
                {
                  "meaning": "(UK, historical) The stick or wand with which persons were formerly admitted tenants, by holding it in the hand and swearing fealty to the lord. Such tenants were called tenants by the verge.",
                  "examples": []
                }
              ]
            },
            {
              "group": "An edge or border.",
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand) The grassy area between the footpath and the street; a tree lawn; a grassed strip running alongside either side of an outback road.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) An extreme limit beyond which something specific will happen.",
                  "examples": [
                    "I was on the verge of tears."
                  ]
                }
              ]
            },
            {
              "group": "(obsolete) The phallus.",
              "entries": [
                {
                  "meaning": "(zoology) The external male organ of certain mollusks, worms, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An old measure of land: a virgate or yardland.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A circumference; a circle; a ring.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The shaft of a column, or a small ornamental shaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The eaves or edge of the roof that projects over the gable of a roof.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horology) The spindle of a watch balance, especially one with pallets, as in the old vertical escapement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Latin vergō (“to bend, turn, tend toward, incline”), from Proto-Indo-European *werg- (“to turn”), from a root *wer- (“to turn, bend”) (compare versus); strongly influenced by the above noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "verge (third-person singular simple present verges, present participle verging, simple past and past participle verged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be or come very close; to border; to approach.",
                  "examples": [
                    "Eating blowfish verges on insanity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bend or incline; to tend downward; to slope.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}