{
  "word": "spangle",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English spangel (“small piece of ornamental metal, spangle; small ornament”) [and other forms], from spang (“small piece of ornamental metal, spangle; small ornament; type of bowl or cup”) + -el (diminutive suffix). Spang is derived from Middle Dutch spange, spaenge (“buckle, clasp; brooch; spangle”) (modern Dutch spang (“clasp; hook; metal hairband; metal pin”)), from Middle Low German spangel (“small chain or clasp”), from Proto-Germanic *spangō (“brooch; clasp”); further etymology uncertain, possibly from Proto-Indo-European *(s)penh₁- (“to twist; to weave”). The English word is analysable as spang +‎ -le (diminutive suffix).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spangle (plural spangles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, flat piece of sparkling metallic or metal-like material with a hole which is sewn on to a garment, etc., for decoration; a sequin.",
                  "examples": [
                    "Synonym: paillette"
                  ]
                }
              ]
            },
            {
              "group": "Any small sparkling object.",
              "entries": [
                {
                  "meaning": "A shiny particle of a mineral.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) A star.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "A point of light; also (rare), a glitter, a sparkle.",
                  "examples": []
                },
                {
                  "meaning": "A speckle or spot, especially on the body of an animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of a number of swallowtail butterflies (genus Papilio); specifically Papilio protenor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spangle (third-person singular simple present spangles, present participle spangling, simple past and past participle spangled)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(also figuratively) To fix spangles or sparkling objects to (something); to bespangle.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To adorn or decorate (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To flash, glitter, or sparkle.",
                  "examples": [
                    "Synonyms: coruscate, scintillate"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}