{
  "word": "collation",
  "etymologies": [
    {
      "description": [
        "From Middle English collacioun, collation, from Old French collation, from Latin collatiō, from the participle stem of cōnferō (“to bring together”). Not related to English collateral."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "collation (countable and uncountable, plural collations)",
          "definitionGroups": [
            {
              "group": "Bringing together.",
              "entries": [
                {
                  "meaning": "The act of bringing things together and comparing them; comparison. [from 14th c.]",
                  "examples": [
                    "I return you your Milton, which, upon collation, I find to be revised, and augmented, in several places"
                  ]
                },
                {
                  "meaning": "The act of collating pages or sheets of a book, or from printing etc. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A collection, a gathering. [from 20th c.]",
                  "examples": [
                    "It's fantastic, as is so much of Forgiveness Rock Record, a collation of so many talents that it's practically bursting at the seams."
                  ]
                }
              ]
            },
            {
              "group": "Discussion, light meal.",
              "entries": [
                {
                  "meaning": "(obsolete) A conference or consultation. [14th–17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(in the plural) The Collationes Patrum in Scetica Eremo Commorantium by John Cassian, an important ecclesiastical work. (Now usually with capital initial.) [from 13th c.]",
                  "examples": []
                },
                {
                  "meaning": "A reading held from the work mentioned above, as a regular service in Benedictine monasteries. [from 14th c.]",
                  "examples": [
                    "When the hymn was over the Sacrist was to strike the table for collation, and the Deacon to enter with the Gospel, preceded by three converts, carrying the candlestick and censer."
                  ]
                },
                {
                  "meaning": "The light meal taken by monks after the reading service mentioned above. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "Any light meal or snack. [from 16th c.]",
                  "examples": [
                    "Yes, absolutely; supper, at least in English tradition, was a cold collation, left out by cook before retiring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical) The presentation of a clergyman to a benefice by a bishop, who has it in his own gift.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(civil law, inheritance) The blending together of property so as to achieve equal division, mainly in the case of inheritance.",
                  "examples": [
                    "Synonym: hotchpot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(civil law, inheritance, Scotland) An heir's right to combine the whole heritable and movable estates of the deceased into one mass, sharing it equally with others who are of the same degree of kindred.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of conferring or bestowing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical) Presentation to a benefice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(databases) The specification of how character data should be treated stored and sorted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "collation (third-person singular simple present collations, present participle collationing, simple past and past participle collationed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To partake of a collation, or light meal.",
                  "examples": [
                    "I  […]  collationed in Spring Garden."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}