{
  "word": "faggot",
  "etymologies": [
    {
      "description": [
        "From Middle English fagot, from Old French fagot (“bundle of sticks”), of uncertain origin. Unlikely from Old Occitan fagot or Italian fagotto, as these appear later than the Old French term. Compare also Italian fangotto and Spanish fajo (“bundle, wad”). Perhaps from a diminutive of Vulgar Latin *facus, from Latin fascis (“bundle of wood”). Compare also Old High German fazza (“bundle, load, burden”). Doublet of fagotto. See also: fag.",
        "The senses relating to persons, though possibly originating as an extension of the sense \"bundle of sticks\", may have been reinforced by faygele, from Yiddish פֿייגעלע‎ (feygele, “homosexual”, literally “little bird”), related to English fowl."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "faggot (plural faggots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, collective) A bundle of sticks or brushwood intended to be used for fuel tied together for carrying. (Some sources specify that a faggot is tied with two bands or withes, whereas a bavin is tied with just one.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Burdensome baggage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bundle of pieces of iron or steel cut off into suitable lengths for welding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, dated in US) A burning or smouldering piece of firewood.",
                  "examples": [
                    "He clambered back on his feet and grinned at them.  The waning faggot cast red light over his fangs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) A meatball made with offcuts and offal, especially pork. (See Wikipedia.)",
                  "examples": [
                    "Synonym: (slang, obsolete) duck"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(offensive, vulgar, derogatory) An annoying or inconsiderate person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Ireland, colloquial, derogatory, obsolete) A shrewish woman.",
                  "examples": [
                    "Synonyms: see Thesaurus:shrew"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(offensive, vulgar) A homosexual man, especially an effeminate one.",
                  "examples": [
                    "Synonyms: see Thesaurus:male homosexual",
                    "Coordinate terms: dyke, scissor sister"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(offensive, vulgar) A man considered weak, effeminate, timid, pathetic, emotional, non-heteronormative in some way",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A soldier numbered on the muster-roll, but not really existing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, historical) A faggot voter.",
                  "examples": [
                    "The Glasgow Herald thought that his attack on the faggots was too serious  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, dated, slang) A lazy, weak, work-shy person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "faggot (third-person singular simple present faggots, present participle faggoting, simple past and past participle faggoted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of fagot",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}