{
  "word": "chaser",
  "etymologies": [
    {
      "description": [
        "From Middle English chaser, chacer, chasour, borrowed from Old French chaceür, chaceor, from chacier (“to chase, hunt”); later senses from or influenced by chase (“pursue”) +‎ -er. Doublet of chasseur."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chaser (plural chasers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing (ship, plane, car, etc.) that chases. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A hunter. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A horse: (originally) a horse used for hunting; (now) a horse trained for steeplechasing, a steeplechaser. [from 14th c.]",
                  "examples": [
                    "\"[I]t looked like The Fellow was the best steeplechaser in many years. He'd earned the best speed rating I'd ever given a chaser.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drink consumed after another of a different kind.",
                  "examples": [
                    "Coordinate term: back",
                    "beer chaser",
                    "straight, no chaser"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logging, obsolete) Someone who follows logs out of the forest in order to signal a yarder engineer to stop them if they become fouled (also called a frogger).",
                  "examples": [
                    "\"...on one end known as a Bardon choker hook, to facilitate making a loop. It stays tight and makes it unnecessary for the \"chaser\" or \"choker setter\" to follow the \"turn\" to the landing as might have to be done if tongs are used\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logging) One who unhooks chokers from the logs at the landing.",
                  "examples": [
                    "\"The rigging slinger hooks the chokers to the main line, the chaser unhooks them at the spar tree.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, historical) A piece of music, etc. played after a performance while the audience leaves.",
                  "examples": [
                    "After the final curtain the orchestra played a \"chaser\" which was music played while the audience members not remaining for the after-show concert left the theatre."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of a series of adjacent light bulbs that cycle on and off to give the illusion of movement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long piece of flexible wire used to draw an electrical cable through a wall cavity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of prison chaser (“person who guards military prisoners”)",
                  "examples": []
                }
              ]
            },
            {
              "group": "(slang) A person who seeks out sexual partners with a particular quality:",
              "entries": [
                {
                  "meaning": "(slang) A tranny chaser.",
                  "examples": []
                },
                {
                  "meaning": "(slang) A chubby chaser.",
                  "examples": []
                },
                {
                  "meaning": "(slang) A person who seeks partners with HIV in order to become infected.",
                  "examples": [
                    "Synonym: bug-chaser"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the sport of Quidditch or Muggle quidditch, a player responsible for passing the quaffle and scoring goals with it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any dragonfly of family Libellulidae.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From chase (“groove; decorate metal”) +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chaser (plural chasers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who chases (decorates) metal; a person who decorates metal by engraving or embossing. [from 18th c.]",
                  "examples": [
                    "\"Mr B., heraldic chaser, says there are several processes in making heraldy plates, sketching, engraving, embossing, chasing and burnishing.\"",
                    "\"H. & C., manufacturers of cloth and gilt buttons, say it requires some weeks to learn to chase the gilt buttons, which are done with small metal tools and a hammer. Chasers are paid by the piece, working ten hours a day, and some can earn $1 a day.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool used for cleaning out screw threads, either as an integral part of a tap or die to remove waste material produced by the cutting tool, or as a separate tool to repair damaged threads. [from 19th c.]",
                  "examples": [
                    "\"In Fig. i is shown one of the chasers in the position which it occupies in cutting a thread.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A chase gun.",
                  "examples": [
                    "bow chaser; stern chaser"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}