{
  "word": "craft",
  "etymologies": [
    {
      "description": [
        "From Middle English craft (“strength, skill”), from Old English cræft (“strength, skill”), from Proto-West Germanic *kraftu, from Proto-Germanic *kraftuz (“strength, power”); further origin obscure.\nCognate with German Kraft (“strength, power, force, energy, employee”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "craft (countable and uncountable, plural craft or crafts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Strength; power; might; force [9th century].",
                  "examples": []
                }
              ]
            },
            {
              "group": "(uncountable) Intellectual power; skill; art.",
              "entries": [
                {
                  "meaning": "Ability, skilfulness, especially skill in making plans and carrying them into execution; dexterity in managing affairs, adroitness, practical cunning; ingenuity in constructing, dexterity [9th century].",
                  "examples": []
                },
                {
                  "meaning": "Cunning, art, skill, or dexterity applied to bad purposes; artifice; guile; subtlety; shrewdness as demonstrated by being skilled in deception [13th century].",
                  "examples": [
                    "Synonyms: craftiness, cunning, foxiness, guile, slyness, wiliness"
                  ]
                },
                {
                  "meaning": "(obsolete) Occult art, magic [13th century].",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, obsolete in the general sense) A work or product of art [c. 1000].",
              "entries": [
                {
                  "meaning": "(collective or plural) Handmade items, especially domestic or decorative objects; handicrafts [20th century].",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) A device, a means; a magical device, spell or enchantment [13th century].",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) Learning of the schools, scholarship; a branch of learning or knowledge, a science, especially one of the ‘seven liberal arts’ of the medieval universities [13th century].",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Skill, skilfulness, art, especially the skill needed for a particular profession [9th century].",
                  "examples": [
                    "The craft of writing plays.",
                    "Synonyms: craftsmanship, workmanship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, plural crafts) A branch of skilled work or trade, especially one requiring manual dexterity or artistic skill, but sometimes applied equally to any business, calling or profession; the skilled practice of a practical occupation [since the 9th century].",
                  "examples": [
                    "The carpenter's craft.",
                    "He learned his craft as an apprentice.",
                    "Synonyms: art, trade, handicraft, business, profession"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A trade or profession as embodied in its practitioners collectively; the members of a trade or handicraft as a body; an association of these; a trade's union, guild, or ‘company’ [15th century].",
                  "examples": [
                    "She represented the craft of brewers."
                  ]
                }
              ]
            },
            {
              "group": "(countable, plural craft) A vehicle designed for navigation in or on water or air or through outer space [since the 17th century].",
              "entries": [
                {
                  "meaning": "(nautical) Boats, especially of smaller size than ships. Historically primarily applied to vessels engaged in loading or unloading of other vessels, as lighters, hoys, and barges.",
                  "examples": []
                },
                {
                  "meaning": "(nautical, British Royal Navy) Those vessels attendant on a fleet, such as cutters, schooners, and gun-boats, generally commanded by lieutenants.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) A woman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, fishing) Implements used in catching fish, such as net, line, or hook. Modern use primarily in whaling, as in harpoons, hand-lances, etc. [17th century].",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "craft (third-person singular simple present crafts, present participle crafting, simple past and past participle crafted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make by hand and with much skill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To construct, develop something (like a skilled craftsman).",
                  "examples": [
                    "state crafting; the process of crafting global policing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) To combine multiple items to form a new item, such as armour or medicine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}