{
  "word": "honeydew",
  "etymologies": [
    {
      "description": [
        "The noun is derived from honey +‎ dew, originally believed to be a form of dew that fell from the sky like rain on to plants (see sense 1).",
        "The adjective is derived from the noun."
      ],
      "adjectives": [
        {
          "description": "honeydew (comparative more honeydew, superlative most honeydew)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a light green colour, like the flesh of some honeydew melons.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "honeydew (countable and uncountable, plural honeydews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A sweet, sticky substance deposited on leaves and other plant parts by insects (especially aphids and scale insects) feeding on plant sap, or by fungi.",
                  "examples": [
                    "Synonym: (archaic) melligo"
                  ]
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(uncountable) A sweet liquid substance resembling the substance mentioned in sense 1, such as honey, nectar, or manna in the Bible.",
                  "examples": [
                    "Synonym: ambrosia"
                  ]
                },
                {
                  "meaning": "(uncountable) A blackish mould (often called sooty mould) produced by fungi of the order Dothideales, feeding on the substance mentioned in sense 1.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, originally US) In full honeydew tobacco: a fine sort of tobacco moistened with a sweet substance (originally molasses).",
                  "examples": []
                },
                {
                  "meaning": "(countable) Short for honeydew melon (“a melon from the Cucumis melo Inodorus cultivar group, with sweet, light green or white flesh and a smooth greenish-white or yellow rind”).",
                  "examples": [
                    "honeydew:"
                  ]
                },
                {
                  "meaning": "(uncountable) A light green colour, like the flesh of some honeydew melons.",
                  "examples": [
                    "honeydew:"
                  ]
                },
                {
                  "meaning": "(countable, figuratively) Something that is enjoyable or pleasant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}