{
  "word": "pyramid",
  "etymologies": [
    {
      "description": [
        "From French pyramide, from Old French piramide, from Latin pȳramis, pȳramidis, from Ancient Greek πῡραμίς (pūramís), possibly from πῡρός (pūrós, “wheat”) + ἀμάω (amáō, “reap”) or from Egyptian pr-m-ws (“height of a pyramid”), from pr (“(one that) comes forth”) + m (“from”) + ws (“height”). Schenkel and K. Lang proposed hypothetical Coptic ⲡⲓⲣⲁⲙ (piram) or ⲫⲣⲁⲙ (phram) derived from Egyptian mr via metathesis as a source of πῡραμίς (pūramís) while Schenkel also suggested it being the source of Arabic هرم‎ although the latter is considered far-fetched by Takacs."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pyramid (countable and uncountable, plural pyramids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ancient massive construction with a square or rectangular base and four triangular sides meeting in an apex, such as those built as tombs in Egypt or as bases for temples in Mesoamerica.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A construction in the shape of a pyramid, usually with a square or rectangular base.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A solid with triangular lateral faces and a polygonal (often square or rectangular) base.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(neuroanatomy) A medullary pyramid, the medial-most bumps on the ventral side of the medulla oblongata",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dated) The game of pool in which the balls are placed in the form of a triangle at spot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pyramid scheme.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games, uncountable) Alternative letter-case form of Pyramid. (a solitaire card game)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) The triangular layout of cards in the game of Pyramid.",
                  "examples": [
                    "Build your pyramid with all cards face down, except the cards in the bottom row."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) An approximately triangular headline consisting of several centered lines of text of increasing length.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pyramid (third-person singular simple present pyramids, present participle pyramiding, simple past and past participle pyramided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To build up or be arranged in the form of a pyramid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, genetics) To combine (a series of genes) into a single genotype.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To employ, or take part in, a pyramid scheme.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) To engage in pyramid trading.",
                  "examples": [
                    "Multiply this by the number of shares you traded, and add other positions if you pyramided."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}