{
  "word": "unlock",
  "etymologies": [
    {
      "description": [
        "From Middle English unloken, unlouken, onlouken, from Old English onlūcan (“to unlock”), equivalent to un- +‎ lock. Cognate with Dutch ontluiken (“to unlock”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "unlock (plural unlocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of unlocking something.",
                  "examples": [
                    "Unlike modern, automated prisons, each cell here was locked and unlocked manually with a large skeleton key. The first duty was to get a proper head count of each inmate, insuring each was alive. Once done, an unlock was conducted."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "unlock (third-person singular simple present unlocks, present participle unlocking, simple past and past participle unlocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To undo or open a lock or something locked by, for example, turning a key, or selecting a combination.",
                  "examples": [
                    "I unlocked the door and walked in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To obtain access to something; to meet the requirements of a security or protection system.",
                  "examples": [
                    "I unlocked the dictionary article so I could edit it.",
                    "This computer game is shareware, but you can pay for a code to unlock the full version."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mobile telephony) To configure (a mobile phone) so that it is not bound to any particular carrier.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disclose or reveal previously unknown knowledge or potential.",
                  "examples": [
                    "The discovery of a clue unlocked the mystery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be or become unfastened or unrestrained.",
                  "examples": [
                    "He had come straight up without mishap or swerving off his course, and his shut teeth unlocked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To make available.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To undermine something that has control over a situation; to find a way to counter or oppose.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}