{
  "word": "swerve",
  "etymologies": [
    {
      "description": [
        "From Middle English swerven, swarven, from Old English sweorfan (“to file; rub; polish; scour; turn aside”), from Proto-Germanic *swerbaną (“to rub off; wipe; mop”), from Proto-Indo-European *swerbʰ- (“to turn; wipe; sweep”). Cognate with West Frisian swerve (“to wander; roam; swerve”), Dutch zwerven (“to wander; stray; roam”), Low German swarven (“to swerve; wander; riot”), Swedish dialectal svärva (“to wipe”), Icelandic sverfa (“to file”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swerve (plural swerves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden movement out of a straight line, for example to avoid a collision.",
                  "examples": [
                    "The distinction between using a skill subconsciously and employing it in the full knowledge of what was happening made a dramatic difference. I could execute a swerve to avoid an obstacle in a fraction of the time it previously took."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deviation from duty or custom.",
                  "examples": [
                    "[…]  indubitable evidence of a swerve from the principle of the work."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swerve (third-person singular simple present swerves, present participle swerving, simple past and past participle swerved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To stray; to wander; to rove.",
                  "examples": [
                    "A maid thitherward did run, / To catch her sparrow which from her did swerve."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To go out of a straight line; to deflect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wander from any line prescribed, or from a rule or duty; to depart from what is established by law, duty, custom, or the like; to deviate.",
                  "examples": [
                    "I swerve not from thy commandments."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bend; to incline; to give way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To climb or move upward by winding or turning.",
                  "examples": [
                    "The tree was high; / Yet nimbly up from bough to bough I swerved."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To turn aside or deviate to avoid impact.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a projectile, to travel in a curved line",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To drive in the trajectory of another vehicle to stop it, to cut off.",
                  "examples": [
                    "The French invaders, like an infuriated animal that has in its onslaught received a mortal wound, felt that they were perishing, but could not stop, any more than the Russian army, weaker by one half, could help swerving."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To go out of one's way to avoid; to snub.",
                  "examples": [
                    "If I see that type o' muthafucka in the club I just swerve him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}