{
  "word": "purr",
  "etymologies": [
    {
      "description": [
        "Onomatopoeic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "purr (plural purrs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The vibrating sound made by a cat in its throat when contented.",
                  "examples": [
                    "Instead, the tiger looked around, and gave a purr, and then a growl. What did that mean? The man could not tell. Then the tiger just flung upon the man some of the sand from the side of the hollow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A throaty, seductive sound of pleasure made by a person.",
                  "examples": [
                    "The trill of her purr echoed inside his mouth when he kissed her again. Clutching at his shirt, her fingers traveled the muscles in his back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The low consistent rumble made by an engine at slow speed",
                  "examples": [
                    "I sat still in the car and listened to the soft purr of the engine and my beating heart. Then slowly, and as silently as possible, I drove the car back to camp."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "purr (third-person singular simple present purrs, present participle purring, simple past and past participle purred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a cat, to make a vibrating sound in its throat when contented.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say (something) in a throaty, seductive manner.",
                  "examples": [
                    "\"This is Cindy,\" she purred again, flashing a smile of perfect white teeth surrounded by full red lips."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a vibrating throaty sound, as from pleasure.",
                  "examples": [
                    "He purred like a kitten when she massaged his neck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of an engine) To make a low and consistent rumbling sound.",
                  "examples": [
                    "Beverly passed the city limits sign with the Porsche's motor purring contentedly after its two hundred and fifty-mile romp."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}