{
  "word": "aid",
  "etymologies": [
    {
      "description": [
        "From Middle English aide, eide, ayde, from Old French eide, aide, from aidier, from Latin adiūtō, adiūtāre (“to assist, help”). Cognates include Spanish ayuda, Portuguese ajuda and Italian aiuto."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "aid (countable and uncountable, plural aids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Help; assistance; succor, relief.",
                  "examples": [
                    "He came to my aid when I was foundering."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A helper; an assistant.",
                  "examples": [
                    "It is not good that man should bee alone, let vs make vnto him an aide like to himselfe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something which helps; a material source of help.",
                  "examples": [
                    "Slimming aids include dietary supplements and appetite suppressants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Britain) An historical subsidy granted to the crown by Parliament for an extraordinary purpose, such as a war effort.",
                  "examples": [
                    "In this parliament was granted to the king for defence against the Scots two aids and two quindecims, the which two aids did not extend over two quindecims."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Britain) An exchequer loan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, law) A pecuniary tribute paid by a vassal to his feudal lord on special occasions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Alternative form of aide (“an aide-de-camp”)",
                  "examples": [
                    "Suddenly, the general's aid entered the room and walked in a straight line, coming to a halt in front of the desk, standing at attention, waiting for the general to recognize him, allowing the aid to speak."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, chiefly in the plural, horse racing) The rider's use of hands, legs, voice, etc. to control the horse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English aiden, from Old French eider, aider, aidier, from Latin adiuto, frequentative of adiuvō (“assist”, verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "aid (third-person singular simple present aids, present participle aiding, simple past and past participle aided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide support to; to further the progress of; to help; to assist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) To climb with the use of aids such as pitons.",
                  "examples": [
                    "Rather than climb into a bottomless off-width crack, we aided an 80-foot A2 to A3 crack to the top of a pedestal. By very tenuous face climbing, we gained entry to the crack, which we followed to a tree beneath the big chimney."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}