{
  "word": "blimp",
  "etymologies": [
    {
      "description": [
        "Origin not entirely certain. However, most historians believe that it is onomatopoeia for the sound a blimp makes when thumped. Although there is some disagreement among historians, credit for coining the term is usually given to Lt. A.D. Conningham of the British Royal Navy in 1915.",
        "There is an often repeated, but false, alternative explanation for the term. The erroneous story is that at some time in the early 20th century, the United States military had two classes for airships: Type A-rigid and Type B-limp, hence “blimp”. In fact, A. D. Topping reports on the “Etymology of ‘Blimp’”, in the AAHS Journal, Winter 1963, that:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blimp (plural blimps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) An airship constructed with a non-rigid lifting agent container.",
                  "examples": [
                    "The Goodyear blimp over Giants Stadium"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any large airborne inflatable.",
                  "examples": [
                    "a 6 meter high blimp made by a professional inflatables company, to be flown in the skies"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An obese person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person similar to the cartoon character Colonel Blimp; a pompous, reactionary British man.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, television) A soundproof cover for a video camera.",
                  "examples": [
                    "Synonym: barney"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blimp (third-person singular simple present blimps, present participle blimping, simple past and past participle blimped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, intransitive) To expand like a blimp or balloon; to become fat.",
                  "examples": [
                    "After college, she started blimping and could no longer wear her favorite little black dress.",
                    "Over a few years the software had blimped into typical bloatware."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fit (a video camera) with a soundproof cover.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}