{
  "word": "tape",
  "etymologies": [
    {
      "description": [
        "From Middle English tape, tappe, from Old English tæppa, tæppe (“ribbon, tape”). Probably akin to Old Frisian tapia (“to pull, rip, tear”), Middle Low German tappen, tāpen (“to grab, pull, rip, tear, snatch”), Middle High German zāfen, zāven (“to pull, tear”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tape (countable and uncountable, plural tapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Flexible material in a roll with a sticky surface on one or both sides; adhesive tape.",
                  "examples": [
                    "Hand me some tape. I need to fix a tear in this paper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Thin and flat paper, plastic or similar flexible material, usually produced in the form of a roll.",
                  "examples": [
                    "We made some decorative flowers out of the tape we bought."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Finishing tape, stretched across a track to mark the end of a race.",
                  "examples": [
                    "Jones broke the tape in 47.77 seconds, a new world record."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Magnetic or optical recording media in a roll; videotape or audio tape.",
                  "examples": [
                    "Did you get that on tape?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, by extension) Any video or audio recording, regardless of the method used to produce it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An unthinking, patterned response triggered by a particular stimulus.",
                  "examples": [
                    "Old couples will sometimes play tapes at each other during a fight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(trading, from ticker tape) The series of prices at which a financial instrument trades.",
                  "examples": [
                    "Don’t fight the tape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) The wrapping of the primary puck-handling surface of a hockey stick",
                  "examples": [
                    "His pass was right on the tape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) A strong flexible band rotating on pulleys for directing the sheets in a printing machine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(possible, obsolete, UK, slang) Liquor, alcoholic drink, especially gin or brandy. (Especially in prison slang or among domestic servants and women.)",
                  "examples": [
                    "white tape, Holland tape, blue tape (gin); red tape (brandy or wine)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clipping of red tape (“time-consuming bureaucratic procedures”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tape (third-person singular simple present tapes, present participle taping, simple past and past participle taped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bind with adhesive tape.",
                  "examples": [
                    "Be sure to tape your parcel securely before posting it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To record, originally onto magnetic tape.",
                  "examples": [
                    "You shouldn’t have said that. The microphone was on and we were taping."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, passive) To understand, figure out.",
                  "examples": [
                    "I've finally got this thing taped."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}