{
  "word": "dissident",
  "etymologies": [
    {
      "description": [
        "From Latin dissidēns, dissidentis, present participle of dissidēre (“to sit apart; to disagree”), from dis- (“asunder, apart, in two”) + sedēre (“to sit”)."
      ],
      "adjectives": [
        {
          "description": "dissident (comparative more dissident, superlative most dissident)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a manner that disagrees; dissenting; discordant.",
                  "examples": [
                    "Verilye yf all thynges that euel and vitiouſs maners haue caused to ſeme inconueniente and noughte ſhould be refuſed, as thinges vnmete and reprochefull, then we muſt among Chriſten people wynke at the moſte parte of al thoſe thinges, whych Chriſt taught vs, and ſo ſtreitly forbad them to be winked at, yat thoſe thinges alſo whiche he whiſpered in ye eares of his diſciples he commaunded to be proclaimed in open houſes. And yet ye moſt parte of them is more diſſident from the maners of the worlde nowe a dayes, then my communication was."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "dissident (plural dissidents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who formally opposes the current political structure, the political group in power, the policies of the political group in power, or current laws.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(Christianity) One who disagrees or dissents; one who separates from the established religion.",
              "entries": [
                {
                  "meaning": "(Christianity, specifically, historical) Sometimes Dissident: in the kingdom of Poland, the name for Christians not part of the Roman Catholic Church.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}