{
  "word": "pew",
  "etymologies": [
    {
      "description": [
        "From Middle English pewe, borrowed from Middle French puie (“balustrade”), from Latin podia, plural of podium (“parapet, podium”), from Ancient Greek πόδιον (pódion, “little foot”), from πούς (poús, “foot”). Doublet of podium."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pew (plural pews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the long benches in a church, seating several persons, usually fixed to the floor and facing the chancel.",
                  "examples": [
                    "In many churches some pews are reserved for either clerical or liturgical officials such as canons, or for prominent families."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enclosed compartment in a church which provides seating for a group of people, often a prominent family.",
                  "examples": [
                    "At St. Patrick’s Cathedral, firefighters in dress blues and white gloves escorted families to the pews for a memorial service, led by Mr. Bloomberg, to honor the 343 Fire Department employees killed on 9/11."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any structure shaped like a church pew, such as a stall, formerly used by money lenders, etc.; a box in a theatre; or a pen or sheepfold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, humorous) A chair; a seat.",
                  "examples": [
                    "Pull up a pew."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pew (third-person singular simple present pews, present participle pewing, simple past and past participle pewed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish with pews.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "See phew."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Onomatopoeic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}