{
  "word": "x",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "The variable name comes from usage in Spain, as up to the 16th century ⟨x⟩ had the sound value /ʃ/ in Spanish, so was used to transcribe Arabic ش‎ (š) used for the purpose of a variable as an abbreviation of شَيْء‎ (šayʔ, “thing”). Its sound value is since then /x/ which explains the decision made in the circle of the International Phonetic Association to assign this character to the voiceless velar fricative. Compare English hickey (“an object whose name is not recalled; bruise-like mark made during petting by pressing the mouth to the skin”) for the development of the sense of a communicated kiss."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "The multiplication sign is an arbitrary notation developed in the early 17th century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Originates in given multiples of the speeds specified in the original CD and DVD standards, then, by reason of the actual unit being without name but just implied by the multiplication sign, reinterpreted as or used as if a unit, considering also that data transfer speed is variable, so that now, bolstered by stylization of the sign in the marketing of manufacturers, either spelling, with the multiplication sign or with the ex borrowed from the iconic mathematical variable sign, seems correct."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}