{
  "word": "of",
  "etymologies": [
    {
      "description": [
        "From Middle English of, from Old English of (“from, out of, off”), an unstressed form of æf, from Proto-West Germanic *ab, from Proto-Germanic *ab (“away; away from”). Doublet of off, which is the stressed descendant of the same Old English word. More at off."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [
        {
          "description": "of",
          "definitionGroups": [
            {
              "group": "Expressing distance or motion.",
              "entries": [
                {
                  "meaning": "(now obsolete or dialectal) From (of distance, direction), \"off\". [from 9th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete except in phrases) Since, from (a given time, earlier state etc.). [from 9th c.]",
                  "examples": [
                    "Obama has been obliged to make nice of late in hope of rescuing the moribund two-state process and preventing resumed West Bank settlement building."
                  ]
                },
                {
                  "meaning": "From, away from (a position, number, distance etc.). [from 10th c.]",
                  "examples": [
                    "There are no shops within twenty miles of the cottage."
                  ]
                }
              ]
            },
            {
              "group": "Expressing separation.",
              "entries": [
                {
                  "meaning": "Indicating removal, absence or separation, with the action indicated by a transitive verb and the quality or substance by a grammatical object. [from 10th c.]",
                  "examples": [
                    "Finally she was relieved of the burden of caring for her sick husband."
                  ]
                },
                {
                  "meaning": "Indicating removal, absence or separation, with resulting state indicated by an adjective. [from 10th c.]",
                  "examples": [
                    "He seemed devoid of human feelings."
                  ]
                },
                {
                  "meaning": "(obsolete) Indicating removal, absence or separation, construed with an intransitive verb. [14th–19th c.]",
                  "examples": [
                    "He was kindly treated by the people at Saco, and recovered of his wounds."
                  ]
                }
              ]
            },
            {
              "group": "Expressing origin.",
              "entries": [
                {
                  "meaning": "Indicating an ancestral source or origin of descent. [from 9th c.]",
                  "examples": [
                    "The word is believed to be of Japanese origin."
                  ]
                },
                {
                  "meaning": "Introducing an epithet that indicates a birthplace, residence, dominion, or other place associated with the individual.",
                  "examples": [
                    "Jesus of Nazareth (after hometown)",
                    "Anselm of Canterbury (after diocese)",
                    "Anselm of Aosta (after birthplace)",
                    "Anselm of Bec (after monastery)",
                    "Pedro II of Brazil (after dominion)",
                    "Mrs Miggins of Gasworks Road, Mudchester (after place of residence)"
                  ]
                },
                {
                  "meaning": "Indicating a (non-physical) source of action or emotion; introducing a cause, instigation; from, out of, as an expression of. [from 9th c.]",
                  "examples": [
                    "The invention was born of necessity."
                  ]
                },
                {
                  "meaning": "(following an intransitive verb) Indicates the source or cause of the verb. [from 10th c.]",
                  "examples": [
                    "It is said that she died of a broken heart."
                  ]
                },
                {
                  "meaning": "(following an adjective) Indicates the subject or cause of the adjective. [from 13th c.]",
                  "examples": [
                    "I am tired of all this nonsense."
                  ]
                }
              ]
            },
            {
              "group": "Expressing agency.",
              "entries": [
                {
                  "meaning": "(following a passive verb) Indicates the agent (for most verbs, now usually expressed with by). [from 9th c.]",
                  "examples": [
                    "I am not particularly enamoured of this idea."
                  ]
                },
                {
                  "meaning": "Used to introduce the \"subjective genitive\"; following a noun to form the head of a postmodifying noun phrase (see also 'Possession' senses below).}} [from 13th c.]",
                  "examples": [
                    "The contract can be terminated at any time with the agreement of both parties."
                  ]
                },
                {
                  "meaning": "(following an adjective) Used to indicate the agent of something described by the adjective. [from 16th c.]",
                  "examples": [
                    "It was very brave of you to speak out like that."
                  ]
                }
              ]
            },
            {
              "group": "Expressing composition, substance.",
              "entries": [
                {
                  "meaning": "(after a verb expressing construction, making etc.) Used to indicate the material or substance used. [from 9th c.]",
                  "examples": [
                    "Many 'corks' are now actually made of plastic."
                  ]
                },
                {
                  "meaning": "(directly following a noun) Used to indicate the material of the just-mentioned object. [from 10th c.]",
                  "examples": [
                    "She wore a dress of silk."
                  ]
                },
                {
                  "meaning": "Indicating the composition of a given collective or quantitative noun. [from 12th c.]",
                  "examples": [
                    "What a lot of nonsense!"
                  ]
                },
                {
                  "meaning": "Used to link a given class of things with a specific example of that class. [from 12th c.]",
                  "examples": [
                    "Welcome to the historic town of Harwich."
                  ]
                },
                {
                  "meaning": "Links two nouns in near-apposition, with the first qualifying the second; \"which is also\". [from 14th c.]",
                  "examples": [
                    "I'm not driving this wreck of a car."
                  ]
                }
              ]
            },
            {
              "group": "Introducing subject matter.",
              "entries": [
                {
                  "meaning": "Links an intransitive verb, or a transitive verb and its subject (especially verbs to do with thinking, feeling, expressing etc.), with its subject-matter; concerning, with regard to. [from 10th c.]",
                  "examples": [
                    "I'm always thinking of you."
                  ]
                },
                {
                  "meaning": "(following a noun (now chiefly nouns of knowledge, communication etc.)) Introduces its subject matter; about, concerning. [from 12th c.]",
                  "examples": [
                    "He told us the story of his journey to India."
                  ]
                },
                {
                  "meaning": "(following an adjective) Introduces its subject matter. [from 15th c.]",
                  "examples": [
                    "This behaviour is typical of teenagers."
                  ]
                }
              ]
            },
            {
              "group": "Having partitive effect.",
              "entries": [
                {
                  "meaning": "(following a number or other quantitive word) Introduces the whole for which is indicated only the specified part or segment; \"from among\". [from 9th c.]",
                  "examples": [
                    "Most of these apples are rotten."
                  ]
                },
                {
                  "meaning": "(following a noun) Indicates a given part. [from 9th c.]",
                  "examples": [
                    "everyone, even the ladies of the village, called the dish tzigayner shmeklekh, or “gypsies' penises.”"
                  ]
                },
                {
                  "meaning": "(now archaic, literary, with preceding partitive word assumed, or as a predicate after to be) Some, an amount of, one of. [from 9th c.]",
                  "examples": [
                    "On the whole, they seem to be of the decent sort."
                  ]
                },
                {
                  "meaning": "Links to a genitive noun or possessive pronoun, with partitive effect (though now often merged with possessive senses, below). [from 13th c.]",
                  "examples": [
                    "He is a friend of mine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "Expressing possession.",
              "entries": [
                {
                  "meaning": "Belonging to, existing in, or taking place in a given location, place or time. Compare \"origin\" senses, above.}} [from 9th c.]",
                  "examples": [
                    "He was perhaps the most famous scientist of the twentieth century."
                  ]
                },
                {
                  "meaning": "Belonging to (a place) through having title, ownership or control over it. [from 9th c.]",
                  "examples": [
                    "The owner of the nightclub was arrested."
                  ]
                },
                {
                  "meaning": "Belonging to (someone or something) as something they possess or have as a characteristic; the \"possessive genitive\". (With abstract nouns, this intersects with the subjective genitive, above under \"agency\" senses.) [from 13th c.]",
                  "examples": [
                    "Keep the handle of the saucepan away from the flames."
                  ]
                }
              ]
            },
            {
              "group": "Forming the \"objective genitive\".",
              "entries": [
                {
                  "meaning": "Follows an agent noun, verbal noun or noun of action. [from 12th c.]",
                  "examples": [
                    "She had a profound distrust of the police."
                  ]
                }
              ]
            },
            {
              "group": "Expressing qualities or characteristics.",
              "entries": [
                {
                  "meaning": "(archaic or literary) Links an adjective with a noun or noun phrase to form a quasi-adverbial qualifier; in respect to, as regards. [from 13th c.]",
                  "examples": [
                    "My companion seemed affable and easy of manner."
                  ]
                },
                {
                  "meaning": "Indicates a quality or characteristic; \"characterized by\". [from 13th c.]",
                  "examples": [
                    "Pooh was said to be a bear of very little brain."
                  ]
                },
                {
                  "meaning": "Indicates quantity, age, price, etc. [from 13th c.]",
                  "examples": [
                    "We have been paying interest at a rate of 10%."
                  ]
                },
                {
                  "meaning": "(US, informal, considered incorrect by some) Used to link singular indefinite nouns (preceded by the indefinite article) and attributive adjectives modified by certain common adverbs of degree.",
                  "examples": [
                    "It's not that big of a deal."
                  ]
                }
              ]
            },
            {
              "group": "Expressing a point in time.",
              "entries": [
                {
                  "meaning": "(chiefly regional) During the course of (a set period of time, day of the week etc.), now specifically with implied repetition or regularity. [from 9th c.]",
                  "examples": [
                    "Of an evening, we would often go for a stroll along the river."
                  ]
                },
                {
                  "meaning": "(UK, dialectal, chiefly in the negative) For (a given length of time). [from 13th c.]",
                  "examples": [
                    "I’ve not tekken her out of a goodly long while."
                  ]
                },
                {
                  "meaning": "(after a noun) Indicates duration of a state, activity etc. [from 18th c.]",
                  "examples": [
                    "After a delay of three hours, the plane finally took off."
                  ]
                },
                {
                  "meaning": "(chiefly US) Denotes the number of minutes before the hour;Before (the hour); to. [from 19th c.]",
                  "examples": [
                    "I’ll be ready at ten of twoI’ll be ready at 1:50",
                    "What's the time? / Nearly a quarter of three."
                  ]
                },
                {
                  "meaning": "(informal) Often used without the hour",
                  "examples": [
                    "I’ll be ready at ten ofI’ll be ready at 1:50, or 2:50, or whatever time ending in 10 makes most sense in context."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": []
    },
    {
      "description": [
        "A spelling of /əv/ influenced by Etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "of",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in modal perfect constructions) Eye dialect spelling of have or ’ve, chiefly in depictions of colloquial speech.",
                  "examples": [
                    "I have refrained from giving many details which I might of done, from feelings of delicacy; indeed, they were of so dark and dreadful a nature, that I could do no more than hint at them"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}