{
  "word": "sputter",
  "etymologies": [
    {
      "description": [
        "Probably representing Middle English *sputren, *sputrien, a frequentative form of Middle English sputen (“to spout, vomit”), equivalent to spout +‎ -er. Cognate with Saterland Frisian spüttern (“to inject, spray, splash”), West Frisian sputterje (“to sputter”), Dutch sputteren (“to sputter”), Low German sputtern, spruttern (“to sprinkle”), German sprudeln (“to spout, squirt”). Compare splutter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sputter (countable and uncountable, plural sputters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moist matter thrown out in small detached particles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Confused and hasty speech.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sputter (third-person singular simple present sputters, present participle sputtering, simple past and past participle sputtered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To emit saliva or spit from the mouth in small, scattered portions, as in rapid speaking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To speak so rapidly as to emit saliva; to utter words hastily and indistinctly, with a spluttering sound, as in rage.",
                  "examples": [
                    "They could neither of them speak their rage, and so fell a sputtering at one another, like two roasting apples."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To throw out anything, as little jets of steam, with a noise like that made by one sputtering.",
                  "examples": [
                    "Like the green wood [...] sputtering in the flame."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, intransitive) To cause surface atoms or electrons of a solid to be ejected by bombarding it with heavy atoms or ions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, transitive) To coat the surface of an object by sputtering.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}