{
  "word": "advocate",
  "etymologies": [
    {
      "description": [
        "From Middle English advocat, advoket, from Old French advocat, from Latin advocātus (past participle of advocāre (“to call for”)), a calque of Ancient Greek παράκλητος (paráklētos) (whence English paraclete). Doublet of advoke, avouch, and avow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "advocate (plural advocates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone whose job is to speak for someone's case in a court of law; a counsel. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anyone who argues the case of another; an intercessor. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who speaks in support of something, or someone. [from 18th c.]",
                  "examples": [
                    "He became a tireless advocate for the needs of adults with IMD throughout Britain and internationally."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who supports others to make their voices heard, or ideally for them to speak up for themselves.",
                  "examples": [
                    "Since she started working with her advocate, she has become much more confident."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "advocate (third-person singular simple present advocates, present participle advocating, simple past and past participle advocated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To plead in favour of; to defend by argument, before a tribunal or the public; to support, vindicate, or recommend publicly.",
                  "examples": [
                    "To advocate the cause of thy client."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To encourage support for something.",
                  "examples": [
                    "I like trees, but I do not advocate living in them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with for) To engage in advocacy.",
                  "examples": [
                    "We have been advocating for changes in immigration law."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, law) To appeal from an inferior court to the Court of Session.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, law, in higher courts) To call a case before itself for decision.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}