{
  "word": "chit",
  "etymologies": [
    {
      "description": [
        "From Middle English chitte (“a young animal, cub, whelp”), from Old English *ċytten, *ċietten, *ċitten, from Proto-West Germanic *kittīn, from Proto-Germanic *kittīną (“young animal, fawn, kid”).",
        "Cognate with Scots chit (“chit”), Low German kitte (“young animal”), German Kitz (“fawn, kid”). See also kid."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chit (plural chits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A child or babe; a young, small, or insignificant person or animal.",
                  "examples": [
                    "“These are returns,” I said, “quite fit",
                    "To me, who nursed you when a chit.",
                    "For shame, lay by this envious art;",
                    "Is this to act a sister's part?”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pert or sassy young person, especially a young woman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English *chit, *chitte, from Old English ċīþ (“germ, seed, sprout, shoot”), from Proto-Germanic *kīþą (“sprout”), from Proto-Indo-European *ĝī-, *ĝey- (“to divide, part, split open, sprout”).",
        "Cognate with Middle Dutch kiede (“sprout”), dialectal German Keid (“sprout”). Doublet of scion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chit (plural chits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The embryonic growing bud of a plant",
                  "examples": [
                    "Synonyms: shoot, sprout, seedling",
                    "the chits of Indian corn or of potatoes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An excrescence on the body, as a wart or a pimple.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chit (third-person singular simple present chits, present participle chitting, simple past and past participle chitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Britain, dialect) To sprout; to shoot, as a seed or plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain, dialect) To damage the outer layers of a seed such as Lupinus or Sophora to assist germination.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain, dialect) To initiate sprouting of tubers, such as potatoes, by placing them in special environment, before planting into the soil.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From chitty, from Hindi चिट्ठी (ciṭṭhī, “letter, note, written message”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chit (plural chits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US and Britain dated) A small sheet or scrap of paper with a hand-written note as a reminder or personal message.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A voucher or token coin used in payrolls under the truck system.",
                  "examples": [
                    "Synonym: scrip"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pharmacology) A small sheet of paper on which is written a prescription to be filled; a scrip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gaming) A smaller cardboard counter generally used not to directly represent something but for another, more transient, purpose such as tracking or randomization.",
                  "examples": [
                    "1.4.3 Also on the board, but turned face down at the beginning of the game, are chits representing treasure sites and sounds and warnings of monsters that may arrive on the map. When characters end a turn in the hex, these chits are revealed. As characters move around the board, more and more of these chits will be revealed, letting the players know where monsters and treasures are to be found."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India, China) A signed voucher or memorandum of a small debt, as for food and drinks at a club.",
                  "examples": [
                    "He just longed to get away from here and try his luck somewhere else, but for the sake of his sister he hung on and on till he ran himself into debt over his ears—I can tell you. I, myself, could show a handful of his chits for meals and drinks in my drawer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A debt or favor owed in return for a prior loan or favor granted, especially a political favor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Perhaps from specialized technical use of Etymology 2, above, “a bud; an excressence” (Hunter 1882)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chit (plural chits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small tool used in cleaving laths. Compare: froe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Euphemistic variation of shit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chit (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, euphemistic) Shit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}