{
  "word": "protocol",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French protocolle, protocole (“document, record”), from Late Latin protocollum (“the first sheet of a volume (on which contents and errata were written)”), from Byzantine Greek πρωτόκολλον (prōtókollon, “first sheet glued onto a manuscript”), from πρῶτος (prôtos, “first”) + κόλλα (kólla, “glue”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "protocol (countable and uncountable, plural protocols)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly historical) The minutes, or official record, of a negotiation or transaction; especially a document drawn up officially which forms the legal basis for subsequent agreements based on it. [from 15th c.]",
                  "examples": [
                    "Another account says that, on the morning of the 31st of May, the king delivered to the prince-royal the crown, the sceptre, and the key of his treasure and gave him his blessing. The privy-counsillor Vockerodt drew up at his desire a protocol of the transaction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(international law, now rare) An official record of a diplomatic meeting or negotiation; later specifically, a draft document setting out agreements to be signed into force by a subsequent formal treaty. [from 17th c.]",
                  "examples": [
                    "The terms of this protocol formed the basis for the Treaty of London signed by the British, French and Russian governments on 6 July 1827."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(international law) An amendment to an official treaty. [from 19th c.]",
                  "examples": [
                    "The 1992 Protocol amended the definitions of other terms, including ‘ship’, ‘oil’ and ‘incident’: Art. 2."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The first leaf of a roll of papyrus, or the official mark typically found on such a page. [from 19th c.]",
                  "examples": [
                    "They marked the beginning of each scroll with their protocol, a practice that continued in the papyrus trade in the Byzantine Empire [...] into the Islamic period, when there were bilingual protocols in Greek and Arabic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The official formulas which appeared at the beginning or end of certain official documents such as charters, papal bulls etc. [from 19th c.]",
                  "examples": [
                    "The protocol of the bull contains elements that appear to be formulaic by the time of John XVIII 's pontificate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) The original notes of observations made during an experiment; also, the precise method for carrying out or reproducing a given experiment. [from 19th c.]",
                  "examples": [
                    "The following is an abstract of the protocol of the experiment: Tumour extract.—A measured 16 c.c. of minced Rous Sarcoma tissue was ground with sand and extracted with 400 c.c. of 0.8-per-cent. saline."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The official rules and guidelines for heads of state and other dignitaries, governing accepted behaviour in relations with other diplomatic representatives or over affairs of state. [from 19th c.]",
                  "examples": [
                    "Even the Queen (for whom the curtsey is a more standard address) was recently treated to an enthusiastic Obama embrace. Her Majesty, who is not normally known for partaking in such public displays of affection, seemed unperturbed by Michelle Obama's disregard for royal protocol."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) An accepted code of conduct; acceptable behaviour in a given situation or group. [from 20th c.]",
                  "examples": [
                    "For those uncertain in the protocol of handshaking a formula for the perfect handshake has been devised by scientists at the University of Manchester."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A set of formal rules describing how to transmit or exchange data, especially across a network. [from 20th c.]",
                  "examples": [
                    "An exception is Jabber, which is designed based on an open protocol called the extensible messaging and presence protocol (XMPP)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The set of instructions allowing a licensed medical professional to start, modify, or stop a medical or patient care order. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "protocol (third-person singular simple present protocols, present participle protocoling or protocolling, simple past and past participle protocoled or protocolled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To make a protocol of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To make or write protocols, or first drafts; to issue protocols.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}