{
  "word": "strap",
  "etymologies": [
    {
      "description": [
        "From a variant of earlier strope (“loop on a harness”), from Middle English strope, stropp, from Late Old English strop, stropp (“a band, thong, strap; oar-thong”) and Old French estrope (“strap, loop on a harness”), both from Latin stroppus, struppus (“strap”), from Ancient Greek στρόφος (stróphos, “rope”), from στρέφω (stréphō, “to twist”), ultimately from Proto-Indo-European *strebʰ- (compare Proto-Germanic *struppōną (“to twist, writhe”)). Cognate with Scots strap, strop (“strap, band, thong”), Dutch strop (“noose, strop, loop”), Low German Strop (“strap”), German Struppe, Strüppe, Strippe (“string, cord”), Danish strop (“strap”), Swedish stropp (“strap, loop”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "strap (countable and uncountable, plural straps)",
          "definitionGroups": [
            {
              "group": "A long, narrow, pliable strip of leather, cloth, or the like.",
              "entries": [
                {
                  "meaning": "A strap worn on the shoulder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strip of thick leather used in flogging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something made of such a strip, or of a part of one, or a combination of two or more for a particular use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of leather, or strip of wood covered with a suitable material, used to hone the sharpened edge of a razor; a strop.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A narrow strip of anything, as of iron or brass.",
              "entries": [
                {
                  "meaning": "(carpentry, machinery) A band, plate, or loop of metal for clasping and holding timbers or parts of a machine.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) A piece of rope or metal passing around a block and used for fastening it to anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The flat part of the corolla in ligulate florets, as those of the white circle in the daisy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The leaf, exclusive of its sheath, in some grasses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A gun, normally a personal firearm such as a pistol or machine pistol.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable, archaic) Credit offered to a customer, especially for alcoholic drink.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) Synonym of strapline",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, professional wrestling, with \"the\") A championship belt, or by extension, the title.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) An investment strategy involving simultaneous trade with one put and two call options on the same security at the same strike price, similar to but more bullish than a straddle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "strap (third-person singular simple present straps, present participle strapping, simple past and past participle strapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To beat or chastise with a strap; to whip, to lash.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fasten or bind with a strap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sharpen by rubbing on a strap; to strop.",
                  "examples": [
                    "to strap a razor"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}