{
  "word": "meander",
  "etymologies": [
    {
      "description": [
        "From Latin Maeander, from Ancient Greek Μαίανδρος (Maíandros) – a river in Asia Minor (present day Turkey) known for its winding course (modern Turkish Menderes)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "meander (plural meanders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often plural) One of the turns of a winding, crooked, or involved course.",
                  "examples": [
                    "the meanders of an old river, or of the veins and arteries in the body"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) One of a series of regular sinuous curves, bends, loops, turns, or windings in the channel of a river, stream, or other watercourse",
                  "examples": [
                    "See, how the streams advancing to the main, / Through crooked channels draw their crystal train! / While lingering thus they in meanders glide, / They scatter verdant life on either side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tortuous or winding journey.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Perplexity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of Greek key, a decorative border; fretwork.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A self-avoiding closed curve which intersects a line a number of times.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(possibly obsolete) A path on which the directions, distances, and elevations are noted, as a part of a land survey.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "meander (third-person singular simple present meanders, present participle meandering, simple past and past participle meandered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To wind or turn in a course or passage; to be intricate.",
                  "examples": [
                    "The stream meandered through the valley."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wind, turn, or twist; to make flexuous.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}