{
  "word": "acephalous",
  "etymologies": [
    {
      "description": [
        "From French acéphale, from Ancient Greek ἀκέφαλος (aképhalos, “headless”), from ἀ- (a-, “not”) + κεφαλή (kephalḗ, “head”). Synchronically, a- +‎ -cephalous."
      ],
      "adjectives": [
        {
          "description": "acephalous (comparative more acephalous, superlative most acephalous)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having no head.",
                  "examples": [
                    "Synonyms: acephalic, headless"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, applied to bivalve mollusks) Without a distinct head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Having the style spring from the base, instead of from the apex, as is the case in certain ovaries",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(social sciences, political science, sociology) A system of society without centralised state authority, where power is welded amongst groups of community entities e.g. clans. Without a leader or chief.",
                  "examples": [
                    "Synonyms: acephalic, leaderless",
                    "an acephalous society / community"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(prosody) Deficient in the beginning, as a line of poetry that is missing its expected opening syllable.",
                  "examples": [
                    "Synonym: acephalic"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a manuscript) Lacking the first portion of the text.",
                  "examples": [
                    "Synonym: acephalic",
                    "Coordinate terms: acaudal, atelous"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Without a beginning.",
                  "examples": [
                    "Men wrote eloquently, because they wrote feelingly: they wrote idiomatically, because they wrote naturally, and without affectation: but if a false or acephalous structure of sentence,—if a barbarous idiom—or an exotic word happened to present itself, no writer of the 17th century seems to have had any such scrupulous sense of the dignity belonging to his own language, as should make it a duty to reject it, or worth his while to re-model a line."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}