{
  "word": "leprosy",
  "etymologies": [
    {
      "description": [
        "From Norman leprosie, from Middle French leprosie (“leprosy & similar skin diseases”), probably from leprous (“leprous”) + -ie (“-y”) but possibly from Medieval Latin leprōsia (leprōsus + -ia) although this only historically attested in reference to leprosariums, both from Late Latin leprōsus (“leprous”), from Latin lepra (“psoriasis & similar skin diseases”) + -ōsus (“-ose”), from Koine Greek λέπρα (lépra, “psoriasis & similar skin diseases”), from λεπρός (leprós, “scaly”), from either λεπίς (lepís, “scale”) or λέπος (lépos, “husk, scale”) + -ρος (-ros, “forming adjectives”).",
        "The shift of sense from psoriasis to Hansen's disease occurred in large part from the use of λέπρα (lépra) to translate Hebrew צרעת‎ (“tzaraath”) in the Septuagint and its subsequent use in the New Testament and Late Latin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leprosy (usually uncountable, plural leprosies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An infectious disease caused by the bacterium Mycobacterium leprae, gradually producing nerve damage and patches of skin necrosis and historically handled by permanently quarantining its sufferers.",
                  "examples": [
                    "Then is it surely a leprosy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, now usually proscribed) Similar contagious skin diseases causing light patches of scaly skin, particularly psoriasis, syphilis, vitiligo, scabies, and (biblical) the various diseases considered \"tzaraath\" in the Old Testament of the Bible.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Anything considered similarly permanent, harmful, and communicable, particularly when such a thing should be handled by avoidance or isolation of its victims.",
                  "examples": [
                    "Sin is a spiritual leprosy."
                  ]
                }
              ]
            },
            {
              "group": "(veterenary medicine) A contagious disease causing similar effects in animals, particularly",
              "entries": [
                {
                  "meaning": "Ellipsis of murine leprosy. and feline leprosy, diseases caused in rodents and cats by Mycobacterium lepraemurium.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Synonym of mange and glanders in horses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) Synonym of leprosarium: a place for the housing of lepers in isolation from the rest of society.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}