{
  "word": "ash",
  "etymologies": [
    {
      "description": [
        "From Middle English asshe, from Old English æsċe, from Proto-West Germanic *askā, from Proto-Germanic *askǭ (compare West Frisian jiske, Dutch as, Low German Asch, German Asche, Danish aske, Swedish aska, Norwegian aske), from Proto-Indo-European *h₂eHs-; see it for cognates.",
        "The rare plural axen is from Middle English axen, axnen, from Old English axan, asċan (“ashes”) (plural of Old English axe, æsċe (“ash”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ash (countable and uncountable, plural ashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The solid remains of a fire.",
                  "examples": [
                    "The audience was more captivated by the growing ash at the end of his cigarette than by his words.",
                    "Ash from a fireplace can restore minerals to your garden's soil.",
                    "Ashes from the fire floated over the street.",
                    "Ash from the fire floated over the street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) The nonaqueous remains of a material subjected to any complete oxidation process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fine particles from a volcano, volcanic ash.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) Human (or animal) remains after cremation.",
                  "examples": [
                    "The urn containing his ashes was eventually removed to a closet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, in the plural) Mortal remains in general.",
                  "examples": [
                    "Napoleon's ashes are not yet extinguished, and we're breathing in their sparks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) What remains after a catastrophe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gray colour, like that of ash.",
                  "examples": [
                    "ash:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ash (third-person singular simple present ashes, present participle ashing, simple past and past participle ashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) To reduce to a residue of ash. See ashing.",
                  "examples": [
                    "I dried the extracted leather very slowly on the steam bath  […]  until the substance was dry enough to ash.  […]  I think that the discrepancy in the percentages of \"total ash\" by method No. 2 and No. 6 is due to this excessive heat required to ash the leather  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hit the end off of a burning cigar or cigarette.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit the end off (a burning cigar or cigarette).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, mostly used in the passive) To cover newly-sown fields of crops with ashes.",
                  "examples": [
                    "Last spring, after I planted, I took what ashes I have saved during the last year, and put on my corn  […] . On harvesting I cut up the two rows which were not ashed (or twenty rods of them,) and set them apart from the others in stouts; and then I cut up two rows of the same length, on each side, which had been ashed,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English asshe, from Old English æsċ, from Proto-Germanic *askaz, *askiz (compare West Frisian esk, Dutch es, German Esche, Danish/Norwegian/Swedish ask), from Proto-Indo-European *Heh₃s- (compare Welsh onnen, Latin ornus (“wild mountain ash”), Lithuanian úosis, Russian я́сень (jásenʹ), Albanian ah (“beech”), Ancient Greek ὀξύα (oxúa, “beech”), Old Armenian հացի (hacʿi))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ash (countable and uncountable, plural ashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A shade tree of the genus Fraxinus.",
                  "examples": [
                    "Synonym: ash tree",
                    "The ash trees are dying off due to emerald ash borer.",
                    "The woods planted in ash will see a different mix of species."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The wood of this tree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The traditional name for the ae ligature (æ), as used in Old English.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}