{
  "word": "road",
  "etymologies": [
    {
      "description": [
        "From Middle English rode, rade (“ride, journey”), from Old English rād (“riding, hostile incursion”), from Proto-West Germanic *raidu, from Proto-Germanic *raidō (“a ride”), from Proto-Indo-European *reydʰ- (“to ride”). Doublet of raid, acquired from Scots, and West Frisian reed (paved trail/road, driveway).",
        "The current primary meaning of \"street, way for traveling\"  originated relatively late—Shakespeare seemed to expect his audiences to find it unfamiliar—and probably arose through reinterpetation of roadway \"a way for riding on\" as saying \"way\" twice, in other words as a tautological compound."
      ],
      "adjectives": [
        {
          "description": "road (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada, sports, chiefly attributive) At the venue of the opposing team or competitor; on the road.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "road (plural roads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A way used for travelling between places, originally one wide enough to allow foot passengers and horses to travel, now (US) usually one surfaced with asphalt or concrete and designed to accommodate many vehicles travelling in both directions. In the UK both senses are heard: a country road is the same as a country lane. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Roads in general as a means of travel, especially by motor vehicle.",
                  "examples": [
                    "We travelled to the seaside by road."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A physical way or route.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A path chosen, as in life or career. [from 17th c.]",
                  "examples": [
                    "the road to happiness; the road to success."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An underground tunnel in a mine. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, rail transport) A railway or (UK, rail transport) a single railway track. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of riding on horseback. [9th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A hostile ride against a particular area; a raid. [9th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, often in the plural) A partly sheltered area of water near a shore in which vessels may ride at anchor; a roadstead. [from 14th c.]",
                  "examples": [
                    "There delivering their fraught, they went to Scandaroone; rather to view what ships was in the Roade, than any thing else […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A journey, or stage of a journey.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}