{
  "word": "male",
  "etymologies": [
    {
      "description": [
        "From Middle English male, borrowed from Old French malle, masle (Modern French mâle), from Latin masculus (“masculine, a male”), diminutive of mās (“male, masculine”). Doublet of macho. Displaced native Old English wǣpned (“male”, literally “penised”), derived from the noun wǣpn (“weapon”), which had the secondary sense “penis.”"
      ],
      "adjectives": [
        {
          "description": "male (not generally comparable, comparative maler or more male, superlative malest or most male)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Belonging to the sex which typically produces sperm, or to the gender which is typically associated with it. [from 14th c.]",
                  "examples": [
                    "male writers",
                    "the leading male and female singers",
                    "a male bird feeding a seed to a female",
                    "in bee colonies, all drones are male",
                    "intersex male patients"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic of this sex/gender. (Compare masculine, manly.)",
                  "examples": [
                    "stereotypically male interests, an insect with typically male coloration"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Tending to lead to or regulate the development of sexual characteristics typical of this sex.",
                  "examples": [
                    "the male chromosome;   like testes, ovaries also produce testosterone and some other male hormones"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, less common than 'masculine') Masculine; of the masculine grammatical gender.",
                  "examples": [
                    "If you are describing a female noun, you must make the adjective feminine by adding an 'e'. If you describe a male noun, you add an 'er'. For neutral nouns you add an 'es'."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of bacteria) Having the F factor; able to impart DNA into another bacterium which does not have the F factor (a female).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Of instruments, tools, or connectors: designed to fit into or penetrate a female counterpart, as in a connector, pipe fitting or laboratory glassware. [from 16th c.]",
                  "examples": [
                    "Male adapter connects female pipe threads to polyethylene cold-water pipe; [...] female flare coupling connects male pipe threads to flared copper or plastic;"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "male (plural males)",
          "definitionGroups": [
            {
              "group": "One of the male (masculine) sex or gender.",
              "entries": [
                {
                  "meaning": "A human member of the masculine sex or gender.",
                  "examples": []
                },
                {
                  "meaning": "An animal of the sex that has testes.",
                  "examples": []
                },
                {
                  "meaning": "A plant of the masculine sex.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bacterium which has the F factor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male connector, pipe fitting, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}