{
  "word": "smarm",
  "etymologies": [
    {
      "description": [
        "The noun is attested since 1914, from the colloquial verb smalm, smarm (“to smear, bedaub (hair, with pomade)”), attested since 1847, of unknown origin, perhaps somehow suggestive of the action. Verbal meaning \"to smear with flattery\" is from 1902."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "smarm (countable and uncountable, plural smarms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Smarmy language or behavior.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fandom slang) A style of fan fiction in which characters are warm and caring toward each other but without sexual overtones.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "smarm (third-person singular simple present smarms, present participle smarming, simple past and past participle smarmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fawn, to be unctuous.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To address in a fawning and unctuous manner.",
                  "examples": [
                    "\"If you go to her and smarm her, it will be all right.\"",
                    "\"If I do what to her?\" asked Mervyn, wondering what the operation of smarming might be.",
                    "\"Of course you don't know,\" laughed Aggie; \"it is a school word. You explain what it means, Isabel.\"",
                    "\"To smarm,\" explained Isabel, \"signifies to say 'yes ma'am,' or 'yes marm,' to a governess when she is rating you. It is ah expressive word, isn't it? It means 'to conciliate by assent;' that is the best definition that I can give of it.\"",
                    "\"Excellent word,\" said Mervyn. \"Then. I am to smarm your mamma, am I, Aggie?[\"]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}