{
  "word": "demerit",
  "etymologies": [
    {
      "description": [
        "From Old French desmerite (modern French démérite)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "demerit (countable and uncountable, plural demerits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quality of being inadequate; a fault; a disadvantage",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mark given for bad conduct to a person attending an educational institution or serving in the army.",
                  "examples": [
                    "A few of you have followed in the path of the perfect West Point graduate, Robert E. Lee, who never received a single demerit in four years. Some of you followed in the path of the imperfect graduate, Ulysses S. Grant, who had his fair share of demerits, and said the happiest day of his life was \"the day I left West Point.\" (Laughter.)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which one merits or deserves, either of good or ill; desert.",
                  "examples": [
                    "Leave here thy body, death has her demerit"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "demerit (third-person singular simple present demerits, present participle demeriting, simple past and past participle demerited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To deserve.",
                  "examples": [
                    "You hold that every sin is an infinite evil, demeriting endless punishment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To depreciate or cry down.",
                  "examples": [
                    "Faith by her own dignity and worthiness doth not demerit justice and righteousness; but receiveth and embraceth the same offered unto us in the gospel  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}