{
  "word": "ramble",
  "etymologies": [
    {
      "description": [
        "An altered form (with dissimilation of mm to mb) of dialectal rammle, from Middle English *ramlen, *ramelen, frequentative of Middle English ramen (“to roam, ramble”); compare Swedish ramla (“to stumble; fall; make a noise; rumble”), Danish ramle (“to stumble; collapse; thunder; boom”); equivalent to roam +‎ -le.",
        "\"mid-15 c., perhaps frequentative of 'romen' 'to walk, go' perhaps via 'romblen' (late 14 c.) 'to ramble.' The vowel change perhaps by influence of Middle Dutch 'rammelen,' a derivative of 'rammen' 'copulate,' 'used of the night wanderings of the amorous cat.' Meaning 'to talk or write incoherently' is from 1630s\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ramble (plural rambles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A leisurely stroll; a recreational walk in the countryside.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rambling; an instance of someone talking at length without direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A bed of shale over the seam of coal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A section of woodland suitable for leisurely walking.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ramble (third-person singular simple present rambles, present participle rambling, simple past and past participle rambled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move about aimlessly, or on a winding course",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To walk for pleasure; to amble or saunter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lead the life of a vagabond or itinerant; to move about with no fixed place of address.",
                  "examples": [
                    "We was drinking more in those days and tempers reached a pitch",
                    "And like a fool I let her run with the rambling itch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To talk or write incessantly, unclearly, or incoherently, with many digressions.",
                  "examples": [
                    "Francine has a tendency to ramble when it gets to be late in the evening."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To follow a winding path or course.",
                  "examples": [
                    "The river rambled through the mountains."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}