{
  "word": "cottage",
  "etymologies": [
    {
      "description": [
        "Late Middle English, from Anglo-Norman cotage and Medieval Latin cotagium, from Old Northern French cot, cote (“hut, cottage”) + -age (“surrounding property”), from Proto-Germanic *kutan, *kuta- (“shed”), probably of non-Indo-European origin, possibly borrowed from Uralic; compare Finnish kota (“hut, house”) and Hungarian ház (“house”), both from Proto-Finno-Ugric/Proto-Uralic *kota.  However, also compare Dutch and English hut.",
        "Old Northern French cote is probably from Old Norse kot (“hut”), cognate of Old English cot of same Proto-Germanic origin.",
        "Slang sense “public toilet” from 19th century, due to resemblance."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cottage (plural cottages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small house.",
                  "examples": [
                    "Synonyms: cot, hut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A seasonal home of any size or stature, a recreational home or a home in a remote location.",
                  "examples": [
                    "Most cottages in the area were larger and more elaborate than my home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, archaic) A public lavatory.",
                  "examples": [
                    "Synonyms: see Thesaurus:bathroom"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Polari) A meeting place for homosexual men.",
                  "examples": [
                    "Synonyms: gingerbread office, tea room, tearoom, teahouse, (US) tea house"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cottage (third-person singular simple present cottages, present participle cottaging, simple past and past participle cottaged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To stay at a seasonal home, to go cottaging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Polari, of men) To have homosexual sex in a public lavatory; to practice cottaging.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}