{
  "word": "peevish",
  "etymologies": [
    {
      "description": [
        "From Middle English pevische, pevisse, pevysse, peivesshe, also peyuesshe, peeuish, of obscure origin. Perhaps from Middle English pew, pue (“a plaintive cry, the cry of a bird”), equivalent to pue +‎ -ish. Cognate with Scots pevis, pevess, pevych, pevach (“peevish”), Scots pew, peu (“to cry in a plaintive manner”). See pue.",
        "An alternative etymology derives Middle English peyvesshe (“capricious, silly”), as a possible corruption of Latin perversus (“perverted”). The meaning “fretful” develops in the 16th century.",
        "A third suggestion links the word to classical Latin expavidus (“startled, shy”) (< ex- + pavidus) via an unrecorded variant with -ai- of Middle French espave (“stray [of animals]; foreign [of persons]; lost property, flotsam”) (first attested 1283 in Old French; Modern French épave). The semantic connection is thought to be the behaviour of stray animals. Compare -ish suffix."
      ],
      "adjectives": [
        {
          "description": "peevish (comparative more peevish, superlative most peevish)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characterized by or exhibiting petty bad temper, bad-tempered, moody, cross. [from 1520]",
                  "examples": [
                    "I would rather figure things out on my own than ask that peevish librarian for help."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Constantly complaining, whining; childishly fretful.",
                  "examples": [
                    "There were several peevish patients in the doctor's waiting room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Easily annoyed, especially by things that are not important; irritable, querulous.",
                  "examples": [
                    "At first he was quite peevish. “What's the idea,” he said, “coming and spoiling a man's beauty-sleep? Get out.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Northern England) Clever, expert. [18th c.]",
                  "examples": [
                    "The word peevish among the vulgar of Scotland is used for niggardly, covetous; in the North of England, for witty, subtile."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Canada, Northern England) Sharp, piercing, bitter (of the wind); windy, blustery (of the weather).",
                  "examples": [
                    "[…]  the ridge  […]  /  […]  defends you from the blust'ring north, / And bleak affliction of the peevish east."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly obsolete) Perverse, refractory; headstrong, obstinate; capricious, skittish; (also) coy. [from c. 1400]",
                  "examples": [
                    "Not onely foolyshe frowarde and obstinate but also peuysshe, peruerse and indurate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Silly, senseless, foolish. [16th–17th c.]",
                  "examples": [
                    "This is your peeuish chattering weake old man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Beside oneself; out of one's senses; mad. [16th c.]",
                  "examples": [
                    "Some tremblid, some girnid, some gaspid, some gasid, As people halfe peuysshe, or men that were masyd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Spiteful, malignant, mischievous, harmful. [16th c.]",
                  "examples": [
                    "In derision of the king, they made certaine peeuishe and mocking rymes which I passe ouer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Hateful, distasteful, horrid. [16th c.]",
                  "examples": [
                    "The Lords Supper and your peevish, popish private masse doe agree together..as the common proverbe is, like harpe and harrow, or like the hare and the hound."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "peevish (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Peevishly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}