{
  "word": "transgender",
  "etymologies": [
    {
      "description": [
        "From trans- +‎ gender. First used in English by John Oliven in 1965, the term had acquired its current senses by the 1990s (by which time it had also largely displaced the earlier term transsexual; see usage notes)."
      ],
      "adjectives": [
        {
          "description": "transgender (not comparable)",
          "definitionGroups": [
            {
              "group": "Having a gender (identity) which is different from the sex one was assigned at birth, or pertaining to a person who does.",
              "entries": [
                {
                  "meaning": "(strictly, sometimes offensive or proscribed) Having a gender (identity) which is opposite from the sex one was assigned at birth: being assigned male at birth but having a female gender, or vice versa.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(loosely, inexact) Transgressing or not identifying with culturally conventional gender roles and categories of male or female.",
                  "examples": [
                    "Coordinate terms: gender-nonconforming, genderplay, genderfuck"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a space) Intended primarily for transgender people.",
                  "examples": [
                    "In Boston, no AIDS prevention messages are posted at the primary drag queen and transgender bar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a space) Available for use by transgender people, rather than only non-transgender people.",
                  "examples": [
                    "Why the sudden outcry for transgender bathrooms?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Crossgender.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "transgender (usually uncountable, plural transgenders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, now often offensive) A transgender person.",
                  "examples": [
                    "In a patriarchal society in which machismo rules, MTF transgenders represent a challenge to traditional masculinity due to their renouncing of the male position of social power."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, rare) Transgenderism; the state of being transgender. (Compare transsex.)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "transgender (third-person singular simple present transgenders, present participle transgendering, simple past and past participle transgendered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) To change the gender of; (used loosely) to change the sex of. (Compare transsex.)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}