{
  "word": "pleasure",
  "etymologies": [
    {
      "description": [
        "From Early Modern English pleasur, plesur, alteration (with ending accommodated to -ure) of Middle English plaisir (“pleasure”), from Old French plesir, plaisir (“to please”), infinitive used as a noun, conjugated form of plaisir or plaire, from Latin placeō (“to please, to seem good”), from the Proto-Indo-European *pleh₂-k- (“wide and flat”). Related to Dutch plezier (“pleasure, fun”). More at please."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pleasure (countable and uncountable, plural pleasures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A state of being pleased or contented; gratification.",
                  "examples": [
                    "Synonyms: delight, gladness, gratification, happiness, indulgence, satisfaction",
                    "Antonyms: displeasure, pain",
                    "He remembered with pleasure his home and family.",
                    "I get a lot of pleasure from watching others work hard while I relax."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A person, thing or action that causes enjoyment.",
                  "examples": [
                    "Synonyms: delight, joy",
                    "It was a pleasure to meet you.",
                    "Having a good night's sleep is one of life's little pleasures."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) One's preference.",
                  "examples": [
                    "Synonyms: desire, fancy, want, will, wish",
                    "What is your pleasure: coffee or tea?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(formal, uncountable) The will or desire of someone or some agency in power.",
                  "examples": [
                    "Synonym: discretion",
                    "to hold an office at pleasure: to hold it indefinitely until it is revoked",
                    "to be imprisoned at Her Majesty's pleasure: to be imprisoned indefinitely",
                    "at Congress's pleasure: whenever or as long as Congress desires"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pleasure (third-person singular simple present pleasures, present participle pleasuring, simple past and past participle pleasured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give or afford pleasure to.",
                  "examples": [
                    "Synonyms: please, gratify"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give sexual pleasure to.",
                  "examples": [
                    "Johnny pleasured Jackie with his mouth last night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To take pleasure; to seek or pursue pleasure.",
                  "examples": [
                    "to go pleasuring"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}