{
  "word": "pipe",
  "etymologies": [
    {
      "description": [
        "From Middle English pīpe, pype (“hollow cylinder or tube used as a conduit or container; duct or vessel of the body; musical instrument; financial records maintained by the English Exchequer, pipe roll”), from Old English pīpe (“pipe (musical instrument); the channel of a small stream”), from Proto-West Germanic *pīpā. Reinforced by Vulgar Latin *pīpa, from Latin pipire, pipiare, pipare, from pīpiō (“to chirp, peep”), of imitative origin. Doublet of fife.",
        "The “storage container” and “liquid measure” senses are derived from Middle English pīpe (“large storage receptacle, particularly for wine; cask, vat; measure of volume”), from pīpe (above) and Old French pipe (“liquid measure”). In specific contexts, calques similar units of measure such as Portuguese pipa.",
        "The verb is from Middle English pīpen, pypyn (“to play a pipe; to make a shrill sound; to speak with a high-pitched tone”), from Old English pīpian (“to pipe”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pipe (plural pipes)",
          "definitionGroups": [
            {
              "group": "Meanings relating to a wind instrument.",
              "entries": [
                {
                  "meaning": "(music) A wind instrument consisting of a tube, often lined with holes to allow for adjustment in pitch, sounded by blowing into the tube. [from 10th c.]",
                  "examples": []
                },
                {
                  "meaning": "(music) A tube used to produce sound in an organ; an organ pipe. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "The key or sound of the voice. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "A high-pitched sound, especially of a bird. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "Meanings relating to a hollow conduit.",
              "entries": [
                {
                  "meaning": "A rigid tube that transports water, steam, or other fluid, as used in plumbing and numerous other applications. [from 10th c.]",
                  "examples": [
                    "A burst pipe flooded my bathroom."
                  ]
                },
                {
                  "meaning": "(especially in informal contexts) A water pipe.",
                  "examples": [
                    "A burst pipe flooded my bathroom."
                  ]
                },
                {
                  "meaning": "A tubular passageway in the human body such as a blood vessel or the windpipe. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(slang) A man's penis.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Meanings relating to a container.",
              "entries": [
                {
                  "meaning": "A large container for storing liquids or foodstuffs; now especially a vat or cask of cider or wine. (See a diagram comparing cask sizes.) [from 14th c.]",
                  "examples": [
                    "Meronym: pipestave"
                  ]
                },
                {
                  "meaning": "The contents of such a vessel, as a liquid measure, sometimes set at 126 wine gallons; half a tun. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "Meanings relating to something resembling a tube.",
              "entries": [
                {
                  "meaning": "Decorative edging stitched to the hems or seams of an object made of fabric (clothing, hats, curtains, pillows, etc.), often in a contrasting color; piping. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "A type of pasta similar to macaroni.",
                  "examples": []
                },
                {
                  "meaning": "(geology) A vertical conduit through the Earth's crust below a volcano through which magma has passed, often filled with volcanic breccia. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(lacrosse) One of the goalposts of the goal.",
                  "examples": []
                },
                {
                  "meaning": "(mining) An elongated or irregular body or vein of ore. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Australia, colloquial, historical) An anonymous satire or essay, insulting and frequently libellous, written on a piece of paper which was rolled up and left somewhere public where it could be found and thus spread, to embarrass the author's enemies. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "Meanings relating to computing.",
              "entries": [
                {
                  "meaning": "(computing) A mechanism that enables one program to communicate with another by sending its output to the other as input. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "(computing, slang) A data backbone, or broadband Internet access. [from 20th c.]",
                  "examples": [
                    "A fat pipe is a high-bandwidth connection."
                  ]
                },
                {
                  "meaning": "(computing, typography) The character |. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "Meanings relating to a smoking implement.",
              "entries": [
                {
                  "meaning": "(smoking) A hollow stem with a bowl at one end used for smoking, especially a tobacco pipe but also including various other forms such as a water pipe. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Canada, US, colloquial, historical) The distance travelled between two rest periods during which one could smoke a pipe. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A telephone.",
                  "examples": [
                    "Synonym: blower"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pipe (third-person singular simple present pipes, present participle piping, simple past and past participle piped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To play (music) on a pipe instrument, such as a bagpipe or a flute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To shout loudly and at high pitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To emit or have a shrill sound like that of a pipe; to whistle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a queen bee: to make a high-pitched sound during certain stages of development.",
                  "examples": [
                    "Coordinate terms: quack, toot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, metallurgy) Of a metal ingot: to become hollow in the process of solidifying.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey or transport (something) by means of pipes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To install or configure with pipes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dab moisture away from.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To lead or conduct as if by pipes, especially by wired transmission.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing, chiefly Unix) To directly feed (the output of one program) as input to another program, indicated by the pipe character (|) at the command line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cooking) To create or decorate with piping (icing).",
                  "examples": [
                    "to pipe flowers on to a cupcake"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To order or signal by a note pattern on a boatswain's pipe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, of a male) To have sexual intercourse with a female.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, dated) To see.",
                  "examples": [
                    "Synonyms: see Thesaurus:see"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, journalism, slang) To invent or embellish (a story).",
                  "examples": [
                    "[…]  who ostensibly was handed an all-day sucker by a warm-hearted bandit in the act of robbing a candy store of $40, there was no moral outcry. \"Find the girl,\" was the immediate response of competing editors to their reporters at police headquarters. The men of the press, who knew a piped story when they saw one, quickly found another little girl, presented her with a lollipop, and photographed her skipping rope in front of the candy store."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}