{
  "word": "milk",
  "etymologies": [
    {
      "description": [
        "From Middle English milk, mylk, melk, mulc, from Old English meolc, meoluc (“milk”), from Proto-West Germanic *meluk, from Proto-Germanic *meluks, from Proto-Indo-European *h₂melǵ-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "milk (countable and uncountable, plural milks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A white liquid produced by the mammary glands of female mammals to nourish their young. From certain animals, especially cows, it is also called dairy milk and is a common food for humans as a beverage or used to produce various dairy products such as butter, cheese, and yogurt.",
                  "examples": [
                    "Skyr is a product made of curdled milk.",
                    "Synonyms: dairy milk, (often implied) cowmilk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, by extension) A white (or whitish) liquid obtained from a vegetable source such as almonds, coconuts, oats, rice, and/or soy beans.",
                  "examples": [
                    "Synonyms: m*lk, mylk, non-dairy milk, plant milk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) An individual serving of milk.",
                  "examples": [
                    "Table three ordered three milks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable or invariant) An individual portion of milk, such as found in a creamer, for tea and coffee.",
                  "examples": [
                    "I take my tea with two milks and two sugars.",
                    "I take my tea with two milk and two sugar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ripe, undischarged spat of an oyster.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Semen.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English milken, from Old English melcan, from Proto-Germanic *melkaną, ultimately from Proto-Indo-European *h₂melǵ-, the same root as the noun. Compare Dutch and German melken, Danish malke, Norwegian mjølke, also Latin mulgeō (“I milk”), Ancient Greek ἀμέλγω (amélgō, “I milk”), Albanian mjel (“to milk”), Russian молоко́ (molokó), Lithuanian mélžti, Tocharian A mālk-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "milk (third-person singular simple present milks, present participle milking, simple past and past participle milked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To express milk from (a mammal, especially a cow).",
                  "examples": [
                    "The farmer milked his cows."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To draw (milk) from the breasts or udder.",
                  "examples": [
                    "to milk wholesome milk from healthy cows"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive, rare) To secrete (milk) from the breasts or udder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To express a liquid from a creature.",
                  "examples": [
                    "The Australian government has a team that regularly milks various snakes for venom to use creating serums and antivenoms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To make excessive use of (a particular point in speech or writing, a source of funds, etc.); to exploit; to take advantage of (something).",
                  "examples": [
                    "When the audience began laughing, the comedian milked the joke for more laughs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of an electrical storage battery) To give off small gas bubbles during the final part of the charging operation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, sex slang) To single-mindedly masturbate a male to ejaculation, especially for the amusement or satisfaction of the masturbator rather than the person masturbated.",
                  "examples": [
                    "Controlled milking can actually establish and consolidate a mistress’s dominance over her sub rather than diminish it.",
                    "Synonym: masturbate"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}