{
  "word": "left",
  "etymologies": [
    {
      "description": [
        "From Middle English left, luft, leoft, lift, lyft, from Old English left, lyft (“weak, clumsy, foolish”), attested in Old English lyftādl (“palsy, paralysis”), from Proto-Germanic *luft-, from *lubjaną (“to castrate, lop off”) (compare dialectal English lib, West Frisian lobje, Dutch lubben), from Proto-Indo-European *(s)lewp-, *(s)lup- (“hanging limply”). Compare Scots left (“left”), North Frisian lefts, leeft, leefts (“left”), West Frisian lofts (“left”), dialectal Dutch loof (“weak, worthless”), Low German lucht (“left”)."
      ],
      "adjectives": [
        {
          "description": "left (comparative more left or lefter, superlative most left or leftmost)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Designating the side of the body toward the west when one is facing north; the side of the body on which the heart is located in most humans; the opposite of right. This arrow points to the reader's left: ←",
                  "examples": [
                    "Synonyms: sinister, sinistral",
                    "Antonyms: right, dexter, dextral",
                    "The left side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) Designating the bank of a river (etc.) on one's left when facing downstream (i.e. facing forward while floating with the current); that is, the north bank of a river that flows eastward. If this arrow: ⥲ shows the direction of the current, the tilde is on the left side of the river.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Left-wing; pertaining to the political left.",
                  "examples": [
                    "It should be noted that there is now no intelligentsia that is not in some sense \"Left\". Perhaps the last right-wing intellectual was T. E. Lawrence. Since about 1930 everyone describable as an “intellectual” has lived in a state of chronic discontent with the existing order."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "left (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "On the left side.",
                  "examples": [
                    "Antonym: right"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Towards the left side.",
                  "examples": [
                    "Antonym: right",
                    "Turn left at the corner. NO! Your other left."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Towards the political left.",
                  "examples": [
                    "Antonym: right",
                    "The East Coast of the US leans left in elections."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "left (plural lefts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The left side or direction.",
                  "examples": [
                    "Synonyms: 9 o'clock, port"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) The left-wing political parties as a group; citizens holding left-wing views as a group.",
                  "examples": [
                    "The Left left workers behind, thinking they had a winning demographic coalition. It hasn't really worked out for them yet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The left hand or fist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing) A punch delivered with the left fist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) A wave breaking from left to right (viewed from the shore).",
                  "examples": [
                    "Antonym: right"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English left, variant of laft (“remaining, left”), from Old English lǣfd, ġelǣfd, past participle of lǣfan (“to leave”). More at leave."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "left",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense and past participle of leave (“depart, separate from; (cause or allow to) remain”).",
                  "examples": [
                    "There's not much food left."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English levit, ilevet, y-levyd, from Old English ġelȳfd, ġelȳfed, past participle of Old English ġelȳfan, lȳfan (“to allow, permit”), equivalent to leave (“to give leave to, allow, grant, permit”) +‎ -ed."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "left",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense and past participle of leave (“permit”).",
                  "examples": [
                    "We were not left go to the beach after school except on a weekend."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}