{
  "word": "system",
  "etymologies": [
    {
      "description": [
        "Partly borrowed from Middle French sisteme, systeme, partly directly from its etymon Late Latin systēma (“harmony; musical scale; set of celestial objects; set of troops; system”), from Ancient Greek σύστημα (sústēma, “musical scale; organized body; whole made of several parts or members”), from σῠνίστημῐ (sunístēmi, “to combine, organize”) + -μᾰ (-ma, resultative suffix). σῠνίστημῐ is from σῠν- (sun-, “with, together”) + ἵστημι (hístēmi, “to stand”), from Proto-Indo-European *steh₂- (“to stand (up)”).",
        "Cognate with Dutch systeem, modern French système, German System, Italian sistema, Portuguese sistema, Spanish sistema."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "system (plural systems)",
          "definitionGroups": [
            {
              "group": "A collection of organized things; a whole composed of relationships among its members. [from early 17th c.]",
              "entries": [
                {
                  "meaning": "(derogatory) Preceded by the word the: the mainstream culture, controlled by the elites or government of a state, or a combination of them, seen as oppressive to the individual.",
                  "examples": []
                },
                {
                  "meaning": "(computing) A set of hardware and software operating in a computer.",
                  "examples": []
                },
                {
                  "meaning": "(mathematics) A set of equations involving the same variables, which are to be solved simultaneously.",
                  "examples": []
                },
                {
                  "meaning": "(music) A set of staves linked by a brace that indicate instruments or sounds that are to be played simultaneously.",
                  "examples": []
                },
                {
                  "meaning": "(physiology) A set of body organs having a particular function.",
                  "examples": [
                    "the digestive system  the nervous system"
                  ]
                },
                {
                  "meaning": "(psychiatry) A set of alters, or the multiple (“the individual with multiple personalities due to, for example, a dissociative personality disorder”) who contains them.",
                  "examples": []
                },
                {
                  "meaning": "(astronomy) A planetary system; a set of planets orbiting a star or star system",
                  "examples": []
                },
                {
                  "meaning": "(philosophy) A comprehensive and logically organized set of propositions or philosophical beliefs.",
                  "examples": []
                },
                {
                  "meaning": "(role-playing games) A set of rules for a tabletop roleplaying game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A method or way of organizing or planning.",
                  "examples": [
                    "Followers should have a system to follow that works in their interests, not against them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}