{
  "word": "cadre",
  "etymologies": [
    {
      "description": [
        "Borrowed from French cadre, from Italian quadro (“framed painting, square”), from Latin quadrum, from quattuor (“four”). The American pronunciations in /eɪ/ may be due to a mistaken assumption that this word comes from Spanish or Italian, when in fact it is strictly French (the Spanish and Italian equivalents are respectively cuadro and quadro)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cadre (plural cadres)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A frame or framework.",
                  "examples": [
                    "[…]  He took away the frame itself, as well as the notice.Mr. MacCulloch. I recollect Mr. Dobrée stating that his reason for taking the cadre was, that the notice was pasted, and that he could not unpaste it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The framework or skeleton upon which a new regiment is to be formed; the officers of a regiment forming the staff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in communism) The core of a managing group, or a member of such a group.",
                  "examples": [
                    "Finally, the exchange, circulation and education of local cadres constitute another key strategy implemented by the provincial leadership in its efforts to diffuse economic development into the backward inland region."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small group of people specially trained for a particular purpose or profession.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}