{
  "word": "waiver",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman weyver, from waiver. Date: 1628."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waiver (plural waivers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of waiving, or not insisting on, some right, claim, or privilege.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A legal document removing some requirement, such as waiving a right (giving it up) or a waiver of liability (agreeing to hold someone blameless).",
                  "examples": [
                    "I had to sign a waiver when I went skydiving, agreeing not to sue even if something went wrong."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that releases a person from a requirement.",
                  "examples": [
                    "I needed a waiver from the department head to take the course because I didn't technically have the prerequisite courses.",
                    "I needed a waiver from the zoning board for the house because the lot was so small, but they let me build because it was next to the park."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The process of waiving or outlawing a person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "waiver (third-person singular simple present waivers, present participle waivering, simple past and past participle waivered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To waive (to relinquish, to forego).",
                  "examples": [
                    "The USACIDC Accreditation Division will conduct an annual reconciliation of the individual's academic achievement, through his or her unit commander, until he or she meets the waivered civilian education requirement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of waver.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}