{
  "word": "wedge",
  "etymologies": [
    {
      "description": [
        "Middle English wegge (“wedge”), from Old English weċġ (“wedge”), from Proto-Germanic *wagjaz."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wedge (countable and uncountable, plural wedges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the simple machines; a piece of material, such as metal or wood, thick at one edge and tapered to a thin edge at the other for insertion in a narrow crevice, used for splitting, tightening, securing, or levering.",
                  "examples": [
                    "Stick a wedge under the door, will you? It keeps blowing shut."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece (of food, metal, wood etc.) having this shape.",
                  "examples": [
                    "Can you cut me a wedge of cheese?",
                    "We ordered a box of baked potato wedges with our pizza."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Something that creates a division, gap or distance between things.",
                  "examples": [
                    "It is one of the ironies of capital cities that each acts as a symbol of its nation, and yet few are even remotely representative of it. London has always set itself apart from the rest of Britain — but political, economic and social trends are conspiring to drive that wedge deeper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A five-sided polyhedron with a rectangular base, two rectangular or trapezoidal sides meeting in an edge, and two triangular ends.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A voussoir, one of the wedge-shaped blocks forming an arch or vault.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A flank of cavalry acting to split some portion of an opposing army, charging in an inverted V formation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of geese, swans, or other birds when they are in flight in a V formation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A type of iron club used for short, high trajectories.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of a pair of wedge-heeled shoes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An ingot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang, uncountable) Silver or items made of silver collectively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, Britain, countable, uncountable) A quantity of money.",
                  "examples": [
                    "I made a big fat wedge from that job."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, regional) A sandwich made on a long, cylindrical roll.",
                  "examples": [
                    "I ordered a chicken parm wedge from the deli."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the basic elements that make up cuneiform writing, a single triangular impression made with the corner of a reed stylus.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Any symbol shaped like a V in some given orientation.",
              "entries": [
                {
                  "meaning": "(typography, US) A háček.",
                  "examples": [
                    "The wedge is used in Czech and is illustrated by the Czech name for the diacritic, haček."
                  ]
                },
                {
                  "meaning": "(phonetics) The IPA character ʌ, which denotes an open-mid back unrounded vowel.",
                  "examples": [
                    "Turned V is referred to as “Wedge” by some phoneticians, but this seems inadvisable to us, because the haček accent (ˇ) is also called that in names like Wedge C for (č)."
                  ]
                },
                {
                  "meaning": "(mathematics) The symbol ∧, denoting a meet (infimum) operation or logical conjunction.",
                  "examples": []
                },
                {
                  "meaning": "(music) A hairpin, an elongated horizontal V-shaped sign indicating a crescendo or decrescendo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) A barometric ridge; an elongated region of high atmospheric pressure between two low-pressure areas.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) A wedge tornado.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A market trend characterized by a contracting range in prices coupled with an upward trend in prices (a rising wedge) or a downward trend in prices (a falling wedge).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wedge (third-person singular simple present wedges, present participle wedging, simple past and past participle wedged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To support or secure using a wedge.",
                  "examples": [
                    "I wedged open the window with a screwdriver."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To force into a narrow gap.",
                  "examples": [
                    "He had wedged the package between the wall and the back of the sofa.",
                    "I wedged into the alcove and listened carefully."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pack (people or animals) together tightly into a mass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work wet clay by cutting or kneading for the purpose of homogenizing the mass and expelling air bubbles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, informal, intransitive) Of a computer program or system: to get stuck in an unresponsive state.",
                  "examples": [
                    "My Linux kernel wedged after I installed the latest update."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cleave with a wedge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To force or drive with a wedge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shape into a wedge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Wedgewood, surname of the person who occupied this position on the first list of 1828."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wedge (plural wedges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Cambridge University slang) The person whose name stands lowest on the list of the classical tripos.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}