{
  "word": "pizza",
  "etymologies": [
    {
      "description": [
        "1931, borrowed from Neapolitan pizza (1590), the Neapolitan dialectal form of  Byzantine Greek πίτα (píta, “cake, pie”).\nThe Greek word is first attested in 1107 and is itself of uncertain origin.\nThe northern Italian dialectal form was pinza, the southern (Apulian and Calabrian) form was pitta.\nThis suggests a derivation from Latin pīnctus (pictus (“painted, smeared”)) or pīnsum, pīnsitum, pistum (“pounded”), but the northern forms appear to be contaminated with pinzare (“to staple”).\nThere are alternative suggestions involving Greek etymologies (πηκτή (pēktḗ), πηκτός (pēktós, “compacted, congealed”); πήτεα (pḗtea, “bran”); Ancient Greek πιττάκιον (pittákion, “patch; tablet; ticket”)), more remote possibilities involve comparision with Lombardic pizzo, pizza (“bite, morsel, lump, dumpling”); Albanian petë (“layer”), Romanian pată (“blotch, stain, macula”); Albanian pite (“gruel”);\nAramaic פִיתָּא‎ (pītā, “piece of bread”), Hebrew פַּת‎ (paṯ, “bread”). Doublet of pita."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pizza (countable and uncountable, plural pizzas or (rare) pizze)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A baked Italian dish of a thinly rolled bread dough crust typically topped before baking with tomato sauce, cheese, and other ingredients such as meat, vegetables or fruit",
                  "examples": [
                    "a slice of pizza",
                    "a pizza pie",
                    "Want to go out for pizza tonight?",
                    "Synonym: 'za"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A single instance of this dish",
                  "examples": [
                    "Synonyms: pizza pie, pie",
                    "He ate a whole pizza!",
                    "Should we cook a frozen pizza for dinner?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}