{
  "word": "school",
  "etymologies": [
    {
      "description": [
        "From Middle English scole, from Old English scōl (“place of education”), from Proto-West Germanic *skōlā, from Late Latin schola, scola (“learned discussion or dissertation, lecture, school”), from Ancient Greek σχολεῖον (skholeîon), from σχολή (skholḗ, “spare time, leisure”), from Proto-Indo-European *seǵʰ- (“to hold, have, possess”). Doublet of schola and shul.",
        "Compare Old Frisian skūle, schūle (“school”) (West Frisian skoalle, Saterland Frisian Skoule), Dutch school (“school”), German Low German School (“school”), Old High German scuola (“school”), German Schule (“school”), Bavarian Schui (“school”), Old Norse skóli (“school”).",
        "Influenced in some senses by Middle English schole (“group of persons, host, company”), from Middle Dutch scole (“multitude, troop, band”). See school1. Related also to Old High German sigi (German Sieg, “victory”), Old English siġe, sigor (“victory”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "school (countable and uncountable, plural schools)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) An institution dedicated to teaching and learning; an educational institution.",
                  "examples": [
                    "Our children attend a public school in our neighborhood.",
                    "Harvard University is a famous American postsecondary school.",
                    "Synonyms: academy, college, university"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) An educational institution providing primary and secondary education, prior to tertiary education (college or university).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) At Eton College, a period or session of teaching.",
                  "examples": [
                    "Divinity, history and geography are studied for two schools per week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Within a larger educational institution, an organizational unit, such as a department or institute, which is dedicated to a specific subject area.",
                  "examples": [
                    "We are enrolled in the same university, but I attend the School of Economics and my brother is in the School of Music.",
                    "Synonyms: college, department, faculty, institute"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An art movement, a community of artists.",
                  "examples": [
                    "The Barbizon school of painters were part of an art movement towards Realism in art, which arose in the context of the dominant Romantic movement of the time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(considered collectively) The followers of a particular doctrine; a particular way of thinking or particular doctrine; a school of thought.",
                  "examples": [
                    "These economists belong to the monetarist school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The time during which classes are attended or in session in an educational institution.",
                  "examples": [
                    "I’ll see you after school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The room or hall in English universities where the examinations for degrees and honours are held.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The canons, precepts, or body of opinion or practice, sanctioned by the authority of a particular class or age.",
                  "examples": [
                    "He was a gentleman of the old school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An establishment offering specialized instruction, as for driving, cooking, typing, coding, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "school (third-person singular simple present schools, present participle schooling, simple past and past participle schooled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To educate, teach, or train (often, but not necessarily, in a school).",
                  "examples": [
                    "Many future prime ministers were schooled in Eton."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To defeat emphatically, to teach an opponent a harsh lesson.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To control, or compose, one’s expression.",
                  "examples": [
                    "She took care to school her expression, not giving away any of her feelings."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English scole, schole (“group of persons, multitude, host, school of fish”), from Middle Dutch scole (“multitude, troop of people, swarm of animals”), from Old Dutch *scola, *skola (“troop, multitude”), from Frankish *skolu, from Proto-Germanic *skulō (“crowd”), from Proto-Indo-European *(s)kʷel- (“crowd, people”).",
        "Cognate with Middle Low German schōle (“multitude, troop”), Old English scolu (“troop or band of people, host, multitude, school of fish”). Doublet of shoal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "school (plural schools)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) A group of fish or a group of marine mammals such as porpoises, dolphins, or whales.",
                  "examples": [
                    "The divers encountered a huge school of mackerel.",
                    "Synonym: shoal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A multitude.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "school (third-person singular simple present schools, present participle schooling, simple past and past participle schooled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of fish) To form into, or travel in, a school.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}