{
  "word": "entry",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English entre, from Old French entree (feminine past participle of the verb entrer, Modern French entrée). From Latin intrō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "entry (countable and uncountable, plural entries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of entering.",
                  "examples": [
                    "The wrestler's dramatic entry into the stadium was very impressive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Permission to enter.",
                  "examples": [
                    "Children are allowed entry only if accompanied by an adult.",
                    "Strictly no entry for under-18s"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A doorway that provides a means of entering a building.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The act of taking possession.",
                  "examples": [
                    ""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(insurance) The start of an insurance contract.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Midlands) A passageway between terraced houses that provides a means of entering a back garden or yard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small room immediately inside the front door of a house or other building, often having an access to a stairway and leading on to other rooms",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small group formed within a church, especially Episcopal, for simple dinner and fellowship, and to help facilitate new friendships",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An item in a list, such as an article in a dictionary or encyclopedia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A record made in a log, diary or anything similarly organized; (computing) a datum in a database.",
                  "examples": [
                    "What does the entry for 2 August 2005 say?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linear algebra) A term at any position in a matrix.",
                  "examples": [
                    "The entry in the second row and first column of this matrix is 6."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The exhibition or depositing of a ship's papers at the customhouse, to procure licence to land goods; or the giving an account of a ship's cargo to the officer of the customs, and obtaining his permission to land the goods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The point when a musician starts to play or sing; entrance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting) The introduction of new hounds into a pack.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}