{
  "word": "swap",
  "etymologies": [
    {
      "description": [
        "From Middle English swappen (“to swap”), originally meaning \"to hurl\" or \"to strike\", the word alludes to striking hands together when making an exchange; probably from Old English *swappian, a secondary form of Old English swāpan (“to swoop”). Cognate with German schwappen (“to slosh, slop”). Compare also Middle English swippen (“to strike, hit”), from Old English swipian (“to scourge, strike, beat, lash”), Old Norse svipa (“to swoop, flash, whip, look after, look around”). More at swipe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "swap (third-person singular simple present swaps, present participle swapping, simple past and past participle swapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exchange or give (something) in an exchange (for something else).",
                  "examples": [
                    "Synonyms: exchange, switch, trade"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To hit, to strike.",
                  "examples": [
                    "\"Maybe Apes will grow honest, Sister,\" said Edmund. \"But, by the Lion, if he breaks it again, it may be in such time and place that any of us could swap off his head in clean battle.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To beat the air, or ply the wings, with a sweeping motion or noise; to flap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To descend or fall; to rush hastily or violently.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the verb swap. First attested in  1620."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swap (plural swaps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An exchange of two comparable things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A financial derivative in which two parties agree to exchange one stream of cashflow against another stream.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, informal, uncountable) Space available in a swap file for use as auxiliary memory.",
                  "examples": [
                    "How much swap do you need?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cambridge University slang) A social meal at a restaurant between two university societies, usually involving drinking and banter; commonly associated with fining and pennying; equivalent to a crewdate at Oxford University.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English swap, swappe (“a blow, strike, lash from a whip”), from the verb (see Etymology 1 above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swap (countable and uncountable, plural swaps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, UK, dialect) A blow; a stroke.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}