{
  "word": "forby",
  "etymologies": [
    {
      "description": [
        "From Middle English forby, forbi, of Middle Low German or North Germanic origin, equivalent to fore- +‎ by. Compare Saterland Frisian foarbie (“beyond, past”), Dutch voorbij (“past”), Low German vörbi, German vorbei (“gone, past”), Danish forbi, Swedish förbi. More at fore, by."
      ],
      "adjectives": [
        {
          "description": "forby (comparative more forby, superlative most forby)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland, archaic) Uncommon; out of the ordinary; extraordinary; superior.",
                  "examples": [
                    "He's a forbye man."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "forby (comparative more forby, superlative most forby)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland, archaic) Past; by; beyond.",
                  "examples": [
                    "To see the world and folk that went forby,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland, archaic) Uncommonly; exceptionally.",
                  "examples": [
                    "He was forby kind."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [
        {
          "description": "forby",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland, archaic) Beyond; past; more than; greater than; over and above; moreover.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland, archaic, of time) Past; gone by; over.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland, archaic) Near; beside; by, close to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland, archaic) On one side; out of the way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland, archaic) Besides; in addition to; as well as; not to mention.",
                  "examples": [
                    "There was other six forby me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland, archaic) With the exception of; not taking into account.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}