{
  "word": "back",
  "etymologies": [
    {
      "description": [
        "From Middle English bak, from Old English bæc, from Proto-West Germanic *bak, from Proto-Germanic *baką, possibly from Proto-Indo-European *bʰeg- (“to bend”). The adverb represents an aphetic form of aback.",
        "Compare Middle Low German bak (“back”), from Old Saxon bak, and West Frisian bekling (“chair back”), Old High German bah, Swedish and Norwegian bak. Cognate with German Bache (“sow [adult female hog]”)."
      ],
      "adjectives": [
        {
          "description": "back (not generally comparable, comparative more back, superlative most back)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "At or near the rear.",
                  "examples": [
                    "Go in the back door of the house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(predicative) Returned or restored to a previous place or condition.",
                  "examples": [
                    "He was on vacation, but now he’s back.",
                    "The office fell into chaos when you left, but now order is back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not current.",
                  "examples": [
                    "I’d like to find a back issue of that magazine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Situated away from the main or most frequented areas.",
                  "examples": [
                    "They took a back road.",
                    "He lives out in the back country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In arrears; overdue.",
                  "examples": [
                    "They still owe three months' back rent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moving or operating backward.",
                  "examples": [
                    "back action"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable, phonetics) Pronounced with the highest part of the body of the tongue toward the back of the mouth, near the soft palate (most often describing a vowel).",
                  "examples": [
                    "The vowel of lot has a back vowel in most dialects of England."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "back (comparative further back, superlative furthest back)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) To or in a previous condition or place.",
                  "examples": [
                    "He gave back the money.",
                    "I left my mobile phone back at the hotel. I'll have to go back and get it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a direction opposite to that in which someone or something is facing or normally pointing.",
                  "examples": [
                    "Someone pushed me in the chest and I fell back.",
                    "The grandfather clock toppled back and crashed to the ground.",
                    "Her arm was bent back at an odd angle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a direction opposite to the usual or desired direction of movement or progress, physically or figuratively.",
                  "examples": [
                    "Wind the film back a few frames.",
                    "Don't forget to put the clocks back by one hour tonight!",
                    "This mishap has set the project back considerably."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "So as to reverse direction and return.",
                  "examples": [
                    "The light bounces back off the mirror."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Towards, into or in the past.",
                  "examples": [
                    "These records go back years.",
                    "He built a time machine and travelled back to 1800.",
                    "Think back to how you felt last year.",
                    "Everything was simpler back in the old days."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Away from someone or something; at a distance.",
                  "examples": [
                    "Keep back! It could explode at any moment!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Away from the front or from an edge.",
                  "examples": [
                    "Sit all the way back in your chair.",
                    "Step back from the curb."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "So as shrink, recede or move aside, or cause to do so.",
                  "examples": [
                    "This tree is dying back.",
                    "Clear back all this vegetation.",
                    "Draw back the curtains and let in some light."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a manner that impedes.",
                  "examples": [
                    "Fear held him back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) In a reciprocal manner; in return.",
                  "examples": [
                    "If you hurt me, I'll hurt you back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(postpositive) Earlier, ago.",
                  "examples": [
                    "We met many years back.",
                    "I last saw him a day or two back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To a later point in time. See also put back.",
                  "examples": [
                    "The meeting has been moved back an hour. It was at 3 o'clock; now it's at 4 o'clock."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "back (plural backs)",
          "definitionGroups": [
            {
              "group": "The rear of the body, especially the part between the neck and the end of the spine and opposite the chest and belly.",
              "entries": [
                {
                  "meaning": "The spine and associated tissues.",
                  "examples": [
                    "I hurt my back lifting those crates."
                  ]
                },
                {
                  "meaning": "(slang, uncountable) Large and attractive buttocks.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) The part of a piece of clothing which covers the back.",
                  "examples": [
                    "I still need to finish the back of your dress."
                  ]
                },
                {
                  "meaning": "The backrest, the part of a piece of furniture which receives the human back.",
                  "examples": [
                    "Can you fix the back of this chair?"
                  ]
                },
                {
                  "meaning": "(obsolete) That part of the body that bears clothing. (Now used only in the phrase clothes on one's back.)",
                  "examples": []
                }
              ]
            },
            {
              "group": "That which is farthest away from the front.",
              "entries": [
                {
                  "meaning": "The side of any object which is opposite the front or useful side.",
                  "examples": [
                    "Turn the book over and look at the back."
                  ]
                },
                {
                  "meaning": "The edge of a book which is bound.",
                  "examples": [
                    "The titles are printed on the backs of the books."
                  ]
                },
                {
                  "meaning": "(printing) The inside margin of a page.",
                  "examples": []
                },
                {
                  "meaning": "The side of a blade opposite the side used for cutting.",
                  "examples": [
                    "Tap it with the back of your knife."
                  ]
                },
                {
                  "meaning": "The reverse side; the side that is not normally seen.",
                  "examples": [
                    "I hung the clothes on the back of the door."
                  ]
                },
                {
                  "meaning": "Area behind, such as the backyard of a house.",
                  "examples": [
                    "We'll meet out in the back of the library."
                  ]
                },
                {
                  "meaning": "The part of something that goes last.",
                  "examples": [
                    "The car was near the back of the train."
                  ]
                },
                {
                  "meaning": "(sports) In some team sports, a position behind most players on the team.",
                  "examples": [
                    "The backs were lined up in an I formation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Upper part of a natural object which is considered to resemble an animal's back.",
                  "examples": [
                    "The small boat raced over the backs of the waves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A support or resource in reserve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The keel and keelson of a ship.",
                  "examples": [
                    "The ship's back broke in the pounding surf."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) The roof of a horizontal underground passage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Effort, usually physical.",
                  "examples": [
                    "Put some back into it!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A non-alcoholic drink (often water or a soft drink), to go with hard liquor or a cocktail.",
                  "examples": [
                    "Could I get a martini with a water back?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Among leather dealers, one of the thickest and stoutest tanned hides.",
                  "examples": [
                    "[…] as delivered by a tanner the average weight of a back and two strips would be about 42 pounds […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(swimming) Clipping of backstroke.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "back (third-person singular simple present backs, present participle backing, simple past and past participle backed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go in the reverse direction.",
                  "examples": [
                    "the train backed into the station;  the horse refuses to back"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To support.",
                  "examples": [
                    "I back you all the way;  which horse are you backing in this race?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, of the wind) To change direction contrary to the normal pattern; that is, to shift anticlockwise in the northern hemisphere, or clockwise in the southern hemisphere.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, of a square sail) To brace the yards so that the wind presses on the front of the sail, to slow the ship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, of an anchor) To lay out a second, smaller anchor to provide additional holding power.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, of a hunting dog) To stand still behind another dog which has pointed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To push or force backwards.",
                  "examples": [
                    "to back oxen",
                    "The mugger backed her into a corner and demanded her wallet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To get upon the back of; to mount.",
                  "examples": [
                    "The horse was the grey stallion he aye rode, the very beast he had ridden for many a wager with the wild lads of the Cross Keys. No man but himself durst back it, and it had lamed many a hostler lad and broke two necks in its day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To place or seat upon the back.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a back for; to furnish with a back.",
                  "examples": [
                    "to back books"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To adjoin behind; to be at the back of.",
                  "examples": [
                    "the chalk cliffs which back the beach"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To write upon the back of, possibly as an endorsement.",
                  "examples": [
                    "to back a letter;  to back a note or legal document"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, of a justice of the peace) To sign or endorse (a warrant, issued in another county, to apprehend an offender).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To row backward with (oars).",
                  "examples": [
                    "to back the oars"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(MLE, transitive) To draw from behind the back [+accusative = a knife etc.] (as also back out).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Nigeria, transitive) To carry an infant on one's back.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French bac."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "back (plural backs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large shallow vat; a cistern, tub, or trough, used by brewers, distillers, dyers, picklers, gluemakers, and others, for mixing or cooling wort, holding water, hot glue, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ferryboat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}