{
  "word": "rout",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English rout, route (“group of people associated with one another, company; entourage, retinue; army; group of soldiers; group of pirates; large number of people, crowd; throng; group of disreputable people, mob; riot; group of animals; group of objects; proper condition or manner”) [and other forms], from Anglo-Norman route, rute, Middle French rote, route, Old French rote, route, rute (“group of people, company; group of armed people; group of criminals; group of cattle”) (modern French route (obsolete)), from Latin rupta (compare Late Latin ruta, rutta (“group of marauders; riot; unlawful assembly”)), the feminine of ruptus (“broken; burst, ruptured”), the perfect passive participle of rumpō (“to break, burst, rupture, tear; to force open; (figurative) to annul; to destroy; to interrupt”), ultimately from Proto-Indo-European *Hrewp- (“to break; to tear (up)”). The English word is a doublet of route.",
        "The verb is derived from Middle English routen (“to assemble, congregate; of animals: to herd together; to regroup, make a stand against; to be riotous, to riot”) [and other forms], from rout, route (noun); see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rout (countable and uncountable, plural routs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) A group of people; a crowd, a throng, a troop; in particular (archaic), a group of people accompanying or travelling with someone.",
                  "examples": [
                    "Synonyms: company, gathering"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, archaic) A group of animals, especially one which is lively or unruly, or made up of wild animals such as wolves; a flock, a herd, a pack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A group of disorganized things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A group of (often violent) criminals or gangsters; such people as a class; (more generally) a disorderly and tumultuous crowd, a mob; hence (archaic, preceded by the), the common people as a group, the rabble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, dated) A fashionable assembly; a large evening party, a soirée.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, archaic) A noisy disturbance; also, a disorderly argument or fight, a brawl; (uncountable) disturbance of the peace, commotion, tumult.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, law, historical) An illegal assembly of people; specifically, three or more people who have come together intending to do something illegal, and who have taken steps towards this, regarded as more serious than an unlawful assembly but not as serious as a riot; the act of assembling in this manner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rout (third-person singular simple present routs, present participle routing, simple past and past participle routed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To assemble in a crowd, whether orderly or disorderly; to collect in company.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is derived from Middle French route (“military defeat; retreat”), from rout, archaic past participle of Middle French, Old French rompre (“to break; to break up, disperse”) (modern French rompre (“to break, snap; to break up (with someone)”)), from Latin rumpere, the present active infinitive of rumpō (“to break, burst, rupture, tear; to force open; (figurative) to annul; to destroy; to interrupt”); see further at etymology 1.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rout (plural routs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally military) The act of completely defeating an army or other enemy force, causing it to retreat in a disorganized manner; (by extension) in politics, sport, etc.: a convincing defeat; a thrashing, a trouncing.",
                  "examples": [
                    "The rout of the enemy was complete.",
                    "The visiting football team was put to rout."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, also figurative) The retreat of an enemy force, etc., in this manner; also (archaic, rare), the army, enemy force, etc., so retreating.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rout (third-person singular simple present routs, present participle routing, simple past and past participle routed) (originally military)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To completely defeat and force into disorderly retreat (an enemy force, opponent in sport, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To retreat from a confrontation in disorder.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Middle English routen (“to snore; to grunt, snort; to sleep; to dwell; to settle permanently”), [and other forms], from Old English hrūtan (“to snore; to make a noise”), from Proto-West Germanic *hrūtan (“to snore”), from Proto-Germanic *hrūtaną, *hreutaną (“to snore”), from *hruttōną (“to snore; to roar”), from Proto-Indo-European *ker-, *kor-, *kr- (“to croak, crow”), *krut- (“to snore; to roar”), probably ultimately imitative.",
        "The English word is cognate with Icelandic rjóta, hrjóta (“to snore; to rattle, roar”), rauta (“to roar”), Middle Dutch ruyten (“to make a noise; to chatter, chirp”), Middle High German rūssen, rūzen (“to make a noise; to buzz; to rattle; to snore”), Norwegian Nynorsk ruta (“to make a loud noise; to roar, rumble”), Swedish ryta (“to bellow, roar; to scream or shout angrily”). Compare Old English rēotan, *hrēotan (“to make a noise; to make a noise in grief, lament, wail; to shed tears, weep”), from Proto-Germanic *reutaną; see further at etymology 4.",
        "The noun is derived from the verb. It is cognate with Southern Norwegian rut (“loud noise, din, roar”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rout (plural routs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Scotland) A loud, resounding noise, especially one made by the sea, thunder, wind, etc.; a roar.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rout (third-person singular simple present routs, present participle routing, simple past and past participle routed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly England, regional) To snore, especially loudly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly England, regional) To make a noise; to bellow, to roar, to snort.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Scotland, archaic) Especially of the sea, thunder, wind, etc.: to make a loud roaring noise; to howl, to roar, to rumble.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Middle English routen (“to cry out, bellow, roar”) [and other forms], from Old Norse rauta (“to roar”), from Proto-Germanic *reutaną (“to cry, wail”), ultimately from Proto-Indo-European *HrewdH- (“to weep”), probably imitative. The English word is cognate with Danish ryde (“to low, moo”), Latin rudere, rūdere (“to bray; to cry”), Lithuanian raudóti (“to wail; to lament; to sob”), Norwegian raute (“to bellow; to low, moo”), Old Church Slavonic рꙑдати (rydati, “to wail, weep”), Old High German riozan (“to roar; to wail”) (Middle High German riezen (“to wail”)), Old Norse rjóta (“to roar”), Old Swedish riuta, ryta (“to howl, wail; to roar”) (modern Swedish ruta, ryta (“to howl; to roar”) (regional)), Old Swedish röta (“to bellow, roar”) (modern Swedish rauta, råta, rota, röta (“to bellow, roar”) (regional)), Sanskrit रुद् (rud, “to cry, wail, weep; to howl, roar; to bewail, deplore, lament”).",
        "The noun is derived from the verb, or from a noun derived from Old Norse rauta (“to roar”) (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rout (plural routs) (chiefly Scotland)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lowing or mooing sound by an animal, especially cattle; a bellow, a moo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loud shout; a bellow, a roar; also, an instance of loud and continued exclamation or shouting; a clamour, an outcry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rout (third-person singular simple present routs, present participle routing, simple past and past participle routed) (chiefly Northern England, Northern Ireland, Scotland)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Of a person: to say or shout (something) loudly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a person: to speak loudly; to bellow, roar, to shout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of an animal, especially cattle: to low or moo loudly; to bellow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant of wrout, itself a variant of wroot (“to search or root in the ground”) (obsolete), from Middle English wroten (“to search or root in the ground; of a person: to dig earth; of a worm: to slither, wriggle; to corrode; of a worm: to irritate by biting the skin; to destroy (a fortification) by digging or mining”) [and other forms] (whence root), from Old English wrōtan (“to root up or rummage with the snout”). from Proto-West Germanic *wrōtan, from Proto-Germanic *wrōtaną (“to dig with the nose or snout, to root”); further etymology uncertain, perhaps related to Proto-Indo-European *wréh₂ds (“a root”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rout (third-person singular simple present routs, present participle routing, simple past and past participle routed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dig or plough (earth or the ground); to till.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Usually followed by out or up: of a person: to search for and find (something); also (transitive) to completely empty or clear out (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly US) Usually followed by from: to compel (someone) to leave a place; specifically (usually followed by out or up), to cause (someone) to get out of bed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) Of an animal, especially a pig: to search (for something) in the ground with the snout; to root.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To use a gouge, router, or other tool to scoop out material (from a metallic, wooden, etc., surface), forming a groove or recess.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a person: to search through belongings, a place, etc.; to rummage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly a variant of root (“to dig or pull out by the roots; to abolish, exterminate, root out”), from Middle English wroten; see further at etymology 5. Some recent uses are difficult to tell apart from rout (“of an animal, especially a pig: to search (for something) in the ground with the snout; to search for and find (something)”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rout (third-person singular simple present routs, present participle routing, simple past and past participle routed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Usually followed by out or up: to dig or pull up (a plant) by the roots; to extirpate, to uproot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) Usually followed by out: to find and eradicate (something harmful or undesirable); to root out.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Middle English routen (“to move quickly, rush; of waters: to churn, surge; to drag, pull; to throw; to agitate, shake; to beat, strike;”) [and other forms], from Old English hrūtan, from or cognate with Old Norse hrjóta (“to be flung; to fall; to fly”), from Proto-Germanic *hrūtaną, *hreutaną (“to fall; to fly; to move quickly”); further etymology uncertain, perhaps from Proto-Indo-European *kreu- (“to fall, plunge; to rush; to topple”).",
        "The English word is cognate with Middle High German rûzen (“to move quickly, storm”), and is also related to Old English hrēosan (“to fall; to collapse; to rush”).",
        "The noun is derived from Middle English rout, route (“a blow; suffering, woe (?); a jerk, sharp pull”) [and other forms], from routen; see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rout (plural routs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Scotland, archaic) A violent movement; a heavy or stunning blow or stroke.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rout (third-person singular simple present routs, present participle routing, simple past and past participle routed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, chiefly Scotland, archaic) To beat or strike (someone or something); to assail (someone or something) with blows.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; either imitative of the bird’s call, or possibly from Icelandic hrota (“brant; brent goose”), also probably imitative though perhaps influenced by hrot (“a snore; act of snoring”), from hrjóta (“to snore”), from Old Norse hrjóta (“to snore”), from Proto-Germanic *hrūtaną (“to snore”); see further at etymology 3."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rout (plural routs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, obsolete) The brant or brent goose (Branta bernicla).",
                  "examples": [
                    "Synonyms: brant goose, road-goose, rood goose, rot-goose"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}