{
  "word": "graduate",
  "etymologies": [
    {
      "description": [
        "From Latin graduātus (“graduated”), from gradus (“step”)."
      ],
      "adjectives": [
        {
          "description": "graduate (comparative more graduate, superlative most graduate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "graduated, arranged by degrees",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "holding an academic degree",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "relating to an academic degree",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "graduate (plural graduates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is recognized by a university as having completed the requirements of a degree studied at the institution.",
                  "examples": [
                    "If the government wants graduates to stay in the country they should offer more incentives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada) A person who is recognized by a high school as having completed the requirements of a course of study at the school.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Philippines) A person who is recognized as having completed any level of education.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A graduated (marked) cup or other container, thus fit for measuring.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "graduate (third-person singular simple present graduates, present participle graduating, simple past and past participle graduated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, ergative) To be recognized by a school or university as having completed the requirements of a degree studied at the institution.",
                  "examples": [
                    "The man graduated in 1967.",
                    "Trisha graduated from college."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, proscribed) To be certified as having earned a degree from; to graduate from (an institution).",
                  "examples": [
                    "Trisha graduated college."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To certify (a student) as having earned a degree",
                  "examples": [
                    "Indiana University graduated the student.",
                    "The college graduated him as soon as he was no longer eligible to play under NCAA rules."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark (something) with degrees; to divide into regular steps or intervals, as the scale of a thermometer, a scheme of punishment or rewards, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change gradually.",
                  "examples": [
                    "sandstone which graduates into gneiss; carnelian sometimes graduates into quartz"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To prepare gradually; to arrange, temper, or modify by degrees or to a certain degree; to determine the degrees of.",
                  "examples": [
                    "to graduate the heat of an oven"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) To bring to a certain degree of consistency, by evaporation, as a fluid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To taper, as the tail of certain birds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Japanese entertainment) Of an idol: to exit a group; or of a virtual YouTuber, to leave a management agency; usually accompanied with \"graduation ceremony\" send-offs, increased focus on the leaving member, and the like.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}