{
  "word": "sundowner",
  "etymologies": [
    {
      "description": [
        "From sundown +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sundowner (plural sundowners)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, obsolete) An itinerant worker, such as a swagman, who arrives at a farm too late in the day to do any work, but readily accepts food and lodging.",
                  "examples": [
                    "What he saw was not usual in this part of Australia - a sundowner, a bush waif who tramps from north to south or from east to west, never working, cadging rations from the far-flung homesteads and having the ability of the camel to do without water, or find it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, obsolete) An itinerant worker, a swagman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A sea captain who shows harsh discipline by requiring all hands to be on board by sundown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, colloquial) A patient, usually demented, who tends to become agitated in the evening.",
                  "examples": [
                    "These patients may improve by day only to relapse at night (nocturnal delirium or sundowner's syndrome)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally colonial slang, especially southern Africa) A cocktail consumed at sunset, or to signify the end of the day.",
                  "examples": [
                    "The cocktail, the universal “sherry and bitters” and sundowner will have to be retained."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cocktail party held in the early evening.",
                  "examples": [
                    "The Sundowner is basically a cocktail party with a buffet on a riverbank in the bush."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A physician employed by the government who practises for private fees after his official hours.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any worker who practises for private fees after official hours.",
                  "examples": [
                    "These \"sundowners\" hold jobs in other — usually related — trades, and do their servicing nights and weekends."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}