{
  "word": "masterly",
  "etymologies": [
    {
      "description": [
        "From Middle English maisterli, from maister (“leader, ruler; high official; official in charge of a place; person in control; employer; owner; schoolmaster, teacher; scholar, sage; holder of a master's degree; religious teacher; master craftsman; expert; magician; social superior; husband; lover; Jesus Christ; a god; male stud animal”) + -li (suffix forming adjectives). Maister is derived from Old English mæġester (“master”) and Old French maistre (“master”) (modern French maître), both from Latin magister (“teacher; master”), ultimately from Proto-Indo-European *méǵh₂s (“big, great”). The English word is analysable as master +‎ -ly."
      ],
      "adjectives": [
        {
          "description": "masterly (comparative more masterly, superlative most masterly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Executed in the manner of a master; showing competence and skill; masterful.",
                  "examples": [
                    "Synonyms: maestrolike, masterlike, (obsolete) masterous; see also Thesaurus:skilled",
                    "Her years of experience enabled her to render a masterly performance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually derogatory, obsolete) Like a master; arbitrary; domineering, imperious.",
                  "examples": [
                    "Synonyms: despotic, overbearing"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English maisterli (“artistically; skilfully; in the manner of a conqueror or master; overconfidently”), from maister (see etymology 1) + -li (suffix forming adverbs); analysable as master +‎ -ly (suffix forming adverbs)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "masterly (comparative more masterly, superlative most masterly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) In a masterful manner; competently, masterfully.",
                  "examples": [
                    "Synonyms: expertly, skilfully"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}