{
  "word": "holist",
  "etymologies": [
    {
      "description": [
        "hol- +‎ -ist"
      ],
      "adjectives": [
        {
          "description": "holist (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education, of a learning strategy) That concentrates on forming an overview of the topic.",
                  "examples": [
                    "The serialist/holist cognitive style is a measure of a bipolar information-processing strategy that describes the way that learners select and represent information (Pask, 1976; Pask & Scott, 1972)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "holist (plural holists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A believer in, or practitioner of, holism; one who believes that a topic of study cannot be fully understood by studying the parts, or who studies by considering the whole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology) One who advocates studying society as a whole, and who consistently interprets the actions of individuals in that context.",
                  "examples": [
                    "Holism is more eclectic in its methods; for most holists, rigor means reconstructing the meaning of an action in the subject's own terms, and interpreting it in light of a richly detailed cultural, social, and historical context."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) One who prefers to learn by forming an overview of the topic.",
                  "examples": [
                    "Holists use a global, thematic approach to learning by concentrating first on building broad descriptions. […] The holist then uses complex links to relate mutileveled information."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}