{
  "word": "astrologize",
  "etymologies": [
    {
      "description": [
        "Probably from Middle French astrologiser;' equivalent to astrology +‎ -ize."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "astrologize (third-person singular simple present astrologizes, present participle astrologizing, simple past and past participle astrologized)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To study or practise astrology; to attempt to foretell the future using astrology.",
                  "examples": [
                    "Synonym: prognosticate"
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To apply astrology to (someone or something).",
              "entries": [
                {
                  "meaning": "To attempt to foretell the future of (someone) using astrology, to read or cast (someone's) horoscope.",
                  "examples": [
                    "[…]  the physician must be watchful, and stethoscopists should be silent, that no depressing word may fall upon the patient’s ear. In truth they had better cease the old practice of astrologizing the patient altogether.  […]  If you prophesy the patient’s death, should he be laboring under some dubious affliction, he will most likely fulfil it, and prove you a truthful prophet."
                  ]
                },
                {
                  "meaning": "To make (something) astrological; to interpret (something) in the light of astrology.",
                  "examples": [
                    "And where Gerson tried to theologize astrology, that is, to render astrology acceptable to theologians, our author essays rather to astrologize theology and make theologians accept astrology."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}