{
  "word": "gown",
  "etymologies": [
    {
      "description": [
        "From Middle English gowne, from Anglo-Norman gune, goune (“fur-trimmed coat, pelisse”), from Old French goune, from Late Latin gunna (“leather garment, a fur”), from Ancient Greek γούνα (goúna, “coarse garment”), of unknown origin. Perhaps from a Balkan or Apennine language. Alternatively, perhaps from Scythian, from Proto-Iranian *gawnám (“fur”) (compare Younger Avestan 𐬔𐬀𐬊𐬥𐬀‎ (gaona, “body hair”) and Ossetian гъун (ǧun)).."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gown (plural gowns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose, flowing upper garment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A woman's ordinary outer dress, such as a calico or silk gown.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The official robe of certain professionals, clerics, and scholars, such as university students and officers, barristers, judges, etc.",
              "entries": [
                {
                  "meaning": "The dress of civil officers, as opposed to military officers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by metonymy) The university community, especially as contrasted with the local populace.",
                  "examples": [
                    "In the perennial town versus gown battles, townies win some violent battles, but the collegians are winning the war."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose wrapper worn by gentlemen within doors; a dressing gown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any sort of dress or garb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The robe worn by a surgeon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gown (third-person singular simple present gowns, present participle gowning, simple past and past participle gowned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dress in a gown, to don or garb with a gown.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}