{
  "word": "bass",
  "etymologies": [
    {
      "description": [
        "A respelling of base under the influence of Italian basso (“low”)."
      ],
      "adjectives": [
        {
          "description": "bass (comparative basser, superlative bassest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of sound, a voice or an instrument, low in pitch or frequency.",
                  "examples": [
                    "The giant spoke in a deep, bass, rumbling voice that shook me to my boots."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bass (plural basses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low spectrum of sound tones.",
                  "examples": [
                    "Peter adjusted the equalizer on his audio equipment to emphasize the bass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A section of musical group that produces low-pitched sound, lower than the baritone and tenor.",
                  "examples": [
                    "The conductor preferred to situate the bass in the middle rear, rather than to one side of the orchestra."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who sings in the bass range.",
                  "examples": [
                    "Halfway through middle school, Edgar morphed from a soprano to a bass, much to the amazement and amusement of his fellow choristers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) An instrument that plays in the bass range, in particular a double bass, bass guitar, electric bass or bass synthesiser.",
                  "examples": [
                    "The musician swung the bass over his head like an axe and smashed it into the amplifier, creating a discordant howl of noise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The clef sign that indicates that the pitch of the notes is below middle C; a bass clef.",
                  "examples": [
                    "The score had been written without the treble and bass, but it was easy to pick out which was which based on the location of the notes on the staff."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bass (third-person singular simple present basses, present participle bassing, simple past and past participle bassed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sound in a deep tone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bace, bas, alteration of bars, from Old English bærs (“a fish, perch”), from Proto-West Germanic *bars, from Proto-Germanic *barsaz (“perch”, literally “prickly”), from Proto-Indo-European *bʰórsos (“prickle, thorn, scale”). Cognate with Dutch baars (“perch, bass”), German Barsch (“perch”). More at barse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bass (countable and uncountable, plural basses or bass)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The perch; any of various marine and freshwater fish resembling the perch, all within the order of Perciformes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A corruption of bast."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bass (countable and uncountable, plural basses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fibrous inner bark of the linden or lime tree, used for making mats.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fibers from other plants, especially palm trees",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything made from such fibers, such as a hassock, basket or thick mat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}