{
  "word": "wire",
  "etymologies": [
    {
      "description": [
        "From Middle English wir, wyr, from Old English wīr (“wire, metal thread, wire-ornament”), from Proto-Germanic *wīraz (“wire”), from Proto-Indo-European *weh₁iros (“a twist, thread, cord, wire”), from *weh₁y- (“to turn, twist, weave, plait”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wire (countable and uncountable, plural wires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Metal formed into a thin, even thread, now usually by being drawn through a hole in a steel die.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of such material; a thread or slender rod of metal, a cable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A metal conductor that carries electricity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fence made of usually barbed wire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A finish line of a racetrack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A telecommunication wire or cable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) An electric telegraph; a telegram.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A hidden listening device on the person of an undercover operative for the purposes of obtaining incriminating spoken evidence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A deadline or critical endpoint.",
                  "examples": [
                    "This election is going to go right to the wire"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards) A wire strung with beads and hung horizontally above or near the table which is used to keep score.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) Any of the system of wires used to operate the puppets in a puppet show; hence, the network of hidden influences controlling the action of a person or organization; strings.",
                  "examples": [
                    "to pull the wires for office"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, thieves' slang) A pickpocket, especially one who targets women.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A covert signal sent between people cheating in a card game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A knitting needle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The slender shaft of the plumage of certain birds.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wire (third-person singular simple present wires, present participle wiring, simple past and past participle wired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fasten with wire, especially with reference to wine bottles, corks, or fencing.",
                  "examples": [
                    "We need to wire that hole in the fence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To string on a wire.",
                  "examples": [
                    "wire beads"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To equip with wires for use with electricity.",
                  "examples": [
                    "Do you know how to wire a plug?"
                  ]
                }
              ]
            },
            {
              "group": "To connect, embed, incorporate, or include (something) into (something else) by or as if by wires:",
              "entries": [
                {
                  "meaning": "To add (something) into a system (especially an electrical system) by means of wiring.",
                  "examples": [
                    "I'll just wire your camera to the computer screen."
                  ]
                },
                {
                  "meaning": "To add or connect (something) into a system as if with wires (for example, with nerves).",
                  "examples": []
                },
                {
                  "meaning": "To connect, involve or embed (something) deeply or intimately into (something else, such as an organization or political scene), so that it is plugged in (to that thing) (“keeping up with current information about (the thing)”) or has insinuated itself into (the thing).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, usually passive) To set or predetermine (someone's personality or behaviour, or an organization's culture) in a particular way.",
                  "examples": [
                    "There's no use trying to get Sarah to be less excitable. That's just the way she's wired."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To send a message or monetary funds to another person through a telecommunications system, formerly predominantly by telegraph.",
                  "examples": [
                    "Urgent: please wire me another 100 pounds sterling.",
                    "The detective wired ahead, hoping that the fugitive would be caught at the railway station."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To make someone tense or psyched up. See also adjective wired.",
                  "examples": [
                    "Coffee late at night wires me good and proper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To install eavesdropping equipment.",
                  "examples": [
                    "We wired the suspect's house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To snare by means of a wire or wires.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, croquet) To place (a ball) so that the wire of a wicket prevents a successful shot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}