{
  "word": "sport",
  "etymologies": [
    {
      "description": [
        "From Middle English sporten (verb) and sport, spoort, sporte (noun), apheretic shortenings of disporten (verb) and disport, disporte (noun). More at disport."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sport (countable and uncountable, plural sports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any activity that uses physical exertion or skills competitively under a set of rules that is not based on aesthetics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A person who exhibits either good or bad sportsmanship.",
                  "examples": [
                    "Jen may have won, but she was sure a poor sport; she laughed at the loser.",
                    "The loser was a good sport, and congratulated Jen on her performance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Somebody who behaves or reacts in an admirably good-natured manner, e.g. to being teased or to losing a game; a good sport.",
                  "examples": [
                    "You're such a sport! You never get upset when we tease you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which diverts, and makes mirth; pastime; amusement.",
                  "examples": [
                    "The little dog laughed to see such sport, and the dish ran away with the spoon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Mockery, making fun; derision.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A toy; a plaything; an object of mockery.",
                  "examples": [
                    "flitting leaves, the sport of every wind"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Gaming for money as in racing, hunting, or fishing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, botany, zoology, countable) A plant or an animal, or part of a plant or animal, which has some peculiarity not usually seen in the species; an abnormal variety or growth. The term encompasses both mutants and organisms with non-genetic developmental abnormalities such as birth defects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, countable) A sportsman; a gambler.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, countable) One who consorts with disreputable people, including prostitutes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) An amorous dalliance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, usually singular) A friend or acquaintance (chiefly used when speaking to the friend in question)",
                  "examples": [
                    "Synonyms: see Thesaurus:friend"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Term of endearment used by an adult for a child, usually a boy.",
                  "examples": [
                    "Hey, sport! You've gotten so big since I saw you last! Give me five."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Play; idle jingle.",
                  "examples": [
                    "An author who should introduce such a sport of words upon our stage  […] would meet with small applause."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sport (third-person singular simple present sports, present participle sporting, simple past and past participle sported)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To amuse oneself, to play.",
                  "examples": [
                    "children sporting on the green"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To mock or tease, treat lightly, toy with.",
                  "examples": [
                    "Jen sports with Bill's emotions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To display; to have as a notable feature.",
                  "examples": [
                    "Jen's sporting a new pair of shoes;  he was sporting a new wound from the combat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To divert; to amuse; to make merry.",
                  "examples": [
                    "Against whom do ye sport yourselves?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To represent by any kind of play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To practise the diversions of the field or the turf; to be given to betting, as upon races.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To assume suddenly a new and different character from the rest of the plant or from the type of the species; said of a bud, shoot, plant, or animal.",
                  "examples": [
                    "more than one kind of rose has sported into a moss"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To close (a door).",
                  "examples": [
                    "There he locked it up in a drawer, sported the doors of both sets of rooms, and retired to bed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}