{
  "word": "develop",
  "etymologies": [
    {
      "description": [
        "Borrowed from French développer, from Middle French desveloper, from Old French desveloper, from des- + voloper, veloper, vloper (“to wrap, wrap up”) (compare Italian -viluppare, Old Italian alternative form goluppare (“to wrap”)) from Vulgar Latin *vloppō, *wloppō (“to wrap”) ultimately from Proto-Germanic *wrappaną, *wlappaną (“to wrap, roll up, turn, wind”), from Proto-Indo-European *werb- (“to turn, bend”) [1]. Akin to Middle English wlappen (“to wrap, fold”) (Modern English lap (“to wrap, involve, fold”)), Middle English wrappen (“to wrap”), Middle Dutch lappen (“to wrap up, embrace”), dialectal Danish vravle (“to wind, twist”), Middle Low German wrempen (“to wrinkle, scrunch, distort”), Old English wearp (“warp”). The word acquired its modern meaning from the 17th-century belief that an egg contains the animal in miniature and matures by growing larger and shedding its envelopes."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "develop (third-person singular simple present develops, present participle developing, simple past and past participle developed or (archaic, rare) developt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To discover, find out; to uncover.",
                  "examples": [
                    "‘The mystery which I cannot develop, may by that time be removed  […] .’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change with a specific direction, progress.",
                  "examples": [
                    "Let's see how things develop and then make our decision."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To progress through a sequence of stages.",
                  "examples": [
                    "Isabel developed from a tropical depression to a tropical storm to a hurricane.   An embryo develops into a fetus and then into an infant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To advance; to further; to promote the growth of.",
                  "examples": [
                    "We must develop our own resources to the utmost."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To create.",
                  "examples": [
                    "I need to develop a plan for the next three weeks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring out images latent in photographic film.",
                  "examples": [
                    "Please develop this roll of film."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To acquire something usually over a period of time.",
                  "examples": [
                    "I have been in England enough to develop a British accent.",
                    "You will develop calluses if you play the cello.",
                    "She developed bad eating habits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, transitive) To place one's pieces actively.",
                  "examples": [
                    "I need to develop my white-square bishop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, pool) To cause a ball to become more open and available to be played on later. Usually by moving it away from the cushion, or by opening a pack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) To change the form of (an algebraic expression, etc.) by executing certain indicated operations without changing the value.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}