{
  "word": "bottle",
  "etymologies": [
    {
      "description": [
        "From Middle English botel (“bottle, flask, wineskin”), from Old French boteille (Modern French bouteille), from Medieval Latin butticula, ultimately of disputed origin. Probably a diminutive of Late Latin buttis. Compare also Low German Buddel and Old High German būtil (whence German Beutel). Doublet of botija."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bottle (plural bottles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A container, typically made of glass or plastic and having a tapered neck, used primarily for holding liquids.",
                  "examples": [
                    "Beer is often sold in bottles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The contents of such a container.",
                  "examples": [
                    "I only drank a bottle of beer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A container with a rubber nipple used for giving liquids to infants, a baby bottle.",
                  "examples": [
                    "The baby wants a bottle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, informal) (originally \"bottle and glass\" as rhyming slang for \"arse\") Nerve, courage.",
                  "examples": [
                    "You don’t have the bottle to do that!",
                    "He was going to ask her out, but he lost his bottle when he saw her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive, of a person with a particular hair color) A container of hair dye, hence with one’s hair color produced by dyeing.",
                  "examples": [
                    "Did you know he’s a bottle brunette? His natural hair color is strawberry blonde."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A bundle, especially of hay; something tied in a bundle.",
                  "examples": [
                    "Is that a Cook of London, with mischance? / Do him come forth, he knoweth his penance; / For he shall tell a tale, by my fay, / Although it be not worth a bottle hay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Intoxicating liquor; alcohol.",
                  "examples": [
                    "to drown one’s troubles in the bottle",
                    "to hit the bottle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bottle (third-person singular simple present bottles, present participle bottling, simple past and past participle bottled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seal (a liquid) into a bottle for later consumption. Also fig.",
                  "examples": [
                    "This plant bottles vast quantities of spring water every day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain) To feed (an infant) baby formula.",
                  "examples": [
                    "Because of complications she can't breast feed her baby and so she bottles him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) To refrain from doing (something) at the last moment because of a sudden loss of courage.",
                  "examples": [
                    "The rider bottled the big jump."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang, sports) To throw away a leading position.",
                  "examples": [
                    "Liverpool bottled the Premier League."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) To strike (someone) with a bottle.",
                  "examples": [
                    "He was bottled at a nightclub and had to have facial surgery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) To pelt (a musical act on stage, etc.) with bottles as a sign of disapproval.",
                  "examples": [
                    "Meat Loaf was once bottled at Reading Festival."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, intransitive) Of pages printed several on a sheet: to rotate slightly when the sheet is folded two or more times.",
                  "examples": [
                    "Closely related to creep is the process of bottling. As you may have noticed from your folded sheet of paper, pages don't merely creep when they're folded — they also rotate slightly. This rotation or bottling is caused by the thickness or bulk of the paper."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bottle, botel, buttle, from Old English botl (“building, house”), from Proto-West Germanic *bōþl, from Proto-Germanic *budlą, *buþlą, *bōþlą (“house, dwelling, farm”), from Proto-Indo-European *bʰōw- (literally “to swell, grow, thrive, be, live, dwell”).",
        "Cognate with North Frisian budel, bodel, bol, boel (“dwelling, inheritable property”), Dutch boedel, boel (“inheritance, estate”), Danish bol (“farm”), Icelandic ból (“dwelling, abode, farm, lair”). Related to Old English bytlan (“to build”). More at build."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bottle (plural bottles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal or obsolete) A dwelling; habitation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal) A building; house.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}