{
  "word": "multiple",
  "etymologies": [
    {
      "description": [
        "From French multiple, itself from Late Latin multiplus."
      ],
      "adjectives": [
        {
          "description": "multiple (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "More than one (followed by plural).",
                  "examples": [
                    "My Swiss Army knife has multiple blades."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having more than one element, part, component, or function, having more than one instance, occurring more than once, usually contrary to expectations (can be followed by a singular).",
                  "examples": [
                    "Some states do explicitly prohibit multiple citizenship.",
                    "It was a multiple pregnancy: the woman had triplets.",
                    "Multiple registrations are an increasing problem for many social networking sites."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "multiple (plural multiples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A whole number that can be divided by another number with no remainder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) Price-earnings ratio.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of a set of the same thing; a duplicate.",
                  "examples": [
                    "One might view this attempt to ensure the scarcity of a multiple as both a marketing ploy and form of elitism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single individual who has multiple personalities.",
                  "examples": [
                    "I had seen its first show when it was a freebie, but I thought it made multiples in general look silly – no one changes clothes THAT much!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of a set of siblings produced by a multiple birth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chain store.",
                  "examples": [
                    "The big advantage such multiples can offer over a purely catalogue operation is that winners can be given shopping vouchers enabling them to choose from goods on display in the multiples' many outlets (Woolworths, for example, has 1,000)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A discovery resulting from the work of many people throughout history, not merely the work of the person who makes the final connection.",
                  "examples": [
                    "Merton's argument that all scientific discoveries are multiples would seem to contradict the theory of genius  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "More than one piercing in a single ear.",
                  "examples": [
                    "First of all, the 'greenhorn' stigma of piercing has worn off. The older woman sees her daughter wearing multiples. So she's confident enough to have her ears pierced at least once."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}