{
  "word": "ministry",
  "etymologies": [
    {
      "description": [
        "From Middle English mynisterie, borrowed from Old French menistere, in turn borrowed itself from Latin ministerium; equivalent to minister +‎ -y."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ministry (plural ministries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Government department, at the administrative level normally headed by a minister (or equivalent rank, e.g. secretary of state), who holds it as portfolio, especially in a constitutional monarchy, but also as a polity",
                  "examples": [
                    "She works for the ministry of finance.",
                    "He works for the ministry of defence.",
                    "I work for the ministry of education.",
                    "They work for the ministry of agriculture.",
                    "Hyponyms: see Thesaurus:government ministry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The complete body of government ministers (whether or not they are in cabinet) under the leadership of a head of government (such as a prime minister)",
                  "examples": [
                    "The premier offered his last ministry's resignation to the monarch, and is asked to form a new one in accordance with the election results."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ministration",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The active practice and education of the minister of a particular religion or faith.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The clergy of nonapostolic Protestant churches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) Work of a spiritual or charitable nature.",
                  "examples": [
                    "the present ministry of the Holy Spirit"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}