{
  "word": "neck",
  "etymologies": [
    {
      "description": [
        "From Middle English nekke, nakke, from Old English hnecca, *hnæcca (“neck, nape”), from Proto-Germanic *hnakkô (“nape, neck”), from Proto-Indo-European *knog-, *kneg- (“back of the head, nape, neck”). Cognate with Scots nek (“neck”), North Frisian neek, neeke, Nak (“neck”), Saterland Frisian Näkke (“neck”), West Frisian nekke (“neck”), Dutch nek (“neck”), German Low German Nack (“neck”), German Nacken (“nape of the neck”), Danish nakke (“neck”), Swedish nacke (“nape of the neck”), Icelandic hnakki (“neck”), Tocharian A kñuk (“neck, nape”). Possibly a mutated variant of *kneug/k (compare Old English hnocc (“hook, penis”), Welsh cnwch (“joint, knob”), Latvian knaūķis (“dwarf”). Doublet of nek. More at nook. Displaced halse (“neck, throat”) and swire (“neck”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "neck (plural necks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The part of the body connecting the head and the trunk found in humans and some animals.",
                  "examples": [
                    "Giraffes have long necks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The corresponding part in some other anatomical contexts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a shirt, dress etc., which fits a person's neck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tapered part of a bottle toward the opening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The slender tubelike extension atop an archegonium, through which the sperm swim to reach the egg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The extension of any stringed instrument on which a fingerboard is mounted",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long narrow tract of land projecting from the main body, or a narrow tract connecting two larger tracts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A reduction in size near the end of an object, formed by a groove around it.",
                  "examples": [
                    "a neck forming the journal of a shaft"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The constriction between the root and crown of a tooth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The gorgerin of a capital.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A volcanic plug, solidified lava filling the vent of an extinct volcano.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) The small part of a gun between the chase and the swell of the muzzle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A person's life.",
                  "examples": [
                    "to risk one's neck; to save someone's neck"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, MLE, slang) A falsehood; a lie.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "neck (third-person singular simple present necks, present participle necking, simple past and past participle necked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To hang by the neck; strangle; kill, eliminate.",
                  "examples": [
                    "Go neck yourself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal, chiefly US) To make love; to intently kiss or cuddle; to canoodle.",
                  "examples": [
                    "Alan and Betty were necking in the back of a car when Betty's dad caught them.",
                    "Synonyms: French kiss, grope, pet, smoodge, snog, snuggle, smooch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To drink rapidly.",
                  "examples": [
                    "Synonym: chug"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To decrease in diameter.",
                  "examples": [
                    "Since this temperature would place the bolt in its creep range, it will slowly stretch, necking down as it does so. Eventually it will get too thin to support the weight, and the bolt will break."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "neck (plural necks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(folklore) A shapeshifting water spirit in Germanic mythology and folklore; a nix.",
                  "examples": [
                    "Synonyms: nix, nixie, nixy"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}