{
  "word": "buster",
  "etymologies": [
    {
      "description": [
        "Originally a dialectal variant of burster; later influenced by bust +‎ -er.",
        "The combining form of the term has appeared from the early 20th century but been especially prolific during three periods: in the 1930s, owing to the success of the radio series Gang Busters; in the 1940s, owing to its appearance as military slang; and in the 1980s, owing to the success of the movie Ghostbusters."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buster (plural busters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly colloquial, with 'of') Someone who or something that bursts, breaks, or destroys a specified thing.",
                  "examples": [
                    "Now death, I pray thee what is it, but a buster of bonds; a destruction of toyle?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly military slang) Forming compounds denoting a team, weapon, or device specialized in the destruction of the first element.",
                  "examples": [
                    "German ‘balloon busters’ attack the Dover barrage."
                  ]
                }
              ]
            },
            {
              "group": "(chiefly colloquial, with 'of') Someone who or something that 'breaks', tames, or overpowers a specified person or thing.",
              "entries": [
                {
                  "meaning": "(US, in particular, dated, slang) A broncobuster.",
                  "examples": [
                    "The buster must be careful to keep well away from sheds and timber."
                  ]
                },
                {
                  "meaning": "(chiefly law enforcement slang) Forming compounds denoting an agent or agency tasked with reducing or eliminating the first element.",
                  "examples": [
                    "Men nicknamed him the ‘Booze Buster’, and cartoonists loved to picture him, revolver in hand,... fighting the demon rum."
                  ]
                }
              ]
            },
            {
              "group": "(dated, slang) Someone or something remarkable, especially for being loud, large, etc..",
              "entries": [
                {
                  "meaning": "(colloquial, variously expressing familiarity, admiration, or hostility) A form of address, particularly of men: guy, dude, fella, mack, buddy, loser. (Originally as 'old buster'.)",
                  "examples": [
                    "That's generous, old buster."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang) A loaf of bread.",
                  "examples": [
                    "Three penny busters, and a whole kit-full of winegar and mustard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang) A drinking spree, a binge.",
                  "examples": [
                    "They were on a buster, and were taken up by the police."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang) A gale, a strong wind; (especially Australia) a southerly buster.",
                  "examples": [
                    "The Buster and Brickfielder: austral red-dust blizzard and red-hot Simoom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia and New Zealand) A heavy fall; (also performing arts) a staged fall, a pratfall.",
                  "examples": [
                    "Dainty... came down ‘a buster’ at the last hurdle, and Scots Grey cantered in by himself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, regional) A molting crab.",
                  "examples": [
                    "In that state he is called a ‘Buster’, bursting his shell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling, slang) A cheat's die whose sides bear only certain combinations of spots, so that undesirable values can never be rolled.",
                  "examples": [
                    "Tops and Bottoms (also Tops, Busters, Ts, Mis-spots): These are the dice used by the professional cheats."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}