{
  "word": "pimp",
  "etymologies": [
    {
      "description": [
        "Origin unknown. Perhaps from French pimpant (“smart, sparkish”) or German Pimpf (“boy, youth, young squirt”). The Old English near-synonym was rendered by Old English forspennend (literally “solicitor”)."
      ],
      "adjectives": [
        {
          "description": "pimp",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) excellent, fashionable, stylish",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pimp (plural pimps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who solicits customers for prostitution and acts as manager for a group of prostitutes; a pander.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, slang) A man who can easily attract women.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pimp (third-person singular simple present pimps, present participle pimping, simple past and past participle pimped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act as a procurer of prostitutes; to pander.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prostitute someone.",
                  "examples": [
                    "The smooth-talking, tall man with heavy gold bracelets claimed he could pimp anyone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, African-American Vernacular, slang) To excessively customize something, especially a vehicle (also pimp out).",
                  "examples": [
                    "You pimped out that motorcycle f'real, dawg."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, medicine, slang) To ask progressively harder and ultimately unanswerable questions of a resident or medical student (said of a senior member of the medical staff).",
                  "examples": [
                    "Only an attending physician can pimp a chief resident; the chief resident and attending can pimp a junior resident; they all three can pimp an intern."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, slang) To promote, to tout.",
                  "examples": [
                    "I gotta show you this sweet website where you can pimp your blog and get more readers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) To persuade, smooth talk or trick another into doing something for your benefit.",
                  "examples": [
                    "I pimped her out of $2,000 and she paid for the entire stay at the Bahamas."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Brythonic numerals, from Proto-Brythonic *pɨmp.",
        "Cognate with Welsh pump, Cornish pymp, Breton pemp. Doublet of five, cinque, punch, and Pompeii."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}