{
  "word": "star",
  "etymologies": [
    {
      "description": [
        "From Middle English sterre, from Old English steorra (“star”), from Proto-West Germanic *sterrō, variant of *sternō, from Proto-Germanic *sternô, *sternǭ (“star”), from Proto-Indo-European *h₂stḗr (“star”). Doublet of aster, stella, étoile, and estoile."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "star (plural stars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any small luminous dot appearing in the cloudless portion of the night sky, especially with a fixed location relative to other such dots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A luminous celestial body, made up of plasma (particularly hydrogen and helium) and having a spherical shape. Depending on context the sun may or may not be included.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A concave polygon with regular, pointy protrusions and indentations, usually with four, five, or six points.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(acting) An actor in a leading role.",
                  "examples": [
                    "Many Hollywood stars attended the launch party."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An exceptionally talented or famous person, often in a specific field; a celebrity.",
                  "examples": [
                    "His teacher tells us he is a star pupil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) An asterisk (*) or symbol (★).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A symbol used to rate hotels, films, etc. with a higher number of stars denoting better quality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A simple dance, or part of a dance, where a group of four dancers each put their right or left hand in the middle and turn around in a circle. You call them right-hand stars or left-hand stars, depending on the hand which is in the middle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) A planet supposed to influence one's destiny.",
                  "examples": [
                    "What's in the stars for you today? Find out in our horoscope."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A star-shaped ornament worn on the breast to indicate rank or honour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A composition of combustible matter used in the heading of rockets, in mines, etc., which, exploding in the air, presents a starlike appearance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "star (third-person singular simple present stars, present participle starring, simple past and past participle starred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To appear as a featured performer or headliner, especially in an entertainment program.",
                  "examples": [
                    "She starred in dozens of silent movies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To feature (a performer or a headliner), especially in a movie or an entertainment program.",
                  "examples": [
                    "The show stars Calista Flockhart as a high-powered lawyer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark with a star or asterisk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set or adorn with stars, or bright, radiating bodies; to bespangle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To shine like a star.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}