{
  "word": "cyclone",
  "etymologies": [
    {
      "description": [
        "Coined by Henry Piddington, probably in the 1840s, and based on some term in Ancient Greek. Sources disagree on the date and on which Ancient Greek term, though it had to be something derived from either κύκλος (kúklos, “circle, wheel”) or κυκλόω (kuklóō, “go around in a circle, form a circle, encircle”), for example the present active participle κυκλῶν (kuklôn). See cycle and wheel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cyclone (plural cyclones)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(broad sense) A weather phenomenon consisting of a system of winds rotating around a center of low atmospheric pressure",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(narrow sense) Such weather phenomenon occurring in the South Pacific and Indian Ocean",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low pressure system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) The more or less violent, small-scale circulations such as tornadoes, waterspouts, and dust devils.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strong wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cyclone separator; the cylindrical vortex tube within such a separator",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cyclone (third-person singular simple present cyclones, present participle cycloning, simple past and past participle cycloned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To separate using a cyclone separator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To storm as a cyclone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To whirl in spirals as a result of a cyclone or whirlwind-like force.",
                  "examples": [
                    "White dust was cycloning at the bottom of ravines that cut for miles into the red flatness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To storm wildly; to be in a frenzy.",
                  "examples": [
                    "Now, all of a sudden, I had to juggle class schedules with study time and assignment deadlines and work hours. It quickly cycloned into a sort of frantic agitation with all-nighters, near misses, and frenzied nerves."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}