{
  "word": "valet",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French valet, from Old French vaslet, from Medieval Latin *vassellittus, diminutive of Late Latin vassallus (“manservant, domestic, retainer”), from vassus (“servant”), from Gaulish *wassos (“young man, squire”), from Proto-Celtic *wastos (“servant”) (compare Old Irish foss and Welsh gwas)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "valet (plural valets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A man's personal male attendant, responsible for his clothes and appearance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hotel employee performing such duties for guests.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(professional wrestling) A female performer in professional wrestling, acting as either a manager or personal chaperone; often used to attract and titillate male members of the audience.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female chaperone who accompanies a man, and is usually not married to him.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A person employed to clean or park cars.",
                  "examples": [
                    "Synonym: parking attendant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person employed to assist the jockey and trainer at a racecourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden stand on which to hold clothes and accessories in preparation for dressing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of goad or stick with an iron point.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "valet (third-person singular simple present valets, present participle valeting, simple past and past participle valeted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To serve (someone) as a valet.",
                  "examples": [
                    "You can valet me, can you? Bother valeting me! I like to put on my own clothes, and brush them, too, when they are on; and if I only knew how to black my own boots, by George I should like to do it!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly UK, Ireland) To clean and service (a car), as a valet does.",
                  "examples": [
                    "He revealed: “We had been through a lot and I decided the car needed to be cleaned out after Georgina had to deliver the baby in the car.",
                    "“You can imagine the scene when I left the car in for valeting. I got some funny looks and I had to explain to the guy that I wasn’t up to anything illegal because it did look a bit like a crime scene.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US) To leave (a car) with a valet to park it.",
                  "examples": [
                    "I asked Giacomo if he ever valeted his car, and he twisted his face into a grimace as he replied, “Rarely, but I have done it. Nervous time.”"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}