{
  "word": "phoenix",
  "etymologies": [
    {
      "description": [
        "From Old English and Old French fenix, from Medieval Latin phenix, from Latin phoenīx, from Ancient Greek φοῖνιξ (phoînix), from Egyptian bnw (boinu, “grey heron”). The grey heron was venerated at Heliopolis and associated in Egypt with the cyclical renewal of life because the bird rises in flight at dawn and migrates back every year in the flood season to inhabit the Nile waters."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "phoenix (plural phoenix or phoenixes or phoenices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mythology) A mythological bird, said to be the only one of its kind, which lives for 500 years and then dies by burning to ashes on a pyre of its own making, ignited by the sun. It then arises anew from the ashes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Anything that is reborn after apparently being destroyed.",
                  "examples": [
                    "Astronomers believe planets might form in this dead star's disk, like the mythical Phoenix rising up out of the ashes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Chinese mythology) A mythological Chinese chimerical bird whose physical body symbolizes the six celestial bodies; a fenghuang.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A Greek silver coin used briefly from 1828 to 1832, divided into 100 lepta.",
                  "examples": [
                    "The national currency, the phoenix, which had been established by Kapodistrias, was renamed after an ancient Greek coin, the drachma."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A marvelous person or thing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "phoenix (third-person singular simple present phoenixes, present participle phoenixing, simple past and past participle phoenixed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) To transfer assets from one company to another to dodge liability",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}