{
  "word": "mantle",
  "etymologies": [
    {
      "description": [
        "From Middle English mantel, from Old English mæntel, mentel (“sleeveless cloak”), from Proto-West Germanic *mantil; later reinforced by Anglo-Norman mantel, both from Latin mantēllum (“covering, cloak”), diminutive of mantum (French manteau, Spanish manto), probably from Gaulish *mantos, *mantalos (“trodden road”), from Proto-Celtic *mantos, *mantlos, from Proto-Indo-European *menH- (“tread, press together; crumble”). Compare Icelandic möttull."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mantle (plural mantles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of clothing somewhat like an open robe or cloak, especially that worn by Orthodox bishops. (Compare mantum.) [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A figurative garment representing authority or status, capable of affording protection.",
                  "examples": [
                    "At the meeting, she finally assumed the mantle of leadership of the party.",
                    "The movement strove to put women under the protective mantle of civil rights laws."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Anything that covers or conceals something else; a cloak. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(malacology) The body wall of a mollusc, from which the shell is secreted. [from 15th c.]",
                  "examples": [
                    "He grasps the female from slightly below about the mid-mantle region and positions himself so his arms are close to the opening of her mantle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) The back of a bird together with the folded wings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The zone of hot gases around a flame.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gauzy fabric impregnated with metal nitrates, used in some kinds of gas and oil lamps and lanterns, which forms a rigid but fragile mesh of metal oxides when heated during initial use and then produces white light from the heat of the flame below it. (So called because it is hung above the lamp's flame like a mantel.) [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The outer wall and casing of a blast furnace, above the hearth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A penstock for a water wheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The cerebral cortex. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) The layer between the Earth's core and crust. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fireplace shelf; Alternative spelling of mantel",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A mantling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mantle (third-person singular simple present mantles, present participle mantling, simple past and past participle mantled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or conceal (something); to cloak; to disguise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become covered or concealed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To spread like a mantle (especially of blood in the face and cheeks when a person flushes).",
                  "examples": [
                    "[…]  and then that coffee! what fragrance it diffused through the room — how the foaming hot cream mantled over it, making discovered country from whose bourne no Master Philip's teeth water,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To climb over or onto something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry) The action of stretching out the wings to hide food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry) The action of stretching a wing and the same side leg out to one side of the body.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}