{
  "word": "spanner",
  "etymologies": [
    {
      "description": [
        "span +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spanner (plural spanners)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, Britain, Ireland) A hand tool for adjusting nuts and bolts; a wrench.",
                  "examples": [
                    "Pass me that spanner, Jake; there's just one more nut to screw in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) One who, or that which, spans.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) A hand tool shaped like a small crank handle, for winding the spring of a wheel lock on a musket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A device in early steam engines for moving the valves for the alternate admission and shutting off of the steam.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A problem, dilemma or obstacle; something unexpected or troublesome (in the phrase spanner in the works)",
                  "examples": [
                    "Halfway through the production of Macbeth, the director found that the stage was smaller than he expected. This really threw a spanner in the works."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Ireland, mildly derogatory) A stupid or unintelligent person; one prone to making mistakes, especially in language.",
                  "examples": [
                    "You spanner, Rodney! I wanted some time, not a bunch of thyme!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spanner (third-person singular simple present spanners, present participle spannering, simple past and past participle spannered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use a spanner; to fix with a spanner",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}