{
  "word": "natural",
  "etymologies": [
    {
      "description": [
        "From Middle English natural, borrowed from Old French natural, naturel, from Latin nātūrālis, from nātus, the perfect participle of nāscor (“be born”, verb)."
      ],
      "adjectives": [
        {
          "description": "natural (comparative more natural, superlative most natural)",
          "definitionGroups": [
            {
              "group": "Existing in nature.",
              "entries": [
                {
                  "meaning": "Existing in the nature of a person or thing; innate, not acquired or learned. [from 14th c.]",
                  "examples": [
                    "A South African Uber driver is causing excitement with his impressive operatic singing but, however much natural talent you have, it is a long road to La Scala."
                  ]
                },
                {
                  "meaning": "Normally associated with a particular person or thing; inherently related to the nature of a thing or creature. [from 14th c.]",
                  "examples": [
                    "The species will be under threat if its natural habitat is destroyed."
                  ]
                },
                {
                  "meaning": "As expected; reasonable, normal; naturally arising from the given circumstances. [from 14th c.]",
                  "examples": [
                    "It's natural for business to be slow on Tuesdays.",
                    "His prison sentence was the natural consequence of a life of crime."
                  ]
                },
                {
                  "meaning": "Formed by nature; not manufactured or created by artificial processes. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "Pertaining to death brought about by disease or old age, rather than by violence, accident etc. [from 16th c.]",
                  "examples": [
                    "She died of natural causes."
                  ]
                },
                {
                  "meaning": "Having an innate ability to fill a given role or profession, or display a specified character. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(mathematics) Designating a standard trigonometric function  of an angle, as opposed to the logarithmic function. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(music) Neither sharp nor flat. Denoted ♮. [from 18th c.]",
                  "examples": [
                    "There's a wrong note here: it should be C natural instead of C sharp."
                  ]
                },
                {
                  "meaning": "Containing no artificial or man-made additives; especially (of food) containing no colourings, flavourings or preservatives. [from 19th c.]",
                  "examples": [
                    "Natural food is healthier than processed food."
                  ]
                },
                {
                  "meaning": "Pertaining to a decoration that preserves or enhances the appearance of the original material; not stained or artificially coloured. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "Pertaining to a fabric still in its undyed state, or to the colour of undyed fabric. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(dice games) Pertaining to a dice roll before bonuses or penalties have been applied to the result.",
                  "examples": []
                },
                {
                  "meaning": "(bodybuilding) Not having used anabolic steroids or other performance-enhancing drugs.",
                  "examples": [
                    "Antonym: enhanced"
                  ]
                },
                {
                  "meaning": "(bridge) Bidding in an intuitive way that reflects one's actual hand.",
                  "examples": [
                    "Antonym: artificial"
                  ]
                },
                {
                  "meaning": "(algebra) Closed under submodules, direct sums, and injective hulls.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Pertaining to birth or descent; native.",
              "entries": [
                {
                  "meaning": "Having a given status (especially of authority) by virtue of birth. [14th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "Related genetically but not legally to  one's father; born out of wedlock, illegitimate. [from 15th c.]",
                  "examples": [
                    "[M]y Mother was the natural Daughter of a Scotch Peer by an italian Opera-girl  […] ."
                  ]
                },
                {
                  "meaning": "Related by birth; genetically related. [from 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "natural (comparative more natural, superlative most natural)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, dialect) Naturally; in a natural manner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "natural (plural naturals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A native inhabitant of a place, country etc. [from 16th c.]",
                  "examples": [
                    "I coniecture and assure my selfe that yee cannot be ignorant by what meanes this peace hath bin thus happily both for our proceedings and the welfare of the Naturals concluded  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A note that is not or is no longer to be modified by an accidental. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The symbol ♮ used to indicate such a natural note.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One with an innate talent at or for something. [from 18th c.]",
                  "examples": [
                    "He's a natural on the saxophone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An almost white colour, with tints of grey, yellow or brown; originally that of natural fabric. [from 20th c.]",
                  "examples": [
                    "natural:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) One with a simple mind; a fool or idiot.",
                  "examples": [
                    "Synonym: half-natural"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, chiefly UK) One's life.",
                  "examples": [
                    "‘Sergeant-Major Robinson came in in the middle of it, and you've never seen a man look more surprised in your natural.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial) A hairstyle for people with Afro-textured hair in which the hair is not straightened or otherwise treated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly in plural) A breast which has not been modified.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bodybuilding) Someone who has not used anabolic steroids or other performance-enhancing drugs.",
                  "examples": [
                    "Synonym: natty"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(craps) A roll of two dice with a score of 7 or 11 on the comeout roll.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}