{
  "word": "climacteric",
  "etymologies": [
    {
      "description": [
        "From Latin clīmactēricus, from Koine Greek κλιμακτηρικός (klimaktērikós, “scale, progression, gradation”), from κλιμακτήρ (klimaktḗr)."
      ],
      "adjectives": [
        {
          "description": "climacteric (comparative more climacteric, superlative most climacteric)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to any of several supposedly critical years of a person's life. [from 17th c.]",
                  "examples": [
                    "Closely parallel to the belief in unlucky days was the notion of climacteric years, those periodic dates in a man's life which were potential turning-points in his health and fortune."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Critical or crucial; decisive. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Relating to a period of physiological change during middle age; especially, menopausal. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Climactic. [from 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "climacteric (plural climacterics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A critical stage or decisive point; a turning point. [from 17th c.]",
                  "examples": [
                    "[H]e was in his grand climacterick, with a florid brow, and a step like youthful agility. Sigourney, Lydia."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period in human life in which some great change is supposed to take place, calculated in different ways by different authorities (often identified as every seventh or ninth year). [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The period of life that leads up to and follows the end of menstruation in women; the menopause. [from 18th c.]",
                  "examples": [
                    "Once women have traversed the turmoil of the climacteric years and reached the hormonal steady-state of the post-menopause, there is almost certainly no increase in the incidence of depression."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}