{
  "word": "turkey",
  "etymologies": [
    {
      "description": [
        "Clipping of turkey-cock and turkey-hen (“(originally) the guinea fowl (family Numididae)”), which was imported to Europe by Turkey merchants through Turkey. The word was then applied to the larger northern American bird Meleagris gallopavo which was brought to Spain by conquistadors in 1523. This transfer of the name may have occurred because the two birds were considered similar to each other, or because the North American turkey was in part introduced through Ottoman territories, or simply to indicate that it was foreign."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "turkey (plural turkeys or turkies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, originally, now obsolete) The guinea fowl (family Numididae). [from c. 1600]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A bird in the genus Meleagris with a fan-shaped tail and wattled neck, especially the wild turkey (Meleagris gallopavo, now domesticated).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The flesh or meat of this bird eaten as food.",
                  "examples": [
                    "All week after Thanksgiving, I had turkey sandwiches for lunch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) With a distinguishing word: a bird resembling the Meleagris gallopavo (for example, the brush turkey or bush turkey (Alectura lathami), and the water turkey (Anhinga anhinga)).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, bowling) An act of throwing three strikes in a row.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, medicine, slang, derogatory) A patient feigning symptoms; a person faking illness or injury; a malingerer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Australia, US, slang, dated) A pack carried by a lumberman; a bindle; also, a large travel bag, a suitcase. [from early 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, slang) A failure.",
                  "examples": [
                    "Synonym: flop",
                    "That film was a turkey."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, slang, usually mildly derogatory) A foolish or inept person.",
                  "examples": [
                    "Synonyms: see Thesaurus:idiot",
                    "The turkey cut in front of me and then berated me for running into him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}