{
  "word": "particularity",
  "etymologies": [
    {
      "description": [
        "From Middle French particularité (“part of a whole; something particular, particularity”) (modern French particularité), and from its etymon Late Latin particularitas (“fact or quality of being particular; something particular, particularity”), from Latin particulāris (“particular; partial”) + -tās (suffix forming feminine abstract nouns indicating a state of being). Particulāris is derived from particula (“particle, small part”) (from pars (“a part, piece, portion, share”) (probably ultimately from Proto-Indo-European *per- (“to sell; to go through; to carry forth, fare”)) + -cula (diminutive suffix)) + -āris (suffix denoting a relationship, forming adjectives). The English word is analysable as particular +‎ -ity (suffix forming nouns from adjectives, referring to the properties, qualities, or states of what is denoted by the adjectives)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "particularity (countable and uncountable, plural particularities)",
          "definitionGroups": [
            {
              "group": "(countable)",
              "entries": [
                {
                  "meaning": "A particular thing.",
                  "examples": [
                    "Synonym: (noun) particular"
                  ]
                },
                {
                  "meaning": "A distinctive characteristic or quality; a peculiarity.",
                  "examples": [
                    "Synonyms: differentia, discrimen",
                    "Donny’s obsession for trains is just a harmless particularity of his."
                  ]
                },
                {
                  "meaning": "(obsolete) A particular case or matter.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(uncountable)",
              "entries": [
                {
                  "meaning": "The condition of being particular rather than general or universal; specificity.",
                  "examples": [
                    "Synonyms: particularness; see also Thesaurus:specificity",
                    "Antonyms: see Thesaurus:genericity"
                  ]
                },
                {
                  "meaning": "(Christianity, theology) The doctrine of the incarnation of God as Jesus occurring at a particular place and time.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity, Judaism, theology, obsolete) Synonym of particularism (“the principle that only certain people are chosen by God for salvation”)",
                  "examples": []
                },
                {
                  "meaning": "Attention to detail; fastidiousness.",
                  "examples": [
                    "Synonym: scrupulousness"
                  ]
                },
                {
                  "meaning": "(obsolete)",
                  "examples": [
                    "Synonym: distinction"
                  ]
                },
                {
                  "meaning": "The condition of being special; peculiarity, specialness.",
                  "examples": [
                    "Synonym: distinction"
                  ]
                },
                {
                  "meaning": "The condition of being special in an unexpected way; oddness, strangeness; (countable) an instance of this.",
                  "examples": [
                    "Synonyms: oddity, singularity"
                  ]
                },
                {
                  "meaning": "The paying of particular close attention to someone; (countable) an instance of this.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}