{
  "word": "guerrilla",
  "etymologies": [
    {
      "description": [
        "From Spanish guerrilla, diminutive of guerra (“war”), coined during the Peninsular War."
      ],
      "adjectives": [
        {
          "description": "guerrilla (comparative more guerrilla, superlative most guerrilla)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) Relating to, using, or typical of guerrilla warfare, or its principles of small independent or non-official perpetrators.",
                  "examples": [
                    "Wherever Nicholson was most wanted, there he was sure to be found. What his life was at this time may be seen from a letter he wrote to his mother: 'I am leading a very guerrilla sort of life with seven hundred horse and foot raised among the people of the country. The chieftain who is in rebellion has eight regular regiments and sixteen guns, so that I am unable to meet them openly in the field.'"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marketing) Relating to, using, or typical of guerrilla marketing.",
                  "examples": [
                    "We took a very guerrilla approach to marketing Goin' Hollywood, in keeping with the irreverent tone of the game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Using unconventional, non-traditional, non-mainstream and often subversive practices to achieve something.",
                  "examples": [
                    "guerrilla marketing",
                    "guerrilla tourism",
                    "guerrilla gardening"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "guerrilla (plural guerrillas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A soldier in a small independent group, fighting against the government or regular forces by surprise raids.",
                  "examples": [
                    "The right-wing paramilitary's offensive against the Marxist guerrillas failed because they did not know the terrain well enough."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A non-official war carried out by small independent groups; a guerrilla war.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}