{
  "word": "flipper",
  "etymologies": [
    {
      "description": [
        "From flip +‎ -er. Compare Saterland Frisian Flappert (“flipper, wing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flipper (plural flippers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In marine mammals such as whales, a wide flat limb, adapted for swimming.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat, wide, paddle-like rubber covering for the foot, used in swimming.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat lever in a pinball machine, triggered by the player to strike the ball and keep it in play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A small flat used to support a larger one.",
                  "examples": [
                    "The flipper is designed to give support by standing at a 90-degree angle to the flat. It probably gets its name from its appearance: cut out like a piece of profile scenery, it resembles the flipper of a marine animal,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A type of ball bowled by a leg spin bowler, which spins backwards and skids off the pitch with a low bounce.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, US) Television remote control, clicker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang) The hand.",
                  "examples": [
                    "Give me your flipper, old man, and tell me if I can be of any service to you. I'll do what you want at all hazards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dentistry) A kind of false tooth, usually temporary.",
                  "examples": [
                    "Dr. Woo attempts to distinguish Blakeslee by pointing out that “one can fondle a breast without having anything to do with dentistry, but one cannot take molds, fabricate and insert flippers into another person's mouth without practicing dentistry.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kitchen spatula.",
                  "examples": [
                    "Remember the mornings when you help me fix eggs and pancakes for breakfast. You always had to use the “flipper” to turn the pancakes and eggs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who flips, in the sense of buying a house or other asset and selling it quickly for profit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who flips in any other sense, for example throwing a coin.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flipper (third-person singular simple present flippers, present participle flippering, simple past and past participle flippered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lift one or both flippers out of the water and slap the surface of the water.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}