{
  "word": "redargue",
  "etymologies": [
    {
      "description": [
        "From Late Middle English redarguen, redargue (“to defeat (someone) in an argument; to rebuke, reprove”), from Middle French redarguer and Old French redargüer (“to disprove, refute; to accuse, blame; to rebuke, reprove”) (modern French rédarguer), and from their etymon Latin redarguere (“to disprove, refute”) (compare Late Latin redarguere (“to rebuke, reprove”)), the present active infinitive of redarguō (“to disprove, refute; to contradict”), from red- (a variant of re- (prefix meaning ‘again’)) + arguō (“to assert, declare; to clarify, make plain; to prove, show; to accuse, charge with; to censure, rebuke, reprove; to blame; to denounce as false”) (possibly ultimately from Proto-Indo-European *h₂erǵ- (“argent, white; glittering”), in the sense of casting light on something to make it clear). Doublet of argue."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "redargue (third-person singular simple present redargues, present participle redarguing, simple past and past participle redargued)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(obsolete except Scotland, law)",
                  "examples": [
                    "Synonym: counterargue"
                  ]
                },
                {
                  "meaning": "To disprove or refute (someone) in an argument.",
                  "examples": []
                },
                {
                  "meaning": "To rebut or refute (an argument, a proposition, etc.).",
                  "examples": [
                    "Synonym: counterargue"
                  ]
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "Often followed by for or of: to censure, to rebuke, to reprove (someone or something).",
                  "examples": []
                },
                {
                  "meaning": "(rare) To argue (a case, proposition, etc.) against someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To present a disproof or refutation of an argument, a person, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}