{
  "word": "resume",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman resumer, Middle French resumer, from Latin resumere, from re- + sumere (“to take”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "resume (third-person singular simple present resumes, present participle resuming, simple past and past participle resumed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To take back possession of (something). [from 15th c.]",
                  "examples": [
                    "For after that initiation it was impossible to attach any profound importance to the notion of dying. All individual deaths had been resumed by the death of God!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To summarise. [from 15th c.]",
                  "examples": [
                    "He  […]  used to say that each separate death had taught him something new about death, and that he was going to resume this knowledge in a philosophic essay about dying."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To start (something) again that has been stopped or paused from the point at which it was stopped or paused; continue, carry on. [from 15th c.]",
                  "examples": [
                    "Antonym: suspend",
                    "We will resume this discussion tomorrow at nine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To start again after an interruption or pause.",
                  "examples": [
                    "Normal service has resumed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French résumé, past participle of résumer (“to summarize”), from Latin resūmere (“to take back”); compare resume."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "resume (plural resumes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A summary or synopsis. [from 18th c.]",
                  "examples": [
                    "Synonym: précis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US, Australia) A summary or account of education and employment experiences and qualifications; a curriculum vitae (often for presentation to a potential future employer when applying for a job). [from 20th c.]",
                  "examples": [
                    "Synonyms: curriculum vitae, CV"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}