{
  "word": "axiom",
  "etymologies": [
    {
      "description": [
        "From Middle French axiome in the 15th century, from Latin axiōma (“axiom; principle”), from Ancient Greek ἀξίωμα (axíōma, “that which is thought to fit, a requisite, that which a pupil is required to know beforehand, a self-evident principle”), from ἀξιόω (axióō, “to think fit or worthy, to require, to demand”), from ἄξιος (áxios, “fit, worthy”, literally “weighing as much as; of like value”), from ἄγω (ágō, “to weigh (down)”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "axiom (plural axioms or axiomata) (the latter is becoming less common and is sometimes considered archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) A seemingly self-evident or necessary truth which is based on assumption; a principle or proposition which cannot actually be proved or disproved.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic, mathematics, proof theory) A fundamental assumption that serves as a basis for deduction of theorems; a postulate (sometimes distinguished from postulates as being universally applicable, whereas postulates are particular to a certain science or context).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An established principle in some artistic practice or science that is universally received.",
                  "examples": [
                    "The axioms of political economy cannot be considered absolute truths."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}