{
  "word": "canister",
  "etymologies": [
    {
      "description": [
        "From Middle English canister, canustyr, a borrowing from Latin canistrum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "canister (plural canisters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cylindrical or rectangular container usually of lightweight metal, plastic, or laminated pasteboard used for holding a dry product (as tea, crackers, flour, matches).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various cylindrical metal receptacles usually with a removable close-fitting top.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A special short-range antipersonnel projectile consisting of a casing of light metal, loaded with preformed submissiles such as flechettes or steel balls. The casing is designed to open just beyond the muzzle of the weapon, dispersing the submissiles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A projectile component containing colored or screening smoke or riot control agent composition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A component of canister-type protective masks containing a mechanical filter and chemical filling to filter, neutralize and/or absorb toxic chemical, biological and radiological agents.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Part of a windmill that connects the sails to the windshaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing, slang, archaic) A person's head.",
                  "examples": [
                    "Caunt let fly left and right, but Bendy ducked his canister, and got down with more caution than gallantry."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "canister (third-person singular simple present canisters, present participle canistering, simple past and past participle canistered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pack into a canister.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}