{
  "word": "cosmopolite",
  "etymologies": [
    {
      "description": [
        "Borrowed from French cosmopolite from Latin cosmopolītēs from Koine Greek κοσμοπολίτης (kosmopolítēs, “citizen of the world”), from Ancient Greek κόσμος (kósmos, “world”) + πολίτης (polítēs, “citizen”)."
      ],
      "adjectives": [
        {
          "description": "cosmopolite (comparative more cosmopolite, superlative most cosmopolite)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to cosmopolites; cosmopolitan.",
                  "examples": [
                    "International necessities are rapidly breaking down old prejudices and conservatisms, while developing cosmopolite feeling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(communication) Oriented, exposed to or open to ideas and influences outside one's own social system or group.",
                  "examples": [
                    "Early adopters tend to be better educated, enjoy higher social status, occupy positions in organizations of greater size and resources, consume higher levels of information from mass media communications, and are more cosmopolite than their later adopting counterparts. An individual or organization that is more cosmopolite is one that seeks and receives higher levels of exposure and exchange with individuals and organizations outside of their specific social system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Distributed throughout the world; having a wide geographical distribution.",
                  "examples": [
                    "If, however, we consider the Australian dingo as a native animal, we might class the genus Canis as cosmopolite, but the wild dogs of South America are now formed into separate genera by some naturalists."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cosmopolite (plural cosmopolites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is at home in every place; a citizen of the world; a cosmopolitan person.",
                  "examples": [
                    "First drink a health, this solemn night, / A health to England, every guest: / That man’s the best cosmopolite / Who loves his native country best."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) The butterfly painted lady (Vanessa cardui).",
                  "examples": [
                    "Synonym: cosmopolitan"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}