{
  "word": "contemplative",
  "etymologies": [
    {
      "description": [
        "From Old French contemplatif, from the participle stem of Latin contemplāre."
      ],
      "adjectives": [
        {
          "description": "contemplative (comparative more contemplative, superlative most contemplative)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Inclined to contemplate; introspective and thoughtful; meditative.",
                  "examples": [
                    "Compared with the greatest poets, he may be said to be the poet of unpoetical natures, possessed of quiet and contemplative tastes. But unpoetical natures are precisely those which require poetic cultivation. This cultivation Wordsworth is much more fitted to give, than poets who are intrinsically far more poets than he."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to a religious contemplative, or a contemplative religious orders, especially the Roman Catholic varieties.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to, or having the power of, contemplation.",
                  "examples": [
                    "contemplative faculties"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, psychiatry) In a phase of mental activity in which one begins to recognize and acknowledge the maladaptiveness of someone's behavior (such as own's own, or that of a family member or friend); usually with reference to substance use.",
                  "examples": [
                    "Coordinate term: precontemplative"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "contemplative (plural contemplatives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who has dedicated themselves to religious or philosophical contemplation.",
                  "examples": [
                    "The contemplative must not expect exotic feelings, visions or heavenly voices; these did not come from God but from his own fevered imagination and would merely distract him from his true objective [...]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}