{
  "word": "gale",
  "etymologies": [
    {
      "description": [
        "From Middle English galen, from Old English galan (“to sing, enchant, call, cry, scream; sing charms, practice incantation”), from Proto-Germanic *galaną (“to roop, sing, charm”), from Proto-Indo-European *gʰel- (“to shout, scream, charm away”). Cognate with Danish gale (“to crow”), Swedish gala (“to crow”), Icelandic gala (“to sing, chant, crow”), Dutch galm (“echo, sound, noise”). Related to yell."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "gale (third-person singular simple present gales, present participle galing, simple past galed or gole, past participle galed or galen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now chiefly dialectal) To sing; charm; enchant.",
                  "examples": [
                    "Can he cry and gale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now chiefly dialectal) To cry; groan; croak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a person, now chiefly dialectal) To talk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a bird, Scotland) To call.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now chiefly dialectal) To sing; utter with musical modulations.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gale (“a wind, breeze”), probably of North Germanic origin, related to Icelandic gola (“a breeze”), Danish gal (“furious, mad”), both from Old Norse gala (“to sing”), and thus ultimately related to the above word (etymology 1)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gale (plural gales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) A very strong wind, more than a breeze, less than a storm; number 7 through to 9 winds on the 12-step Beaufort scale.",
                  "examples": [
                    "It's blowing a gale outside.",
                    "Many parts of the boat were damaged in the gale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An outburst, especially of laughter.",
                  "examples": [
                    "a gale of laughter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary, archaic) A light breeze.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gale (third-person singular simple present gales, present participle galing, simple past and past participle galed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To sail, or sail fast.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gaile, gawl, gawwyl, gaȝel, gagel, from Old English gagel, gagelle, gagille, gagolle (“gale; sweet gale”), from Proto-Germanic *gagulaz (“gale; sweet-willow”). Cognate with Scots gaul, gall (“bog-myrtle”), Dutch gagel (“wild mytle”), German Gagel (“mytle-bush”), Icelandic gaglviður (“sweet-gale; myrtle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gale",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shrub, also called sweet gale or bog myrtle (Myrica gale), that grows on moors and fens.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gavel (“rent; tribute”), from Old English gafol."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gale (plural gales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A periodic payment, such as is made of a rent or annuity.",
                  "examples": [
                    "Gale day - the day on which rent or interest is due."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}