{
  "word": "lip",
  "etymologies": [
    {
      "description": [
        "From Middle English lippe, from Old English lippa, lippe (“lip”), from Proto-West Germanic *lippjō (“lip”), from Proto-Germanic *lepô, from Proto-Indo-European *leb- (“to hang loosely, droop, sag”).",
        "Cognate with West Frisian lippe (“lip”), Dutch lip (“lip”), German Lippe and Lefze (“lip”), Swedish läpp (“lip”), Norwegian leppe (“lip”), Latin labium (“lip”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lip (countable and uncountable, plural lips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Either of the two fleshy protrusions around the opening of the mouth.",
                  "examples": [
                    "Synonym: labium"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A part of the body that resembles a lip, such as the edge of a wound or the labia.",
                  "examples": [
                    "Synonym: labium"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, countable) The projecting rim of an open container; a short open spout.",
                  "examples": [
                    "Synonyms: edge, rim, spout"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Backtalk; verbal impertinence.",
                  "examples": [
                    "Synonyms: backchat, cheek (informal), impudence, rudeness",
                    "Don’t give me any lip!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The edge of a high spot of land.",
                  "examples": [
                    "We landed at the head of Garden Island, which is situated near the middle of the river and on the lip of the Falls. On reaching that lip, and peering over the giddy height, the wondrous and unique character of the magnificent cascade at once burst upon us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sharp cutting edge on the end of an auger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) One of the two opposite divisions of a labiate corolla.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The distinctive petal of the Orchis family.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) One of the edges of the aperture of a univalve shell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, colloquial) Embouchure: the condition or strength of a wind instrumentalist's lips.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lip (third-person singular simple present lips, present participle lipping, simple past and past participle lipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch or grasp with the lips; to kiss; to lap the lips against (something).",
                  "examples": [
                    "Our love was like the bright snow-flakes,",
                    "Which melt before you pass,",
                    "Or the bubble on the wine which breaks",
                    "Before you lip the glass;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) (of something inanimate) To touch lightly.",
                  "examples": [
                    "He moved the boat onward very slowly, lipping the glossy surface delicately with the light oars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To wash against a surface, lap.",
                  "examples": [
                    "It was very soothing and restful up there on the saloon deck, with no sound but the gentle lipping of the water as it rippled against the sides of the steamer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rise or flow up to or over the edge of something.",
                  "examples": [
                    "Below, the swollen Eden, lipping full from bank to bank, rolled yellow and surly to the sea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form the rim, edge or margin of something.",
                  "examples": [
                    "[…]  old Macrae, of Adrfeulan Farm near by, had caused rude steps to be cut in the funnel-like hollow rising sheer up from the sloping ledge that lipped the chasm and reached the summit of the scaur."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To utter verbally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To simulate speech by moving the lips without making any sound; to mouth.",
                  "examples": [
                    "And as he read, lipping the words, he thought of his own boyhood  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) To make a golf ball hit the lip of the cup, without dropping in.",
                  "examples": [
                    "“I shall find the ball to the left of a patch of sword grass near the hole,” he said. “My second will lip the hole, I know it as well as if I could see the whole thing.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To change the sound of (a musical note played on a wind instrument) by moving or tensing the lips.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}