{
  "word": "calypso",
  "etymologies": [
    {
      "description": [
        "Originally Trinidad English, an alteration of kaiso, perhaps ultimately of African origin; Allsopp 1996 suggests Ibibio ka iso (“come on”), used to urge dancers on. The spelling reflects a later folk-etymological assimilation with the mythological name Calypso."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "calypso (countable and uncountable, plural calypsos or calypsoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A style of Caribbean music that originated in Trinidad and Tobago during the early to the mid-19th century and spread to the rest of the Caribbean Antilles and Venezuela by the mid-20th century. Its rhythms can be traced back to West African Kaiso and the arrival of French planters and their slaves from the French Antilles in the 18th century.",
                  "examples": [
                    "'How you does live, Mr. Wordsworth?' I asked him one day.\nHe said, 'You mean how I get money?'When I nodded, he laughed in a crooked way.He said, 'I sing calypsoes in the calypso season.''And that last you the rest of the year?''It is enough.'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "calypso (third-person singular simple present calypsos, present participle calypsoing, simple past and past participle calypsoed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To perform calypso.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin, itself from Ancient Greek Καλυψώ (Kalupsṓ, “name of a sea nymph”)",
        "Wikispecies"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "calypso (countable and uncountable, plural calypsos or calypsoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bulbous bog orchid of the genus Calypso, Calypso bulbosa",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light blue color.",
                  "examples": [
                    "calypso:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}