{
  "word": "place",
  "etymologies": [
    {
      "description": [
        "From Middle English place, conflation of Old English plæse, plætse, plæċe (“place, an open space, street”) and Old French place (“place, an open space”), both from Latin platea (“plaza, wide street”), from Ancient Greek πλατεῖα (plateîa), shortening of πλατεῖα ὁδός (plateîa hodós, “broad way”), from Proto-Indo-European *pleth₂- (“to spread”), extended form of *pleh₂- (“flat”). Displaced native Old English stōw. Compare also English pleck (“plot of ground”), West Frisian plak (“place, spot, location”), Dutch plek (“place, spot, patch”). Doublet of piatza, piazza, and plaza."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "place (countable and uncountable, plural places)",
          "definitionGroups": [
            {
              "group": "(physical) An area; somewhere within an area.",
              "entries": [
                {
                  "meaning": "An open space, particularly a city square, market square, or courtyard.",
                  "examples": []
                },
                {
                  "meaning": "(often in street names or addresses) A street, sometimes but not always surrounding a public place, square, or plaza of the same name.",
                  "examples": [
                    "They live at Westminster Place."
                  ]
                },
                {
                  "meaning": "An inhabited area: a village, town, or city.",
                  "examples": []
                },
                {
                  "meaning": "Any area of the earth: a region.",
                  "examples": [
                    "He is going back to his native place on vacation."
                  ]
                },
                {
                  "meaning": "The area one occupies, particularly somewhere to sit.",
                  "examples": [
                    "We asked the restaurant to give us a table with three places."
                  ]
                },
                {
                  "meaning": "The area where one lives: one's home, formerly (chiefly) country estates and farms.",
                  "examples": [
                    "Do you want to come over to my place later?"
                  ]
                },
                {
                  "meaning": "An area of the body, especially the skin.",
                  "examples": [
                    "Which place hurts the most?"
                  ]
                },
                {
                  "meaning": "(euphemistic slang) An area to urinate and defecate: an outhouse or lavatory.",
                  "examples": [
                    "Place,... (2) a jakes, or house of ease."
                  ]
                },
                {
                  "meaning": "(obsolete) An area to fight: a battlefield or the contested ground in a battle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A location or position in space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular location in a book or document, particularly the current location of a reader.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A passage or extract from a book or document.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rhetoric) A topic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A state of mind.",
                  "examples": [
                    "I'm in a strange place at the moment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, obsolete) A chess position; a square of the chessboard.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(social) A responsibility or position in an organization.",
              "entries": [
                {
                  "meaning": "A role or purpose; a station.",
                  "examples": [
                    "It is really not my place to say what is right and wrong in this case."
                  ]
                },
                {
                  "meaning": "The position of a contestant in a competition.",
                  "examples": [
                    "We thought we would win but only ended up in fourth place."
                  ]
                },
                {
                  "meaning": "(horse-racing) The position of first, second, or third at the finish, especially the second position.",
                  "examples": [
                    "to win a bet on a horse for place"
                  ]
                },
                {
                  "meaning": "The position as a member of a sports team.",
                  "examples": [
                    "He lost his place in the national team."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A fortified position: a fortress, citadel, or walled town.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Numerically, the column counting a certain quantity.",
                  "examples": [
                    "three decimal places;  the hundreds place"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ordinal relation; position in the order of proceeding.",
                  "examples": [
                    "That's what I said in the first place!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Reception; effect; implying the making room for.",
                  "examples": [
                    "My word hath no place in you."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English placen, from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "place (third-person singular simple present places, present participle placing, simple past and past participle placed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put (an object or person) in a specific location.",
                  "examples": [
                    "He placed the glass on the table."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive) To earn a given spot in a competition.",
              "entries": [
                {
                  "meaning": "(intransitive, racing) To finish second, especially of horses or dogs.",
                  "examples": [
                    "In the third race: Aces Up won, paying eight dollars; Blarney Stone placed, paying three dollars; and Cinnamon showed, paying five dollars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, passive) To rank at (a certain position, often followed by an ordinal) as in a horse race.",
                  "examples": [
                    "Run Ragged was placed fourth in the race."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remember where and when (an object or person) has been previously encountered.",
                  "examples": [
                    "I've seen him before, but I can't quite place where."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sing (a note) with the correct pitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To arrange for or to make (a bet).",
                  "examples": [
                    "I placed ten dollars on the Lakers beating the Bulls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To establish a call (connection by telephone or similar).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To recruit or match an appropriate person for a job, or a home for an animal for adoption, etc.",
                  "examples": [
                    "They phoned hoping to place her in the management team."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, transitive) To place-kick (a goal).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}