{
  "word": "freshen",
  "etymologies": [
    {
      "description": [
        "From fresh +‎ -en."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "freshen (third-person singular simple present freshens, present participle freshening, simple past and past participle freshened)",
          "definitionGroups": [
            {
              "group": "(intransitive) To become fresh.",
              "entries": [
                {
                  "meaning": "To be refreshed.",
                  "examples": [
                    "Ah, how my spirit freshens, as I taste",
                    "That life-restoring breeze!"
                  ]
                },
                {
                  "meaning": "To become cool.",
                  "examples": [
                    "They breed, says M. Deshayes, in the heats of autumn, and during the freshening air of winter, at St. Domingo [...]"
                  ]
                },
                {
                  "meaning": "(of water) To become not salty, to lose its salinity.",
                  "examples": [
                    "He coasted along the American Continent from the 60th degree of northern latitude, till he fell in with the Gulph of St. Lawrence, which he continued to navigate till he perceived the water to freshen;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of wind) To become stronger.",
                  "examples": [
                    "[...] the wind freshen’d, and carryed our Maintop-mast by the board; in which disaster, the man that was lower-most, and least in danger, fell over-board, and was drowned;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive, of a cow) To begin or resume giving milk, especially after calving; to cause to resume giving milk.",
                  "examples": [
                    "For Sale—Three registered holstein cows. Due to freshen the first of Jan. February and March. Prices that will sell. Age three and five years. Eugune Gibson, Smyrna."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To make fresh.",
              "entries": [
                {
                  "meaning": "To refresh; to revive; to renew.",
                  "examples": [
                    "[...] the good Druid went to seeke out some hearbs by the bank sides, which he knew were good to be applyed unto my wounds, and which would a little freshen and invigorate my spirits;"
                  ]
                },
                {
                  "meaning": "To make cool.",
                  "examples": [
                    "[...] Natal, the glorious green country on the coast, lush, forested, watered, warm in the bitterest winter, in the summer freshened by breezes off the sea or the high mountains that bounded it inland."
                  ]
                },
                {
                  "meaning": "To make green (vegetation that has become dry).",
                  "examples": [
                    "[The animals] were not valuable enough to be worth the trouble of saving until rain came to fill the holes and freshen the pastures."
                  ]
                },
                {
                  "meaning": "To remove or cover unpleasant qualities such as staleness, bad odour or taste (in air, breath, water, etc.).",
                  "examples": [
                    "[...] from the earliest time that he could remember, there had lain pleasantly in the end of his nose the various scents of mint—used to freshen the water in the ewers—or of basil, camomile, fennel, hysop and lavender—which he had been taught to strew on the rushy floors [...]"
                  ]
                },
                {
                  "meaning": "To touch up (makeup); to give (a body part, especially the face) a quick wash.",
                  "examples": [
                    "It was after seven, she was freshening her lipstick and perking up her appearance [...]"
                  ]
                },
                {
                  "meaning": "To touch up the paint on (something).",
                  "examples": [
                    "In staging the school’s Christmas play the whole town helped or meddled: older men repaired the platform, assembled the crib; young ones fashioned new innkeepers and freshened the masks with paint."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give redness to (the face or cheeks of a person with light skin).",
                  "examples": [
                    "‘Might copper beech trees mark the route?’ suggested Adelaide, her dumpling countenance freshened by the excitement this thought induced."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make less salty; to separate, as water, from saline ingredients.",
                  "examples": [
                    "to freshen water, fish, or flesh"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To relieve, as a rope, by change of place where friction wears it; or to renew, as the material used to prevent chafing.",
                  "examples": [
                    "to freshen a hawse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To top up (a drink).",
                  "examples": [
                    "She dried her eyes and blew her nose and picked up her drink. ¶ Cass stared at her helplessly. “Let me freshen it for you,” she said, and took the glass into the kitchen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, historical) To top up (primer) in a firearm.",
                  "examples": [
                    "She pushed her tomahawk and fighting knife into the back of her belt, opened her powder horn and freshened the priming in her rifle and pistols [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}