{
  "word": "helm",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English helm, helme (“tiller of a ship”), from Old English helma (“helm, tiller”), from Proto-Germanic *helmô (“handle; helm, tiller”), ultimately from Proto-Indo-European *ḱel- (“to cover”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "helm (plural helms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The tiller (or, in a large ship, the wheel) which is used to control the rudder of a marine vessel; also, the entire steering apparatus of a vessel.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(nautical) The use of a helm (sense 1); also, the amount of space through which a helm is turned.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) The member of a vessel's crew in charge of steering the vessel; a helmsman or helmswoman.",
                  "examples": [
                    "Synonym: (rare) helmsperson"
                  ]
                },
                {
                  "meaning": "Something used to control or steer; also (obsolete), a handle of a tool or weapon; a haft, a helve.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "A position of control or leadership.",
                  "examples": [
                    "the helm of the Commonwealth"
                  ]
                },
                {
                  "meaning": "One in the position of controlling or directing; a controller, a director, a guide.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "helm (third-person singular simple present helms, present participle helming, simple past and past participle helmed) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To control the helm (noun sense 1) of (a marine vessel); to be in charge of steering (a vessel).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To direct or lead (a project, etc.); to manage (an organization).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English helm (“helmet; crown of thorns of Jesus; warrior; inn or shop sign”) [and other forms], from Old English helm (“helmet”), from Proto-West Germanic *helm, from Proto-Germanic *helmaz (“protective covering”), probably from Proto-Indo-European *ḱelmos, from Proto-Indo-European *ḱel- (“to cover”). Doublet of helmet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "helm (plural helms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or poetic) A helmet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) Synonym of helmet (“the feature above a shield on a coat of arms”)",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(Northern England) A shelter for cattle or other farm animals; a hemmel, a shed.",
                  "examples": []
                },
                {
                  "meaning": "(Northern England (Cumberland, Westmorland)) A heavy cloud lying on the brow of a mountain, especially one associated with a storm.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "(except Britain, dialectal) The crown or top of something.",
                  "examples": []
                },
                {
                  "meaning": "(alchemy, chemistry) The upper part or cap of an alembic or retort.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English helmen, helmi (“to provide with a helmet; (figuratively) to cover; to protect”), from Old English helmian (“to cover”), ġehelmian (“to cover with a helmet; to crown”), from (ġe- (prefix with an intensifying effect, or forming nouns or verbs denoting processes or results) +) helm (“helmet”) (see further at etymology 2) + -ian (suffix forming verbs from adjectives and nouns)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "helm (third-person singular simple present helms, present participle helming, simple past and past participle helmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic or poetic) To cover (a head) with a helmet; to provide (someone) with a helmet; to helmet.",
                  "examples": [
                    "Synonym: behelm"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is possibly:",
        "The verb is either derived from the noun, or is possibly a variant of yelm."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "helm (countable and uncountable, plural helms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A stalk of corn, or (uncountable) stalks of corn collectively (that is, straw), especially when bundled together or laid out straight to be used for thatching roofs.",
                  "examples": [
                    "Synonyms: (bundle of straw for thatching) thatch, yelm"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Alternative form of haulm (“the stems of various cultivated plants, left after harvesting the crop, which are used as animal food or litter, or for thatching”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Synonym of bentgrass (“any of numerous reedy grass species of the genus Agrostis”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "helm (third-person singular simple present helms, present participle helming, simple past and past participle helmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lay out (stalks of corn, or straw) straight to be used for thatching roofs; to yelm.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}