{
  "word": "sledge",
  "etymologies": [
    {
      "description": [
        "From Middle English slegge, from Old English sleċġ (“sledgehammer; mallet”), from Proto-Germanic *slagjǭ. Cognate with Dutch slegge (“sledge”), Swedish slägga (“sledge”), Norwegian Bokmål slegge (“sledge”), Norwegian Nynorsk sleggje (“sledge”), Icelandic sleggja (“sledge”), German Schlägel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sledge (plural sledges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heavy, long handled maul or hammer used to drive stakes, wedges, etc.",
                  "examples": [
                    "[based on information from Major Hill, Master of the Silver Mills, in 1662, descibing silver mining in Cardiganshire] They dig the Oar thus; One holds a little Picque, or Punch of Iron, having a long Handle of Wood which they call a Gad; Another with a great Iron Hammer, or Sledge, drives it into the Vein."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sledge (third-person singular simple present sledges, present participle sledging, simple past and past participle sledged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to hit with a sledgehammer.",
                  "examples": [
                    "The rapid and violent exertion of smiths, mightily sledging the glowing iron masses of their furnaces."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Dialectal Dutch sleedse, from Middle Dutch sleedse, from the root of sled."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sledge (plural sledges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low sled drawn by animals, typically on snow, ice or grass.",
                  "examples": [
                    "The sledge ran far better upon the ice; I cannot say the same for the dogs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) any type of sled or sleigh.",
                  "examples": [
                    "Aged wore out Coal-Horses, which after some time Wrought you will have, may serve turn for Sledge-Horses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A card game resembling all fours and seven-up; old sledge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sledge (third-person singular simple present sledges, present participle sledging, simple past and past participle sledged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To drag or draw a sledge.",
                  "examples": [
                    "It should be remembered, that these explorations were nearly all made by our seamen and officers on foot, dragging sledges, on which were piled tents, provision, fuel for cooking, and raiment. This sledging was brought to perfection by Captain M'Clintock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To ride, travel with or transport in a sledge.",
                  "examples": [
                    "When \"the great fen or moor\" which washed the city walls on the north was frozen over, sliding, sledging, and skating were the sports of crowds."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Sledge (“a surname”), influenced by sledgehammer. Australian from 1960s.\nAccording to Ian Chappell, originated in Adelaide during the 1963/4 or 1964/5 Sheffield Shield season. A cricketer who swore in the presence of a woman was taken to be as subtle as a sledgehammer (meaning unsubtle) and was called “Percy” or “Sledge”, from singer Percy Sledge (whose song When a Man Loves a Woman was a hit at the time). Directing insults or obscenities at the opposition team then became known as sledging."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sledge (plural sledges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly cricket, Australia) An instance of sledging.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sledge (third-person singular simple present sledges, present participle sledging, simple past and past participle sledged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly cricket, Australia) To verbally insult or abuse an opponent in order to distract them (considered unsportsmanlike).",
                  "examples": [
                    "Batteries of fast bowlers softened batsmen up with short-pitched bowling, while fielders tried to disturb their concentration with a running commentary of insults commonly known as sledging."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}