{
  "word": "swallow",
  "etymologies": [
    {
      "description": [
        "From Middle English swolowen, swolwen, swolȝen, swelwen, swelȝen, from Old English swelgan, from Proto-West Germanic *swelgan, from Proto-Germanic *swelganą (“to swallow, revel, devour”), from Proto-Indo-European *swelk- (“to gulp”). Cognate with Dutch zwelgen (“to revel, carouse, guzzle”), German schwelgen (“to delight, indulge”), Swedish svälja (“to swallow, gulp”), Icelandic svelgja (“to swallow”), Old English swillan, swilian (“to swill, wash out, gargle”). See also swill.",
        "The noun is from Middle English swelwe, swolwe, from Old English swelh, swelg (“gulf, chasm”) and ġeswelge (“gulf, chasm, abyss, whirlpool”), both from Proto-West Germanic *swelg, *swalgi, from Proto-Germanic *swelgaz, *swalgiz. Cognate with Old English swiliġe (“pit”), Scots swelch, swellie, swallie (“an abyss in the sea, whirpool”), Middle Low German swelch (“whirlpool, eddy”), Dutch zwelg (“gorge, chasm, gullet, throat”), Old Norse svelgr (“whirlpool, current, stream”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swallow (countable and uncountable, plural swallows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A deep chasm or abyss in the earth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The mouth and throat; that which is used for swallowing; the gullet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount swallowed in one gulp; the act of swallowing.",
                  "examples": [
                    "He took the aspirin with a single swallow of water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The opening in a pulley block between the sheave and shell through which the rope passes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Nigeria) Any of various carbohydrate-based dishes that are swallowed without much chewing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swallow (third-person singular simple present swallows, present participle swallowing, simple past and past participle swallowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (food, drink etc.) to pass from the mouth into the stomach; to take into the stomach through the throat. [from 11th c.]",
                  "examples": [
                    "Synonyms: consume, devour, eat, gulp"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take (something) in so that it disappears; to consume, absorb. [from 13th c.]",
                  "examples": [
                    "Synonyms: absorb, engulf, incorporate, swallow up; see also Thesaurus:integrate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take food down into the stomach; to make the muscular contractions of the oesophagus to achieve this, often taken as a sign of nervousness or strong emotion. [from 18th c.]",
                  "examples": [
                    "Synonym: gulp",
                    "My throat was so sore that I was unable to swallow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To accept easily or without questions; to believe, accept. [from 16th c.]",
                  "examples": [
                    "Synonyms: buy, credit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engross; to appropriate; usually with up.",
                  "examples": [
                    "Synonyms: absorb, monopolize, occupy, take over"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To retract; to recant.",
                  "examples": [
                    "Synonyms: disavow, take back; see also Thesaurus:recant",
                    "to swallow one's opinions"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put up with; to bear patiently or without retaliation.",
                  "examples": [
                    "Synonyms: endure, live with; see also Thesaurus:tolerate",
                    "to swallow an affront or insult"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English swalwe, swalewe, swalowe, from Old English swealwe, from Proto-West Germanic *swalwā, from Proto-Germanic *swalwǭ. Cognate with Danish and Norwegian svale, Dutch zwaluw, German Schwalbe, Swedish svala."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swallow (plural swallows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, migratory bird of the Hirundinidae family with long, pointed, moon-shaped wings and a forked tail which feeds on the wing by catching insects.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}