{
  "word": "plaque",
  "etymologies": [
    {
      "description": [
        "Borrowed from French plaque (“plate, sheet (of metal); slab (of marble); bacteria on teeth”), from French plaquer, Middle French plaquer (“to plate”), from Middle Dutch placken (“to patch, beat metal into a thin plate”), from placke (“disk, patch, stain”), from Old Dutch *plagga (“patch”), from Proto-Germanic *plaggą (“patch”).",
        "The word is cognate with Middle Low German placke, plagge (“small stain, scraps, rags, thin grass”), German Placken (“spot, patch”), Saterland Frisian plak, plakke (“a blow, slap”), Swedish plagg (“clothing, garment”). Compare plack."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plaque (countable and uncountable, plural plaques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any flat, thin piece of clay, ivory, metal, etc., used for ornament, or for painting pictures upon, as a dish, plate, slab, etc., hung upon a wall; also, a smaller decoration worn by a person, such as a brooch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A piece of flat metal with writing on it, attached to a building, monument, or other structure to remind people of a person or an event.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A small card representing an amount of money, used for betting in casinos; a sort of gaming chip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, biology) A clearing in a bacterial lawn caused by a virus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, music) In the Hornbostel–Sachs classification system: any flat, thin musical instrument.",
                  "examples": [
                    "blown plaques",
                    "aconcussion plaques"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, pathology) A broad patch of abnormal tissue distinguishable from surrounding tissue, especially a broad papule (“inflamed, irritated patch”) on the skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, uncountable, pathology) An abnormal accumulation of material in or on an organ of the body, often associated with disease.",
              "entries": [
                {
                  "meaning": "(countable, uncountable, pathology) An accumulation in artery walls made up of macrophage cells and debris containing lipids, (cholesterol and fatty acids), calcium, and connective tissue; an atheroma.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, dentistry) An accumulation of biofilm, or bacteria, on teeth, which may develop into dental calculus (tartar).",
                  "examples": []
                },
                {
                  "meaning": "(countable, medicine) A deposit of beta-amyloid protein occurring in a nerve cell and associated with Alzheimer's disease.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}