{
  "word": "cunt",
  "etymologies": [
    {
      "description": [
        "From Middle English cunte, queynt, queynte, from Old English *cunte, from Proto-Germanic *kuntǭ. Cognate with West Frisian kunte, Middle Dutch conte (Dutch kont (“butt”)), dialectal Swedish kunta, dialectal Danish kunte, and Icelandic kunta. A relationship to Latin cunnus has not been conclusively shown. Partridge suggests cuneus (“a wedge”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cunt (countable and uncountable, plural cunts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, countable) The female genitalia, especially the vulva.",
                  "examples": [
                    "An' doesn't ter know? Cunt! It's thee down theer; an' what I get when I'm i'side thee, and what tha gets when I'm i'side thee; it's a' as it is, all on't."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, offensive, countable) An extremely unpleasant or objectionable person (in US, especially a woman; in UK, Ireland, Australia, New Zealand more usually a man).",
                  "examples": [
                    "He rails against political correctness and health and safety regulations, and earlier this summer was accused of calling Gordon Brown \"a cunt\" in unbroadcast comments to his Top Gear audience, whom he has also referred to as \"oafs\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Ireland, Australia, New Zealand, vulgar, countable) An objectionable object or item.",
                  "examples": [
                    "Fix the car? I’ll sort the cunt out at the weekend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Ireland, New Zealand, UK, countable, vulgar) An unpleasant or difficult experience or incident.",
                  "examples": [
                    "Certain situations just cry out for it – keys breaking in the lock, not being able to find the starting point in a roll of sticky-tape, running out of bin-bags. The kind of everyday annoyances that Alanis Morissette would define as irony are actually cunts as far as I’m concerned."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, countable and uncountable) A woman, women, or bottom (i.e. submissive partner, not the top) as a source of sex.",
                  "examples": [
                    "I’m going to hit the clubs and see if I can get me some cunt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, Ireland, UK, vulgar, positive, countable) (with words funny, good) A person (mostly between male friends); compare bastard.",
                  "examples": [
                    "Yes, I do remember Dave; he was one funny cunt.",
                    "Tom's a good cunt: he fixed my car and didn't even charge me for it!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}