{
  "word": "quarrel",
  "etymologies": [
    {
      "description": [
        "From Middle English querele (“altercation, dispute; argument, debate; armed combat; trial by combat; basis for dispute, complaint; claim, legal suit; a lament; illness”) [and other forms], from Anglo-Norman querele [and other forms] and Middle French querele, querelle (“altercation, dispute; basis for dispute; side in a dispute; complaint; accusation; legal suit; lament; problem”) (modern French querelle), and from their etymon Latin querēla, querella (“dispute; argument; complaint, grievance; legal complaint; lament; illness”), from querī + -ēla, -ella (suffix forming nouns). Querī is the present active infinitive of queror (“to complain; to bewail, lament; to be indignant”), from Proto-Indo-European *ḱwes- (“to puff; to sigh”).",
        "The word had replaced Old English sacan (“basis for dispute”) by 1340."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quarrel (countable and uncountable, plural quarrels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A dispute or heated argument (especially one that is verbal).",
                  "examples": [
                    "Synonyms: see Thesaurus:dispute",
                    "We got into a silly quarrel about what food to order."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Often preceded by a form of to have: a basis or ground of dispute or objection; a complaint; also, a feeling or situation of ill will and unhappiness caused by this.",
                  "examples": [
                    "A few customers in the shop had some quarrels with us, so we called for the manager.",
                    "I have no quarrel with her; it’s her partner whom I dislike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, uncountable) A propensity to quarrel; quarrelsomeness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English querelen (“to dispute, quarrel; to assert one's claims; to rebel”) [and other forms], from querele (noun); see etymology 1. Compare Anglo-Norman, Middle French, and Old French quereler, quereller (“to argue with, dispute; to criticize; to bring a legal suit”) (modern French quereller (“to quarrel, squabble”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "quarrel (third-person singular simple present quarrels, present participle (UK) quarrelling or (US) quarreling, simple past and past participle (UK) quarrelled or (US) quarreled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, also figuratively) To argue fiercely; to contend; to squabble; to cease to be on friendly terms, to fall out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To find fault; to cavil.",
                  "examples": [
                    "to quarrel with one’s lot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) Followed by at: to disagree with; to take offence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete except Scotland) To argue or squabble with (someone).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English quarrel (“bolt for an arbalest, crossbow, or siege engine; (figurative) seductive glance, temptation to sin; needle (possibly one square in cross-section); small (perhaps square-shaped) opening in window tracery; a cushion (perhaps square-shaped)”) [and other forms], from Anglo-Norman quarel, quarele, quarrel, Middle French quarrel, and Old French quarel, quarrel, carrel (“crossbow bolt; floor tile or paving stone (rectangular- or square-shaped); small glass pane for windows”) (modern French carreau (“crossbow bolt; a tile; windowpane; a square”)), from Late Latin quarellus, quadrellus (“crossbow bolt; paving stone; a tile”), from Latin quadrum (“a square; square section; regular shape or form”) + -ellus (variant of -ulus (suffix forming diminutive nouns, indicating small size or youth)). Quadrum is ultimately derived from quattuor (“four”), from Proto-Indo-European *kʷetwóres (“four”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quarrel (countable and uncountable, plural quarrels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, archery, historical) An arrow or bolt for a crossbow or an arbalest (“a late, large type of crossbow”), traditionally with the head square in its cross section.",
                  "examples": [
                    "Synonyms: (obsolete) carrel, quarry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, architecture) A diamond- or square-shaped piece of glass forming part of a lattice window.",
                  "examples": [
                    "Synonym: quarry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Northern England, architecture) A square tile; a quarry tile; (uncountable) such tiles collectively.",
                  "examples": [
                    "Synonym: (archaic) quarry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete, rare) A cutting tool or chisel with a diamond- or square-shaped end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, architecture, obsolete) A small square-shaped opening in window tracery.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}