{
  "word": "initiate",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin initiātus, perfect passive participle of initiō (“begin, originate”), from initium (“a beginning”), from ineō (“go in, enter upon, begin”), from in + eō (“go”)."
      ],
      "adjectives": [
        {
          "description": "initiate (comparative more initiate, superlative most initiate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Unpractised; untried; new.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Begun; commenced; introduced to, or instructed in, the rudiments; newly admitted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "initiate (plural initiates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A new member of an organization.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who has been through a ceremony of initiation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is oriented in and familiar with a topic or subject; especially, one who is an expert in it.",
                  "examples": [
                    "Antonym: noninitiate",
                    "Coordinate terms: expert, nonexpert, layperson, amateur, dilettante, journeyman, master"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "initiate (third-person singular simple present initiates, present participle initiating, simple past and past participle initiated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To begin; to start.",
                  "examples": [
                    "How are changes of this sort to be initiated?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To instruct in the rudiments or principles; to introduce.",
                  "examples": [
                    "Divine Providence would only initiate and enter mankind into the useful knowledge of her, leaving the rest to employ our industry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To confer membership on; especially, to admit to a secret order with mysterious rites or ceremonies.",
                  "examples": [
                    "He was initiated into half a dozen clubs before he was one and twenty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To do the first act; to perform the first rite; to take the initiative.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}