{
  "word": "rather",
  "etymologies": [
    {
      "description": [
        "From Middle English rather, from Old English hraþor, comparative of hraþe (“soon, early, fast”), equivalent to rathe +‎ -er. More at rathe. Cognate with Dutch radder (“faster”), comparative of Dutch rad (“fast; quick”), German Low German radd, ratt (“rashly; quickly; hastily”), German gerade (“even; straight; direct”)."
      ],
      "adjectives": [
        {
          "description": "rather (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Prior; earlier; former.",
                  "examples": [
                    "Now no man dwelleth at the rather town of Damietta."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "rather (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) More quickly. [9th–19th c.]",
                  "examples": [
                    "Synonyms: sooner, earlier"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used to specify a choice or preference; preferably, in preference to. (Now usually followed by than) [from 9th c.]",
                  "examples": [
                    "Synonym: (archaic) liefer",
                    "I would rather stay in all day than go out with them.",
                    "I would like this one rather than the other one.",
                    "I would much rather be with you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(conjunctive) Used to introduce a contradiction; on the contrary. [from 14th c.]",
                  "examples": [
                    "It wasn't supposed to be popular; rather, it was supposed to get the job done.",
                    "She didn't go along, but rather went home instead."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(conjunctive) Introducing a qualification or clarification; more precisely. (Now usually preceded by or.) [from 15th c.]",
                  "examples": [
                    "His ‘Iliad’ is spirited and polished, and, though often rather a paraphrase than a translation, is always more truly poetic than most of the best translations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(degree) Somewhat, fairly. [from 16th c.]",
                  "examples": [
                    "Synonyms: somewhat, fairly, quite",
                    "Antonym: utterly",
                    "This melon is rather tasteless, especially compared to the one we had last time.",
                    "We had some rather bad news today.",
                    "We’ll be seeing rather a lot of you over the next few days."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rather (third-person singular simple present rathers, present participle rathering, simple past and past participle rathered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard or dialectal) To prefer; to prefer to.",
                  "examples": [
                    "So you must excuse my saying anything I did: all it was, that up to the very last I had understood us all to be friendly — apart, that is, from his rathering me not there. How was I to know he would flash out so wicked?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}