{
  "word": "queer",
  "etymologies": [
    {
      "description": [
        "Attested since about 1510, from Scots, perhaps from Middle Low German (Brunswick dialect) queer (“oblique, off-center”) (also compare with German quer (“diagonal”)), from Old Saxon thwerh, from Proto-West Germanic *þwerh, from Proto-Germanic *þwerhaz, from Proto-Indo-European *terkʷ- (“to turn, twist, wind”).",
        "Compare Latin torqueō. Related to thwart. Began to be used to describe gay people in the late 1800s, see usage notes for more."
      ],
      "adjectives": [
        {
          "description": "queer (comparative queerer, superlative queerest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated outside Scotland and Ulster) Weird, odd, or different; whimsical. [from 16th c.]",
                  "examples": [
                    "“I wish I hadn’t cried so much!” said Alice, as she swam about, trying to find her way out. “I shall be punished for it now, I suppose, by being drowned in my own tears! That will be a queer thing, to be sure! However, everything is queer to-day.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, informal, dated) Slightly unwell (mainly in \"to feel queer\"). [from 18th c.]",
                  "examples": [
                    "\"Well, I'm—I'm jiggered,\" said Peter, and his voice also sounded queer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) Drunk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, sometimes derogatory) Homosexual. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, sometimes derogatory) Non-heterosexual or non-cisgender: homosexual, bisexual, asexual, transgender, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(broadly) Pertaining to sexual or gender behaviour or identity which does not conform to conventional heterosexual or cisgender norms, assumptions etc. [from 20th c.]",
                  "examples": [
                    "the queer community"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "queer (comparative more queer, superlative most queer)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Queerly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "queer (plural queers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, sometimes derogatory) A person who is or appears homosexual, or who has homosexual qualities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, sometimes derogatory) A person of any non-heterosexual sexuality or sexual identity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, sometimes derogatory) A person of any genderqueer identity.",
                  "examples": [
                    "Gentrification often starts with the artists, revolutionaries, freaks, transfolks, and queers (what I would call my people) moving into poor neighborhoods inhabited by people of color."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(definite, with \"the\", informal, archaic) Counterfeit money.",
                  "examples": [
                    "Synonyms: funny money, snide"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "queer (third-person singular simple present queers, present participle queering, simple past and past participle queered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To render an endeavor or agreement ineffective or null.",
                  "examples": [
                    "I was a lot more apt to queer it than help it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect, dated) To puzzle.",
                  "examples": [
                    "\"But lor-a-mussy, Jacob, how could a woman get away from here with all her boxes in the middle of the night?\"",
                    "\"That's what queered me,\" and Spink slowly shook his head, \"and queered a good many; for of course it got newsed about  […] \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) To ridicule; to banter; to rally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) To spoil the effect or success of, as by ridicule; to throw a wet blanket on; to spoil.",
                  "examples": [
                    "\"Food is what queered the party. We ordered a big supper to be sent up to the room about two o'clock. Alec didn't give the waiter a tip, so I guess the little bastard snitched.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(social sciences) To reevaluate or reinterpret (a work) with an eye to sexual orientation and/or to gender, as by applying queer theory.",
                  "examples": [
                    "Synonym: queerify"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, LGBT, neologism) To make a work more appealing or attractive to LGBT people, such as by not having strict genders for playable characters.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}