{
  "word": "cheek",
  "etymologies": [
    {
      "description": [
        "From Middle English cheeke, cheke, cheoke, choke, from Old English ċēce, ċēace, ċēoce (“cheek; jaw”), from Proto-West Germanic *kākā, *keukā (“jaw, cheek”), from Proto-Germanic *kēkǭ, *keukǭ (“jaw; palate; pharynx”), perhaps from Proto-Indo-European *ǵyewh₁- (“to chew”).",
        "Cognate with Saterland Frisian Sooke (“cheek”), West Frisian tsjeak (“jaw”), Dutch kaak (“jaw; cheek”), Swedish käke (“jaw; jowl”), Norwegian kjake (“jaw”), Old Norse kók (“mouth; gullet”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cheek (countable and uncountable, plural cheeks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The soft skin on each side of the face, below the eyes; the outer surface of the sides of the oral cavity.",
                  "examples": [
                    "Synonym: (obsolete) wang"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy, informal, usually in the plural) The lower part of the buttocks that is often exposed beneath very brief underwear, swimwear, or extremely short shorts.",
                  "examples": [
                    "Synonyms: arsecheek, asscheek, butt cheek, nether cheek"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, informal, uncountable) Impudence.",
                  "examples": [
                    "Synonyms: impertinence, impudence, (slang) brass neck, (informal) nerve, (informal, especially US) sass, chutzpah",
                    "You’ve got some cheek, asking me for money!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, informal) One of the genae, flat areas on the sides of a trilobite's cephalon.",
                  "examples": []
                }
              ]
            },
            {
              "group": "One of the pieces of a machine, or of timber or stonework, that form corresponding sides or a similar pair.",
              "entries": [
                {
                  "meaning": "(nautical) pump-cheek, pump-cheeks, a piece of wood cut out fork-shaped in which the brake is fastened by means of a bolt and can thus move around and move the upper box of the pump up and down",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) The branches of a bridle bit. .",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Either side of an axehead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metalworking) The middle section of a flask, made so that it can be moved laterally, to permit the removal of the pattern from the mould.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cheek (third-person singular simple present cheeks, present participle cheeking, simple past and past participle cheeked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be impudent towards.",
                  "examples": [
                    "Don't cheek me, you little rascal!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pull a horse's head back toward the saddle using the cheek strap of the bridle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}