{
  "word": "carry",
  "etymologies": [
    {
      "description": [
        "From Middle English carrien, from Anglo-Norman carier (modern French charrier); from a derivative of Latin carrus (“four-wheeled baggage wagon”), ultimately of Gaulish origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carry (plural carries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A manner of transporting or lifting something; the grip or position in which something is carried.",
                  "examples": [
                    "Adjust your carry from time to time so that you don't tire too quickly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tract of land over which boats or goods are carried between two bodies of navigable water; a portage.",
                  "examples": [
                    "Undrowned, unducked, as safe from the perils of the broad lake as we had come out of the defiles of the rapids, we landed at the carry below the dam at the lake's outlet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The bit or digit that is carried in an addition operation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) The benefit or cost of owning an asset over time.",
                  "examples": [
                    "The carry on this trade is 25 basis points per annum."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) The distance travelled by the ball when struck, until it hits the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) Carried interest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) The sky; cloud-drift.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "carry (third-person singular simple present carries, present participle carrying, simple past and past participle carried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lift (something) and take it to another place; to transport (something) by lifting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To notionally transfer from one place (such as a country, book, or column) to another.",
                  "examples": [
                    "to carry the war from Greece into Asia",
                    "to carry an account to the ledger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey by extension or continuance; to extend.",
                  "examples": [
                    "The builders are going to carry the chimney through the roof.  They would have carried the road ten miles further, but ran out of materials."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly archaic) To move; to convey using force",
                  "examples": [
                    "Synonyms: impel, conduct"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lead or guide.",
                  "examples": [
                    "Passion and revenge will carry them too far."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stock or supply (something); to have in store.",
                  "examples": [
                    "The corner drugstore doesn't carry his favorite brand of aspirin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adopt (something); take (something) over.",
                  "examples": [
                    "I think I can carry Smith's work while she is out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adopt or resolve on, especially in a deliberative assembly",
                  "examples": [
                    "The court carries that motion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, arithmetic) In an addition, to transfer the quantity in excess of what is countable in the units in a column to the column immediately to the left in order to be added there.",
                  "examples": [
                    "Five and nine are fourteen; carry the one to the tens place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have, hold, possess or maintain (something).",
                  "examples": [
                    "Always carry sufficient insurance to protect against a loss."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be transmitted; to travel.",
                  "examples": [
                    "The sound of the bells carried for miles on the wind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To insult, to diss.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To capture a ship by coming alongside and boarding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports) To transport (the ball) whilst maintaining possession.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have on one's person.",
                  "examples": [
                    "she always carries a purse;  marsupials carry their young in a pouch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be pregnant (with).",
                  "examples": [
                    "The doctor said she's carrying twins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have propulsive power; to propel.",
                  "examples": [
                    "A gun or mortar carries well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hold the head; said of a horse.",
                  "examples": [
                    "to carry well, i.e. to hold the head high, with arching neck"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting) To have earth or frost stick to the feet when running, as a hare.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bear or uphold successfully through conflict, for example a leader or principle",
                  "examples": [
                    "the carrying of our main point"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to succeed in (e.g. a contest); to succeed in; to win.",
                  "examples": [
                    "The Tories carried the election."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To get possession of by force; to capture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To contain; to comprise; have a particular aspect; to show or exhibit",
                  "examples": [
                    "Things of little value carry great importance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To bear (oneself); to behave or conduct.",
                  "examples": [
                    "He carried himself so insolently in the house, and out of the house, to all persons, that he became odious."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bear the charges or burden of holding or having, as stocks, merchandise, etc., from one time to another.",
                  "examples": [
                    "A merchant is carrying a large stock;  a farm carries a mortgage;  a broker carries stock for a customer;  to carry a life insurance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have a weapon on one's person; to be armed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gaming) To be disproportionately responsible for a team's success.",
                  "examples": [
                    "He absolutely carried the game, to the point of killing the entire enemy team by himself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Southern US) to physically transport (in the general sense, not necessarily by lifting)",
                  "examples": [
                    "Will you carry me to town?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) To bear a firearm, such as a gun.",
                  "examples": [
                    "A holster can help you carry in confidence, knowing that your weapon is secure and close at hand."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}