{
  "word": "sere",
  "etymologies": [
    {
      "description": [
        "From Middle English ser, sere, seare, seer, seere, seir, seyr (“dry, withered; emaciated, shrivelled; brittle; bare; dead, lifeless; barren, useless”), from Old English sēar, sīere (“dry, withered; barren; sere”), from Proto-West Germanic *sauʀ(ī), from Proto-Germanic *sauzaz (“dry, parched”), from Proto-Indo-European *h₂sews-, *sh₂ews- (“to be dry”).",
        "Cognate with Dutch zoor (“dry and coarse”), Greek αὖος (aὖos, “dry”), Lithuanian sausas (“dry”), Middle Low German sôr (Low German soor (“arid, dry”)), Old Church Slavonic suχŭ (“dry”),. Doublet of sear and sare."
      ],
      "adjectives": [
        {
          "description": "sere (comparative serer, superlative serest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or literary, poetic) Without moisture; dry.",
                  "examples": [
                    "Synonyms: (Britain, archaic) sare, sear; see also Thesaurus:dry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or literary, poetic) Of thoughts, etc.: barren, fruitless.",
                  "examples": [
                    "Our talk had been serious and sober,But our thoughts they were palsied and sere—Our memories were treacherous and sere—"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Of fabrics: threadbare, worn out.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin serere, present active infinitive of  serō (“to entwine, interlace, link together; to join in a series, string together”), ultimately from Proto-Indo-European *ser- (“to bind, tie together; to thread”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sere (plural seres)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecology) A natural succession of animal or plant communities in an ecosystem, especially a series of communities succeeding one another from the time a habitat is unoccupied to the point when a climax community is achieved. [from early 20th c.]",
                  "examples": [
                    "Synonym: seral community"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old French serre (modern French serre (“talon”)), from serrer (“to grip tightly; to shut”) (modern French serrer (“to squeeze; to tighten”)), from Vulgar Latin serrāre (“to close, shut”), from Late Latin serāre, present active infinitive of serō (“to fasten with a bolt; to bar, bolt”), from sera (“bar for fastening doors”), from serō (“to bind or join together; entwine, interlace, interweave, plait”); see further at etymology 2."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sere (plural seres)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A claw, a talon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English ser, sere, schere, seer, seere, seir, seyr, seyre (“different; diverse, various; distinct, individual; parted, separated; many, several”), from Old Norse sér (“for oneself; separately”, dative reflexive pronoun, literally “to oneself”), from sik (“oneself, myself, yourself, herself, himself; ourselves, yourselves, themselves”), from Proto-Germanic *sek (“oneself”), from Proto-Indo-European *swé (“self”). The English word is cognate with Danish sær (“singular”), især (“especially, particularly”), German sich (“oneself; herself, himself, itself; themselves”), Icelandic sig (“oneself; herself, himself, itself; themselves”), Latin sē (“herself, himself, itself; themselves”), Scots seir, Swedish sär (“particularly”)."
      ],
      "adjectives": [
        {
          "description": "sere (comparative more sere, superlative most sere)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or Britain, dialectal) Individual, separate, set apart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or Britain, dialectal) Different; diverse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}