{
  "word": "skin",
  "etymologies": [
    {
      "description": [
        "From Middle English skyn, skinn, from Old English scinn, from Old Norse skinn (“animal hide”), from Proto-Germanic *skinþą, from Proto-Indo-European *sken- (“to split off”), nasal variant of *skeh₁i-d- (“to cut”).",
        "See also Dutch schinde (“bark”), dialectal German Schinde (“fruit peel”); also Breton skant (“scales”), Old Irish ceinn, Irish scainim (“I tear, burst”), Latin scindere (“to split, divide”), Sanskrit छिनत्ति (chinátti, “he splits”). Partially displaced native Old English hȳd (“skin, hide”), see hide. More at shed."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skin (countable and uncountable, plural skins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The outer protective layer of the body of any animal, including of a human.",
                  "examples": [
                    "He is so disgusting he makes my skin crawl."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The outer protective layer of the fruit of a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The skin and fur of an individual animal used by humans for clothing, upholstery, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A congealed layer on the surface of a liquid.",
                  "examples": [
                    "In order to get to the rest of the paint in the can, you′ll have to remove the skin floating on top of it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, computing, graphical user interface) A set of resources that modifies the appearance and/or layout of the graphical user interface of a computer program.",
                  "examples": [
                    "You can use this skin to change how the browser looks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, video games) An alternate appearance (texture map or geometry) for a character model in a video game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) Rolling paper for cigarettes.",
                  "examples": [
                    "Pass me a skin, mate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) Clipping of skinhead.",
                  "examples": [
                    "By the end of the show, fights would break out all over the place: the Atlantic City skins against the crew from Philly; the oldschool skinheads feuding with overzealous fresh-cuts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A subgroup of Australian aboriginal people; such divisions are cultural and not related to an individual′s physical skin.",
                  "examples": [
                    "The younger brother questions the correctness of the pursuit of the girls. \"They may be of the wrong subsection,\" he suggests. \"We can take wrong skins,\" says the older brother, but the younger still holds back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Bare flesh, particularly bare breasts.",
                  "examples": [
                    "Let me see a bit of skin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vessel made of skin, used for holding liquids.",
                  "examples": [
                    "the Bacchic train,Who brought their skins of wine, and loaded polesThat bent with mighty clusters of black grapes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) That part of a sail, when furled, which remains on the outside and covers the whole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The covering, as of planking or iron plates, outside the framing, forming the sides and bottom of a vessel; the shell; also, a lining inside the framing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The outer surface covering much of the wings and fuselage of an aircraft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drink of whisky served hot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Ireland, Britain) person, chap",
                  "examples": [
                    "He was a decent old skin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, thieves slang, obsolete) A purse.",
                  "examples": [
                    "[…]  and away I scampered with the tiddlywink-table, while Teddy Limber  […]  frisked the yokel of his yack and skin."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "skin (third-person singular simple present skins, present participle skinning, simple past and past participle skinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To injure the skin of.",
                  "examples": [
                    "He fell off his bike and skinned his knee on the concrete."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove the skin and/or fur of an animal or a human.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) To high five.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing, colloquial) To apply a skin to (a computer program).",
                  "examples": [
                    "Can I skin the application to put the picture of my cat on it?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, soccer, transitive) To use tricks to go past a defender.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become covered with skin.",
                  "examples": [
                    "A wound eventually skins over."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with skin, or as if with skin; hence, to cover superficially.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, archaic) To produce, in recitation, examination, etc., the work of another for one's own, or to use cribs, memoranda, etc., which are prohibited.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) To strip of money or property; to cheat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}