{
  "word": "lance",
  "etymologies": [
    {
      "description": [
        "From Middle English launce, from Old French lance, from Latin lancea."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lance (plural lances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A weapon of war, consisting of a long shaft or handle and a steel blade or head; a spear carried by horsemen.",
                  "examples": [
                    "The head of the lance was commonly of the leaf form, and sometimes approached that of the lozenge; it was very seldom barbed, although this variety, together with the others, appears upon the Bayeux Tapestry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden spear, sometimes hollow, used in jousting or tilting, designed to shatter on impact with the opposing knight’s armour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A spear or harpoon used by whalers and fishermen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A soldier armed with a lance; a lancer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An instrument which conveys the charge of a piece of ordnance and forces it home.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metallurgy) A small iron rod which suspends the core of the mold in casting a shell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pyrotechnics) One of the small paper cases filled with combustible composition, which mark the outlines of a figure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A lancet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lance (third-person singular simple present lances, present participle lancing, simple past and past participle lanced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pierce with a lance, or with any similar weapon.",
                  "examples": [
                    "Seized the due victim, and with fury lanced Her back. Dryden."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To open with a lancet; to pierce.",
                  "examples": [
                    "to lance a vein or an abscess"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To throw in the manner of a lance; to lanch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}