{
  "word": "creak",
  "etymologies": [
    {
      "description": [
        "From Middle English creken, criken, metathesis of Old English cearcian (“to chatter, creak, crash, gnash”), from Proto-West Germanic *krakōn (“to crash, crack, creak”), from Proto-Germanic *krakōną, from Proto-Indo-European *gerh₂- (“to make a sound, cry hoarsely”), ultimately of imitative origin.",
        "Compare also Old English crǣccettan, crācettan (“to croak”), Albanian grykë (“throat”). More at crack."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "creak (plural creaks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sound produced by anything that creaks; a creaking.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "creak (third-person singular simple present creaks, present participle creaking, simple past and past participle creaked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a prolonged sharp grating or squeaking sound, as by the friction of hard substances.",
                  "examples": [
                    "Then when the four ropes were arranged the coffin was placed upon them. He watched it descend; it seemed descending for ever. At last a thud was heard; the ropes creaked as they were drawn up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To produce a creaking sound with.",
                  "examples": [
                    "I miss the polished brass, the powerful black horses,",
                    "The drivers creaking the seats of the baroque hearses"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To suffer from strain or old age.",
                  "examples": [
                    "Fascinating though this high-minded re-reading was, certain crucial joints of the play creaked a good deal under the strain."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}