{
  "word": "spring",
  "etymologies": [
    {
      "description": [
        "As a verb, from Middle English spryngen (“to burst or flow forth, to sprout, to emerge, to happen, to become known, to sprinkle”), from Old English springan (“to burst or flow forth, to sprout, to emerge, to become known”), cognate with Afrikaans spring, West Frisian springe, Dutch & German springen, Danish springe, Swedish springa.",
        "Further etymology is uncertain, but usually taken to derive from a Proto-Germanic verb reconstructed as *springaną (“to burst forth”), from a Proto-Indo-European root reconstructed *sprenǵʰ- whose other descendants may include Lithuanian spreñgti (“to push (in)”), Old Church Slavonic прѧсти (pręsti, “to spin, to stretch”), Latin spargere (“to sprinkle, to scatter”), Ancient Greek σπέρχω (spérkhō, “to hasten”), Sanskrit स्पृहयति (spṛháyati, “to be eager”). Some newer senses derived from the noun.",
        "As a noun, from Middle English spryng (“a wellspring, tide, branch, sunrise, kind of dance or blow, ulcer, snare, flock”), from Old English spring (“wellspring, ulcer”) and Old English spryng (“a jump”), from ablaut forms of the Proto-Germanic verb. Further senses derived from the verb and from clippings of day-spring, springtime, spring tide, etc. Its sense as the season, first attested in a work predating 1325, gradually replaced Old English lencten (“spring, Lent”) as that word became more specifically liturgical. Compare fall."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spring (countable and uncountable, plural springs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An act of springing: a leap, a jump.",
                  "examples": [
                    "The pris'ner with a spring from prison broke;Then stretch'd his feather'd fans with all his might,And to the neighb'ring maple wing'd his flight."
                  ]
                }
              ]
            },
            {
              "group": "(countable) The season of the year in temperate regions in which plants spring from the ground and into bloom and dormant animals spring to life.",
              "entries": [
                {
                  "meaning": "(astronomy) The period from the moment of vernal equinox (around March 21 in the Northern Hemisphere) to the moment of the summer solstice (around June 21); the equivalent periods reckoned in other cultures and calendars.",
                  "examples": [
                    "Chinese New Year always occurs in January or February but is called the \"Spring Festival\" throughout East Asia because it is reckoned as the beginning of their spring."
                  ]
                },
                {
                  "meaning": "(meteorology) The three months of March, April, and May in the Northern Hemisphere and September, October, and November in the Southern Hemisphere.",
                  "examples": [
                    "I spent my spring holidays in Morocco.",
                    "The spring issue will be out next week."
                  ]
                }
              ]
            },
            {
              "group": "(uncountable, figurative) The time of something's growth; the early stages of some process.",
              "entries": [
                {
                  "meaning": "(figurative, politics) a period of political liberalization and democratization",
                  "examples": [
                    "Arab Spring",
                    "Prague Spring"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, fashion) Someone with ivory or peach skin tone and eyes and hair that are not extremely dark, seen as best suited to certain colors of clothing.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable) Something which springs, springs forth, springs up, or springs back, particularly",
              "entries": [
                {
                  "meaning": "(geology) A spray or body of water springing from the ground.",
                  "examples": [
                    "This beer was brewed with pure spring water.",
                    "Synonyms: fount, source"
                  ]
                },
                {
                  "meaning": "(oceanography, obsolete) The rising of the sea at high tide.",
                  "examples": []
                },
                {
                  "meaning": "(oceanography) Short for spring tide, the especially high tide shortly after full and new moons.",
                  "examples": [
                    "Antonym: neap tide"
                  ]
                },
                {
                  "meaning": "A mechanical device made of flexible or coiled material that exerts force and attempts to spring back when bent, compressed, or stretched.",
                  "examples": [
                    "We jumped so hard the bed springs broke.",
                    "Synonym: coil"
                  ]
                },
                {
                  "meaning": "(nautical) A line from a vessel's end or side to its anchor cable used to diminish or control its movement.",
                  "examples": [
                    "He had warped round with the springs on his cable, and had recommenced his fire upon the Aurora."
                  ]
                },
                {
                  "meaning": "(nautical) A line laid out from a vessel's end to the opposite end of an adjacent vessel or mooring to diminish or control its movement.",
                  "examples": [
                    "You should put a couple of springs onto the jetty to stop the boat moving so much."
                  ]
                },
                {
                  "meaning": "(figurative) A race, a lineage.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) A youth.",
                  "examples": []
                },
                {
                  "meaning": "A shoot, a young tree.",
                  "examples": []
                },
                {
                  "meaning": "A grove of trees; a forest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) An erection of the penis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, nautical, obsolete) A crack which has sprung up in a mast, spar, or (rare) a plank or seam.",
                  "examples": [
                    "A spar is said to be sprung, when it is cracked or split,... and the crack is called a spring."
                  ]
                }
              ]
            },
            {
              "group": "(uncountable) Springiness: an attribute or quality of springing, springing up, or springing back, particularly",
              "entries": [
                {
                  "meaning": "Elasticity: the property of a body springing back to its original form after compression, stretching, etc.",
                  "examples": [
                    "the spring of a bow",
                    "Synonyms: bounce, bounciness, elasticity, resilience, springiness"
                  ]
                },
                {
                  "meaning": "Elastic energy, power, or force.",
                  "examples": [
                    "Heav'ns what a spring was in his Arm, to throw:How high he held his Shield, and rose at ev'ry blow!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The source from which an action or supply of something springs.",
                  "examples": [
                    "As wel the singers as the players on instruments shall bee there: all my springs are in thee."
                  ]
                }
              ]
            },
            {
              "group": "(countable) Something which causes others or another to spring forth or spring into action, particularly",
              "entries": [
                {
                  "meaning": "A cause, a motive, etc.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A lively piece of music.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spring (third-person singular simple present springs, present participle springing, simple past sprang or sprung, past participle sprung)",
          "definitionGroups": [
            {
              "group": "(intransitive) To burst forth.",
              "entries": [
                {
                  "meaning": "(of liquids) To gush, to flow suddenly and violently.",
                  "examples": [
                    "...for swenge swat ædrum sprongforð under fexe.",
                    "...for the swing, the blood from his veins sprangforth under his hair."
                  ]
                },
                {
                  "meaning": "(of water, now mostly followed by \"out\" or \"up\") To gush, to flow out of the ground.",
                  "examples": []
                },
                {
                  "meaning": "(of light) To appear, to dawn.",
                  "examples": [
                    "...so the man tooke his concubine, and brought her foorth vnto them, and they knew her, and abused her all the night vntil the morning: and when the day began to spring, they let her goe."
                  ]
                },
                {
                  "meaning": "(of plants) To sprout, to grow,",
                  "examples": [
                    "Who hath diuided a water-course for the ouerflowing of waters? or a way for the lightning of thunder,To cause it to raine on the earth, where no man is: on the wildernesse wherein there is no man?To satisfie the desolate and waste ground, and to cause the bud of the tender herbe to spring forth."
                  ]
                },
                {
                  "meaning": "(now chiefly botanical) To grow taller or longer.",
                  "examples": []
                },
                {
                  "meaning": "(hunting, especially of birds) To rise from cover.",
                  "examples": []
                },
                {
                  "meaning": "(of landscape) To come dramatically into view.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) to arise, to come into existence.",
                  "examples": [
                    "Hope springs eternal.",
                    "He hit the gas and the car sprang to life.",
                    "Synonyms: arise, form, take shape"
                  ]
                },
                {
                  "meaning": "(figurative, Usually with cardinal adverbs, of animals) to move with great speed and energy; to leap, to jump; to dart, to sprint; of people: to rise rapidly from a seat, bed, etc.",
                  "examples": [
                    "...into helle spring..."
                  ]
                },
                {
                  "meaning": "(usually with from) To be born, descend, or originate from",
                  "examples": [
                    "He sprang from peasant stock."
                  ]
                },
                {
                  "meaning": "(figurative, religion, philosophy) to descend or originate from.",
                  "examples": [
                    "The Stoics sprang from the Cynics."
                  ]
                },
                {
                  "meaning": "(obsolete) To rise in social position or military rank, to be promoted.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, of knowledge, usually with wide) To become known, to spread.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, of odors) To emit, to spread.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, of beards) To grow.",
                  "examples": [
                    "A ȝong kniȝt, þat sprong furst [berd],Of no man he nas aferd."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To cause to burst forth.",
              "entries": [
                {
                  "meaning": "(rare, of water) To cause to well up or flow out of the ground.",
                  "examples": []
                },
                {
                  "meaning": "(figurative, of plants) To bring forth.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) permit to bring forth new shoots, leaves, etc.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, of knowledge) To cause to become known, to tell of.",
                  "examples": []
                },
                {
                  "meaning": "(figurative, of animals) To cause to move energetically; (equestrianism) to cause to gallop, to spur.",
                  "examples": [
                    "Just before the last pair of cones he sprung his ponies."
                  ]
                },
                {
                  "meaning": "(hunting, of birds) To cause to rise from cover.",
                  "examples": [
                    "His dogs sprang the grouse and partridges and flushed the woodcock."
                  ]
                },
                {
                  "meaning": "(obsolete, military, of weapons) To shift quickly from one designated position to another.",
                  "examples": [
                    "Each man springs his ramrod as the officer passes him, and then returns it."
                  ]
                },
                {
                  "meaning": "(obsolete, of horses) To breed with, to impregnate.",
                  "examples": [
                    "...[they] sought the fairest stoned horses to spring their mares..."
                  ]
                },
                {
                  "meaning": "(of mechanisms) To cause to work or open by sudden application of pressure.",
                  "examples": [
                    "He sprang the trap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To make wet, to moisten.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, usually with \"to\" or \"up\") To rise suddenly, (of tears) to well up.",
                  "examples": [
                    "The documentary made tears spring to their eyes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now usually with \"apart\" or \"open\") To burst into pieces, to explode, to shatter.",
                  "examples": [
                    "On the 22nd the mines sprang, and took very good effect."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, military) to go off.",
                  "examples": [
                    "The whole contraption appears liable to spring apart at any moment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To cause to explode, to set off, to detonate.",
                  "examples": [
                    "They sprung another Mine... wherein was placed about sixtie Barrels of Powder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical, usually perfective) To crack.",
                  "examples": [
                    "Probably the mast had sprung in some squall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To have something crack.",
                  "examples": [
                    "The Edward sprang hir foremast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To cause to crack.",
                  "examples": [
                    "A boisterous wind...Springs the... mast..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(transitive, figurative) To surprise by sudden or deft action.",
              "entries": [
                {
                  "meaning": "To come upon and flush out",
                  "examples": [
                    "To spring a plant, is to find any thing that has been concealed by another."
                  ]
                },
                {
                  "meaning": "(Australia, slang) to catch in an illegal act or compromising position.",
                  "examples": [
                    "He figured that nobody would ever spring him, but he figured wrong."
                  ]
                },
                {
                  "meaning": "(obsolete) To begin something.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To produce, provide, or place an item unexpectedly.",
                  "examples": [
                    "Surpriz'd with Fright,She starts, and leaves her Bed, and springs a Light."
                  ]
                },
                {
                  "meaning": "(obsolete, slang) To put bad money into circulation.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, of jokes, gags) To tell, to share.",
                  "examples": []
                },
                {
                  "meaning": "(of news, surprises) To announce unexpectedly, to reveal.",
                  "examples": [
                    "Sorry to spring it on you like this but I've been offered another job."
                  ]
                },
                {
                  "meaning": "(transitive, slang, US) To free from imprisonment, especially by facilitating an illegal escape.",
                  "examples": [
                    "His lieutenants hired a team of miners to help spring him.",
                    "Synonyms: free, let out, release, spring loose, jailbreak"
                  ]
                },
                {
                  "meaning": "(intransitive, slang, rare) To be free of imprisonment, especially by illegal escape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, architecture, of arches) To build, to form the initial curve of.",
                  "examples": [
                    "They sprung an arch over the lintel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, architecture, of arches, with \"from\") To extend, to curve.",
                  "examples": [
                    "The arches spring from the front posts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To turn a vessel using a spring attached to its anchor cable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, nautical) To raise a vessel's sheer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, cobblery) To raise a last's toe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pay or spend a certain sum, to cough up.",
                  "examples": [
                    "He wouldn't spring a nickel for a bag of peanuts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive, slang) To raise an offered price.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, dialectal) Alternative form of sprain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, dialectal) Alternative form of strain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To act as a spring: to strongly rebound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To equip with springs, especially (of vehicles) to equip with a suspension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare, obsolete) To provide spring or elasticity",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, rare, obsolete) to inspire, to motivate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To deform owing to excessive pressure, to become warped; to intentionally deform in order to position and then straighten in place.",
                  "examples": [
                    "Don't drive it in too hard, as it will ‘spring’ the plane-iron, and make it concave."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now rare) To reach maturity, to be fully grown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, UK, dialectal, chiefly of cows) To swell with milk or pregnancy.",
                  "examples": [
                    "“Gee, Dad, Nancy’s springing all right,” Ray said and paused in spontaneous pleasure.",
                    "Stan Parker came, and together they looked at their swelling heifer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of rattles, archaic) To sound, to play.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive) To spend the springtime somewhere",
              "entries": [
                {
                  "meaning": "(of animals) to find or get enough food during springtime.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}