{
  "word": "cranny",
  "etymologies": [
    {
      "description": [
        "From Middle English crany, crani (“cranny”), apparently a diminutive of *cran (+ -y), from Old French cran, cren (“notch, fissure”), a derivative of crener (“to notch, split”), from Medieval Latin crenō (“split”, verb), from Vulgar Latin *crinō (“split, break”, verb), of obscure origin.",
        "Despite a spurious use in Pliny, connection to Latin crēna is doubtful. Instead, probably of Germanic or Celtic origin. Compare Old High German chrinna (“notch, groove, crevice”), Alemannic German Krinne (“small crack, channel, groove”), Low German karn (“notch, groove, crevice, cranny”), Old Irish ara-chrinin (“to perish, decay”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cranny (plural crannies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, narrow opening, fissure, crevice, or chink, as in a wall, or other substance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool for forming the necks of bottles, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cranny (third-person singular simple present crannies, present participle crannying, simple past and past participle crannied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To break into, or become full of, crannies.",
                  "examples": [
                    "The ground did cranie everie where and light did pierce to hell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To haunt or enter by crannies.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}