{
  "word": "blowout",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blowout (plural blowouts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden puncturing of a pneumatic tyre/tire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden release of oil and gas from a well.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A social function, especially one with large quantities of food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A large or extravagant meal.",
                  "examples": [
                    "The dining room at Alain Ducasse's flagship Paris restaurant gleams with 10,000 crystals, confirming that this is the flashiest place in town for a blowout meal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, sports) A sporting contest that is decidedly one-sided and whose outcome is no longer in doubt.",
                  "examples": [
                    "The game between the two teams was nothing but a blowout."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An argument; an altercation.",
                  "examples": [
                    "The day my aunt and I had talked was just as vivid to me now as it had been eight years ago, when I'd had a blowout with my mother over my decision to go to school in Tucson rather than staying safely up here in northern Arizona."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A sandy depression in a sand dune ecosystem caused by the removal of sediments by wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) An extreme and unexpected increase in costs, such as in government estimates for a project.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cleaning of the flues of a boiler from scale, etc., by a blast of steam.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unsightly flap of skin caused by an ear piercing that is too large.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of having one's hair blow-dried and styled.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tattoo) The blurring of a tattoo due to ink penetrating too far into the skin and dispersing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}