{
  "word": "when",
  "etymologies": [
    {
      "description": [
        "From Middle English when(ne), whanne, from Old English hwonne, from Proto-West Germanic *hwannē, from Proto-West Germanic *hwan, from Proto-Germanic *hwan (“at what time, when”), from Proto-Indo-European *kʷis (interrogative base).",
        "Cognate with Dutch wanneer (“when”) and wen (“when, if”), Low German wannehr (“when”), wann (“when”) and wenn (“if, when”), German wann (“when”) and wenn (“when, if”), Gothic 𐍈𐌰𐌽 (ƕan, “when, how”), Latin quandō (“when”). More at who.",
        "Interjection sense: a playful misunderstanding of \"say when\" (i.e. say something / speak up when you want me to stop) as \"say [the word] when\"."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "when (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(interrogative) At what time? At which time? Upon which occasion or circumstance? Used to introduce direct or indirect questions about time.",
                  "examples": [
                    "When will they arrive?",
                    "Do you know when they arrived?",
                    "I don't know when they arrived.",
                    "When they arrived is unknown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "At an earlier time and under different, usually less favorable, circumstances.",
                  "examples": [
                    "He's mister high and mighty now, but I remember him when."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(relative) At which, on which, during which: often omitted or replaced with that.",
                  "examples": [
                    "That was the day when the Twin Towers fell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fused relative) The time at, on or during which.",
                  "examples": [
                    "I recall when they were called the Greys.",
                    "Next year is when we elect a new mayor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, in definitions or explanations) A circumstance or situation in which.",
                  "examples": [
                    "Love is when you can't get enough of someone."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "when (plural whens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The time at which something happens.",
                  "examples": [
                    "A good article will cover the who, the what, the when, the where, the why and the how."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}