{
  "word": "constitution",
  "etymologies": [
    {
      "description": [
        "From Middle English constitucioun, constitucion (“edict, law, ordinance, regulation, rule, statute; body of laws or rules, or customs; body of fundamental principles; principle or rule (of science); creation”) from Old French constitucion (modern French constitution), a learned borrowing from Latin cōnstitūtiō, cōnstitūtiōnem (“character, constitution, disposition, nature; definition; point in dispute; order, regulation; arrangement, system”), from cōnstituō (“to establish, set up; to confirm; to decide, resolve”). Equivalent to constitute +‎ -ion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "constitution (plural constitutions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act, or process of setting something up, or establishing something; the composition or structure of such a thing; its makeup.",
                  "examples": [
                    "Synonyms: configuration, form; see also Thesaurus:composition"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(government) The formal or informal system of primary principles and laws that regulates a government or other institutions.",
                  "examples": [
                    "They have in their present Constitution a  Grand Council of the Nobility, a  Senato, a  College of Twenty six who give Audience to Ambassadors and report their Demands to the Senate, a  Council of Ten; and a  Triumvirate (monthly chosen by, and out of, the Ten) of three  Inquisitors of State; whose Authority is so absolute, as to extend to the taking away of the Life of the  Doge no less than the meanest Artisan, without acquainting the Senate, provided they all three agree in the Sentence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A legal document describing such a formal system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Catholicism) A document issued by a religious authority serving to promulgate some particular church laws or doctrines.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person's physical makeup or temperament, especially in respect of robustness.",
                  "examples": [
                    "He has a strong constitution, so he should make a quick recovery from the illness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) The general health of a person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}