{
  "word": "quote",
  "etymologies": [
    {
      "description": [
        "From Middle English quoten, coten (“to mark (a book) with chapter numbers or marginal references”), from Old French coter, from Medieval Latin quotāre (“to distinguish by numbers, number chapters”), itself from Latin quotus (“which, what number (in sequence)”), from quot (“how many”) and related to quis (“who”). The sense developed via “to give as a reference, to cite as an authority” to “to copy out exact words” (since 1680); the business sense “to state the price of a commodity” (1866) revives the etymological meaning. The noun, in the sense of “quotation,” is attested from 1885; see also usage note, below."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quote (plural quotes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quotation; a statement attributed to a person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quotation mark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A summary of work to be done with a set price.",
                  "examples": [
                    "After going over the hefty quotes, the board decided it was cheaper to have the project executed by its own staff."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A price set for a financial security or commodity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quote (third-person singular simple present quotes, present participle quoting, simple past and past participle quoted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To repeat (the exact words of a person).",
                  "examples": [
                    "The writer quoted the president's speech."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prepare a summary of work to be done and set a price.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(commerce, transitive) To name the current price, notably of a financial security.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To indicate verbally or by equivalent means the start of a quotation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To observe, to take account of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}