{
  "word": "reflex",
  "etymologies": [
    {
      "description": [
        "From Late Latin reflexus, past participle of reflectere (“to bend back”). Photography sense is from noun sense meaning “reflection”."
      ],
      "adjectives": [
        {
          "description": "reflex (comparative more reflex, superlative most reflex)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bent, turned back or reflected.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Produced automatically by a stimulus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry, of an angle) Having greater than 180 degrees but less than 360 degrees.",
                  "examples": [
                    "A polygon is said to be convex when no one of its angles is reflex."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(painting) Illuminated by light reflected from another part of the same picture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "reflex (plural reflexes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An automatic response to a simple stimulus which does not require mental processing.",
                  "examples": [
                    "For a while, I shall have to make a conscious effort to smile, nod, stand and perform the thousands of little gestures which constitute life on Earth, and then those gestures will become reflexes again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) The descendant of an earlier language element, such as a word or phoneme, in a daughter language.",
                  "examples": [
                    "Synonym: derivative",
                    "Antonym: etymon",
                    "Coordinate term: cognate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, rare) The ancestor word corresponding to a descendant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The descendant of anything from an earlier time, such as a cultural myth.",
                  "examples": [
                    "The superstition of the loup-garou, or werewolf, belongs to the folklore of most modern nations, and has its reflex in the story of \"Little Red Riding-hood\" and others."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly photography) Reflection or an image produced by reflection. The light reflected from an illuminated surface to one in shade.",
                  "examples": [
                    "A reflex camera uses a mirror to reflect the image onto a ground-glass viewfinder."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "reflex (third-person singular simple present reflexes, present participle reflexing, simple past and past participle reflexed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bend back or turn back over itself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To reflect (light, sight, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To reflect or mirror (an object), to show the image of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To cast (beams of light) on something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To respond to a stimulus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}