{
  "word": "splice",
  "etymologies": [
    {
      "description": [
        "Circa 1525, borrowed from Middle Dutch splissen (Modern Dutch splitsen); akin to Middle Dutch splitten (“to split”), German spleißen (“to split, splice”), Spliss (“split ends, hair breakage”), French épisser (also from Dutch). The Dutch word originally referred only to the fraying of the ropes' ends but was then also used for the entire process of fraying and retying; hence the peculiar semantic development from “split” to “join”. The same development occurred in German."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "splice (plural splices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A junction or joining of ropes made by splicing them together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical) The electrical and mechanical connection between two pieces of wire or cable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) That part of a bat where the handle joins the blade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bonding or joining of overlapping materials.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) The process of removing intron sequences from the pre-messenger RNA, and then joining together exons.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "splice (third-person singular simple present splices, present participle splicing, simple past and past participle spliced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To unite, as two ropes, or parts of a rope, by a particular manner of interweaving the strands, the union being between two ends, or between an end and the body of a rope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To unite, as spars, timbers, rails, etc., by lapping the two ends together, or by applying a piece which laps upon the two ends, and then binding, or in any way making fast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To unite in marriage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To unite as if splicing.",
                  "examples": [
                    "He argues against attempts to splice different genres or species of literature into a single composition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) To remove intron sequences from the pre-messenger RNA, and then join together exons.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}