{
  "word": "vituperate",
  "etymologies": [
    {
      "description": [
        "Learned borrowing from Latin vituperātus (“censured; disparaged”) + English -ate (suffix forming adjectives with the sense ‘characterized by [the specified thing]’, and forming verbs with the sense ‘to act in [the specified manner]’). Vituperātus is the perfect passive participle of vituperō (“to blame, scold, tell off; to censure; to disparage, find fault with”), from vitium (“blemish, defect, flaw, imperfection; crime, misdeed, wrongdoing; fault, error, sin; vice; disease (of plants)”) (possibly from Proto-Indo-European *(d)wi-tyo- (“apart; wrong”), from *dwóh₁ (“two”)) + parō (“to acquire, get, obtain, procure; to arrange, order; to contrive, design; to furnish, provide; to produce; to decide, resolve”) (from Proto-Indo-European *per- (“to get, procure; to produce; to bring forward; to bring forth, carry forth; to go through”))."
      ],
      "adjectives": [
        {
          "description": "vituperate (comparative more vituperate, superlative most vituperate) (formal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, characterized by, or relating to abusive or harsh criticism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Which has been abusively or harshly criticized; also, deserving harsh criticism.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "vituperate (third-person singular simple present vituperates, present participle vituperating, simple past and past participle vituperated) (formal)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To criticize (someone or something) in an abusive or harsh manner.",
                  "examples": [
                    "Synonyms: berate, scold; see also Thesaurus:criticize",
                    "Antonyms: see Thesaurus:praise"
                  ]
                },
                {
                  "meaning": "To attack (someone or something) with abusive language; to revile, to vilify.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use abusive or harsh words.",
                  "examples": [
                    "Synonym: rail"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}