{
  "word": "capital",
  "etymologies": [
    {
      "description": [
        "From Middle English capital, borrowed from Latin capitālis (“of the head”) (in sense “head of cattle”), from caput (“head”) (English cap). Use in trade and finance originated in Medieval economies when a common but expensive transaction involved trading heads of cattle.",
        "Compare chattel and kith and kine (“all one’s possessions”), which also use “cow” to mean “property”."
      ],
      "adjectives": [
        {
          "description": "capital (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of prime importance.",
                  "examples": [
                    "a capital article in religion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chief, in a political sense, as being the seat of the general government of a state or nation.",
                  "examples": [
                    "London and Paris are capital cities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable, Britain, dated) Excellent.",
                  "examples": [
                    "That is a capital idea!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(crime) Punishable by, or involving punishment by, death.",
                  "examples": [
                    "Some 1,600 priests were deported, for example, while the total number of capital victims of the military commissions down to 1799 was only around 150."
                  ]
                }
              ]
            },
            {
              "group": "Uppercase.",
              "entries": [
                {
                  "meaning": "used to emphasise greatness or absoluteness",
                  "examples": [
                    "You're a genius with a capital G!",
                    "He's dead with a capital D!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to the head.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "capital (countable and uncountable, plural capitals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, economics) Already-produced durable goods available for use as a factor of production, such as steam shovels (equipment) and office buildings (structures).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, business, finance, insurance) Money and wealth. The means to acquire goods and services, especially in a non-barter system.",
                  "examples": [
                    "He does not have enough capital to start a business."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A city designated as a legislative seat by the government or some other authority, often the city in which the government is located; otherwise the most important city within a country or a subdivision of it.",
                  "examples": [
                    "Washington D.C. is the capital of the United States of America.",
                    "The Welsh government claims that Cardiff is Europe’s youngest capital."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The most important city in the field specified.",
                  "examples": [
                    "Hollywood is the film capital, New York the theater capital, Las Vegas the gambling capital."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An uppercase letter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, architecture) The uppermost part of a column.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Knowledge; awareness; proficiency.",
                  "examples": [
                    "Interpreters need a good amount of cultural capital in order to function efficiently in the profession."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, by extension) The chief or most important thing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}