{
  "word": "whisk",
  "etymologies": [
    {
      "description": [
        "Middle English [Term?], from Old Norse visk, from Proto-Germanic *wiskaz, *wiskō (“bundle of hay, wisp”), from Proto-Indo-European *weys-.",
        "Cognate with Danish visk, Dutch wis, German Wisch, Latin virga (“rod, switch”), viscus (“entrails”), Lithuanian vizgéti (“to tremble”), Czech vechet (“wisp of straw”), Sanskrit वेष्क (veṣka, “noose”). Compare also Old English wiscian (“to plait”), granwisc (“awn”).",
        "The unetymological wh- is probably expressive of the sound; compare the same development in whip and onomatopoeias such as whack and whoosh."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whisk (plural whisks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quick, light sweeping motion.",
                  "examples": [
                    "With a quick whisk, she swept the cat from the pantry with her broom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kitchen utensil, now usually made from stiff wire loops fixed to a handle (and formerly of twigs), used for whipping (or a mechanical device with the same function).",
                  "examples": [
                    "He used a whisk to whip up a light and airy souffle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bunch of twigs or hair etc, used as a brush.",
                  "examples": [
                    "Peter dipped the whisk in lather and applied it to his face, so he could start shaving."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small handheld broom with a small (or no) handle.",
                  "examples": [
                    "I used a whisk to sweep the counter, then a push-broom for the floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plane used by coopers for evening chines.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of cape, forming part of a woman's dress.",
                  "examples": [
                    "My wife in her new lace whiske."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "whisk (third-person singular simple present whisks, present participle whisking, simple past and past participle whisked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move something with quick light sweeping motions.",
                  "examples": [
                    "Vernon whisked the sawdust from his workbench."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) In cooking, to whip e.g. eggs or cream.",
                  "examples": [
                    "The chef prepared to whisk the egg whites for the angel's food cake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move something rapidly and with no warning.",
                  "examples": [
                    "I beg she would not impale worms, nor whisk carp out of one element into another."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move lightly and nimbly.",
                  "examples": [
                    "The children whisked down the road to the fair, laughing and chattering as they went."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move whiskers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "So called from the rapid action of sweeping the cards off the table after a trick has been won."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whisk (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The card game whist.",
                  "examples": [
                    "Trump, noddy, whisk, hole […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}