{
  "word": "beach",
  "etymologies": [
    {
      "description": [
        "From Middle English bache, bæcche (“bank, sandbank”), from Old English beċe (“beck, brook, stream”), from Proto-West Germanic *baki, from Proto-Germanic *bakiz (“brook”), from Proto-Indo-European *bʰog- (“flowing water”).",
        "Cognate with Dutch beek (“brook, stream”), German Bach (“brook, stream”), Swedish bäck (“stream, brook, creek”). More at batch, beck."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "beach (plural beaches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The shore of a body of water, especially when sandy or pebbly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A horizontal strip of land, usually sandy, adjoining water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Sussex, Kent) The loose pebbles of the seashore, especially worn by waves; shingle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(motorsports, euphemistic) Synonym of gravel trap",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A dry, dusty pitch or situation, as though playing on sand.",
                  "examples": [
                    "I never realised Lincoln was a seaside town. BRIAN LAWS Scunthorpe manager, after losing on a liberally sanded beach of a pitch"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "beach (third-person singular simple present beaches, present participle beaching, simple past and past participle beached)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To run aground on a beach.",
                  "examples": [
                    "When we finally beached, the land was scarcely less wet than the sea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To run (something) aground on a beach.",
                  "examples": [
                    "Great Aías led twelve ships from Sálamis",
                    "and beached them where Athenians formed for battle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a vehicle) To run into an obstacle or rough or soft ground, so that the floor of the vehicle rests on the ground and the wheels cannot gain traction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}