{
  "word": "frigate",
  "etymologies": [
    {
      "description": [
        "From French frégate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "frigate (plural frigates)",
          "definitionGroups": [
            {
              "group": "(nautical) Any of several types of warship:",
              "entries": [
                {
                  "meaning": "(historical) A sailing warship (of any size) built for speed and maneuverability; typically without raised upperworks, having a flush forecastle and tumblehome sides. [late 15th–mid-18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(historical) A sailing warship with a single continuous gun deck, typically used for patrolling and blockading duties, but not considered large enough for the line of battle. [mid-18th–mid-19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(historical) A warship combining sail and steam propulsion, typically of ironclad timber construction, supplementing and superseding sailing ships of the line at the beginning of the development of the ironclad battleship. [mid 19th–late 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(historical) A escort warship, smaller than a destroyer, introduced in World War 2 as an anti-submarine vessel. [mid 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "A modern type of warship, equivalent in size or smaller than a destroyer, often focused on anti-submarine warfare, but sometimes general purpose. [from mid-20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fiction) A warship or space warship, inspired by one of the many historic varieties of frigate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A frigatebird (Fregata spp.).",
                  "examples": [
                    "These frigates are all so lazy, that they perch by day on the trees, at the edge of the sea, awaiting the other birds  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}