{
  "word": "gulp",
  "etymologies": [
    {
      "description": [
        "From Middle English gulpen, probably from West Flemish or Middle Dutch gulpen, golpen, of uncertain origin. Perhaps of imitative origin, or related to Dutch galpen (“to roar, squeal”), English galp, gaup (“to gape”).",
        "Related to German Low German gulpen (“to gush out, belch, gulp”), West Frisian gjalpe, gjalpje, gjealpje (“to gush, spurt forth”), Danish gulpe, gylpe (“to gulp up, disgorge”), dialectal Swedish glapa (“to gulp down”), Old English galpettan (“to gulp down, eat greedily, devour”). More at galp."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gulp (plural gulps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The usual amount swallowed.",
                  "examples": [
                    "Synonym: slug"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sound of swallowing, sometimes indicating fear.",
                  "examples": [
                    "Indeed, the envisioned future should produce a bit of \"the gulp factor\"  […] , there should be an almost audible \"gulp\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, computing) An unspecified small number of bytes, often two.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gulp (third-person singular simple present gulps, present participle gulping, simple past and past participle gulped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To swallow eagerly, or in large draughts; to swallow up; to take down in one swallow.",
                  "examples": [
                    "Synonyms: see Thesaurus:drink"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To react nervously by swallowing.",
                  "examples": [
                    "The man eyed Percy with a chilly eye. \"Well,\" he said, \"What's troublin you?\" Percy gulped. The man's mere appearance was a sedative. \"Er-nothing! […]\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}