{
  "word": "latex",
  "etymologies": [
    {
      "description": [
        "Borrowed from New Latin latex (“clear fluid which is part of a humour or bodily fluid”), a later use of Latin latex (“water; liquid, fluid”). Potentially a borrowing from Ancient Greek λᾰ́τᾰξ (látax, “drop of wine”), reformed by analogy to other nouns in -ex. The semantic shift, however, from drop of wine to water is difficult to explain and may indicate that both words originated from a separate language. Perhaps from the same root as Proto-Celtic *lati- (Old Irish laith (“liquid, beer”), Welsh llad (“beer”)) or Proto-Germanic *ladjō- (Old High German letto (“clay, loam”), Old Norse leðja (“mud, dregs”)) or from a Pre-Greek  language."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "latex (countable and uncountable, plural latices or latexes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, archaic, rare) A clear liquid believed to be a component of a humour or other bodily fluid (esp. plasma and lymph)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The milky sap of several trees that coagulates on exposure to air; used to make rubber.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An emulsion of rubber in water, used in adhesives and the like.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Natural latex rubber, especially non-vulcanized rubber, such as is used in making latex gloves, latex condoms, and latex clothing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}