{
  "word": "behindhand",
  "etymologies": [
    {
      "description": [
        "behind +‎ hand"
      ],
      "adjectives": [
        {
          "description": "behindhand (comparative more behindhand, superlative most behindhand)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, of a person) Late, tardy, overdue, behind (in accomplishing a task, etc.).",
                  "examples": [
                    "These days before the examinations began were very difficult for everybody, and Perrin began that hideous “getting behind-hand” that made things accumulate so that there seemed no chance of ever catching up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, of a task or the object of a task) Not at the expected point of completion.",
                  "examples": [
                    "It was now the season for planting and sowing; many gardens and allotments of the villagers had already received their spring tillage; but the garden and the allotment of the Durbeyfields were behindhand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Behind (someone or something moving, a trend, etc.), lagging behind, not keeping up.",
                  "examples": [
                    "I have constantly observed, that the generality of people are fifty years, at least, behind-hand in their politicks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Behind in paying a debt; in arrears.",
                  "examples": [
                    "[…]  Frl. Mayr is behind-hand with the rent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Not having enough of, lacking (in something).",
                  "examples": [
                    "[…]  I have had for some time a very difficult and laborious respiration, but I am better by purges, abstinence, and other methods. I am yet however much behind-hand in my health and rest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Inferior, less advanced (compared with someone in something).",
                  "examples": [
                    "He had enough of that faculty of small talk to be sufficiently eloquent upon insignificant topics; he could point a compliment, or envelope a double meaning with all the readiness of a practitioner in that commodious art, and indeed he was not behindhand with any man of modern honour in the true principles of the sect  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "behindhand (comparative more behindhand, superlative most behindhand)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Belatedly, tardily.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) In debt, or in arrears.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}