{
  "word": "tenor",
  "etymologies": [
    {
      "description": [
        "From Middle English tenour, from Anglo-Norman tenour, from Old French tenor (“substance, contents, meaning, sense; tenor part in music”), from Latin tenor (“course, continuance; holder”), from teneō (“I hold”). In music, from the notion of the one who holds the melody, as opposed to the countertenor."
      ],
      "adjectives": [
        {
          "description": "tenor (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to the tenor part or range.",
                  "examples": [
                    "He has a tenor voice."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tenor (countable and uncountable, plural tenors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical range or section higher than bass and lower than alto.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, instrument, or group that performs in the tenor (higher than bass and lower than alto) range.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, music) A musical part or section that holds or performs the main melody, as opposed to the contratenor bassus and contratenor altus, who perform countermelodies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lowest tuned in a ring of bells.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Tone, as of a conversation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) duration; continuance; a state of holding on in a continuous course; general tendency; career.",
                  "examples": [
                    "Along the cool sequestered vale of life / They kept the noiseless tenor of their way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) The subject in a metaphor to which attributes are ascribed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) Time to maturity of a bond.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Stamp; character; nature.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An exact copy of a writing, set forth in the words and figures of it. It differs from purport, which is only the substance or general import of the instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That course of thought which holds on through a discourse; the general drift or course of thought; purport; intent; meaning; understanding.",
                  "examples": [
                    "He would have learned , by the whole tenor of the divine law , and especially by the example of the absent Lord , whose property he was for a season trusted with , that he was to do as much good to humanity , and win as much glory to God, as was compatible with the measure of his trust, and for the time for which he might retain it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, music) A tenor saxophone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}