{
  "word": "hulk",
  "etymologies": [
    {
      "description": [
        "From Middle English hulk, hulke, holke (“hut; shed for hogs; type of ship; husk, pod, shell; large, clumsy person; a giant”) (probably reinforced by\nMiddle Dutch hulk, huelc, and Middle Low German hulk, holk, hollek (“freighter, cargo ship, barge”)), from Old English hulc (“light ship; heavy, clumsy ship; cabin, hovel, hut”), from Proto-West Germanic *huluk, *hulik, from Proto-Germanic *hulukaz, *hulikaz (“something hollowed or dug out, cavity”), equivalent to hole/hollow +‎ -ock. Cognate with Old High German holcho (“cargo or transport ship, barge”) (whence Middle High German holche, modern German Holk), Old Norse hólkr (“metal tube, ring”), dialectal Norwegian holk, hylke (“wooden barrel”), Middle English holken (“to dig out, gouge”).",
        "Relation to Medieval Latin hulcus, holcas (“ship”) and Ancient Greek ὁλκάς (holkás, “ship being towed; cargo ship; ship used for trading”) (compare\nAncient Greek ἕλκω (hélkō, “to drag”), possibly from Proto-Indo-European *selk- (“to draw, pull”)) is uncertain. It is not known whether the Middle Latin word was borrowed from Old English, or vice versa. It is also uncertain whether the Middle Latin hulcus, holcas was borrowed from the Greeek or vice versa.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hulk (plural hulks)",
          "definitionGroups": [
            {
              "group": "(nautical)",
              "entries": [
                {
                  "meaning": "(archaic) A large ship used for transportation; (more generally) a large ship that is difficult to manoeuvre.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) A non-functional but floating ship, usually stripped of equipment and rigging, and often put to other uses such as accommodation or storage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A large structure with a dominating presence.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively) A big (and possibly clumsy) person.",
              "entries": [
                {
                  "meaning": "(bodybuilding) An excessively muscled person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hulk (third-person singular simple present hulks, present participle hulking, simple past and past participle hulked)",
          "definitionGroups": [
            {
              "group": "(transitive, nautical)",
              "entries": [
                {
                  "meaning": "To reduce (a ship) to a non-functional hulk.",
                  "examples": []
                },
                {
                  "meaning": "To temporarily house (goods, people, etc.) in such a hulk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (a large, hulking body).",
                  "examples": [
                    "Hadrian hulked his mass over the spot where the children had disappeared. 'You are still here, aren't you? I can feel your presence.' He walked forwards and his giant strides came down on the children. They scrambled out the way, [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be a hulk, that is, a large, hulking, and often imposing presence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a (large) person: to act or move slowly and clumsily.",
                  "examples": [
                    "After a while he hulked up to where Erland sat, putting his hairy fist on the table and watching the boy work."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant of holk (“to dig out, hollow out, make hollow; to dig up, excavate; to dig into, investigate”), from Middle English holken (“to dig out, hollow out; to dig up, excavate”) (compare holk (“a hollow; body cavity”)), perhaps from Middle Low German hȫlken (“to hollow out, gouge”), ultimately from Proto-Germanic *hulaz (“hollow”, adjective); further etymology uncertain, perhaps either from Proto-Indo-European *ḱel- (“to cover”), or *ḱewh₁- (“to swell; to be strong”). Compare also Old English āhlocian (“to dig out”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hulk (third-person singular simple present hulks, present participle hulking, simple past and past participle hulked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete except Britain, dialectal) To remove the entrails of; to disembowel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}