{
  "word": "broom",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English brom, from Old English brōm (“brushwood”), from Proto-West Germanic *brām (“bramble”) (compare Saterland Frisian Brom, West Frisian brem, Dutch braam, German Low German Braam), from Proto-Indo-European *bʰrem-, from *bʰer- ‘edge’. Related to brim, brink."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "broom (countable and uncountable, plural brooms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A domestic utensil with fibers bound together at the end of a long handle, used for sweeping.",
                  "examples": [
                    "Synonym: besom"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, curling) An implement with which players sweep the ice to make a stone travel further and curl less; a sweeper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several yellow-flowered shrubs of the family Fabaceae, in the tribe Genisteae, including genera Cytisus, Genista, and Spartium, with long, thin branches and small or few leaves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, rare) A shotgun, because it is more or less long, held similarly to a besom and “cleans” what is in front.",
                  "examples": [
                    "Synonyms: see Thesaurus:firearm"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "broom (third-person singular simple present brooms, present participle brooming, simple past and past participle broomed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To sweep with a broom.",
                  "examples": [
                    "“ […]   Sidi, I was busy in the exercise of my functions, occupied in brooming the front of the stables, when who should come but Hhamed Ould Denéï on horseback, at full gallop, as if he were going to break his neck.  […] ”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(roofing) To improve the embedding of a membrane by using a broom or squeegee to smooth it out and ensure contact with the adhesive under the membrane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) to get rid of someone, like firing an employee or breaking up with a girlfriend, to sweep another out of one's life",
                  "examples": [
                    "A word to the \"not-so-wise\" about your girlfriend. Do what you need to with her, then broom her fast."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "broom (third-person singular simple present brooms, present participle brooming, simple past and past participle broomed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Alternative form of bream (“to clean a ship's bottom”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}