{
  "word": "prostitute",
  "etymologies": [
    {
      "description": [
        "From Latin prōstitūtus, past participle of prōstituō, from prō̆ (“for, before”) +‎ statuō (“to set up, to erect”)."
      ],
      "adjectives": [
        {
          "description": "prostitute (comparative more prostitute, superlative most prostitute)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Debased, corrupt; seeking personal gain by dishonourable means. [16th–19th c.]",
                  "examples": [
                    "[H]e speaks a languages that merits not reply, and which can only excite contempt for his prostitute principles, or pity for his ignorance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Taking part in promiscuous sexual activity, licentious; (later, chiefly as attributive use of noun) that is a prostitute. [from 16th c.]",
                  "examples": [
                    "They rightly say that attacks against prostitute women are common and that it's only when five are murdered in one place that it starts to provoke debate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Exposed, subjected (to something shameful). [16th–18th c.]",
                  "examples": [
                    "As a matter of ease, exposed and prostitute to every Mother-wit, and to be attained without any great care or study."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "prostitute (plural prostitutes)",
          "definitionGroups": [
            {
              "group": "Any person (especially a woman) who has sexual intercourse or engages in other sexual activity for payment, especially as a means of livelihood. [from 18th c.]",
              "entries": [
                {
                  "meaning": "A woman who has sexual intercourse or engages in other sexual activity for payment, especially as a means of livelihood. [from 17th c.]",
                  "examples": [
                    "Unfortunately, there is to my knowledge no visual evidence for the dress of the Roman prostitute, but the literary sources present us with a range of prostitute clothing (from rich accoutrements all the way down to nothing),  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who does, or offers to do, a demeaning or dishonourable activity for money or personal gain; someone who acts in a dishonourable way for personal advantage. [from 17th c.]",
                  "examples": [
                    "Synonym: sellout"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "prostitute (third-person singular simple present prostitutes, present participle prostituting, simple past and past participle prostituted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, reflexive) To offer (oneself or someone else) for sexual activity in exchange for money. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, derogatory) To sacrifice (oneself, one's talents etc.) in return for profit or other advantage; to exploit for base purposes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}