{
  "word": "ally",
  "etymologies": [
    {
      "description": [
        "From Middle English allien, alien (“to form an alliance, associate, join; to become an ally; to introduce (someone) as an ally; to marry; to become related (to someone); to attack, engage in combat; to combine; (cooking) to combine ingredients, especially to bind them together”) [and other forms], from Anglo-Norman alier, allier, Middle French alier, allier [and other forms], and Old French alier (“to join together, unite; to alloy (metals); (cooking) to combine ingredients”) (modern French allier), from Latin alligāre, the present active infinitive of alligō, adligō (“to bind around, to, or up (something), bandage, fasten, fetter, tie; to hold fast; to detain, hinder”), from al-, ad- (intensifying prefix) + ligō (“to bind, tie; to bandage, wrap around; to unite”) (from Proto-Indo-European *leyǵ- (“to bind, tie”)). Doublet of allay, alligate, alloy, and ligament."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "ally (third-person singular simple present allies, present participle allying, simple past and past participle allied)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To unite or form a connection between (people or things), as between families by marriage, or between states by confederacy, league, or treaty.",
                  "examples": []
                },
                {
                  "meaning": "Chiefly followed by to or with: to connect or form a relation to (someone or something) by similarity in features or nature.",
                  "examples": []
                },
                {
                  "meaning": "(reflexive) To join or unite (oneself or itself) against, with, etc., someone or something else.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Chiefly followed by with: to enter into an alliance or unite for a common aim.",
                  "examples": [
                    "Synonym: make common cause"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English allie, alie [and other forms], probably partly:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ally (plural allies)",
          "definitionGroups": [
            {
              "group": "A person who co-operates with or helps another; an associate; a friend.",
              "entries": [
                {
                  "meaning": "A person who, or organization which, supports a demographic group subject to discrimination and/or misrepresentation but is not a member of the group; specifically (LGBT), a person who is not a member of the LGBT+ community but is supportive of it.",
                  "examples": [
                    "I’m glad you want to be a better ally to the disabled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, group, state, etc., which is associated or united by treaty with another for a common (especially military or political) purpose; a confederate.",
                  "examples": [
                    "The two countries were allies in World War I."
                  ]
                }
              ]
            },
            {
              "group": "Something regarded as connected with or related to another thing by similarity in features or nature.",
              "entries": [
                {
                  "meaning": "(taxonomy) An organism which is related to another organism through common evolutionary origin; specifically, a species which is closely related to another species, usually within the same family.",
                  "examples": [
                    "The order of Gruiformes includes cranes and their allies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A person, group, concept, etc., which is associated with another as a helper; an auxiliary; a supporter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical or obsolete) A kinsman or kinswoman; a relative.",
                  "examples": []
                }
              ]
            }
          ]
        },
        {
          "description": "ally pl (plural only) (obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's relatives; kin, kindred, relations; also, relationship through descent or marriage; kinship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "People, groups, states, etc., which are associated or united with each other for a common purpose; confederates; also, the state of being allied; alliance, confederation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See alley."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ally (plural allies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of alley (“a glass marble or taw”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}