{
  "word": "update",
  "etymologies": [
    {
      "description": [
        "From up- +‎ date."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "update (plural updates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An advisement providing more up-to-date information than currently known.",
                  "examples": [
                    "He gave me an update on the situation in New York."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A change in information, a modification of existing or known data.",
                  "examples": [
                    "I just made an update to the Wikipedia article on guerillas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An additional piece of information. An addition to existing information.",
                  "examples": [
                    "I just made an update to my blog about my trip to Rome."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A modification of something to a more recent, up-to-date version; (in software) a minor upgrade.",
                  "examples": [
                    "Our database receives an update every morning at 3 AM.",
                    "I have a couple of updates to install on your laptop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A version of something which is newer than other versions.",
                  "examples": [
                    "You should try the update: it rocks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "update (third-person singular simple present updates, present participle updating, simple past and past participle updated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring (a thing) up to date.",
                  "examples": [
                    "I need to update my records to take account of the most recent transaction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring (a person) up to date: to inform (a person) about recent developments.",
                  "examples": [
                    "Update me on what happened while I was away."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}