{
  "word": "madam",
  "etymologies": [
    {
      "description": [
        "From Middle English madame, from Old French madame, from ma (“my”) + dame (“lady”), from post-classical Latin mea domina. Doublet of Madonna."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "madam (plural madams or mesdames)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A polite form of address for a woman or lady.",
                  "examples": [
                    "Synonyms: dame, woman, lady, matron, mistress",
                    "Coordinate terms: sir, gentleman",
                    "Mrs Grey wondered if the outfit she was trying on made her look fat. The sales assistant just said, “It suits you, madam”.",
                    "Later, Mrs Grey was sitting in her favourite tea shop. “Would madam like the usual cream cakes and patisserie with her tea?” the waitress asked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The mistress of a household.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A conceited or quarrelsome girl.",
                  "examples": [
                    "Selina kept pushing and shoving during musical chairs. The nursery school teacher said she was a bad-tempered little madam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A woman who runs a brothel, particularly one that specializes in finding prostitutes for rich and important clients.",
                  "examples": [
                    "Synonyms: (archaic) abbess, bawd, lady abbess, nookie-bookie, whoremistress, brothel-keeper",
                    "Coordinate terms: (mostly for males) pimp, brothel-keeper",
                    "After she grew too old to work as a prostitute, she became a madam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India, derogatory slang) An irritable, conceited, or contemptous woman. (used as a general term of abuse).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "madam (third-person singular simple present madams, present participle madaming, simple past and past participle madamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To address as \"madam\".",
                  "examples": [
                    "He bowed to me, he madamed me, he was throughout as gentlemanlike and respectful as I had ever found him when we met at Old Harbour House or in Old Harbour Town."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}