{
  "word": "coronation",
  "etymologies": [
    {
      "description": [
        "From Late Middle English coronacion, coronacioun (“crowning of a sovereign or his consort; powers conferred by this ceremony; crowning of the Virgin Mary; (figuratively) placing of a crown of thorns on Jesus; act of rewarding a person with eternal life, happiness, honour, etc.”) [and other forms], borrowed from Anglo-Norman coronacion and Old French coronacion, coronation, from Late Latin *corōnātiōnem, from Latin corōnō (“to coronate, crown (with a crown, garland, etc.)”) + -ātiōnem (suffix forming nouns relating to actions or their results). Corōnō is derived from corōna (“garland, wreath; crown”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coronation (plural coronations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also attributively) An act of investing with a crown; a crowning.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically, also attributively) An act or the ceremony of formally investing a sovereign or the sovereign's consort with a crown and other insignia of royalty, on or shortly after their accession to the sovereignty.",
                  "examples": [
                    "Synonyms: crowning, (obsolete) crownment, (obsolete, rare) sacration",
                    "King Charles III’s coronation is to be much less elaborate compared to his mother’s."
                  ]
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "A completion or culmination of something.",
                  "examples": []
                },
                {
                  "meaning": "A success in the face of little or no opposition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(board games, rare) In the game of checkers or draughts: the act of turning a checker into a king when it has reached the farthest row forward.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}