{
  "word": "prothesis",
  "etymologies": [
    {
      "description": [
        "From Late Latin prothesis, prosthesis, alteration (dropping the ‘s’) from Ancient Greek πρόσθεσις (prósthesis, “addition, augmentation”), (English prosthesis) from προστίθημι (prostíthēmi, “I add”), from πρός (prós, “towards”) + τίθημι (títhēmi, “I place”), from Proto-Indo-European *próti, *préti + *dʰédʰeh₁- (“to be putting, to be placing”).",
        "However, often confused for a descendant of the Ancient Greek word πρόθεσις (próthesis, “a preposing, preposition”) (without the σ (s)), which is instead the source of a different term – see alternative etymology, below."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "prothesis (countable and uncountable, plural protheses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonology) The prepending of phonemes at the beginning of a word without changing its morphological structure, as in Spanish esfera from Latin sphaera (“sphere”) (without prothesis the word would have become *sfera).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Ancient Greek πρόθεσις (próthesis, “a preposing”), from προτίθημι (protíthēmi, “I prepose”), from πρό (pró, “before”) + τίθημι (títhēmi, “I place”), from Proto-Indo-European *pro + *dʰédʰeh₁ti (“to be putting, to be placing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "prothesis (countable and uncountable, plural protheses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The preparation and preliminary oblation of the Eucharistic bread and wine in the Divine Liturgy of the Eastern Orthodox and Eastern Catholic Churches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Credence table.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}