{
  "word": "needle",
  "etymologies": [
    {
      "description": [
        "From Middle English nedle, from Old English nǣdl, from Proto-West Germanic *nāþlu, from Proto-Germanic *nēþlō, from pre-Germanic *neh₁-tleh₂, from Proto-Indo-European *(s)neh₁- (“to spin, twist”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "needle (plural needles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, thin, sharp implement usually for piercing as in sewing, embroidery, acupuncture, tattooing, body piercing, medical injections, sutures, etc; or a blunt but otherwise similar implement used for forming loops or knots in crafts such as darning, knitting, tatting, etc.",
                  "examples": [
                    "The seamstress threaded the needle to sew on a button.",
                    "reusable needles",
                    "single-use needles"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any slender, pointed object resembling a needle, such as a pointed crystal, a sharp pinnacle of rock, an obelisk, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fine measurement indicator on a dial or graph.",
                  "examples": [
                    "a compass needle",
                    "The needle on the fuel gauge pointed to empty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A sensor for playing phonograph records, a phonograph stylus.",
                  "examples": [
                    "Ziggy bought some diamond needles for his hi-fi phonograph."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A needle-like leaf found on some conifers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strong beam resting on props, used as a temporary support during building repairs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, usually preceded by the) The death penalty carried out by lethal injection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) A text string that is searched for within another string. (see: needle in a haystack)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Any of various species of damselfly of the genus Synlestes, endemic to Australia.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "needle (third-person singular simple present needles, present participle needling, simple past and past participle needled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pierce with a needle, especially for sewing or acupuncture.",
                  "examples": [
                    "[…] the eyes were once more beginning to show the old nystagmus; so I decided to needle the cataracts, and on Jan. 31 I needled the right eye."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tease in order to provoke; to poke fun at.",
                  "examples": [
                    "Billy needled his sister incessantly about her pimples."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To form, or be formed, in the shape of a needle.",
                  "examples": [
                    "to needle crystals"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}