{
  "word": "answer",
  "etymologies": [
    {
      "description": [
        "From Middle English answere, andsware, from Old English andswaru (“answer”), from and- (“against”) +‎ -swaru (“affirmation”), (from Proto-Indo-European *h₂ent- (“front, forehead”) and Old English swerian (“to swear”), from Proto-Indo-European *swer-), suggesting an original meaning of \"a sworn statement rebutting a charge\". The cognates suggest the existence of Proto-Germanic *andaswarō (“a reply to a question”). Cognate with Old Frisian ondser (“answer”), Old Saxon andswōr (“answer”), Danish and Swedish ansvar (“liability, responsibility, answer”), Icelandic andsvar (“answer, response”). Compare also Old English andwyrde (“answer”) (cognate to Dutch antwoord, German Antwort), Old English andcwiss (“reply”), German Schwur (“oath, vow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "answer (plural answers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A response or reply; something said or done in reaction to a statement or question.",
                  "examples": [
                    "Her answer to his proposal was a slap in the face."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A solution to a problem.",
                  "examples": [
                    "There is no simple answer to corruption."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A document filed in response to a complaint, responding to each point raised in the complaint and raising counterpoints.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English answeren, andswaren, answerien, from Old English andswarian, answarien (“to answer, to respond, to deny an allegation under oath”), from Proto-Germanic *andaswarōną, *andaswarjaną (“to answer, to give a response, to rebut”), from *anda- (“against”) +‎ *swarjaną, *swarōną (“to swear an oath, to answer, to respond”), from Proto-Indo-European *swer- (“to swear”) and *h₂ent- (“face, forehead”), equivalent to and- (“against, back”) +‎ swear. Cognate with Old Frisian ondswera (“to answer”), Danish ansvare (“to answer, account for”), Swedish ansvara (“to answer, account for”), Icelandic andsvara (“to answer, reply”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "answer (third-person singular simple present answers, present participle answering, simple past and past participle answered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make a reply or response to.",
                  "examples": [
                    "He answered the question."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To speak in defence against; to reply to in defence.",
                  "examples": [
                    "to answer a charge or accusation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To respond to a call by someone at a door or telephone, or other similar piece of equipment.",
                  "examples": [
                    "She answered the door.",
                    "Nobody answered when I knocked on the door."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To suit a need or purpose satisfactorily.",
                  "examples": [
                    "Of course for publication in a newspaper, my palaeotype would not answer, but my glossotype would enable the author to give his Pennsylvania German in an English form and much more intelligibly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be accountable or responsible; to make amends.",
                  "examples": [
                    "Synonym: answer for",
                    "The man must answer to his employer for the money entrusted to his care.",
                    "He has a lot to answer for."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To file a document in response to a complaint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To correspond to; to be in harmony with; to be in agreement with.",
                  "examples": [
                    "Egad, I wish she had answer’d her picture as well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be opposite, or to act in opposition.",
                  "examples": [
                    "The windows answering each other, we could just discern the glowing horizon through them  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be or act in conformity, or by way of accommodation, correspondence, relation, or proportion; to conform; to correspond; to suit; usually with to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To respond to satisfactorily; to meet successfully by way of explanation, argument, or justification; to refute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be or act in compliance with, in fulfillment or satisfaction of, as an order, obligation, or demand.",
                  "examples": [
                    "He answered my claim upon him.",
                    "The servant answered the bell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To render account to or for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To atone for; to be punished for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be or act as an equivalent to, or as adequate or sufficient for; to serve for; to repay.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}