{
  "word": "stove",
  "etymologies": [
    {
      "description": [
        "From Middle Dutch stove and/or Middle Low German stove (compare Dutch stoof, German Low German Stuve, Stuuv), both from Proto-West Germanic *stobu, *stobō, from Proto-Germanic *stubō (“room, living room, heated room”), further origin uncertain. Cognate with Old English stofa (“bathroom, bathhouse”), stufbæþ (“hot-air bath”), Old High German stuba (whence German Stube), Old Norse stofa (whence Icelandic stofa (“living room”), Norwegian stove, Danish and Norwegian stue and Swedish stuga). The Germanic words are very old, and are the source of the Slavic and Romance terms. It is often speculated that the Germanic terms were borrowed from Vulgar Latin *extūfa, *extūfāre (“to heat with steam”), from Latin ex- + *tūfus (“hot vapor”), from Ancient Greek τῦφος (tûphos, “fever”).",
        "Doublet of stufa."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stove (plural stoves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heater, a closed apparatus to burn fuel for the warming of a room.",
                  "examples": [
                    "[I]n the countries of modern Europe, the use of stoves prevail throughout the north; while in France and Great Britain, open fires are used. In the warm countries of Italy and Spain, there are very few chimneys, and the only method usually practised of tempering the cold... is to burn charcoal in portable brasiers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for heating food, (UK) a cooker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stovetop, with hotplates.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK) A hothouse (heated greenhouse).",
                  "examples": [
                    "There existed only one specimen of this sacred tree in all Mexico, at least to the knowledge of the Mexicans;  […]  In spite, however, of the firmest convictions of the indivisibility of this tree — the Manitas, as it is commonly called — it has been propagated by cuttings, some of which are at this moment thriving in some of the larger stoves of our modern collectors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A house or room artificially warmed or heated.",
                  "examples": [
                    "When most of the waiters were commanded away to their supper, the Parlour or Stove being near emptied, in came a Company of Musketeers."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stove (third-person singular simple present stoves, present participle stoving, simple past and past participle stoved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To heat or dry, as in a stove.",
                  "examples": [
                    "to stove feathers"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep warm, in a house or room, by artificial heat.",
                  "examples": [
                    "to stove orange trees"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "stove",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense and past participle of stave",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}