{
  "word": "pantechnicon",
  "etymologies": [
    {
      "description": [
        "From Pantechnicon, a 19th-century firm which owned a building with a Greek-style facade of Doric columns in Motcomb Street, Belgrave Square, London, UK, with a picture gallery, a furniture shop, a shop selling carriages, and a warehouse for storing customers’ furniture and other items. The firm used large horse-drawn vans to collect and deliver their customers' property, which came to be known as Pantechnicon vans.",
        "The word was coined by the firm from pan- (“prefix meaning ‘all’”) (from Ancient Greek πᾶν (pân), neuter form of πᾶς (pâs, “all, every”)) + τεχνικόν (tekhnikón), neuter singular of τεχνικός (tekhnikós, “technical”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pantechnicon (plural pantechnicons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) A building or place housing shops or stalls where all sorts of (especially exotic) manufactured articles are collected for sale. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) Originally pantechnicon van: a van, especially a large moving or removal van. [from 19th c.]",
                  "examples": [
                    "The pantechnicon was running away. It had perceived the wrath to come and was fleeing. Its guardians had evidently left it imperfectly scotched or braked, and it had got loose.  […]  [T]he onrush of the pantechnicon constituted a clear crisis. Lower down the gradient of Brougham Street was more dangerous, and it was within the possibilities that people inhabiting the depths of the street might find themselves pitched out of bed by the sharp corner of a pantechnicon that was determined to be a pantechnicon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}