{
  "word": "ring",
  "etymologies": [
    {
      "description": [
        "From Middle English ryng, from Old English hring (“ring, circle”), from Proto-West Germanic *hring, from Proto-Germanic *hringaz (“ring”), from Proto-Indo-European *(s)krengʰ-, extended nasalized form of *(s)ker- (“to turn, bend”).",
        "Cognate with West Frisian ring, Low German Ring, Dutch ring, German Ring, Swedish ring, also Finnish rengas. Doublet of rink."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ring (plural rings)",
          "definitionGroups": [
            {
              "group": "(physical) A solid object in the shape of a circle.",
              "entries": [
                {
                  "meaning": "A circumscribing object, (roughly) circular and hollow, looking like an annual ring, earring, finger ring etc.",
                  "examples": [
                    "Synonyms: annulus, hoop, torus"
                  ]
                },
                {
                  "meaning": "A round piece of (precious) metal worn around the finger or through the ear, nose, etc.",
                  "examples": []
                },
                {
                  "meaning": "(Britain) A bird band, a round piece of metal put around a bird's leg used for identification and studies of migration.",
                  "examples": []
                },
                {
                  "meaning": "(UK) A burner on a kitchen stove.",
                  "examples": []
                },
                {
                  "meaning": "In a jack plug, the connector between the tip and the sleeve.",
                  "examples": []
                },
                {
                  "meaning": "(historical) An instrument, formerly used for taking the sun's altitude, consisting of a brass ring suspended by a swivel, with a hole at one side through which a solar ray entering indicated the altitude on the graduated inner surface opposite.",
                  "examples": []
                },
                {
                  "meaning": "(botany) A flexible band partly or wholly encircling the spore cases of ferns.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(physical) A group of objects arranged in a circle.",
              "entries": [
                {
                  "meaning": "A circular group of people or objects.",
                  "examples": [
                    "a ring of mushrooms growing in the wood"
                  ]
                },
                {
                  "meaning": "(astronomy) A formation of various pieces of material orbiting around a planet or young star.",
                  "examples": []
                },
                {
                  "meaning": "(Britain) A large circular prehistoric stone construction such as Stonehenge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of food in the shape of a ring.",
                  "examples": [
                    "onion rings"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) Short for webring.",
                  "examples": [
                    "Individuals looking to add their own homepage to a particular ring are, however, more or less at the mercy of the ringmaster, who often maintains a ring homepage listing its acceptance (or membership) policies and an index of its member sites."
                  ]
                }
              ]
            },
            {
              "group": "A place where some sports or exhibitions take place; notably a circular or comparable arena, such as a boxing ring or a circus ring; hence the field of a political contest.",
              "entries": [
                {
                  "meaning": "The open space in front of a racecourse stand, used for betting purposes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An exclusive group of people, usually involving some unethical or illegal practices.",
                  "examples": [
                    "a crime ring; a prostitution ring; a bidding ring (at an auction sale)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A group of atoms linked by bonds to form a closed chain in a molecule.",
                  "examples": [
                    "a benzene ring"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A planar geometrical figure included between two concentric circles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) A diacritical mark in the shape of a hollow circle placed above or under the letter; a kroužek.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An old English measure of corn equal to the coomb or half a quarter.",
                  "examples": [
                    "The ring is common in the Huntingdonshire accounts of Ramsey Abbey. It was equal to half a quarter, i.e., is identical with the coomb of the eastern counties"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing theory) A hierarchical level of privilege in a computer system, usually at hardware level, used to protect data and functionality (also protection ring).",
                  "examples": [
                    "Kernel Mode processes run in ring 0, and User Mode processes run in ring 3."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) Either of the pair of clamps used to hold a telescopic sight to a rifle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) The twenty-fifth Lenormand card.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ring (third-person singular simple present rings, present participle ringing, simple past and past participle ringed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enclose or surround.",
                  "examples": [
                    "The inner city was ringed with dingy industrial areas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To make an incision around; to girdle; to cut away a circular tract of bark from a tree in order to kill it.",
                  "examples": [
                    "They ringed the trees to make the clearing easier next year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attach a ring to, especially for identification.",
                  "examples": [
                    "We managed to ring 22 birds this morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surround or fit with a ring, or as if with a ring.",
                  "examples": [
                    "to ring a pig’s snout"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry) To rise in the air spirally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To steal and change the identity of (cars) in order to resell them.",
                  "examples": [
                    "Gabe said that as Derry had only caught part of the conversation, it's possible that they were discussing a film, it was bad enough that they'd unwittingly been brought into ringing cars, adding drugs into it was far more than either of them could ever be comfortable with."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, transitive) To ride around (a group of animals, especially catle) to keep them milling in one place; hence (intransitive), to work as a drover, to muster cattle.",
                  "examples": [
                    "‘I was ringing for your dad out there at Haddon Hill the year you was born. It was a good year for calves.’"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English ringen, from Old English hrinġan (“to ring”), from Proto-Germanic *hringijaną. Cognate with Dutch ringen, Swedish ringa."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ring (plural rings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The resonant sound of a bell, or a sound resembling it.",
                  "examples": [
                    "The church bell's ring could be heard the length of the valley.",
                    "The ring of hammer on anvil filled the air."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A pleasant or correct sound.",
                  "examples": [
                    "The name has a nice ring to it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A sound or appearance that is characteristic of something.",
                  "examples": [
                    "Her statements in court had a ring of falsehood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A telephone call.",
                  "examples": [
                    "I’ll give you a ring when the plane lands."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any loud sound; the sound of numerous voices; a sound continued, repeated, or reverberated.",
                  "examples": [
                    "the ring of acclamations fresh in his ears"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chime, or set of bells harmonically tuned.",
                  "examples": [
                    "St Mary's has a ring of eight bells."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ring (third-person singular simple present rings, present participle ringing, simple past rang or (nonstandard) rung, past participle rung)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a bell, etc., to produce a resonant sound.",
                  "examples": [
                    "The bells were ringing in the town."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (a bell, etc.) produce a resonant sound.",
                  "examples": [
                    "The deliveryman rang the doorbell to drop off a parcel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To produce (a sound) by ringing.",
                  "examples": [
                    "They rang a Christmas carol on their handbells."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To produce the sound of a bell or a similar sound.",
                  "examples": [
                    "Whose mobile phone is ringing?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) Of something spoken or written, to appear to be, to seem, to sound.",
                  "examples": [
                    "That does not ring true."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial, Britain, Australia, New Zealand) To telephone (someone).",
                  "examples": [
                    "I will ring you when we arrive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) to resound, reverberate, echo.",
                  "examples": [
                    "It is instructive for us to learn as well as to ponder on the fact that \"the very men who looked down with delight, when the sand of the arena reddened with human blood, made the arena ring with applause when Terence in his famous line: ‘Homo sum, Nihil humani alienum puto’ proclaimed the brotherhood of man.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce music with bells.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To repeat often, loudly, or earnestly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From a shortening of German Zahlring (“number(s) ring”) (coined by German mathematician David Hilbert in 1892). Apparently first used in English in 1930, E. T. Bell, “Rings whose elements are ideals,” Bulletin of the American Mathematical Society."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ring (plural rings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(algebra) An algebraic structure which consists of a set with two binary operations: an additive operation and a multiplicative operation, such that the set is an abelian group under the additive operation, a monoid under the multiplicative operation, and such that the multiplicative operation is distributive with respect to the additive operation.",
                  "examples": [
                    "The set of integers, \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle \\mathbb {Z} }\n  \n, is the prototypical ring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(algebra) An algebraic structure as above, but only required to be a semigroup under the multiplicative operation, that is, there need not be a multiplicative identity element.",
                  "examples": [
                    "The definition of ring without unity allows, for instance, the set \n  \n    \n      \n        2\n        \n          Z\n        \n      \n    \n    {\\displaystyle 2\\mathbb {Z} }\n  \n of even integers to be a ring."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ring (plural rings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematical analysis, measure theory) A family of sets that is closed under finite unions and differences.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}