{
  "word": "bunt",
  "etymologies": [
    {
      "description": [
        "Unknown. Perhaps a nasalised variant of butt."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bunt (countable and uncountable, plural bunts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The middle part, cavity, or belly of a sail; the part of a furled sail which is at the center of the yard.",
                  "examples": [
                    "The bunt of the sail was green."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A push or shove; a butt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, softball) A ball that has been intentionally hit softly so as to be difficult to field, sometimes with a hands-spread batting stance or with a close-hand, choked-up hand position. No swinging action is involved.",
                  "examples": [
                    "The bunt was fielded cleanly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, softball) The act of bunting.",
                  "examples": [
                    "The manager will likely call for a bunt here."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The second half of an outside loop, from level flight to inverted flight.",
                  "examples": [
                    "(by extension) Any large pilot-commanded pitch-down motion of an aircraft, often producing negative G-forces and resulting in a large negative change in flightpath angle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A fungus (Ustilago foetida) affecting the ear of cereals, filling the grains with a foetid dust.",
                  "examples": [
                    "Synonym: pepperbrand"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bunt (third-person singular simple present bunts, present participle bunting, simple past and past participle bunted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To push with the horns; to butt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To spring or rear up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To intentionally hit softly with a hands-spread batting stance.",
                  "examples": [
                    "Jones bunted the ball."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, baseball) To intentionally hit a ball softly with a hands-spread batting stance.",
                  "examples": [
                    "Jones bunted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, aviation) To perform (the second half of) an outside loop.",
                  "examples": [
                    "We had heard that there was an elite group of three or four pilots in Jodhpur called the \"Bunt Club\", who had successfully bunted their aircraft - that is, carried out the second half of an outside loop. In the Bunt, you pushed the nose down, past the vertical and still further, until you were in horizontal inverted flight, and came out on the other side and rolled it out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) To swell out.",
                  "examples": [
                    "The sail bunts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, of a cat) To headbutt affectionately.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}