{
  "word": "peg",
  "etymologies": [
    {
      "description": [
        "From Middle English pegge, from Middle Dutch pegge (“pin, peg”), from Old Dutch *pigg-, *pegg-, from Proto-Germanic *pig-, *pag- (“peg, stake”), from Proto-Indo-European *bak-, *baḱ- (“club, pointed stick, peg”). Cognate with Dutch dialectal peg (“pin”), Low German pig, pigge (“peg, stick with a point”), Low German pegel (“post, stake”), Swedish pigg (“tooth, spike”), Danish pig (“spike”), Norwegian Bokmål pigg (“spike”), Irish bac (“stick, crook”), Latin baculum (“staff”), Latvian bakstît (“to poke”), Ancient Greek βάκτρον (báktron, “staff, walking stick”). Related to beak.",
        "This is one of the very few English words that begin with a p and come from Proto-Germanic. Proto-Germanic *p, when not in a consonant cluster beginning with *s, developed by Grimm's law from the Proto-Indo-European consonant *b, which was very rare."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "peg (plural pegs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cylindrical wooden or metal object used to fasten or as a bearing between objects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A protrusion used to hang things on.",
                  "examples": [
                    "Hang your coat on the peg and come in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A support; a reason; a pretext.",
                  "examples": [
                    "a peg to hang a claim upon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cribbage) A peg moved on a crib board to keep score.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A fixed exchange rate, where a currency's value is matched to the value of another currency or measure such as gold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A small quantity of a strong alcoholic beverage.",
                  "examples": [
                    "Synonym: shot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place formally allotted for fishing",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, dated) A leg or foot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the pins of a musical instrument, on which the strings are strained.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A step; a degree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ellipsis of clothes peg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) A topic of interest, such as an ongoing event or an anniversary, around which various features can be developed.",
                  "examples": [
                    "Journalists and prospective sources wishing to attract their attention are constantly on the lookout for pegs. The process by which a peg is identified is informed by news values."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, slang) A stump.",
                  "examples": [
                    "Lindy hit the pegs with five deliveries out of six."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The penetration of one's (male) partner in the anus using a dildo.",
                  "examples": [
                    "Get your strap-on out and give me a nice peg!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) A serving of brandy and soda.",
                  "examples": [
                    "I then ordered a \"peg\" (brandy-and-soda) to be brought to my tent, and returned to have a smoke before turning in again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) A serving of any hard spirit, particularly whisky.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A shilling.",
                  "examples": [
                    "The price of a case (five shillings piece bad) from the smasher is about one shilling; an alderman (two and sixpence) about sixpence; a peg (shilling) about threepence; a downer or sprat (sixpence) about twopence."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "peg (third-person singular simple present pegs, present participle pegging, simple past and past participle pegged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fasten using a peg.",
                  "examples": [
                    "Let's peg the rug to the floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To affix or pin.",
                  "examples": [
                    "I found a tack and pegged your picture to the bulletin board.",
                    "She lunged forward and pegged him to the wall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fix a value or price.",
                  "examples": [
                    "China's currency is no longer pegged to the American dollar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To narrow the cuff openings of a pair of pants so that the legs take on a peg shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To throw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To indicate or ascribe an attribute to. (Assumed to originate from the use of pegs or pins as markers on a bulletin board or a list.)",
                  "examples": [
                    "He's been pegged as a suspect.",
                    "I pegged his weight at 165."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cribbage) To move one's pegs to indicate points scored; to score with a peg.",
                  "examples": [
                    "She pegged twelve points."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To reach or exceed the maximum value on (a scale or gauge).",
                  "examples": [
                    "We pegged the speedometer across the flats."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive, typically in heterosexual contexts) To engage in anal sex by penetrating (one's male partner) with a dildo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To keep working hard at something; to peg away.",
                  "examples": [
                    "For more than the period of his splendid service in India, which the country was not slow to acknowledge, the Volunteers had kept pegging at it, despite all the official obstacles thrown in the way  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) To drink alcohol frequently, especially brandy and soda; to tipple.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}