{
  "word": "tackle",
  "etymologies": [
    {
      "description": [
        "From Middle English takel (“gear, apparatus”), from Middle Dutch or Middle Low German takel (“ship's rigging”), perhaps related to Middle Dutch taken (“to grasp, seize”). Akin to Danish takkel (“tackle”), Swedish tackel (“tackle”). More at take."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tackle (countable and uncountable, plural tackles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for grasping an object and an attached means of moving it, as a rope and hook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A block and tackle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, slang, uncountable) Clothing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing, uncountable) Equipment (rod, reel, line, lure, etc.) used when angling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, informal, by extension) Equipment, gear, gadgetry.",
                  "examples": [
                    "... an illuminated license-plate frame bearing his likeness, signature, and yellow number 24. \"That there's a real nice piece of tackle. ...\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, countable) A play where a player attempts to take control over the ball from an opponent, as in rugby or football.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby, American football, countable) A play where a defender brings the ball carrier to the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any instance in which one person intercepts another and forces them to the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) An offensive line position between a guard and an end: offensive tackle; a person playing that position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A defensive position between two defensive ends: defensive tackle; a person playing that position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A man's genitalia.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tackle (third-person singular simple present tackles, present participle tackling, simple past and past participle tackled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To force a person to the ground with the weight of one's own body, usually by jumping on top or slamming one's weight into them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To face or deal with, attempting to overcome or fight down.",
                  "examples": [
                    "The government's measures to tackle crime were insufficient."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) To attempt to take away a ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby, American football) To bring a ball carrier to the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Singapore, colloquial) To \"hit on\" or pursue a person that one is interested in.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}