{
  "word": "hook",
  "etymologies": [
    {
      "description": [
        "From Middle English hoke, from Old English hōc, from Proto-West Germanic *hōk, from Proto-Germanic *hōkaz, variant of *hakô (“hook”), probably ultimately from Proto-Indo-European *kog-, *keg-, *keng- (“peg, hook, claw”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hook (plural hooks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rod bent into a curved shape, typically with one end free and the other end secured to a rope or other attachment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A barbed metal hook used for fishing; a fishhook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various hook-shaped agricultural implements such as a billhook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The curved needle used in the art of crochet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a hinge which is fixed to a post, and on which a door or gate hangs and turns.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loop shaped like a hook under certain written letters, for example, g and j.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tie-in to a current event or trend that makes a news story or editorial relevant and timely.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A snare; a trap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) The projecting points of the thighbones of cattle; called also hook bones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Removal or expulsion from a group or activity.",
                  "examples": [
                    "He is not handling this job, so we're giving him the hook."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture) A field sown two years in succession.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(authorship) A brief, punchy opening statement intended to get attention from an audience, reader, or viewer, and make them want to continue to listen to a speech, read a book, or watch a play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(narratology) A gimmick or element of a creative work intended to be attention-grabbing for the audience; a compelling idea for a story that will be sure to attract people's attention.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge, slang) A finesse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games, slang) A jack (the playing card).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) A spit or narrow cape of sand or gravel turned landward at the outer end, such as Sandy Hook in New Jersey.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A catchy musical phrase which forms the basis of a popular song.",
                  "examples": [
                    "The song's hook snared me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, informal) A ship's anchor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) Part of a system's operation that can be intercepted to change or augment its behaviour.",
                  "examples": [
                    "Synonym: endpoint",
                    "We've added hooks to allow undefined message types to be handled with custom code."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scrabble) An instance of playing a word perpendicular to a word already on the board, adding a letter to the start or the end of the word to form a new word.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) a diacritical mark shaped like the upper part of a question mark, as in ỏ.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography, rare) a háček.",
                  "examples": [
                    "Common diacritics in Slavonic language are the hook ˇ (as in haček – Czech for ‘hook’) and the stroke ´ (robić – Polish for ‘do/make’)."
                  ]
                }
              ]
            },
            {
              "group": "Senses relating to sports.",
              "entries": [
                {
                  "meaning": "(baseball) A curveball.",
                  "examples": [
                    "He threw a hook in the dirt."
                  ]
                },
                {
                  "meaning": "(basketball) a basketball shot in which the offensive player, usually turned perpendicular to the basket, gently throws the ball with a sweeping motion of his arm in an upward arc with a follow-through which ends over his head. Also called hook shot.",
                  "examples": []
                },
                {
                  "meaning": "(bowling) A ball that is rolled in a curved line.",
                  "examples": []
                },
                {
                  "meaning": "(boxing) a type of punch delivered with the arm rigid and partially bent and the fist travelling nearly horizontally mesially along an arc",
                  "examples": [
                    "The heavyweight delivered a few powerful hooks that staggered his opponent."
                  ]
                },
                {
                  "meaning": "(cricket) A type of shot played by swinging the bat in a horizontal arc, hitting the ball high in the air to the leg side, often played to balls which bounce around head height.",
                  "examples": []
                },
                {
                  "meaning": "(golf) A golf shot that (for the right-handed player) curves unintentionally to the left. (See draw, slice, fade.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, Australia, military) Any of the chevrons denoting rank.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A prostitute.",
                  "examples": [
                    "Synonym: hooker"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A pickpocket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) Synonym of shoulder (“the part of a wave that has not yet broken”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, chiefly historical) A knee-shaped wooden join connecting the keel to the stem (post forming the frontmost part of the bow) or the sternpost in cog-like vessels or similar vessels.",
                  "examples": [
                    "Hyponym: heel knee"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hook (third-person singular simple present hooks, present participle hooking, simple past and past participle hooked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attach a hook to.",
                  "examples": [
                    "Hook the bag here, and the conveyor will carry it away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To catch with a hook (hook a fish).",
                  "examples": [
                    "He hooked a snake accidentally, and was so scared he dropped his rod into the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work yarn into a fabric using a hook; to crochet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To insert in a curved way reminiscent of a hook.",
                  "examples": [
                    "He hooked his fingers through his belt loops."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ensnare or obligate someone, as if with a hook.",
                  "examples": [
                    "She's only here to try to hook a husband.",
                    "A free trial is a good way to hook customers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, US, slang, archaic) To steal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To connect (hook into, hook together).",
                  "examples": [
                    "If you hook your network cable into the jack, you'll be on the network."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in passive) To make addicted; to captivate.",
                  "examples": [
                    "He had gotten hooked on cigarettes in his youth.",
                    "I watched one episode of that TV series and now I'm hooked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, golf) To play a hook shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby) To succeed in heeling the ball back out of a scrum (used particularly of the team's designated hooker).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(field hockey, ice hockey) To engage in the illegal maneuver of hooking (i.e., using the hockey stick to trip or block another player)",
                  "examples": [
                    "The opposing team's forward hooked me, but the referee didn't see it, so no penalty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer, bowling) To swerve a ball; kick or throw a ball so it swerves or bends.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To engage in prostitution.",
                  "examples": [
                    "I had a cheap flat in the bad part of town, and I could watch the working girls hooking from my bedroom window."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scrabble) To play a word perpendicular to another word by adding a single letter to the existing word.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge, slang) To finesse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seize or pierce with the points of the horns, as cattle in attacking enemies; to gore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move or go with a sudden turn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}