{
  "word": "thank",
  "etymologies": [
    {
      "description": [
        "From Middle English thank, from Old English þanc (“thought, favour, grace, pleasure, satisfaction, thanks”), from Proto-Germanic *þankaz (“thought, remembrance, gratitude”), from Proto-Indo-European *tong-, *teng- (“to think”). Cognate with Saterland Frisian Tonk, West Frisian tank, Dutch dank, Low German Dank, German Dank, Danish tak, Swedish tack, Faroese tøkk, Icelandic þökk. Related to thought."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thank (plural thanks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete in the singular) An expression of appreciation; a thought.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English thanken, thankien, from Old English þancian, þoncian (“to thank, give thanks”), from Proto-Germanic *þankōną (“to thank”), from Proto-Germanic *þankaz (“thought, gratitude”), from Proto-Indo-European *teng- (“to think, feel”). Cognate with Saterland Frisian tonkje (“to thank”), West Frisian tanke (“to thank”), Dutch danken (“to thank”), Low German danken (“to thank”), German danken (“to thank”), Danish takke (“to thank”), Swedish tacka (“to thank”), Icelandic þakka (“to thank”). Of the same root as the above etymology. Related to thought."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "thank (third-person singular simple present thanks, present participle thanking, simple past and past participle thanked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To express gratitude or appreciation toward.",
                  "examples": [
                    "She thanked him for the lift."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To feel gratitude or appreciation toward.",
                  "examples": [
                    "I'll thank you not to smoke in my house!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To credit or hold responsible.",
                  "examples": [
                    "We can thank global warming for this weather."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}