{
  "word": "frazzle",
  "etymologies": [
    {
      "description": [
        "Originally an East Anglian word. Either from a variant of the now obsolete fazle (“to unravel”), altered due to influence from fray, or from a blend of fazle and fray. fazle comes from earlier fasel, which was inherited from Middle English facelyn (“[of the end of a rope, or of cloth] to unravel”). Middle English facelyn was a verbal derivative of the noun fasylle (“frayed edge”), which was in turn a derivative (with the diminutive suffix -el) of Old English fæs (“fringe, border”), from Proto-West Germanic *fas, from Proto-Germanic *fasōn.",
        "Related to German Faser (“fibre”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "frazzle (plural frazzles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A burnt fragment; a cinder or crisp.",
                  "examples": [
                    "The bacon was burned to a frazzle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) The condition or quality of being frazzled; a frayed end.",
                  "examples": [
                    "My fingers are all cut to frazzles."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "frazzle (third-person singular simple present frazzles, present participle frazzling, simple past and past participle frazzled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fray or wear down, especially at the edges.",
                  "examples": [
                    "The new puppy has been chewing on everything, and my favorite afghan has become frazzled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drain emotionally or physically.",
                  "examples": [
                    "After dealing with the children all day, I just can't help feeling frazzled."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}