{
  "word": "insure",
  "etymologies": [
    {
      "description": [
        "Recorded since about 1440, as a variant of Middle English ensuren (from Anglo-Norman enseurer, itself from en- (“make”) + seür (“sure”), probably influenced by Old French asseürer (“to assure”)); took on its particular sense of \"make safe against loss by payment of premiums\" in 1635, replacing assure."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "insure (third-person singular simple present insures, present participle insuring, simple past and past participle insured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide for compensation if some specified risk occurs. Often agreed by policy (contract) to offer financial compensation in case of an accident, theft or other undesirable event.",
                  "examples": [
                    "I'm not insured against burglary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To deal in such contracts; subscribe to a policy of insurance",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, transitive, dated) Alternative spelling of ensure; to make sure or certain of; guarantee.",
                  "examples": [
                    "We the People of the United States, in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defence, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}