{
  "word": "muzzle",
  "etymologies": [
    {
      "description": [
        "From earlier muzle, musle, mousle, mussel, mozell, from Middle English mosel, from Old French musel, museau, muzeau (modern French museau), from Late Latin mūsus (“snout”), probably expressive of the shape of protruded lips and/or influenced by Latin mūgīre (“to moo, bellow”). Doublet of museau."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "muzzle (plural muzzles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The protruding part of an animal's head which includes the nose, mouth and jaws.",
                  "examples": [
                    "Synonym: snout"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory, by extension) A person's mouth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device used to prevent an animal from biting or eating, which is worn on its snout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) The mouth or the end for entrance or discharge of a gun, pistol etc., that the bullet emerges from.",
                  "examples": [
                    "Coordinate term: breech"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Scotland) A piece of the forward end of the plow-beam by which the traces are attached.",
                  "examples": [
                    "Synonym: bridle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, historical) An openwork covering for the nose, used for the defense of the horse, and forming part of the bards in the 15th and 16th centuries.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "muzzle (third-person singular simple present muzzles, present participle muzzling, simple past and past participle muzzled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bind or confine an animal's mouth by putting a muzzle, as to prevent it from eating or biting.",
                  "examples": [
                    "Thou shalt not muzzle the ox when he treadeth out the corn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To restrain (from speaking, expressing opinion or acting); to gag; to silence; to censor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To veil, mask, muffle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To fondle with the closed mouth; to nuzzle.",
                  "examples": [
                    "Venus her self would sit Muzzling and Gazing them in the Eyes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bring the muzzle or mouth near.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}