{
  "word": "ithyphallic",
  "etymologies": [
    {
      "description": [
        "Borrowed from Late Latin ithyphallicus, from Ancient Greek ἰθυφαλλικός (ithuphallikós), from ῑ̓θῠ́φαλλος (īthúphallos, “phallus carried in festivals of Bacchus; ode sung in honour of the phallus; dance accompanying such an ode; dancer performing such a dance”) + -ῐκός (-ikós, suffix forming adjectives meaning ‘of or pertaining to’). ῑ̓θῠ́φαλλος is derived from ἰθῠ́ς (ithús) (variant of εὐθῠ́ς (euthús, “straight”)) + φαλλός (phallós, “penis; image of a penis, phallus”). The English word can be analysed as ithyphallus +‎ -ic.",
        "As regards the noun, compare Latin ithyphallicum (“poem with the same metre as the hymns to Priapus”)."
      ],
      "adjectives": [
        {
          "description": "ithyphallic (comparative more ithyphallic, superlative most ithyphallic)",
          "definitionGroups": [
            {
              "group": "(historical, Ancient Rome) Of or pertaining to the erect phallus that was carried in bacchic processions.",
              "entries": [
                {
                  "meaning": "(specifically) Of a poem or song: having the metre of an ode sung in honour of the bacchic phallus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to an upward pointing, erect penis; (specifically) of an artistic depiction of a deity or other figure: possessing an erect penis.",
                  "examples": [
                    "Synonym: (one sense) priapic"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Lascivious, obscene.",
                  "examples": [
                    "Synonyms: see Thesaurus:obscene"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetry) Pertaining to a metrical combination of two trochees followed by one spondee.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "ithyphallic (plural ithyphallics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A poem or song in an ithyphallic metre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lascivious or obscene poem or song.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}