{
  "word": "chaos",
  "etymologies": [
    {
      "description": [
        "Borrowed from Ancient Greek χάος (kháos, “vast chasm, void”). Doublet of gas, which was borrowed through Dutch.",
        "In Early Modern English, used in the sense of the original Greek word. In the meaning \"primordial matter\" from the 16th century. Figurative usage in the sense \"confusion, disorder\" from the 17th century. The technical sense in mathematics and science dates from the 1960s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chaos (usually uncountable, plural chaoses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The unordered state of matter in classical accounts of cosmogony.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any state of disorder; a confused or amorphous mixture or conglomeration.",
                  "examples": [
                    "to descend into chaos",
                    "After the earthquake, the local hospital was in chaos"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A behaviour of iterative non-linear systems in which arbitrarily small variations in initial conditions become magnified over time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fantasy) One of the two metaphysical forces of the world in some fantasy settings, as opposed to law.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A vast chasm or abyss.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A given medium; a space in which something exists or lives; an environment.",
                  "examples": [
                    "What is the centre of the earth? is it pure element only, as Aristotle decrees, inhabited (as Paracelsus thinks) with creatures whose chaos is the earth: or with fairies, as the woods and waters (according to him) are with nymphs, or as the air with spirits?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}