{
  "word": "thatch",
  "etymologies": [
    {
      "description": [
        "Variant of thack, from Middle English thache, thach, from Old English þæc (“roof-covering”), from Proto-West Germanic *þak, from Proto-Germanic *þaką (“covering”), from (o-grade of) Proto-Indo-European *(s)teg- (“cover”).",
        "Cognate with Icelandic þak, Dutch dak, German Dach, Norwegian tak, Swedish tak, Danish tag; and with Latin toga, Albanian thak (“awn, beard, pin, peg, tassel, fringe”), Lithuanian stogas (“roof”). Related to Ancient Greek τέγος (tégos, “roof”) and στέγη (stégē, “roof”). See also English deech, deck."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thatch (countable and uncountable, plural thatches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Straw, rushes, or similar, used for making or covering the roofs of buildings, or of stacks of hay or grain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Caribbean) Any of several kinds of palm, the leaves of which are used for thatching.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A buildup of cut grass, stolons or other material on the soil in a lawn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any straw-like material, such as a person's hair.",
                  "examples": [
                    "An outgoing, story-telling Irishman from Butte, Montana, with his thatch of red hair and sandpapered face, Matt was the quintessential imp."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English thacchen, from Old English þeċċan, þeċċean (“to cover”), from Proto-West Germanic *þakkjan, from Proto-Germanic *þakjaną (“to cover”), from Proto-Germanic *þaką (“cover, covering”, noun) (see above).",
        "Cognate with West Frisian dekke, Dutch dekken, German decken, Danish tække, Swedish täcka. Alteration of vowel after Middle English perhaps due to the above noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "thatch (third-person singular simple present thatches, present participle thatching, simple past and past participle thatched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover the roof with straw, reed, leaves, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}