{
  "word": "amplitude",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French amplitude, from Latin amplitūdō, from amplus (“large”); synchronically, ample +‎ -itude."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "amplitude (countable and uncountable, plural amplitudes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The measure of something's size, especially in terms of width or breadth; largeness, magnitude.",
                  "examples": [
                    "The cathedral of Lincoln  […]  is a magnificent structure, proportionable to the amplitude of the diocese."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The maximum absolute value of the vertical component of a curve or function, especially one that is periodic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) The maximum absolute value of some quantity that varies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) The arc of the horizon between the true east or west point and the center of the sun, or a star, at its rising or setting. At the rising, the amplitude is eastern or ortive: at the setting, it is western, occiduous, or occasive. It is also northern or southern, when north or south of the equator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) The arc of the horizon between the true east or west point and the foot of the vertical circle passing through any star or object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) The horizontal line which measures the distance to which a projectile is thrown; the range.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}