{
  "word": "bonfire",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Late Middle English bon-fir, bonefire, bonnefyre (“fire in which bones are burnt, bonfire”) [and other forms], apparently from bon (“bone; series of connected bones regarded as a unit; bone-like part of the body such as a piece of cartilage, tooth, tusk, etc.; animal’s dewclaw”) + fir (“fire”). Bon is derived from Old English bān (“bone”) (ultimately from Proto-Indo-European *bʰeyh₂- (“to hit, strike; to cut, hew”)), while fir is from Old English fȳr (“fire”) (ultimately from Proto-Indo-European *péh₂wr̥ (“fire”)). The first element of the word has sometimes been assumed to be French bon (“good; correct, right”).",
        "The Oxford English Dictionary (OED) notes that bonfires, originally lit as part of midsummer celebrations, were not generally associated with the burning of bones. However, the first edition of the OED (under the title A New English Dictionary on Historical Principles, 1887) stated that “for the annual midsummer ‘banefire’ or ‘bonfire’ in the burgh of Hawick [in Roxburghshire, Scotland], old bones were regularly collected and stored up, down to c. 1800”.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bonfire (plural bonfires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large, controlled outdoor fire lit to celebrate something or as a signal.",
                  "examples": [
                    "Synonym: (archaic or obsolete) bale"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fire lit outdoors to burn unwanted items; originally (historical), heretics or other offenders, or banned books; now, generally agricultural or garden waste, or rubbish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something like a bonfire (sense 1 or 2) in heat, destructiveness, ferocity, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A fire lit to cremate a dead body; a funeral pyre.",
                  "examples": [
                    "Synonym: (archaic) bale"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bonfire (third-person singular simple present bonfires, present participle bonfiring, simple past and past participle bonfired)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To destroy (something) by, or as if by, burning on a bonfire; (more generally) to burn or set alight.",
                  "examples": []
                },
                {
                  "meaning": "(ceramics) To fire (pottery) using a bonfire.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To start a bonfire in (a place); to light up (a place) with a bonfire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare) To make, or celebrate around, a bonfire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}