{
  "word": "crew",
  "etymologies": [
    {
      "description": [
        "From Middle English crue, from Old French creue (“an increase, recruit, military reinforcement”), the feminine past participle of creistre (“grow”), from Latin crescere (“to arise, grow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crew (plural crews)",
          "definitionGroups": [
            {
              "group": "A group of people together",
              "entries": [
                {
                  "meaning": "(obsolete) Any company of people; an assemblage; a throng.",
                  "examples": []
                },
                {
                  "meaning": "A group of people (often staff) manning and operating a large facility or piece of equipment such as a factory, ship, boat, airplane, or spacecraft.",
                  "examples": [
                    "If you need help, please contact a member of the crew."
                  ]
                },
                {
                  "meaning": "A group of people working together on a task.",
                  "examples": [
                    "The crews competed to cut the most timber."
                  ]
                },
                {
                  "meaning": "(art) The group of workers on a dramatic production who are not part of the cast.",
                  "examples": [
                    "There are a lot of carpenters in the crew!",
                    "The crews for different movies would all come down to the bar at night."
                  ]
                },
                {
                  "meaning": "(informal, often derogatory) A close group of friends.",
                  "examples": [
                    "I'd look out for that whole crew down at Jack's."
                  ]
                },
                {
                  "meaning": "(often derogatory) A set of individuals lumped together by the speaker.",
                  "examples": [
                    "He captured Harper’s Ferry, with his nineteen men so few,",
                    "And frightened \"Old Virginny\" till she trembled thru and thru;",
                    "They hung him for a traitor, they themselves the traitor crew,",
                    "But his soul is marching on."
                  ]
                },
                {
                  "meaning": "(Scouting) A group of Rovers.",
                  "examples": []
                },
                {
                  "meaning": "(slang, hip-hop) A hip-hop or b-boying group.",
                  "examples": [
                    "[…]  mutating into all-star line-ups of emcees spitting hot bars over familiar beats, then to a single crew spitting bars over familiar beats, then eventually to a single crew (or artist) spitting bars over unfamiliar beats."
                  ]
                },
                {
                  "meaning": "(rowing) A rowing team manning a single shell.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A person in a crew",
              "entries": [
                {
                  "meaning": "(plural: crew) A member of the crew of a vessel or plant.",
                  "examples": [
                    "One crew died in the accident."
                  ]
                },
                {
                  "meaning": "(art, plural: crew) A worker on a dramatic production who is not part of the cast.",
                  "examples": [
                    "There were three actors and six crew on the set."
                  ]
                },
                {
                  "meaning": "(nautical, plural: crew) A member of a ship's company who is not an officer.",
                  "examples": [
                    "The officers and crew assembled on the deck.",
                    "There are quarters for three officers and five crew."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, rowing, US, uncountable) The sport of competitive rowing.",
                  "examples": [
                    "The University of Virginia belongs to the Atlantic Coast Conference and competes interscholastically in basketball, baseball, crew, cross country, fencing, football, golf, indoor track, lacrosse, polo, soccer, swimming, tennis, track, and wrestling."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crew (third-person singular simple present crews, present participle crewing, simple past and past participle crewed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive and intransitive) To be a member of a vessel's crew",
                  "examples": [
                    "We crewed together on a fishing boat last year.",
                    "The ship was crewed by fifty sailors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be a member of a work or production crew",
                  "examples": [
                    "The film was crewed and directed by students."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To supply workers or sailors for a crew",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To do the proper work of a sailor",
                  "examples": [
                    "The crewing of the vessel before the crash was deficient."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To take on, recruit (new) crew",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "crew",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, archaic) simple past tense of crow (“make the characteristic sound of a rooster”).",
                  "examples": [
                    "It was still dark when the cock crew."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably of Brythonic origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crew (plural crews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialectal) A pen for livestock such as chickens or pigs",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crew (plural crews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The Manx shearwater.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}