{
  "word": "palingenesis",
  "etymologies": [
    {
      "description": [
        "Probably a variant of palingenesia  +‎ -genesis (suffix meaning ‘origin; production’). Palingenesia is a learned borrowing from Late Latin palingenesia (“rebirth; regeneration”), from Koine Greek παλιγγενεσία (palingenesía, “rebirth”), from Ancient Greek πᾰ́λῐν (pálin, “again, anew, once more”) (ultimately from Proto-Indo-European *kʷel- (“to turn (end-over-end); to revolve around; to dwell, sojourn”)) + γένεσις (génesis, “creation; manner of birth; origin, source”) (ultimately from Proto-Indo-European *ǵenh₁- (“to beget; to give birth; to produce”)) + -ῐ́ᾱ (-íā, suffix forming feminine abstract nouns);  surface analysis, palin- +‎ genesis.",
        "Sense 2 (“apparent repetition, during the development of a single embryo, of changes that occurred previously in the evolution of its species”) is from German Palingenesis; while sense 3 (“regeneration of magma by the melting of metamorphic rocks”) is from Swedish palingenes. Both are derived from the Greek word: see above.",
        "The plural form is probably from palingenesis + Latin genesēs (a plural form of genesis)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "palingenesis (countable and uncountable, plural palingeneses)",
          "definitionGroups": [
            {
              "group": "(uncountable, also figuratively) Rebirth; regeneration; (countable) an instance of this.",
              "entries": [
                {
                  "meaning": "The recurrence of historical events in the same order in an infinite series of cycles.",
                  "examples": []
                },
                {
                  "meaning": "(philosophy, theology, historical) Spiritual rebirth through the transmigration of the soul.",
                  "examples": [
                    "Synonym: metempsychosis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, biology, chiefly historical or obsolete) The apparent repetition, during the development of a single embryo, of changes that occurred previously in the evolution of its species.",
                  "examples": [
                    "Synonyms: (obsolete, rare) palingeny, recapitulation",
                    "Antonym: (in the writings of Ernst Haeckel) caenogenesis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, geology) The regeneration of magma by the melting of metamorphic rocks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}