{
  "word": "death",
  "etymologies": [
    {
      "description": [
        "From Middle English deeth, from Old English dēaþ, from Proto-West Germanic *dauþu, from Proto-Germanic *dauþuz (compare West Frisian dead, Dutch dood, German Tod, Swedish död, Norwegian død), from Proto-Indo-European *dʰówtus. More at die."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "death (countable and uncountable, plural deaths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "The cessation of life and all associated processes; the end of an organism's existence as an entity independent from its environment and its return to an inert, nonliving state.",
              "entries": [
                {
                  "meaning": "Execution (in the judicial sense).",
                  "examples": [
                    "The serial killer was sentenced to death."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often capitalized) The personification of death as a hooded figure with a scythe; the Grim Reaper. The pronoun he is not the only option, but probably the most traditional one, as it matches with the male grammatical gender of Old English dēaþ, also with cognate German der Tod. The fourth apocalyptic rider (Bible, revelations 6:8) is male  θᾰ́νᾰτος (thanatos) in Greek. It has the female name Mors in Latin, but is referred to with male forms qui and eum. The following quotes show this rider on a pale horse is his in the English Bible and she in Peter Gabriel's lyrics.",
                  "examples": [
                    "When death walked in, a chill spread through the room."
                  ]
                }
              ]
            },
            {
              "group": "(preceded by the) The collapse or end of something.",
              "entries": [
                {
                  "meaning": "(figuratively, especially followed by of-phrase) A cause of great stress, exhaustion, embarrassment, or another negative condition (for someone).",
                  "examples": [
                    "This bake sale is going to be the death of me!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Spiritual lifelessness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}