{
  "word": "keep",
  "etymologies": [
    {
      "description": [
        "From Middle English kepen (“to keep, guard, look after, watch”), from Old English cēpan (“to seize, hold, observe”), from Proto-Germanic *kōpijaną (compare West Frisian kypje (“to look”)), from Proto-Indo-European *ǵab-, *ǵāb- (“to look after”) (compare Lithuanian žẽbti (“to eat reluctantly”), Russian забо́та (zabóta, “care, worry”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "keep (countable and uncountable, plural keeps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The main tower of a castle or fortress, located within the castle walls.",
                  "examples": [
                    "Synonym: donjon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The food or money required to keep someone alive and healthy; one's support, maintenance.",
                  "examples": [
                    "He works as a cobbler's apprentice for his keep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act or office of keeping; custody; guard; care; heed; charge; notice.",
                  "examples": [
                    "Pan, thou god of shepherds all, / Which of our tender lambkins takest keep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being kept; hence, the resulting condition; case.",
                  "examples": [
                    "to be in good keep"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which is kept in charge; a charge.",
                  "examples": [
                    "Often he used of his keep / A sacrifice to bring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A cap for holding something, such as a journal box, in place.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "keep (third-person singular simple present keeps, present participle keeping, simple past and past participle kept)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To continue in (a course or mode of action); to not intermit or fall from; to uphold or maintain.",
                  "examples": [
                    "to keep silence;  to keep possession"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remain faithful to a given promise or word.",
                  "examples": [
                    "to keep one's word;  to keep one's promise",
                    "Synonym: fullfill"
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To hold the status of something.",
              "entries": [
                {
                  "meaning": "To maintain possession of.",
                  "examples": [
                    "I keep a small stock of painkillers for emergencies."
                  ]
                },
                {
                  "meaning": "(ditransitive) To maintain the condition of; to preserve in a certain state.",
                  "examples": [
                    "I keep my specimens under glass to protect them.",
                    "The abundance of squirrels kept the dogs running for hours."
                  ]
                },
                {
                  "meaning": "(transitive) To record transactions, accounts, or events in.",
                  "examples": [
                    "I used to keep a diary."
                  ]
                },
                {
                  "meaning": "(transitive) To enter (accounts, records, etc.) in a book.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To remain in; to be confined to.",
                  "examples": [
                    "The following day she was so ill that she kept her bed; the husband went not once to enquire for her, nor did he send any message: he also kept his apartment, and was heard walking backwards and forwards with a hurried pace the whole of that day."
                  ]
                },
                {
                  "meaning": "To restrain.",
                  "examples": [
                    "I keep my pet gerbil away from my brother.",
                    "Don't let me keep you; I know you have things to be doing."
                  ]
                },
                {
                  "meaning": "(with from) To watch over, look after, guard, protect.",
                  "examples": [
                    "May the Lord keep you from harm."
                  ]
                },
                {
                  "meaning": "To supply with necessities and financially support (a person).",
                  "examples": [
                    "He kept a mistress for over ten years."
                  ]
                },
                {
                  "meaning": "(of living things) To raise; to care for.",
                  "examples": [
                    "He has been keeping orchids since retiring."
                  ]
                },
                {
                  "meaning": "To refrain from freely disclosing (a secret).",
                  "examples": []
                },
                {
                  "meaning": "To maintain (an establishment or institution); to conduct; to manage.",
                  "examples": [
                    "They were honourably accompanied and with great estate brought to London, where euery of them kept house by himselfe."
                  ]
                },
                {
                  "meaning": "To have habitually in stock for sale.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive) To hold or be held in a state.",
              "entries": [
                {
                  "meaning": "(obsolete) To reside for a time; to lodge; to dwell.",
                  "examples": [
                    "She kept to her bed while the fever lasted."
                  ]
                },
                {
                  "meaning": "To continue.",
                  "examples": [
                    "I keep taking the tablets, but to no avail."
                  ]
                },
                {
                  "meaning": "To remain edible or otherwise usable.",
                  "examples": [
                    "Potatoes can keep if they are in a root cellar.",
                    "Latex paint won't keep indefinitely."
                  ]
                },
                {
                  "meaning": "(copulative) To remain in a state.",
                  "examples": [
                    "The rabbit avoided detection by keeping still.",
                    "Keep calm! There's no need to panic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To wait for, keep watch for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cricket) To act as wicket-keeper.",
                  "examples": [
                    "Godfrey Evans kept for England for many years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To take care; to be solicitous; to watch.",
                  "examples": [
                    "[…]  kepe that the lustes choke not the word of God that is sowen in vs,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To be in session; to take place.",
                  "examples": [
                    "School keeps today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To observe; to adhere to; to fulfill; to not swerve from or violate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated, by extension) To visit (a place) often; to frequent.",
                  "examples": [
                    "[…]  'tis hallowed ground;",
                    "No Maid seeks here her strayed Cow, or Sheep,",
                    "Fairies, and fawns, and satyrs do it keep:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To observe or celebrate (a holiday).",
                  "examples": [
                    "The feast of St. Stephen is kept on December 26."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}