{
  "word": "ambit",
  "etymologies": [
    {
      "description": [
        "From Late Middle English ambyte, borrowed from Latin ambitus (“circuit; circumference, perimeter; area within a perimeter; ground around a building; cycle, orbit, revolution”) (compare Late Latin ambitus (“neighbourhood; wall of a castle, monastery, or town; cloister; parish boundary”)), from ambīre + -tus (suffix forming verbal nouns from verbs). Ambīre is the present active infinitive of ambiō (“to go around, to skirt; to encircle, surround”), from ambi- (“prefix meaning ‘both, on both sides’”) (possibly ultimately from Proto-Indo-European *h₂ent- (“front; face; forehead”)) + eō (“to go, move”) (ultimately from Proto-Indo-European *h₁ey- (“to go”)). The English word is a doublet of ambitus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ambit (plural ambits)",
          "definitionGroups": [
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "The extent of actions, thoughts, or the meaning of words, etc.",
                  "examples": []
                },
                {
                  "meaning": "The area or sphere of control and influence of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The boundary around a building, town, region, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, rare) The circumference of something circular; also, an arc; a circuit, an orbit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Chiefly in the plural form ambits: the open space surrounding a building, town, etc.; the grounds or precincts of a place.",
                  "examples": [
                    "Synonym: (of a house) curtilage"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}