{
  "word": "evolve",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin ēvolvō (“unroll, unfold”), from ē- (“out of”) (short form of ex) + volvō (“roll”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "evolve (third-person singular simple present evolves, present participle evolving, simple past and past participle evolved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move in regular procession through a system.",
                  "examples": [
                    "Not by any power evolved from man's own resources, but by a power which descended from above."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change; transform.",
                  "examples": [
                    "What began as a few lines of code has now evolved into a million-line behemoth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To come into being; develop.",
                  "examples": [
                    "You will remove the pig, place it in the car, and drive it to my house in Wiltshire. That is the plan I have evolved."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Of a population, to change genetic composition over successive generations through the process of evolution.",
                  "examples": [
                    "A hundred thousand years from now, will Homo sapiens have evolved into beings unrecognisable to their ancestors?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a trait, to develop within a population via biological evolution.",
                  "examples": [
                    "How long ago did beaks evolve?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Of a population, to acquire or develop (a trait) in the process of biological evolution.",
                  "examples": [
                    "How long ago did birds evolve beaks?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) To give off (gas, such as oxygen or carbon dioxide during a reaction).",
                  "examples": [
                    "to evolve odours"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause something to change or transform.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}