{
  "word": "hour",
  "etymologies": [
    {
      "description": [
        "From Middle English houre, hour, oure, from Anglo-Norman houre, from Old French houre, (h)ore, from Latin hōra (“hour”), from Ancient Greek ὥρα (hṓra, “any time or period, whether of the year, month, or day”), from Proto-Indo-European *yeh₁- (“year, season”). Akin to Old English ġēar (“year”). Doublet of hora and year.",
        "Displaced native Middle English stunde, stound (“hour, moment, stound”) (from Old English stund (“hour, time, moment”)), Middle English ȝetid, tid (“hour, time”) from Old English *ġetīd, compare Old Saxon getīd (“hour, time”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hour (plural hours)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A time period of sixty minutes; one twenty-fourth of a day.",
                  "examples": [
                    "I spent an hour at lunch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A season, moment, or time.",
                  "examples": [
                    "Now will be a good hour to show you Milly Erne's grave."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic) The time.",
                  "examples": [
                    "The hour grows late and I must go home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, in the plural) Used after a two-digit hour and a two-digit minute to indicate time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, in the plural) The set times of prayer, the canonical hours, the offices or services prescribed for these, or a book containing them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) A distance that can be traveled in one hour.",
                  "examples": [
                    "This place is an hour away from where I live."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}