{
  "word": "rider",
  "etymologies": [
    {
      "description": [
        "From Middle English ryder, ridere, from Late Old English rīdere (“rider, knight”); equivalent to ride +‎ -er. Compare Dutch rijder, German Reiter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rider (plural riders)",
          "definitionGroups": [
            {
              "group": "A mounted person.",
              "entries": [
                {
                  "meaning": "(now archaic or historical) A knight, or other mounted warrior. [from 11th c.]",
                  "examples": []
                },
                {
                  "meaning": "An old Dutch gold coin with the figure of a man on horseback stamped upon it. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(generally) Someone who rides a horse or (later) a bicycle, motorcycle etc. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now historical or archaic) A mounted robber; a bandit, especially in the Scottish borders. [from 16th c.]",
                  "examples": [
                    "In Evosdale eight and fourty notorious Riders are hung on growing Trees, the most famous of which was John Arm-Strong"
                  ]
                },
                {
                  "meaning": "(obsolete) Someone who breaks in or manages a horse; a riding master. [16th–17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now rare, historical) An agent who goes out with samples of goods to obtain orders; a commercial traveller or travelling salesman. [from 18th c.]",
                  "examples": [
                    "I set out with a Paisley manufacturer and a London rider, the latter of whom I envied for his smartness and self-complacency."
                  ]
                },
                {
                  "meaning": "(now chiefly US) Someone riding in a vehicle; a passenger on public transport. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "An addition, supplement.",
              "entries": [
                {
                  "meaning": "(politics) A supplementary clause added to a document after drafting, especially to a bill under the consideration of a legislature. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "An amendment or addition to an entertainer's performance contract, often covering a performer's equipment or food, drinks, and general comfort requirements. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "An additional matter or question arising in corollary; a qualification. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A supplementary question, now especially in mathematics. [from 19th c.]",
                  "examples": [
                    "This [question] was a rider which Mab found difficult to answer."
                  ]
                }
              ]
            },
            {
              "group": "Technical senses.",
              "entries": [
                {
                  "meaning": "(shipbuilding) An interior rib occasionally fixed in a ship's hold, reaching from the keelson to the beams of the lower deck, to strengthen the frame. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(mining, now rare) Rock material in a vein of ore, dividing it. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(nautical, in the plural) The second tier of casks in a vessel's hold. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A small, sliding piece of thin metal on a balance, used to determine small weights. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(cartomancy) The first Lenormand card, also known as either the horseman or the cavalier.",
                  "examples": []
                },
                {
                  "meaning": "(chess) A piece, such as the rook or bishop, which moves any distance in one direction, as long as no other piece is in the way.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}