{
  "word": "spirit",
  "etymologies": [
    {
      "description": [
        "From Middle English spirit, from Old French espirit (“spirit”), from Latin spīritus (“breath; spirit”), from Proto-Indo-European *(s)peys- (“to blow, breathe”). Compare inspire, respire, transpire, all ultimately from Latin spīrō (“I breathe, blow, respire”). In this sense, displaced native Middle English gast (from Old English gāst), whence modern English ghost. Doublet of esprit, spiritus, and sprite."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spirit (countable and uncountable, plural spirits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The soul of a person or other creature.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A supernatural being, often but not exclusively without physical form; ghost, fairy, angel.",
                  "examples": [
                    "A wandering spirit haunts the island."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Enthusiasm.",
                  "examples": [
                    "School spirit is at an all-time high."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The manner or style of something.",
                  "examples": [
                    "In the spirit of forgiveness, we didn't press charges."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) A volatile liquid, such as alcohol. The plural form spirits is a generic term for distilled alcoholic beverages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Energy; ardour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is vivacious or lively; one who evinces great activity or peculiar characteristics of mind or temper.",
                  "examples": [
                    "a ruling spirit; a schismatic spirit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often in the plural) Temper or disposition of mind; mental condition or disposition; intellectual or moral state.",
                  "examples": [
                    "to be cheerful, or in good spirits; to be down-hearted, or in bad spirits"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Air set in motion by breathing; breath; hence, sometimes, life itself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A rough breathing; an aspirate, such as the letter h; also, a mark denoting aspiration.",
                  "examples": [
                    "Be it a letter or spirit, we have great use of it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Intent; real meaning; opposed to the letter, or formal statement.",
                  "examples": [
                    "the spirit of an enterprise, or of a document"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alchemy, obsolete) Any of the four substances: sulphur, sal ammoniac, quicksilver, and arsenic (or, according to some, orpiment).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dyeing) Stannic chloride.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spirit (third-person singular simple present spirits, present participle spiriting, simple past and past participle spirited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To carry off, especially in haste, secrecy, or mystery.",
                  "examples": [
                    "I felt as if I had been spirited into some castle of felicity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sometimes followed by up: to animate with vigour; to excite; to encourage; to inspirit.",
                  "examples": [
                    "Civil dissensions often spirit the ambition of private men."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}