{
  "word": "stead",
  "etymologies": [
    {
      "description": [
        "From Middle English sted, stede (noun) and steden (verb), from Old English stede, from Proto-Germanic *stadiz, from Proto-Indo-European *stéh₂tis. Cognate with German Stadt, Statt and Stätte, Gothic 𐍃𐍄𐌰𐌸𐍃 (staþs, “place”), Danish and Swedish stad, Norwegian Bokmål sted, Scots steid, Dutch stad, Yiddish שטאָט‎ (shtot). See the doublet stasis."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stead (plural steads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A place, or spot, in general. [10th–16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A place where a person normally rests; a seat. [10th–18th c.]",
                  "examples": [
                    "There now the hart, fearlesse of greyhound, feeds, / And loving pelican in safety breeds; / There shrieking satyres fill the people's emptie steads."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An inhabited place; a settlement, city, town etc. [13th–16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An estate, a property with its grounds; a farm; a homestead. [14th–19th c.]",
                  "examples": [
                    "But of course I could not do this by myself, so I took a Hottentot—a very clever man when he was not drunk—who lived on the stead, into my confidence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The frame on which a bed is laid; a bedstead. [15th–19th c.]",
                  "examples": [
                    "The genial bed / Sallow the feet, the borders, and the stead."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in phrases, now literary) The position or function (of someone or something), as taken on by a successor. [from 15th c.]",
                  "examples": [
                    "His nurse had told him all about changelings, and how the little people would always try to steal a beautiful human child out of its cradle and put in its stead one of their own ailing, puking brats  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) An emotional or circumstantial \"place\" having specified advantages, qualities etc. (now only in phrases). [from 15th c.]",
                  "examples": [
                    "Though small and delicate-looking, she gave an impression of intense earnestness and latent toughness, qualities that stood her in good stead when she dared to challenge the most intrusive communist society in eastern Europe."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stead (third-person singular simple present steads, present participle steading, simple past and past participle steaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To help, support, benefit or assist; to be helpful.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To fill the stead or place of something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of steady."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stead (plural steads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Singapore, colloquial) One's partner in a romantic relationship.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}