{
  "word": "wench",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English wench, wenche (“female baby; girl (especially unmarried); maiden, young woman; bondwoman; serving maid; beloved, sweetheart; concubine, mistress; harlot, prostitute”) [and other forms], a shortened form of Middle English wenchel (“girl; maiden; child”), from Old English wenċel, winċel (“child; servant; slave”), from Proto-Germanic *wankilą, from Proto-Germanic *wankijaną (“to sway; waver”). The English word is cognate with Old High German wenken (“to waver; to give way, yield”), wankōn (“to totter”).",
        "The verb and adjective are derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wench (plural wenches)",
          "definitionGroups": [
            {
              "group": "(archaic, now dialectal or humorous, possibly offensive) A girl or young woman, especially a buxom or lively one.",
              "entries": [
                {
                  "meaning": "(specifically) A girl or young woman of a lower class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or dialectal) Used as a term of endearment for a female person, especially a wife, daughter, or girlfriend: darling, sweetheart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A woman servant; a maidservant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A promiscuous woman; a mistress (“other woman in an extramarital relationship”).",
                  "examples": [
                    "Synonyms: see Thesaurus:promiscuous woman, Thesaurus:mistress"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A prostitute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, archaic or historical) A black woman (of any age), especially if in a condition of servitude.",
                  "examples": [
                    "Synonym: (dated, literary, now offensive) negress"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wench (third-person singular simple present wenches, present participle wenching, simple past and past participle wenched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic, now humorous) To frequent prostitutes; to whore; also, to womanize.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}