{
  "word": "preface",
  "etymologies": [
    {
      "description": [
        "Late 14th century, from Middle English preface, prefas, from Old French preface (from which derives the modern French préface), from Medieval Latin prefātia, for classical Latin praefātiō (“a saying beforehand”), from praefor (“to speak beforehand”), from prae- (“beforehand”) + for (“to speak”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "preface (plural prefaces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The beginning or introductory portion that comes before the main text of a document or book.",
                  "examples": [
                    "Synonyms: forespeech, foretalk, foreword, introduction, proem, prologue; see also Thesaurus:foreword",
                    "The book included a brief preface by a leading expert in the field."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An introduction, or series of preliminary remarks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism) The prelude or introduction to the canon of the Mass.",
                  "examples": [
                    "Synonym: prelude"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A title or epithet.",
                  "examples": [
                    "[…]  a black-tie dinner to celebrate on the eve of the ceremony which would remove the preface \"Sir\" from his name and replace it with the preface \"Lord,\" thought by some to be one of the most potent words in the English language."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "preface (third-person singular simple present prefaces, present participle prefacing, simple past and past participle prefaced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To introduce or make a comment before (the main point).",
                  "examples": [
                    "Let me preface this by saying that I don't know him that well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give a preface to.",
                  "examples": [
                    "to preface a book"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}