{
  "word": "regiment",
  "etymologies": [
    {
      "description": [
        "From Middle French regement, régiment, and its source, Late Latin regimentum (“direction for government; course of medical treatment”), from Latin regō (“rule”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "regiment (plural regiments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A unit of armed troops under the command of an officer, and consisting of several smaller units; now specifically, usually composed of two or more battalions. [from 16th c.]",
                  "examples": [
                    "As the prime minister insisted that he had \"never told a lie\" in his life, the Tory leader attacked him for ordering Scottish troops into battle with no warning that their regiments would be disbanded."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, archaic) Rule or governance over a person, place etc.; government, authority. [from 14th c.]",
                  "examples": [
                    "What place is there in all the world, not ſubiect to the regiment and power of this citie?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The state or office of a ruler; rulership. [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Influence or control exercised by someone or something (especially a planet). [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A place under a particular rule; a kingdom or domain. [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, medicine) A regimen. [15th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "regiment (third-person singular simple present regiments, present participle regimenting, simple past and past participle regimented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form soldiers into a regiment.",
                  "examples": [
                    "The people are organized or regimented into bodies, and special functions are relegated to the several units."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To systematize, or put in rigid order.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}