{
  "word": "scissor",
  "etymologies": [
    {
      "description": [
        "From Middle English cysour, cysoure, cysowre, altered from sisours (“scissors”); ultimately from Latin caedere (“to cut”); current spelling influenced by Latin scindere, scissus (“to split”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scissor (plural scissors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) One blade on a pair of scissors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) Scissors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(noun adjunct) Used in certain noun phrases to denote a thing resembling the action of scissors, as scissor kick, scissor hold (wrestling), scissor jack.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scissor (third-person singular simple present scissors, present participle scissoring, simple past and past participle scissored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut using, or as if using, scissors.",
                  "examples": [
                    "[The poem] “All for Love”  […]  was originally intended for the Keepsake—the Editor of which Annual proposed to have it scissored down into genteel dimensions, which the Laureate refused to do  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To excise or expunge something from a text.",
                  "examples": [
                    "The erroneous testimony was scissored from the record."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To reproduce (text) as an excerpt, copy.",
                  "examples": [
                    "The public are no longer excluded from the beauties of Science, if there is any virtue in 257 pages of etymology, scissored from “the best authorities.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To move something like a pair of scissors, especially the legs.",
                  "examples": [
                    "The runner scissored over the hurdles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, sex) To engage in scissoring (tribadism), a sexual act in which two women intertwine their legs and rub their vulvas against each other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(skating) To skate with one foot significantly in front of the other.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}