{
  "word": "vassal",
  "etymologies": [
    {
      "description": [
        "From Middle English vassal, from Old French vassal, from Medieval Latin vassallus (“manservant, domestic, retainer”), from Latin vassus (“servant”), from Gaulish *wassos (“young man, squire”), from Proto-Celtic *wastos (“servant”) (compare Old Irish foss and Welsh gwas)."
      ],
      "adjectives": [
        {
          "description": "vassal (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Resembling a vassal; slavish; servile.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "vassal (plural vassals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, law) The grantee of a fief, a subordinate granted use of a superior's land and its income in exchange for vows of fidelity and homage and (typically) military service.",
                  "examples": [
                    "Synonyms: feudatory, feudal tenant",
                    "The manor's vassals owed first fruits and a tithe to the parish church, another 10% to the lord (including at least 50 eels), a week or two each year of service in the manor's upkeep, and service in the local fyrd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Any direct subordinate bound by such vows to a superior.",
                  "examples": [
                    "The king ordered his vassals to join him on the crusade unless they had a written note signed by the archbishop or pope.",
                    "Synonyms: subject, dependant, bondsman, villein, serf, helot, thrall, servant, slave"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any subordinate bound by similar close ties.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vassal (third-person singular simple present vassals, present participle vassalling, simple past and past participle vassalled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat as a vassal or to reduce to the position of a vassal; to subject to control; to enslave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To subordinate to someone or something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}