{
  "word": "fustian",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English fustian (“type of fabric, probably made from cotton, flax, or wool; piece of fustian spread over a bed or mattress”) [and other forms], from Old French fustaine, fustaigne (modern French futaine), from Medieval Latin fūstāneum, from (pannus) fūstāneus or (tela) fūstānea, of disputed origin.",
        "Sense 3 (“inflated, pompous, or pretentious speech or writing”) is possibly from the fact that the fabric was sometimes used to make cushion- and pillowcases, thus suggesting that the speech or writing is “padded” or “stuffed”; compare bombast. The relationship between sense 4 (“hot drink made of a mixture of alcoholic beverages with egg yolk, lemon, and spices”) and the fabric is unclear.",
        "The adjective is from an attributive use of the noun."
      ],
      "adjectives": [
        {
          "description": "fustian (comparative more fustian, superlative most fustian)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made out of fustian (noun sense 1).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person, or their speech or writing: using inflated, pompous, or pretentious language; bombastic; grandiloquent; also (obsolete) using incoherent or unintelligible language.",
                  "examples": [
                    "Synonyms: see Thesaurus:verbose",
                    "Antonyms: see Thesaurus:concise"
                  ]
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "Imaginary; invented.",
                  "examples": []
                },
                {
                  "meaning": "Useless; worthless.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "fustian (usually uncountable, plural fustians)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Originally, a kind of coarse fabric made from cotton and flax; now, a kind of coarse twilled cotton, or cotton and linen, stuff with a short pile and often dyed a dull colour, which is chiefly prepared for menswear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A class of fabric including corduroy and velveteen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Inflated, pompous, or pretentious speech or writing; bombast; also (archaic), incoherent or unintelligible speech or writing; gibberish, nonsense.",
                  "examples": [
                    "Synonyms: aureation, (obsolete) bombard phrase, grandiloquence, magniloquence, purple prose"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alcoholic beverages, archaic) Chiefly in rum fustian: a hot drink made of a mixture of alcoholic beverages (as beer, gin, and sherry or white wine) with egg yolk, lemon, and spices.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}