{
  "word": "book",
  "etymologies": [
    {
      "description": [
        "From Middle English bok, book, from Old English bōc, from Proto-West Germanic *bōk, from Proto-Germanic *bōks. Eclipsed non-native Middle English livret, lyveret (“book, booklet”) from Old French livret (“book, booklet”). Bookmaker sense by clipping."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "book (plural books)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A collection of sheets of paper bound together to hinge at one edge, containing printed or written material, pictures, etc.",
                  "examples": [
                    "I repeat: it suffices that a book be possible for it to exist. Only the impossible is excluded. For example: no book can be a ladder, although no doubt there are books which discuss and negate and demonstrate this possibility and others whose structure corresponds to that of a ladder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long work fit for publication, typically prose, such as a novel or textbook, and typically published as such a bound collection of sheets, but now sometimes electronically as an e-book.",
                  "examples": [
                    "I have three copies of his first book."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A major division of a long work.",
                  "examples": [
                    "Genesis is the first book of the Bible.",
                    "Many readers find the first book of A Tale of Two Cities to be confusing.",
                    "Synonyms: tome, volume"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) A record of betting (from the use of a notebook to record what each person has bet).",
                  "examples": [
                    "I'm running a book on who is going to win the race."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A bookmaker (a person who takes bets on sporting events and similar); bookie; turf accountant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A convenient collection, in a form resembling a book, of small paper items for individual use.",
                  "examples": [
                    "a book of stamps",
                    "a book of raffle tickets",
                    "Synonym: booklet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) The script of a musical or opera.",
                  "examples": [
                    "Synonym: libretto"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) Records of the accounts of a business.",
                  "examples": [
                    "Synonyms: account, record"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, colloquial) A book award, a recognition for receiving the highest grade in a class (traditionally an actual book, but recently more likely a letter or certificate acknowledging the achievement).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(whist) Six tricks taken by one side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) Four of a kind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A document, held by the referee, of the incidents happened in the game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, by extension) A list of all players who have been booked (received a warning) in a game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) The twenty-sixth Lenormand card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any source of instruction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with \"the\") The accumulated body of knowledge passed down among black pimps.",
                  "examples": [
                    "The Book is an oral tradition of belief in The Life that has been passed down from player to player from generation to generation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(advertising, informal) A portfolio of one's previous work in the industry.",
                  "examples": [
                    "Getting your book (portfolio) organised is the first step, and knowing both what to include, and what to leave out, is an essential step towards achieving that important agency placement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, uncountable) The sum of chess knowledge in the opening or endgame.",
                  "examples": [
                    "The opposite-colored bishops endgame is usually a book draw.",
                    "A book move",
                    "out of book"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English booken, boken, from Old English bōcian, ġebōcian, from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "book (third-person singular simple present books, present participle booking, simple past and past participle booked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reserve (something) for future use.",
                  "examples": [
                    "I want to book a hotel room for tomorrow night.",
                    "I can book tickets for the concert next week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To write down, to register or record in a book or as in a book.",
                  "examples": [
                    "They booked that message from the hill",
                    "Synonyms: make a note of, note down, record, write down"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To add a name to the list of people who are participating in something.",
                  "examples": [
                    "I booked a flight to New York.",
                    "Synonyms: sign up, register, reserve, schedule, enroll"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law enforcement, transitive) To record the name and other details of a suspected offender and the offence for later judicial action.",
                  "examples": [
                    "The police booked him for driving too fast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) To issue a caution to, usually a yellow card, or a red card if a yellow card has already been issued.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To travel very fast.",
                  "examples": [
                    "He was really booking, until he passed the speed trap.",
                    "Synonyms: bomb, hurtle, rocket, speed, shoot, whiz"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To record bets as bookmaker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law student slang) To receive the highest grade in a class.",
                  "examples": [
                    "The top three students had a bet on which one was going to book their intellectual property class."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To leave.",
                  "examples": [
                    "He was here earlier, but he booked."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English book, bok, from Old English bōc, from Proto-Germanic *bōk, first and third person singular indicative past tense of Proto-Germanic *bakaną (“to bake”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "book",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England) simple past tense of bake",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}