{
  "word": "groove",
  "etymologies": [
    {
      "description": [
        "From Middle English grov, grove, groof, grofe (“cave; pit; mining shaft”), from Old English grōf (“trench, furrow, something dug”), from Proto-West Germanic *grōbu, from Proto-Germanic *grōbō (“groove, furrow”), from Proto-Indo-European *gʰrebʰ- (“to dig, scrape, bury”). Cognate with Dutch groef, groeve (“groove; pit, grave”), German Grube (“ditch, pit”), Norwegian grov (“brook, riverbed”), Serbo-Croatian grèbati (“scratch, dig”). Directly descended from Old English grafan (“to dig”). More at grave."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "groove (plural grooves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, narrow channel or depression; e.g., such a slot cut into a hard material to provide a location for an engineering component, a tyre groove, or a geological channel or depression.",
                  "examples": [
                    "Antonym: ridge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fixed routine.",
                  "examples": [
                    "The gregarious trifling of life in the social groove."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The middle of the strike zone in baseball where a pitch is most easily hit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A pronounced, enjoyable rhythm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, informal) A good feeling (often as in the groove).",
                  "examples": [
                    "How could he be expected to make music that put the audience in a groove, he reasoned, if he wasn't grooving himself?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A shaft or excavation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(motor racing) A racing line, a path across the racing circuit's surface that a racecar will usually track on. (Note: There may be multiple grooves on any particular circuit or segment of circuit)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "groove (third-person singular simple present grooves, present participle grooving, simple past and past participle grooved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut a groove or channel in; to form into channels or grooves; to furrow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To perform, dance to, or enjoy rhythmic music.",
                  "examples": [
                    "I was just starting to groove to the band when we had to leave."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}