{
  "word": "jay",
  "etymologies": [
    {
      "description": [
        "From Middle English jay, from Old French jai (\"jay\"; Modern French geai), either from Late Latin gaius (“jay”), or from Old French gai (“gay, merry”), so named due to its plumage, from Old Frankish *gāhi (“quick, impetuous”), from Proto-Germanic *ganhuz, *ganhwaz (“sudden”), cognate with Dutch gaai (“jay”). More on the latter etymology at gay."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jay (plural jays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the numerous species of birds belonging to several genera within the family Corvidae, including Garrulus, Cyanocitta, Aphelocoma, Perisoreus, Cyanocorax, Gymnorhinus, Cyanolyca, Ptilostomus, and Calocitta, allied to the crows, but smaller, more graceful in form, often handsomely coloured, usually having a crest, and often noisy.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Any of various other birds of similar appearance and behaviour.",
              "entries": [
                {
                  "meaning": "The Indian roller, Coracias benghalensis.",
                  "examples": [
                    "They are the commonality of birddom, who furnish forth the mobs which bewilder the drunken-flighted jay when he jerks, shrieking in a series of blue hyphen-flashes through the air  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various large papilionid butterflies of the genus Graphium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A dull or ignorant person. It survives today in the term jaywalking.",
                  "examples": [
                    "Burlington Bertie's the latest young jayHe rents a swell flat somewhere Kensington wayHe spends the good oof that his pater has madeAlong with the Brandy and Soda Brigade."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Promiscuous woman; prostitute.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Respelling of the letter jy (which see), by analogy with the following letter kay."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jay (plural jays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The name of the Latin-script letter J.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A marijuana cigarette; a joint.",
                  "examples": [
                    "Although sympathetic, my main reaction was to think: “Some people can handle it, and some people can’t,” and then smugly light up a big fat jay."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}