{
  "word": "insert",
  "etymologies": [
    {
      "description": [
        "From Latin insertus, past participle of inserō, from in- +‎ serō (“join, bind together, connect, entwine, interweave”), ultimately from Proto-Indo-European *ser- (“to bind, put together, to line up”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "insert (plural inserts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An image inserted into text.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A promotional or instructive leaflet inserted into a magazine, newspaper, tape or disk package, etc.",
                  "examples": [
                    "This software can print compact disc inserts if you have the right size of paper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanical component inserted into another.",
                  "examples": [
                    "a threaded insert"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) An expression, such as \"please\" or an interjection, that may occur at various points in an utterance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A sequence of DNA inserted into another DNA molecule.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A pre-recorded segment included as part of a live broadcast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, television) A close-up shot used to draw attention to a particular element of a larger scene.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(audio effects) A plug-in that adds an effect to an audio track.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "insert (third-person singular simple present inserts, present participle inserting, simple past and past participle inserted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put in between or into.",
                  "examples": [
                    "In order to withdraw money from a cash machine, you have to insert your debit card.",
                    "To make your proof easier to understand, I recommend you insert a few more steps."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}