{
  "word": "rat",
  "etymologies": [
    {
      "description": [
        "From Middle English ratte, rat, rotte, from Old English rætt, from Proto-West Germanic *ratt, from Proto-Germanic *rattaz, *rattō (compare West Frisian rôt, Dutch rat), of uncertain origin, possibly from Proto-Indo-European *reh₁d- (“to scrape, scratch, gnaw”). However, the rat may have been unknown in Northern Europe in antiquity, and the Proto-Germanic word may have referred to a different animal; see *rattaz for more. Attestation of this family of words begins in the 12th century.[citation needed].",
        "Some of the Germanic cognates show considerable consonant variation, e.g. Middle Low German ratte, radde; Middle High German rate, ratte, ratze. The irregularity may be symptomatic of a late dispersal of the word, although Kroonen accounts for it with a Proto-Germanic stem *raþō nom., *ruttaz gen., showing both ablaut and a Kluge's law alternation, with the variation arising from varying remodellings in the descendants. Kroonen states that this requires a Proto-Indo-European etymon in final *t and is incompatible with the usual derivation from Proto-Indo-European *reh₁d- (“to scrape, scratch, gnaw”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rat (plural rats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) A medium-sized rodent belonging to the genus Rattus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Any of the numerous members of several rodent families (e.g. voles and mice) that resemble true rats in appearance, usually having a pointy snout, a long, bare tail, and body length greater than about 12 cm, or 5 inches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A person who is known for betrayal; a scoundrel; a quisling.",
                  "examples": [
                    "rat bastard"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An informant or snitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A scab: a worker who acts against trade union policies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A person who routinely spends time at a particular location.",
                  "examples": [
                    "Our teenager has become a mall rat.",
                    "He loved hockey and was a devoted rink rat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wad of shed hair used as part of a hairstyle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A roll of material used to puff out the hair, which is turned over it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, north-west London, slang, vulgar) Vagina.",
                  "examples": [
                    "Get your rat out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly informal) Short for muskrat.",
                  "examples": [
                    "The price of rats began to rise and soon after the marsh froze over, spearing rats began, which was done with a one tine three-eighths inch steel rod, with a wooden handle  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rat (third-person singular simple present rats, present participle ratting, simple past and past participle ratted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with “on” or “out”) To betray a person or party, especially by telling their secret to an authority or an enemy; to turn someone in.",
                  "examples": [
                    "He ratted on his coworker.",
                    "He is going to rat us out!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, intransitive) To work as a scab, going against trade union policies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a dog, etc.) To kill rats.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English ratten, further etymology unknown. Compare Middle High German ratzen (“to scratch; rasp; tear”). Could be related to write. See also rit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rat (plural rats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional) A scratch or a score.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, regional) A place in the sea with rapid currents and crags where a ship is likely to be torn apart in stormy weather.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rat (third-person singular simple present rats, present participle ratting, simple past and past participle ratted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional) To scratch or score.",
                  "examples": [
                    "He ratted a vertical line on his face with a pocket knife."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional, rare, obsolete) To tear, rip, rend.",
                  "examples": [
                    "Ratted to shreds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Damn, drat, blast; used in oaths.",
                  "examples": [
                    "“But, rat me, sir,” cried Foster in bewilderment, “tis too generous—'pon honour it is. I can't consent to it. No, rat me, I can't.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rat (plural rats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, slang) A ration.",
                  "examples": [
                    "With regards to the testing of his product, the initial blood analysis had come back confirming huge, distinctive nutritional superiority for Stewart's military ration pack. Given that the policy of the British Army is to be fully ready for war at the drop of a hat, he was sitting on the potential of supplying new rats for the entire army  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}