{
  "word": "festoon",
  "etymologies": [
    {
      "description": [
        "From French feston."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "festoon (plural festoons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ornament such as a garland or chain which hangs loosely from two tacked spots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A bas-relief, painting, or structural motif resembling such an ornament.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A raised cable with light globes attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A cloud on Jupiter that hangs out of its home belt or zone into an adjacent area forming a curved finger-like image or a complete loop back to its home belt or zone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(acarology) Any of a series of wrinkles on the backs of some ticks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(technology) A specific style of electric light bulb consisting of a cylindrical enclosure with two points of contact on either end providing power to the filament or diode.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(manufacturing) Two sets of rollers used to create a buffer of material on web handling equipment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various papilionid butterflies of the genus Zerynthia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dentistry) Texturing applied to a denture to simulate human tissue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "festoon (third-person singular simple present festoons, present participle festooning, simple past and past participle festooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To decorate with ornaments, such as garlands or chains, which hang loosely from two tacked spots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make festoons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To decorate or bedeck abundantly.",
                  "examples": [
                    "A mysterious woman who shows up at a funeral more droopily festooned in black than the widow is making what is known as a fashion statement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dentistry, transitive) To apply texturing to (a denture) to simulate human tissue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}