{
  "word": "clamshell",
  "etymologies": [
    {
      "description": [
        "clam +‎ shell"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clamshell (plural clamshells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The shell of a clam.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Any object that, in (literal or figurative) resemblance to the shell of a clam, has a hinge on one edge and two surfaces that close together.",
              "entries": [
                {
                  "meaning": "A dredging bucket with hinges like the shell of a clam.",
                  "examples": []
                },
                {
                  "meaning": "In food service, the closing box (usually styrofoam but sometimes cardboard) given to consumers with take-out food.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, US, slang) mouth",
                  "examples": [
                    "Shut your clam-shell!"
                  ]
                }
              ]
            },
            {
              "group": "(often attributive) Any object with some other resemblance to either one or both halves of the shell of a clam.",
              "entries": [
                {
                  "meaning": "(music) An amphitheater, especially an outdoor amphitheater; the semi-circular acoustic backdrop behind and above the performers.",
                  "examples": [
                    "Synonym: bandshell"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clamshell (third-person singular simple present clamshells, present participle clamshelling, simple past and past participle clamshelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(manufacturing) To deform a die in a shape resembling the shell of a clam, as a result of uneven extrusion pressure.",
                  "examples": [
                    "Although it produces a nonuniform pressure drop across the die and thus causes nonuniform flow through the die lip, the distribution of the melt does not produce die distortion of [sic] clamshelling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dig out by means of a clamshell (dredging bucket).",
                  "examples": [
                    "The additional handling that it would get by the canal would be: One dumping from the pockets into the canal barge, one clamshelling out of the canal barge, and one dumping onto the dock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To compress or flatten underwater debris so as to avoid blocking a channel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To open or close by means of a hinge, similar to the way a clamshell opens and closes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}