{
  "word": "mop",
  "etymologies": [
    {
      "description": [
        "From Middle English mappe (also as mappel), perhaps borrowed from Walloon mappe (“napkin”), from Latin mappa (“napkin, cloth”). Believed to be from a Semitic source, variously claimed as Phoenician or Punic (the latter by Quintilian). Compare Modern Hebrew מַפָּה‎ (mapá, “a map; a cloth”) (shortened from מַנְפָּה‎ (manpah, “fluttering banner, streaming cloth”)). More at map."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mop (plural mops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An implement for washing floors or similar, made of a piece of cloth, or a collection of thrums, or coarse yarn, fastened to a handle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wash with a mop; the act of mopping.",
                  "examples": [
                    "He gave the floor a quick mop to soak up the spilt juice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(humorous) A dense head of hair.",
                  "examples": [
                    "He ran a comb through his mop and hurried out the door."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect, obsolete) A fair where servants are hired.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect, obsolete) The young of any animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect, obsolete) A young girl; a moppet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A made-up face; a grimace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, MLE, slang) A firearm particularly if it has a large magazine (compare broom, but still can be related to MP)",
                  "examples": [
                    "Synonyms: see Thesaurus:firearm"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mop (third-person singular simple present mops, present participle mopping, simple past and past participle mopped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rub, scrub, clean or wipe with a mop, or as if with a mop.",
                  "examples": [
                    "to mop (or scrub) a floor",
                    "to mop one's face with a handkerchief"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a wry expression with the mouth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) To shoplift.",
                  "examples": [
                    "By “mopping” (stealing) the clothes and accessories necessary to effect their look, or by buying breasts, reconstructed noses, lifted chins, and female genitals, the children turn traditional ideas of labor around:  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}