{
  "word": "sunburn",
  "etymologies": [
    {
      "description": [
        "From Middle English *sunne burnen, *sonne brennen, *sunne brennen (suggested by derivatives sonne brennynge, sunne brennynge (“sunburn”, literally “sun-burning”) and sunne brente (“sunburnt”), equivalent to sun +‎ burn. Compare West Frisian sinnebrân (“sunburn”), Dutch zonnebrand (“sunburn”), German Sonnenbrand (“sunburn”), Swedish solbränna (“sunburn”), and Icelandic sólbruni (“sunburn”), as well as Old English sunbryne (“sunburn”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sunburn (countable and uncountable, plural sunburns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A burn on the skin caused by excess exposure to the sun's rays.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A burn on the tissue of crop plants or their fruits (especially if they are rich in water like tomatoes, grapes, apples, gooseberries) caused by excess exposure to the sun's rays.",
                  "examples": [
                    "Synonym: sunscald"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sunburn (third-person singular simple present sunburns, present participle sunburning, simple past and past participle sunburned or (mostly Commonwealth) sunburnt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To receive a sunburn.",
                  "examples": [
                    "I have brought",
                    "Your grace a Salamanders skin, to keep you",
                    "From sun-burning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To burn or tan (someone's skin) by the sun; to allow (a part of one's body) to become sunburnt.",
                  "examples": [
                    "My Aunt charg’d me not to pull off my Glove for fear of Sun-burning my hand."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}