{
  "word": "torture",
  "etymologies": [
    {
      "description": [
        "From Middle English torture, from Old French torture, from Late Latin tortūra (“a twisting, writhing, of bodily pain, a griping colic;” in Medieval Latin “pain inflicted by judicial or ecclesiastical authority as a means of persuasion, torture”), from Latin tortus (whence also tort), past participle of torquēre (“to twist”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "torture (countable and uncountable, plural tortures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The intentional causing of somebody's experiencing agony.",
                  "examples": [
                    "Using large dogs to attack bound, hand-cuffed prisoners is clearly torture.",
                    "In every war there are acts of torture that cause the world to shudder.",
                    "People confess to anything under torture.",
                    "Synonym: enhanced interrogation techniques"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly literary) The \"suffering of the heart\" imposed by one on another, as in personal relationships.",
                  "examples": [
                    "Every time she says 'goodbye' it is torture!",
                    "Coventry City midfielder Josh Ruffels described his 11 months out injured as 'absolute torture' after the goalless draw with Derby County Under-21s. ([3])"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) (often as \"absolute torture\") Stage fright; severe embarrassment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "torture (third-person singular simple present tortures, present participle torturing, simple past and past participle tortured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To intentionally inflict severe pain or suffering on (someone).",
                  "examples": [
                    "People who torture often have sadistic tendencies.",
                    "In the aftermath of 9/11, we did some things that were wrong. We did a whole lot of things that were right, but, we tortured some folks. We did some things that were contrary to our values."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}