{
  "word": "benefit",
  "etymologies": [
    {
      "description": [
        "From Late Middle English benefytt, benefett, alteration (due to Latin bene-) of benfet, bienfet, bienfait (“good or noble deed”), from Anglo-Norman benfet (“well-done”), Middle French bienfait, from Old French bienfet, bienfait (“foredeal, favour”), from past participle of bienfaire (“to do good, do well”), from bien (“well”) + faire (“to do”), modelled after Latin benefactum (“good deed”). More at benefactor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "benefit (countable and uncountable, plural benefits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An advantage; help or aid from something.",
                  "examples": [
                    "She can't read, so the voice recording was made for her benefit.",
                    "Exposure to cutting-edge technologies is one of the benefits of the job."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(insurance) A payment made in accordance with an insurance policy or a public assistance scheme.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An event, such as a theatrical performance, given to raise funds for some cause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) beneficence; liberality",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Intended audience (as for the benefit of).",
                  "examples": [
                    "The whole scene was staged for his benefit, and it completely fooled him.",
                    "Since my wife is Canadian, whenever we have dinner with my family, they keep bringing up anything they've heard about Canada lately for her benefit."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "benefit (third-person singular simple present benefits, present participle benefiting or benefitting, simple past and past participle benefited or benefitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be or to provide a benefit to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To receive a benefit (from); to be a beneficiary.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}