{
  "word": "quintal",
  "etymologies": [
    {
      "description": [
        "Late Middle English, from Anglo-Norman quintal, from Middle French quintal, from Old French and Medieval Latin quintale and quintallus (“various medieval hundredweights”), from Arabic قِنْطَار‎ (qinṭār, “100 rottols”), from Classical Syriac ܩܰܢܛܺܝܪܳܐ‎ (qanṭīrā) and ܩܰܢܛܺܝܢܳܪܳܐ‎ (qanṭīnārā), from Byzantine Greek κεντηνάριον (kentēnárion), from Latin centēnārium (“100 Roman pounds”), from centēnārius (“having 100 things”) + -ium (“-ium: forming abstract nouns”). Use for various non-English units, borrowed from French quintal, Spanish quintal, Portuguese quintal, &c. The apparent relation to quint- (“five, fivefold”) and -al (“forming adjectives”) is accidental, although it possibly influenced the eventual spelling of the term. Doublet of centenary and kantar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quintal (plural quintals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Synonym of hundredweight, 100 or 112 English or American pounds.",
                  "examples": [
                    "In one import license alone, the merchant in question was instructed to bring in 13,000 quintals of alum, which, snapped up by industries in England and the Low Countries, would yield the king a cool £8,666 13s 4d."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Various other similar units of weight in other systems.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unofficial metric unit equal to 100 kg.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}