{
  "word": "hub",
  "etymologies": [
    {
      "description": [
        "From earlier hubbe, which has the same immediate origin as hob. Hub was originally a dialectal word; its ultimate origin is unknown."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hub (plural hubs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The central part, usually cylindrical, of a wheel; the nave.",
                  "examples": [
                    "If you need to reload film, the cassette can be rewound slightly by turning the hub located on one end of its spool."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A point where many routes meet and traffic is distributed, dispensed, or diverted.",
                  "examples": [
                    "Hong Kong International Airport is one of the most important air traffic hubs in Asia."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A central facility providing a range of related services, such as a medical hub or an educational hub.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(networking) A computer networking device connecting several Ethernet ports. See switch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surveying) A stake with a nail in it, used to mark a temporary point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male weasel; a buck; a dog; a jack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A rough protuberance or projecting obstruction.",
                  "examples": [
                    "a hub in the road"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) An area in a video game from which individual levels are accessed.",
                  "examples": [
                    "In a break with tradition, these levels are tackled in any order, with the next act chosen from a semi-random selection machine located in the game's hub area."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A goal or mark at which quoits, etc., are thrown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hardened, engraved steel punch for impressing a device upon a die, used in coining, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A screw hob.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A block for scotching a wheel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}