{
  "word": "fool",
  "etymologies": [
    {
      "description": [
        "From Middle English fole (“fool”), from Old French fol (cf. modern French fou (“mad”)) from Latin follis. Doublet of follis."
      ],
      "adjectives": [
        {
          "description": "fool (comparative fooler or more fool, superlative foolest or most fool)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Foolish.",
                  "examples": [
                    "That was a fool thing to do. You could have gotten yourself shot"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "fool (plural fools)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A person with poor judgment or little intelligence.",
                  "examples": [
                    "You were a fool to cross that busy road without looking.",
                    "The village fool threw his own shoes down the well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A jester; a person whose role was to entertain a sovereign and the court (or lower personages).",
                  "examples": [
                    "This court fool could say bright things on occasion, but his main use to the ladies and lords of the palace was to serve as victim to practical jokes, cruel, coarse, and vulgar enough to be appreciated perhaps in the Bowery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Someone who derives pleasure from something specified.",
                  "examples": [
                    "I'm a fool for the city."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly African-American Vernacular) Buddy, dude, man.",
                  "examples": [
                    "[page 10:] \"I knew you'd be scared,\" Reggie laughed. \"What are you doin', foo? You must be crazy. You don't scare me.\" \"Then why did you almost fall out of that chair? I scare everyone.\"",
                    "[page 38:] \"This is coo,\" said Fred. \"It's almost like being there.\" \"We are there, foo!\" said Reggie as the boys slapped palms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) A type of dessert made of puréed fruit and custard or cream.",
                  "examples": [
                    "Coordinate term: mess",
                    "an apricot fool; a gooseberry fool"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tarot, often capitalized Fool) A particular card in a tarot deck, representing a jester.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fool (third-person singular simple present fools, present participle fooling, simple past and past participle fooled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To trick; to deceive.",
                  "examples": [
                    "She bit it gently and found that it resembled a worm in no way whatsoever as to taste although because it was long and slender, a Little Red Hen might easily be fooled by its appearance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act in an idiotic manner; to act foolishly.",
                  "examples": [
                    "Is this a time for fooling?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To make a fool of; to make act the fool.",
                  "examples": [
                    "They fool me to the top of my bent."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}