{
  "word": "deputy",
  "etymologies": [
    {
      "description": [
        "From French député, from Late Latin deputatus (“appointed”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "deputy (plural deputies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One appointed as the substitute of others, and empowered to act for them, in their name or their behalf; a substitute in office.",
                  "examples": [
                    "the deputy of a prince",
                    "The deputy sheriff was promoted after his senior retired.",
                    "As the deputy store manager, he is able to fire staff.",
                    "Synonyms: lieutenant, representative, delegate, vice, vicegerent"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining, historical) A person employed to install and remove props, brattices, etc. and to clear gas, for the safety of the miners.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(France) A member of the Chamber of Deputies, formerly called Corps Législatif.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland) a member of Dáil Éireann, or the title of a member of Dáil Éireann. (Normally capitalised in both cases).",
                  "examples": [
                    "Eamon Ryan is a deputy in the Dáil.",
                    "At today's meeting, Deputy Ryan will speak on local issues."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) a law enforcement officer who works for the county sheriff's office; a deputy sheriff or sheriff's deputy; the entry level rank in such an agency.",
                  "examples": [
                    "The sheriff's deputies took the suspect into custody.",
                    "Deputy Jones was promoted to corporal today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(government) The name for a member of parliament in some countries.",
                  "examples": [
                    "The State Duma comprises 450 deputies."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "deputy (third-person singular simple present deputies, present participle deputying, simple past and past participle deputied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, nonstandard) to deputise",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}