{
  "word": "bier",
  "etymologies": [
    {
      "description": [
        "From Middle English beer, beere, bere, from Old English bēr, (West Saxon) bǣr (“stretcher, bier”), from Proto-West Germanic *bāru, from Proto-Germanic *bērō, from Proto-Indo-European *bʰer- (“to carry, bear”).",
        "Cognate with Saterland Frisian Beere (“stretcher, bier”), Dutch baar (“bier”), German Bahre (“bier, stretcher”). More at bear."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bier (plural biers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A litter to transport the corpse of a dead person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A platform or stand where a body or coffin is placed.",
                  "examples": [
                    "On April 5, 1925, Chiang Kai-shek returned from the First Eastern Expedition to the Whampoa Military Academy to officiate at a funeral service for Sun Yat-sen, who had died in Peking on March 12. Huang Chi-lu, then a young professor of political science at the University of Kwangtung and destined to become director of the Kuomintang Archives some forty years later, has informed us of the display of strong emotion evidenced by Chiang on this occasion: \"The service was officiated by Mr. Chiang and Liao Chung-k'ai and was attended by over four thousand officers, cadets, and soldiers. As the funeral ceremonies began, Mr. Chiang, unable to control himself, wept bitterly and audibly, causing all in the assembly to shed tears.\"¹ Three years later, at the conclusion of the Northern Expedition, a similarly melodramatic scene unfolded before the eyes of the public as Chiang visited Sun's bier in the suburbs of Peking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A count of forty threads in the warp or chain of woollen cloth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}