{
  "word": "analysis",
  "etymologies": [
    {
      "description": [
        "From Medieval Latin analysis, from Ancient Greek ἀνάλυσις (análusis), from ἀναλύω (analúō, “I unravel, investigate”), from ἀνα- (ana-, “thoroughly”) + λύω (lúō, “I loosen”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "analysis (countable and uncountable, plural analyses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Decomposition into components in order to study (a complex thing, concept, theory etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The result of such a process.",
                  "examples": [
                    "Thus, in a sequence such as [French English teacher], since English is closer to the Head Noun teacher, it must be a Complement; and since French is further away from teacher, it must be an Attribute. Hence, we correctly predict that the only possible interpretation for [a French English teacher] is ‘a person who teaches English who is Frenchʼ. So our analysis not only has semantic plausi- bility; but in addition it has independent syntactic support."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, mathematics) The mathematical study of functions, sequences, series, limits, derivatives and integrals.",
                  "examples": [
                    "Synonym: mathematical analysis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, logic) Proof by deduction from known truths.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, chemistry) The process of breaking down a substance into its constituent parts, or the result of this process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, music) The analytical study of melodies, harmonies, sequences, repetitions, variations, quotations, juxtapositions, and surprises.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, psychology) Psychoanalysis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}