{
  "word": "affiliate",
  "etymologies": [
    {
      "description": [
        "From Late Latin adfiliare, affiliare (“to adopt as son”), from Latin ad + filius (“son”): compare French affilier."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "Noun: Verb",
          "definitionGroups": []
        },
        {
          "description": "affiliate (plural affiliates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone or something, especially, a television station, that is associated with a larger, related organization, such as a television network; a member of a group of associated things.",
                  "examples": [
                    "Our local TV channel is an affiliate of NBC."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "Noun: Verb",
          "definitionGroups": []
        },
        {
          "description": "affiliate (third-person singular simple present affiliates, present participle affiliating, simple past and past participle affiliated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adopt; to receive into a family as one's offspring",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to bring or receive into close connection; to ally.",
                  "examples": [
                    "Is the soul affiliated to God, or is it estranged and in rebellion?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, said of an illegitimate child) To fix the paternity of",
                  "examples": [
                    "to affiliate the child to (or on or upon) one man rather than another"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To connect in the way of descent; to trace origin to.",
                  "examples": [
                    "How do these facts tend to affiliate the faculty of hearing upon the aboriginal vegetative processes?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, followed by \"to\" or \"with\") To attach (to) or unite (with); to receive into a society as a member, and initiate into its mysteries, plans, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}