{
  "word": "knotter",
  "etymologies": [
    {
      "description": [
        "From knot +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "knotter (plural knotters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who makes knots.",
                  "examples": [
                    "This was Jai, the expert lace-knotter  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine or device that makes knots.",
                  "examples": [
                    "One of the most important inventions, one that was received with acclaim by the American manufacturer, and one which actually reduced his labor cost on spooling no less than ten per cent. at one clip, is a tiny little thing that is held in the palm of the hand. This is the Barber knotter. When a thread breaks, the attendant places the two ends together in the machine and by the mere pressure of her thumb ties the knot much better than she could do it without the knotter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pulp and paper) A screen used to remove “knots” or impurities from wood pulp in the process of making paper.",
                  "examples": [
                    "[…]  the pulp is strained by means of a sieve or “knotter” as it is called, which is usually formed of brass, having fine slits cut in it to allow the comminuted pulp to pass through, while it retains all lumps and knots  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, in compounds) A vessel capable of reaching a specified speed in knots.",
                  "examples": [
                    "His hon. and gallant friend raised the question as to the two classes of destroyers, one for ocean work and the other for work in narrow waters. It was not true to say that the new twenty-five-and-a-half “knotters” had proved inferior to the old thirty “knotters.” In anything like dirty weather the twenty-five-and-a-half “knotters” had shown their superiority. As he had stated to the Committee, they had failed to produce a better design which would combine greater speed with greater stability at a limited cost."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, in compounds) A wind blowing at a specified velocity in knots.",
                  "examples": [
                    "“See how the canvass unfurls itself like great white wings, and spreads its volumes upon the air. The wind is a strong eight-knotter, and will give her a firm headway for Tom’s purpose.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}