{
  "word": "minstrel",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English minstral, menestrel (“actor; juggler; mime; musician; singer; storyteller; (military) soldier playing a horn or trumpet as a signal”) [and other forms], from Anglo-Norman menestrel  [and other forms]  and Old French menestrel (“artisan; servant; itinerant musician or poet; worker”)  [and other forms]  (modern French ménestrel (“minstrel”)), from Late Latin ministerialis (“official or retainer owing household and military service to a feudal lord, a ministerial or ministerialis”), from Latin ministerium (“employment, ministration; office of a minister, ministry; action or attendance by an inferior person such as a slave, service”) + -ālis (suffix forming adjectives). Ministerium is derived from minister (“accomplice; agent; aide; attendant; servant; waiter”) (probably ultimately from Proto-Indo-European *mey- (“little, small”) + *-teros (contrastive or oppositional suffix forming adjectives)) + -ium (suffix forming abstract nouns). Doublet of ministerial and ministerialis.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "minstrel (plural minstrels) (also attributively)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Originally, an entertainer employed to juggle, play music, sing, tell stories, etc.; a buffoon, a fool, a jester; later, a medieval (especially travelling) entertainer who would recite and sing poetry, often to their own musical accompaniment.",
                  "examples": [
                    "Synonyms: bard, jongleur, troubadour"
                  ]
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(chiefly poetic) Any lyric poet, musician, or singer.",
                  "examples": []
                },
                {
                  "meaning": "(US, historical) One of a troupe of entertainers, often a white person who wore black makeup (blackface), to present a so-called minstrel show, being a variety show of banjo music, dance, and song (now sometimes regarded as racist).",
                  "examples": []
                },
                {
                  "meaning": "(by extension, slang) An amphetamine tablet, typically black, or black and white, in colour.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "minstrel (third-person singular simple present minstrels, present participle minstreling or minstrelling, simple past and past participle minstreled or minstrelled) (also figuratively)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To play (a tune on a musical instrument); to sing (a song).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act as a minstrel; to entertain by playing a musical instrument, singing, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}