{
  "word": "zone",
  "etymologies": [
    {
      "description": [
        "From Latin zōna, from Ancient Greek ζώνη (zṓnē, “girdle, belt”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "zone (plural zones)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography, now rare) Each of the five regions of the earth's surface into which it was divided by climatic differences, namely the torrid zone (between the tropics), two temperate zones (between the tropics and the polar circles), and two frigid zones (within the polar circles).",
                  "examples": [
                    "And as two Zones doe cut the Heaven upon the righter side, / And other twaine upon the left likewise the same devide, / The middle in outragious heat exceeding all the rest: / Even so likewise through great foresight to God it seemed best, / The earth encluded in the same should so devided bee […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any given region or area of the world.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A given area distinguished on the basis of a particular characteristic, use, restriction, etc.",
                  "examples": [
                    "There is a no-smoking zone that extends 25 feet outside of each entrance.",
                    "The white zone is for loading and unloading only.",
                    "Files in the Internet zone are blocked by default, as a security measure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A band or area of growth encircling anything.",
                  "examples": [
                    "a zone of evergreens on a mountain; the zone of animal or vegetable life in the ocean around an island or a continent"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A band or stripe extending around a body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(crystallography) A series of planes having mutually parallel intersections.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, informal) The strike zone.",
                  "examples": [
                    "That pitch was low and away, just outside of the zone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) Every of the three parts of an ice rink, divided by two blue lines.",
                  "examples": [
                    "Players are off side, if they enter the attacking zone before the puck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(handball) A semicircular area in front of each goal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly sports) A high-performance phase or period.",
                  "examples": [
                    "I just got in the zone late in the game: everything was going in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball, American football) A defensive scheme where defenders guard a particular area of the court or field, as opposed to a particular opposing player.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(networking) That collection of a domain's DNS resource records, the domain and its subdomains, that are not delegated to another authority.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(networking, dated) A logical group of network devices on AppleTalk (an obsolete networking protocol).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now literary) A belt or girdle.",
                  "examples": [
                    "Her tapered fingers too with rings are graced, / And an embroidered zone surrounds her slender waist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) The curved surface of a frustum of a sphere, the portion of surface of a sphere delimited by parallel planes.",
                  "examples": [
                    "To find the surface of a spherical zone.",
                    "Rule.—Multiply the altitude of the zone by the circumference of a great circle of the sphere, and the product will be the surface (Book VIII. Prop. X. Sch. 1)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry, loosely, perhaps by meronymy) A frustum of a sphere.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A circuit; a circumference.",
                  "examples": [
                    "And we have yet large day; for scarce the sun / Hath finish'd half his journey, and scarce begins / His other half in the great zone of heaven."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "zone (third-person singular simple present zones, present participle zoning, simple past and past participle zoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To divide into or assign to sections or areas.",
                  "examples": [
                    "Please zone off our staging area, a section for each group."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To define the property use classification of (an area).",
                  "examples": [
                    "This area was zoned for industrial use."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To enter a daydream state temporarily, for instance as a result of boredom, fatigue, or intoxication; to doze off.",
                  "examples": [
                    "I must have zoned while he was giving us the directions.",
                    "Everyone just put their goddamn heads together and zoned. (Byron Coley, liner notes for the album \"Piece for Jetsun Dolma\" by Thurston Moore)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, poetic) To girdle or encircle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}