{
  "word": "trice",
  "etymologies": [
    {
      "description": [
        "From Middle English trīcen, trice, trise (“to pull or push; to snatch away; to steal”), from Middle Dutch trīsen (“to hoist”) (modern Dutch trijsen) or Middle Low German trissen (“to trice the spritsail”); further etymology uncertain. The word is cognate with Danish trisse, tridse (“to haul with a pulley”), Low German trissen, tryssen, drisen, drysen (“to wind up, trice”), German trissen, triezen (“to annoy or torment”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "trice (third-person singular simple present trices, present participle tricing, simple past and past participle triced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To pull, to pull out or away, to pull sharply.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drag or haul, especially with a rope; specifically (nautical) to haul or hoist and tie up by means of a rope.",
                  "examples": [
                    "... the fold of his double chin hung like a bag triced up close under the hinge of his jaw."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English trīce, trise, in the phrase at a trīce (“with a single, quick motion; at once”, literally “with a pull or jerk”), later also in the phrases in a trice, on a trice, and with a trice. The word is ultimately from Middle English trīcen: see etymology 1 above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trice (plural trices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Now only in the phrase in a trice: a very short time; the blink of an eye, an instant, a moment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English trīce, tryys, tryyst, from Middle Dutch trīse, trijs (modern Dutch trijs (“hoisting-block, pulley, windlass”)) or Middle Low German trīsse, trītse (“hoisting-rope, tackle”); probably related to the verb trice (see etymology 1 above), and perhaps to Old English tryndel (“roller, wheel”) (see further at trend, trindle). The English word is cognate with Danish tridse, trisse (“pulley”), Low German trissel (“dizziness; whirling”), German trieze (“crane; pulley”), Norwegian triss (“pulley”), Swedish trissa (“pulley, truckle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trice (plural trices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A pulley, a windlass (“form of winch for lifting heavy weights, comprising a cable or rope wound around a cylinder”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}