{
  "word": "avoid",
  "etymologies": [
    {
      "description": [
        "From Middle English avoiden, from Anglo-Norman avoider, Old French esvuidier (“to empty out”), from es- + vuidier, from Vulgar Latin *vocitāre < *vocitus < *vocivus, ultimately related to Latin vacuus. Displaced native Old English forbūgan (literally “to bend away from”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "avoid (third-person singular simple present avoids, present participle avoiding, simple past and past participle avoided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To try not to meet or communicate with (a person); to shun",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stay out of the way of (something harmful).",
                  "examples": [
                    "I avoided the slap easily.",
                    "One town was flooded from the storm, while the other town avoided the storm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to keep away from; to keep clear of; to stay away from",
                  "examples": [
                    "I try to avoid the company of gamblers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To try not to do something or to have something happen",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To make empty; to clear.",
                  "examples": [
                    "If thou haue, he shal lyue with thee, and auoide thee out ; and he shal not sorewen vpon thee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now law) To make void, to annul; to refute (especially a contract).",
                  "examples": [
                    "But Y seie, this testament is confermed of God; the lawe that was maad after foure hundrid and thritti yeer, makith not the testament veyn to auoide awei the biheest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To defeat or evade; to invalidate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To emit or throw out; to void.",
                  "examples": [
                    "[…]  the citie of Memi, where is a great Caue or Denne, in the whiche is a spryng or fountayne that contynually auoydeth a great quantitie of Bitumen  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To leave, evacuate; to leave as empty, to withdraw or come away from.",
                  "examples": [
                    "[…]  the bishop commaunded al to auoide the chambre for an houre, and beganne to talke after this manner to his chaplin  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To get rid of.",
                  "examples": [
                    "Whanne Y was a litil child, Y spak as a litil child, Y vndurstood as a litil child, Y thouyte as a litil child; but whanne Y was maad a man, Y auoidide tho thingis that weren of a litil child."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To retire; to withdraw, depart, go away.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To become void or vacant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}