{
  "word": "fusion",
  "etymologies": [
    {
      "description": [
        "1555, from Middle French fusion, from Latin fūsiōnem (the accusative of fūsiō), from fusus, past participle of fundō (“I pour, I melt”) (see also found). Doublet of foison."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fusion (countable and uncountable, plural fusions)",
          "definitionGroups": [
            {
              "group": "The act of merging separate elements, or the result thereof.",
              "entries": [
                {
                  "meaning": "(physics) A nuclear reaction in which nuclei combine to form more massive nuclei with the concomitant release of energy.",
                  "examples": []
                },
                {
                  "meaning": "(music) A style of music that blends disparate genres; especially different types of jazz and reggae.",
                  "examples": []
                },
                {
                  "meaning": "A style of cooking that combines ingredients and techniques from different countries or cultures",
                  "examples": []
                },
                {
                  "meaning": "The act of melting or liquefying something by heating it.",
                  "examples": []
                },
                {
                  "meaning": "(genetics) The result of the hybridation of two genes which originally coded for separate proteins.",
                  "examples": []
                },
                {
                  "meaning": "(cytology) The process by which two distinct lipid bilayers merge their hydrophobic core, resulting in one interconnected structure.",
                  "examples": []
                },
                {
                  "meaning": "(fiction) The act of two characters merging into one, typically more powerful, being; or the merged being itself.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fusion (third-person singular simple present fusions, present participle fusioning, simple past and past participle fusioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard) to combine; to fuse",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}