{
  "word": "progress",
  "etymologies": [
    {
      "description": [
        "From Middle English progresse, from Old French progres (“a going forward”), from Latin prōgressus (“an advance”), from the participle stem of prōgredī (“to go forward, advance, develop”), from pro- (“forth, before”) +‎ gradi (“to walk, go”). Displaced native Old English forþgang."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "progress (usually uncountable, plural progresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Movement or advancement through a series of events, or points in time; development through time. [from 15th c.]",
                  "examples": [
                    "Testing for the new antidote is currently in progress."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specifically, advancement to a higher or more developed state; development, growth. [from 15th c.]",
                  "examples": [
                    "Science has made extraordinary progress in the last fifty years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An official journey made by a monarch or other high personage; a state journey, a circuit. [from 15th c.]",
                  "examples": [
                    "With the king about to go on progress, the trials and executions were deliberately timed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A journey forward; travel. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Movement onwards or forwards or towards a specific objective or direction; advance. [from 16th c.]",
                  "examples": [
                    "The thick branches overhanging the path made progress difficult."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the noun. Lapsed into disuse in the 17th century, except in the US. Considered an Americanism on reintroduction to use in the UK."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "progress (third-person singular simple present progresses, present participle progressing, simple past and past participle progressed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move, go, or proceed forward; to advance.",
                  "examples": [
                    "Visitors progress through the museum at their own pace."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive) To develop.",
              "entries": [
                {
                  "meaning": "(by extension) To improve; to become better or more complete.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To expedite.",
                  "examples": [
                    "Or […] they came to progress matters in which Dudley had taken a hand, and left defrauded or bound over to the king."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}