{
  "word": "rice",
  "etymologies": [
    {
      "description": [
        "From Middle English rys, from Old French ris, from Old Italian riso, risi, from Byzantine Greek ὄρυζα (óruza), from an Eastern Iranian language related to Middle Persian blnj (*brinǰ). Theorized to come to Iranian languages from Sanskrit व्रीहि (vrīhi).",
        "Prior to Sanskrit, it is speculated to be either a borrowing from a Dravidian language (compare Proto-Dravidian *wariñci (“rice”)), thence from Austroasiatic languages such as Proto-Mon-Khmer *sruʔ (“paddy rice”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rice (countable and uncountable, plural rices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Cereal plants, Oryza sativa of the grass family whose seeds are used as food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A specific variety of this plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The seeds of this plant used as food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, ethnic slur, humorous) The types of automobile modifications characteristic of a rice burner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rice (third-person singular simple present rices, present participle ricing, simple past and past participle riced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To squeeze through a ricer; to mash or make into rice-sized pieces (especially potatoes).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To harvest wild rice (Zizania sp.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) To throw rice at a person (usually at a wedding).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, transitive) To customize the user interface of a computer system, e.g. a desktop environment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English ris, rys, from Old English hrīs (“branch; twig”), from Proto-Germanic *hrīsą (“bush; twig”), from Proto-Indo-European *(s)kreys- (“to turn; bend; wind; move; shake”). Cognate with Scots reise, rice (“twigs; brushwood”), West Frisian riis, rys, Dutch rijs (“little branch; twig; osier; whip”), German Low German Ries, German Reis (“twig; sprig; shoot”), Swedish ris (“twigs; brush; rod”), Icelandic hrís."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rice (plural rices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly, dialectal, Scotland, Ireland) A twig or stick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving, obsolete) A bobbin or spool.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}