{
  "word": "logrolling",
  "etymologies": [
    {
      "description": [
        "log +‎ rolling, the figurative senses from the practice of neighbors helping each other do heavy work such as rolling logs in connection with clearing land and building."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "logrolling (countable and uncountable, plural logrollings)",
          "definitionGroups": [
            {
              "group": "(countable, US) The rolling of logs from one place to another; an occasion when people meet to help each other roll logs.",
              "entries": [
                {
                  "meaning": "(uncountable, US, lumberjacking) The act of balancing on a log floating on a river to guide it downstream, often involving rolling it using one's feet; birling.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, US, sports) A sport in which two people balance on a log floating in a body of water, each one aiming to cause the opponent to fall off by rolling or kicking the log.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, US politics, figuratively) A concerted effort to push forward mutually advantageous legislative agendas by combining two items, either or both of which might fail on its own, into a single bill that is more likely to pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, US, figuratively) Mutual recommendation of friends' or colleagues' services or products, such as book recommendations in literary reviews.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "logrolling",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "present participle of logroll.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}