{
  "word": "stock",
  "etymologies": [
    {
      "description": [
        "From Old English stocc, from Proto-West Germanic *stokk, from Proto-Germanic *stukkaz (“tree-trunk”), with modern senses mostly referring either to the trunk from which the tree grows (figuratively, its origin and/or support/foundation), or to a piece of wood, stick, or rod. The senses of \"supply\" and \"raw material\" arose from a probable conflation with steck (“an item of goods, merchandise”) or the use of split tally sticks consisting of foil or counterfoil and stock to capture paid taxes, debts or exchanges. Doublet of chock."
      ],
      "adjectives": [
        {
          "description": "stock (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a type normally available for purchase/in stock.",
                  "examples": [
                    "stock items",
                    "stock sizes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(racing, of a race car) Having the same configuration as cars sold to the non-racing public, or having been modified from such a car.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Straightforward, ordinary, just another, very basic.",
                  "examples": [
                    "He gave me a stock answer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "stock (countable and uncountable, plural stocks or (obsolete) stocken)",
          "definitionGroups": [
            {
              "group": "A store or supply.",
              "entries": [
                {
                  "meaning": "(operations) A store of goods ready for sale; inventory.",
                  "examples": [
                    "We have a stock of televisions on hand."
                  ]
                },
                {
                  "meaning": "A supply of anything ready for use.",
                  "examples": [
                    "Lay in a stock of wood for the winter season."
                  ]
                },
                {
                  "meaning": "Railroad rolling stock.",
                  "examples": []
                },
                {
                  "meaning": "(card games, in a card game) A stack of undealt cards made available to the players.",
                  "examples": []
                },
                {
                  "meaning": "Farm or ranch animals; livestock.",
                  "examples": []
                },
                {
                  "meaning": "The population of a given type of animal (especially fish) available to be captured from the wild for economic use.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(finance) The capital raised by a company through the issue of shares. The total of shares held by an individual shareholder.",
              "entries": [
                {
                  "meaning": "The price or value of the stock of a company on the stock market.",
                  "examples": [
                    "When the bad news came out, the company's stock dropped precipitously."
                  ]
                },
                {
                  "meaning": "(especially US) A share in a company.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) The measure of how highly a person or institution is valued.",
                  "examples": [
                    "Synonym: reputation",
                    "After that last screw-up of mine, my stock is pretty low around here."
                  ]
                },
                {
                  "meaning": "Any of several types of security that are similar to a stock, or marketed like one.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The raw material from which things are made; feedstock.",
              "entries": [
                {
                  "meaning": "(cooking, uncountable, countable) Broth made from meat (originally bones) or vegetables, used as a basis for stew or soup.",
                  "examples": []
                },
                {
                  "meaning": "The type of paper used in printing.",
                  "examples": [
                    "The books were printed on a heavier stock this year."
                  ]
                },
                {
                  "meaning": "Ellipsis of film stock.",
                  "examples": []
                },
                {
                  "meaning": "Plain soap before it is coloured and perfumed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Stock theater, summer stock theater.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The trunk and woody main stems of a tree. The base from which something grows or branches.",
              "entries": [
                {
                  "meaning": "(horticulture) The plant upon which the scion is grafted.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) Lineage, family, ancestry.",
                  "examples": [
                    "We may also conclude that as it was the Ionic γένη of the Attic tetrapolis who in the main achieved the Ionization of Athens, so it was a branch of this same stock that settled at Delos  […]"
                  ]
                },
                {
                  "meaning": "(linguistics) A larger grouping of language families: a superfamily or macrofamily.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the several species of cruciferous flowers in the genus Matthiola.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A handle or stem to which the working part of an implement or weapon is attached.",
              "entries": [
                {
                  "meaning": "(firearms) The part of a rifle or shotgun that rests against the shooter's shoulder.",
                  "examples": []
                },
                {
                  "meaning": "The handle of a whip, fishing rod, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Part of a machine that supports items or holds them in place.",
              "entries": [
                {
                  "meaning": "The headstock of a lathe, drill, etc.",
                  "examples": []
                },
                {
                  "meaning": "The tailstock of a lathe.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A bar, stick or rod.",
              "entries": [
                {
                  "meaning": "A ski pole.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) A bar going through an anchor, perpendicular to the flukes.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) The axle attached to the rudder, which transfers the movement of the helm to the rudder.",
                  "examples": []
                },
                {
                  "meaning": "(geology) A pipe (vertical cylinder of ore)",
                  "examples": []
                }
              ]
            },
            {
              "group": "A type of (now formal or official) neckwear.",
              "entries": [
                {
                  "meaning": "A necktie or cravat, particularly a wide necktie popular in the eighteenth century, often seen today as a part of formal wear for horse riding competitions.",
                  "examples": []
                },
                {
                  "meaning": "A piece of black cloth worn under a clerical collar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bed for infants; a crib, cot, or cradle",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(folklore) A piece of wood magically made to be just like a real baby and substituted for it by magical beings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A cover for the legs; a stocking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A block of wood; something fixed and solid; a pillar; a firm support; a post.",
                  "examples": [
                    "Item, for a stock of brass for the holy water, seven shillings; which, by the canon, must be of marble or metal, and in no case of brick."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, obsolete) A person who is as dull and lifeless as a stock or post; one who has little sense.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, historical) The longest part of a split tally stick formerly struck in the exchequer, which was delivered to the person who had lent the king money on account, as the evidence of indebtedness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shipbuilding, in the plural) The frame or timbers on which a ship rests during construction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, in the plural) Red and grey bricks, used for the exterior of walls and the front of buildings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) In tectology, an aggregate or colony of individuals, such as trees, chains of salpae, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The beater of a fulling mill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stock (third-person singular simple present stocks, present participle stocking, simple past and past participle stocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have on hand for sale.",
                  "examples": [
                    "The store stocks all kinds of dried vegetables."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To provide with material requisites; to store; to fill; to supply.",
                  "examples": [
                    "to stock a warehouse with goods",
                    "to stock a farm, i.e. to supply it with cattle and tools",
                    "to stock land, i.e. to occupy it with a permanent growth, especially of grass"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To allow (cows) to retain milk for twenty-four hours or more prior to sale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put in the stocks as punishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To fit (an anchor) with a stock, or to fasten the stock firmly in place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games, dated) To arrange cards in a certain manner for cheating purposes; to stack the deck.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Italian stoccata."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stock (plural stocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thrust with a rapier; a stoccado.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}