{
  "word": "agency",
  "etymologies": [
    {
      "description": [
        "From Medieval Latin agentia, from Latin agēns (present participle of agere (“to act”)), agentis (cognate with French agence, see also agent)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "agency (countable and uncountable, plural agencies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The capacity, condition, or state of acting or of exerting power.",
                  "examples": [
                    "Synonyms: action, activity, operation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology, philosophy, psychology) The capacity of individuals to act independently and to make their own free choices.",
                  "examples": [
                    "Coordinate terms: free will, structure",
                    "moral agency",
                    "individual agency"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A medium through which power is exerted or an end is achieved.",
                  "examples": [
                    "Synonyms: instrumentality, means"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The office or function of an agent; also, the relationship between a principal and that person's agent.",
                  "examples": [
                    "authority of agency"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An establishment engaged in doing business for another; also, the place of business or the district of such an agency.",
                  "examples": [
                    "Synonym: management",
                    "Hyponyms: advertising agency, dating agency, employment agency, escort agency, introduction agency, modelling agency, news agency, press agency, relief agency, syndication agency, travel agency"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A department or other administrative unit of a government; also, the office or headquarters of, or the district administered by such unit of government.",
                  "examples": [
                    "Hyponyms: antitrust agency, intelligence agency, space agency",
                    "Agency for Toxic Substances and Disease Registry",
                    "Central Intelligence Agency"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}