{
  "word": "juggler",
  "etymologies": [
    {
      "description": [
        "From Middle English jogeler, jogelour, iogular, partly continuing Old English ġeogolere (“juggler; magician; wizard”) and partly from Anglo-Norman jogelour, jugelur, Old French jongleur (“juggler”), equivalent to juggle +‎ -er. Doublet of jongleur."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "juggler (plural jugglers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Agent noun of juggle; one who either literally juggles objects, or figuratively juggles tasks.",
                  "examples": [
                    "Baraka was part trickster and part provocateur, a brilliant juggler of genres, ideas, and identities, whose career spanned nearly six decades."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who practices juggling.",
                  "examples": [
                    "The waiters, commanded by Jules, moved softly across the thick Oriental rugs, balancing their trays with the dexterity of jugglers, and receiving and executing orders with that air of profound importance of which only really first-class waiters have the secret."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A person who performs tricks using sleight of hand, a conjurer, prestidigitator.",
                  "examples": [
                    "According to Mr. Gmelin’s account, [the Samojede magicians] are tolerable jugglers. Some have the art of plunging a knife into the body, without making a wound; and apparently wringing off their heads, by fastening a cord round their necks, and suffering two persons to draw it tight, and afterwards setting it on again. But these tricks are seen only among those magicians who require but little art to deceive their countrymen; and, indeed, to speak seriously, such a Siberian juggler, would cut but a very indifferent figure at a European fair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A magician or wizard.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "juggler",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of jugular.",
                  "examples": [
                    "The defensive system they were playing hampered them from going for the juggler."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}