{
  "word": "uplift",
  "etymologies": [
    {
      "description": [
        "up- +‎ lift"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "uplift (countable and uncountable, plural uplifts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or result of being uplifted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A tectonic upheaval, especially one that takes place in the process of mountain building.",
                  "examples": [
                    "Recent uplift of the Maine and Oregon coasts has not been enough to \"undrown\" the larger valleys; the shorelines are still submergent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transport) The picking up and loading of goods to be transported by a mover.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A brassiere that raises the breasts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An increase in a fine or penalty due to aggravating circumstances.",
                  "examples": [
                    "The CMA fined the companies involved £3.4 million, which included uplifts for director level involvement."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "uplift (third-person singular simple present uplifts, present participle uplifting, simple past and past participle uplifted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To raise something or someone to a higher physical, social, moral, intellectual, spiritual or emotional level.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, of a penalty) To aggravate; to increase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, travel) To be accepted for carriage on a flight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New Zealand) To remove (a child) from a damaging home environment by a social welfare organization.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, Australia, transitive) To remove (a document) from its current possessor and take it into one's own possession.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}