{
  "word": "congregation",
  "etymologies": [
    {
      "description": [
        "c. 1340, from Old French congregacion, from Latin congregātiō, itself from congregō (“to herd into a flock”). Adopted (1520s) by the English Bible translator William Tyndale, to render the Ancient Greek ἐκκλησία (ekklēsía, “those called together, (popular) meeting”) (hence Latin ecclēsia) in his New Testament, and preferred by 16th century Reformers instead of church."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "congregation (countable and uncountable, plural congregations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of congregating or collecting together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gathering of faithful in a temple, church, synagogue, mosque or other place of worship. It can also refer to the people who are present at a devotional service in the building, particularly in contrast to the pastor, minister, imam, rabbi etc. and/or choir, who may be seated apart from the general congregation or lead the service (notably in responsory form).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Roman Congregation, a main department of the Vatican administration of the Catholic Church.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A corporate body whose members gather for worship, or the members of such a body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any large gathering of people.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flock of various birds, such as plovers or eagles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Oxford University) The main body of university staff, comprising academics, administrative staff, heads of colleges, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}