{
  "word": "odd",
  "etymologies": [
    {
      "description": [
        "From Middle English odde, od (“odd (not even); leftover after division into pairs”), from Old Norse oddi (“odd, third or additional number; triangle”), from oddr (“point of a weapon”), from Proto-Germanic *uzdaz (“point”), from Proto-Indo-European *wes- (“to stick, prick, pierce, sting”) + *dʰeh₁- (“to set, place”).",
        "Cognate to Icelandic oddi (“triangle, point of land, odd number”), Swedish udda (“odd”), udd (“a point”), Danish od (“point of weapon””) and odde (“a headland, point”), Norwegian Bokmål odde (“a point”, “odd”, “peculiar”); related to Old English ord (“a point”). Doublet of ord (\"point\")."
      ],
      "adjectives": [
        {
          "description": "odd (not generally comparable, comparative odder, superlative oddest)",
          "definitionGroups": [
            {
              "group": "Differing from what is usual, ordinary or expected.",
              "entries": [
                {
                  "meaning": "Peculiar, singular and strange in looks or character; eccentric, bizarre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Without a corresponding mate in a pair or set; unmatched; (of a pair or set) mismatched.",
                  "examples": [
                    "Synonyms: single, mismatched",
                    "Optimistically, he had a corner of a drawer for odd socks.",
                    "My cat Fluffy has odd eyes: one blue and one brown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Left over, remaining after the rest have been paired or grouped.",
                  "examples": [
                    "I'm the odd one out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Left over or remaining (as a small amount) after counting, payment, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Scattered; occasional, infrequent; not forming part of a set or pattern.",
                  "examples": [
                    "I don't speak Latin well, so in hearing a dissertation in Latin, I would only be able to make out the odd word of it.",
                    "but for the odd exception"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Not regular or planned.",
                  "examples": [
                    "He's only worked odd jobs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Used or employed for odd jobs.",
                  "examples": [
                    "The odd horse will now be employed in carting couch grass on to pasture land, carting hay, &c, to sheep in the field, carting roots, straw, &c, for feeding cattle in the boxes or dairy cows in the stalls or yards, and in various odd jobs on the farm  ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, not comparable) Numerically indivisible by two.",
                  "examples": [
                    "Antonym: even",
                    "The product of odd numbers is also odd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Numbered with an odd number.",
                  "examples": [
                    "How do I print only the odd pages?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, in combination with a number) About, approximately; somewhat more than (an approximated round number).",
                  "examples": [
                    "Synonyms: see Thesaurus:about, Thesaurus:approximately",
                    "There were thirty-odd people in the room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Out of the way, secluded.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) On the left.",
                  "examples": [
                    "He served from the odd court."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Singular in excellence; matchless; peerless; outstanding. [since the 1400s]",
                  "examples": [
                    "He goes to Phrygia, and sees Scamander. \"Happy are all,\" he says, \"who are honoured by that odd clerk. Homer.\" In Macedonia, he finds hie mother."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "odd (plural odds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, diminutive) An odd number.",
                  "examples": [
                    "So let's see. There are two evens here and three odds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Something left over, not forming part of a set.",
                  "examples": [
                    "I've got three complete sets of these trading cards for sale, plus a few dozen odds."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}