{
  "word": "likeness",
  "etymologies": [
    {
      "description": [
        "From Middle English liknesse, from Old English līcness, ġelīcnes (“the quality of being like or equal; likeness; image; copy; pattern; example; parable”), from Proto-West Germanic *galīkanassī (“likeness”), equivalent to like +‎ -ness. Cognate with West Frisian likenis (“likeness”), Dutch gelijkenis (“similarity; likeness; parable”), German Low German Glieknis (“form; semblance; likeness; parable”), German Gleichnis (“form; semblance; image; likeness; parable; simile”). The verb is derived from the noun. Compare also Old Norse líkneskja (“figure, image, appearance, likeness”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "likeness (plural likenesses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or quality of being like or alike",
                  "examples": [
                    "Erich thought he observed a likeness between the stranger and a relative of Walther; this led them into the chapter of likenesses, and the strange way in which certain forms repeat themselves in families, often most distinctly in the most remote ramifications."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Appearance or form; guise.",
                  "examples": [
                    "A foe in the likeness of a friend"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which closely resembles; a portrait.",
                  "examples": [
                    "How he looked, the likenesses of him which still remain enable us to imagine."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "likeness (third-person singular simple present likenesses, present participle likenessing, simple past and past participle likenessed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To depict.",
                  "examples": [
                    "I have this morning received the photographs of my two boys. The eldest is very well likenessed: the other, perhaps, not so well."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}