{
  "word": "iris",
  "etymologies": [
    {
      "description": [
        "From Middle English [Term?], from Latin īris, from Ancient Greek ἶρις (îris, “rainbow”), possibly from a derivative of Proto-Indo-European *w(e)ih₁-ro- (“a twist, thread, cord, wire”), from *weh₁y- (“to turn, twist, weave, plait”). If so, it would be cognate to English wire."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "iris (plural irises or iris or irides) (See Usage notes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A plant of the genus Iris, common in the northern hemisphere, and generally having attractive blooms (See  Iris (plant) on  Wikipedia.Wikipedia ).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The contractile membrane perforated by the pupil, which adjusts to control the amount of light reaching the retina, and which forms the colored portion of the eye (See  Iris (anatomy) on  Wikipedia.Wikipedia ).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography, cinematography) A diaphragm used to regulate the size of a hole, especially as a way of controlling the amount of light reaching a lens.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic) A rainbow, or other colourful refraction of light.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A constricted opening in the path inside a waveguide, used to form a resonator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) The inner circle of an oscillated color spot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "iris (third-person singular simple present irises, present participle irising, simple past and past participle irised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of an aperture, lens, or door) To open or close in the manner of an iris.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) To cause (something) to shine with the colours of the rainbow; to make iridescent.",
                  "examples": [
                    "Synonym: iridize"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}