{
  "word": "cackle",
  "etymologies": [
    {
      "description": [
        "From Middle English caclen, cakelen. Compare Dutch kakelen (“to cackle”), German Low German kakeln (“to cackle”), German kakeln (“to blather”), Danish kagle (“to cackle”), Swedish kackla (“to cackle”). Compare also Old English cahhetan, ċeahhettan (“to laugh loudly; cackle”), German gackern (“to cackle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cackle (countable and uncountable, plural cackles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cry of a hen or goose, especially when laying an egg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A laugh resembling the cry of a hen or goose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Futile or excessively noisy talk.",
                  "examples": [
                    "There's no time to waste on silly cackle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of hyenas.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cackle (third-person singular simple present cackles, present participle cackling, simple past and past participle cackled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a sharp, broken noise or cry, as a hen or goose does.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To laugh with a broken sound similar to a hen's cry.",
                  "examples": [
                    "The witch cackled evilly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To talk in a silly manner; to prattle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, gambling, slang) To pretend to rattle (dice) in one's hand while gripping them so that they maintain their orientation.",
                  "examples": [
                    "Danny cackled the dice furiously in his cupped hand, then rolled them so they stopped inches from Slattery's hands. The result was the same as before – a seven."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}