{
  "word": "lord",
  "etymologies": [
    {
      "description": [
        "From Middle English lord and lorde (attested from the 15th century), from earlier (14th century) lourde and other variants which dropped the intervocalic consonant of earlier lowerd, louerd, loverd, laford, and lhoaverd; from Old English hlāford < hlāfweard, a compound of hlāf (“bread”) + weard (“guardian”); see loaf and ward. The term was already being applied broadly prior to the literary development of Old English and was influenced by its common use to translate Latin dominus. Compare Scots laird (“lord”), preserving a separate vowel development (from northern/Scottish Middle English lard, laverd), the Old English compound hlāf-ǣta (“servant”, literally “bread-eater”), and modern English lady, from Old English hlǣfdīġe (“bread-kneader”). The Middle English word laford was borrowed by Icelandic, where it survives as lávarður."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lord (plural lords)",
          "definitionGroups": [
            {
              "group": "(obsolete) The master of the servants of a household; (historical) the master of a feudal manor",
              "entries": [
                {
                  "meaning": "(archaic) The male head of a household, a father or husband.",
                  "examples": [
                    "Ymbe ðet lond et cert ðe hire eðelmod hire hlabard salde."
                  ]
                },
                {
                  "meaning": "(archaic) The owner of a house, piece of land, or other possession",
                  "examples": [
                    "Als oure lauerd has heuen in hand",
                    "Sua suld man be lauerd of land."
                  ]
                }
              ]
            },
            {
              "group": "One possessing similar mastery over others; (historical) any feudal superior generally; any nobleman or aristocrat; any chief, prince, or sovereign ruler; in Scotland, a male member of the lowest rank of nobility (the equivalent rank in England is baron)",
              "entries": [
                {
                  "meaning": "(historical) A feudal tenant holding his manor directly of the king",
                  "examples": []
                },
                {
                  "meaning": "A peer of the realm, particularly a temporal one",
                  "examples": [
                    "Men myghten lordis knowe",
                    "By there arraye, from oþir folke."
                  ]
                },
                {
                  "meaning": "(obsolete, uncommon) A baron or lesser nobleman, as opposed to greater ones",
                  "examples": [
                    "Farre excellyng the state of lordes, erles, dukes or kynges."
                  ]
                }
              ]
            },
            {
              "group": "One possessing similar mastery in figurative senses (esp. as lord of ~)",
              "entries": [
                {
                  "meaning": "A magnate of a trade or profession.",
                  "examples": [
                    "The Tobacco Lords were a group of Scottish merchants and slave traders who in the 18th century made enormous fortunes by trading in tobacco."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) The heavenly body considered to possess a dominant influence over an event, time, etc.",
                  "examples": [
                    "The assendent, & eke the lord of the assendent, may be shapen for to be fortunat or infortunat, as thus, a fortunat assendent clepen they whan þat no wykkid planete, as Saturne or Mars, or elles the tail of the dragoun, is in þe hows of the assendent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang, obsolete) A hunchback.",
                  "examples": [
                    "Lord, a very crooked, deformed... Person."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Australia, via Cockney rhyming slang, obsolete) Sixpence.",
                  "examples": [
                    "Twenty years ago you might hear a sixpence described as a ‘Lord’ meaning ‘Lord of the Manor’; that is, a tanner."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lord (third-person singular simple present lords, present participle lording, simple past and past participle lorded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive and transitive) Domineer or act like a lord.",
                  "examples": [
                    "The grisly toadstool grown there might I see, / And loathed paddocks lording on the same."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To invest with the dignity, power, and privileges of a lord; to grant the title of lord.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}