{
  "word": "phenomenologically",
  "etymologies": [
    {
      "description": [
        "phenomenological +‎ -ly"
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "phenomenologically (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) In a manner characteristic of phenomenology or of phenomenological philosophy.",
                  "examples": [
                    "There is no question that, phenomenologically considered, the experience of perceiving and the experience of having a hallucination are sufficiently similar that, on the strength of what proves to be a hallucination, one may sincerely claim to have (veridically) perceived something."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) In a manner which places primary or undue reliance upon subjective criteria such as signs, symptoms and behaviors, while ignoring objective etiologies in the formulation of diagnoses and in the compilation of a formal nosologies.",
                  "examples": [
                    "The DSM may be viewed as a behavioristically, phenomenologically oriented nosology which often groups unlike disease states together into categories, and in its behaviorist approach, can ignore distinctions between pathophysiological processes within the brain and normal human response to stressors. Because of this and the modern access, via the techniques of molecular biology, to molecular processes in the human brain and other bodily systems, there is growing call in the psychiatric community to reformulate the mental health nosology, basing it rather upon the pathophysiological processes which may, or may not, underlie problematic behavioral phenomena."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}