{
  "word": "rise",
  "etymologies": [
    {
      "description": [
        "From Middle English risen, from Old English rīsan, from Proto-West Germanic *rīsan, from Proto-Germanic *rīsaną, from Proto-Indo-European *h₁rey- (“to rise, arise”). See also raise."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rise (plural rises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The process of or an action or instance of moving upwards or becoming greater.",
                  "examples": [
                    "The rise of the tide.",
                    "There was a rise of nearly two degrees since yesterday.",
                    "Exercise is usually accompanied by a temporary rise in blood pressure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The process of or an action or instance of coming to prominence.",
                  "examples": [
                    "The rise of the working class.",
                    "The rise of the printing press.",
                    "The rise of the feminists."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, also Australia, Canada, New Zealand, South Africa) An increase in a quantity, price, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Ireland, Australia, rest of Commonwealth, sometimes Canada) Ellipsis of pay rise: an increase in wage or salary.",
                  "examples": [
                    "The governor just gave me a rise of two pound six."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount of material extending from waist to crotch in a pair of trousers or shorts.",
                  "examples": [
                    "The rise of his pants was so low that his tailbone was exposed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Sussex) A small hill; used chiefly in place names.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area of terrain that tends upward away from the viewer, such that it conceals the region behind it; a slope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A very noticeable visible or audible reaction of a person or group.",
                  "examples": [
                    "Making fun of their football team is one sure way to get a rise from a crowd.",
                    "She really got a rise from the audience when she donned a wig and talked like the president."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The height of an arch or a step.",
                  "examples": [
                    "As the rise, i.e. height, of the arch decreases, the outward thrust increases.",
                    "Each step had a rise of 170 mm and a going of 250 mm."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rise (third-person singular simple present rises, present participle rising, simple past rose, past participle risen)",
          "definitionGroups": [
            {
              "group": "(intransitive) To move, or appear to move, physically upwards relative to the ground.",
              "entries": [
                {
                  "meaning": "To move upwards.",
                  "examples": [
                    "We watched the balloon rise."
                  ]
                },
                {
                  "meaning": "To grow upward; to attain a certain height.",
                  "examples": [
                    "This elm tree rises to a height of seventy feet."
                  ]
                },
                {
                  "meaning": "To slope upward.",
                  "examples": [
                    "The path rises as you approach the foot of the hill."
                  ]
                },
                {
                  "meaning": "(of a celestial body) To appear to move upwards from behind the horizon of a planet as a result of the planet's rotation.",
                  "examples": [
                    "The sun was rising in the East."
                  ]
                },
                {
                  "meaning": "To become erect; to assume an upright position.",
                  "examples": [
                    "to rise from a chair or from a fall"
                  ]
                },
                {
                  "meaning": "To leave one's bed; to get up.",
                  "examples": []
                },
                {
                  "meaning": "(figurative) To be resurrected.",
                  "examples": [
                    "he rose from the grave;   he is risen!"
                  ]
                },
                {
                  "meaning": "(figurative) To terminate an official sitting; to adjourn.",
                  "examples": [
                    "The committee rose after agreeing to the report."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive) To increase in value or standing.",
              "entries": [
                {
                  "meaning": "To attain a higher status.",
                  "examples": [
                    "among the rising theologians of Germany"
                  ]
                },
                {
                  "meaning": "Of a quantity, price, etc., to increase.",
                  "examples": []
                },
                {
                  "meaning": "To become more and more dignified or forcible; to increase in interest or power; said of style, thought, or discourse.",
                  "examples": [
                    "to rise in force of expression; to rise in eloquence;   a story rises in interest."
                  ]
                },
                {
                  "meaning": "To ascend on a musical scale; to take a higher pitch.",
                  "examples": [
                    "to rise a tone or semitone"
                  ]
                }
              ]
            },
            {
              "group": "To begin, to develop; to be initiated.",
              "entries": [
                {
                  "meaning": "To become active, effective or operational, especially in response to an external or internal stimulus.",
                  "examples": [
                    "to rise to the occasion",
                    "Thus far, my intellect has been able to rise sufficiently to meet every academic challenge that I have encountered.",
                    "As Patrick continued to goad me, I felt my temper rising towards the limits of my self control."
                  ]
                },
                {
                  "meaning": "To develop.",
                  "examples": [
                    "As hunger and despondency became more intense, a determination rose within me to find a way of getting off the desert island."
                  ]
                },
                {
                  "meaning": "To swell or puff up in the process of fermentation; to become light.",
                  "examples": [
                    "Has that dough risen yet?"
                  ]
                },
                {
                  "meaning": "(of a river) To have its source (in a particular place).",
                  "examples": [
                    "The majestic Marannon, or Amazon River, rises out of the Lake Launcocha, situated in the province of Tarma, in 10° 14ʹ south latitude, and ten leagues to the north of Pasco."
                  ]
                },
                {
                  "meaning": "To become perceptible to the senses, other than sight.",
                  "examples": [
                    "a noise rose on the air;   odour rises from the flower"
                  ]
                },
                {
                  "meaning": "To become agitated, opposed, or hostile; to go to war; to take up arms; to rebel.",
                  "examples": []
                },
                {
                  "meaning": "To come to mind; to be suggested; to occur.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To go up; to ascend; to climb.",
                  "examples": [
                    "to rise a hill"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to go up or ascend.",
                  "examples": [
                    "to rise a fish, or cause it to come to the surface of the water",
                    "to rise a ship, or bring it above the horizon by approaching it"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To retire; to give up a siege.",
                  "examples": [
                    "He, […]  rising with small honour from Gunza, […] was gone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To come; to offer itself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) To be lifted, or capable of being lifted, from the imposing stone without dropping any of the type; said of a form.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English ris, rys, from Old English hrīs, from Proto-Germanic *hrīsą (“twig; shoot”). More at rice."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rise (plural rises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of rice (“twig”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}