{
  "word": "present",
  "etymologies": [
    {
      "description": [
        "From Middle English present, from Old French present, from Latin praesent-, praesens present participle of praeesse (“to be present”), from Latin prae- (“pre-”) + esse (“to be”)."
      ],
      "adjectives": [
        {
          "description": "present (comparative more present, superlative most present)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to now, for the time being; current.",
                  "examples": [
                    "The barbaric practice continues to the present day.The present manager has been here longer than the last one.Up to the present day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Located in the immediate vicinity.",
                  "examples": [
                    "Is there a doctor present?  Several people were present when the event took place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Having an immediate effect (of a medicine, poison etc.); fast-acting. [16th–18th c.]",
                  "examples": [
                    "Amongſt this number of Cordials and Alteratiues, J doe not find a more preſent remedy, then a cup of wine, or ſtrong drinke, and if it be ſoberly and opportunely vſed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Not delayed; immediate; instant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Ready; quick in emergency.",
                  "examples": [
                    "a present wit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Favorably attentive; propitious.",
                  "examples": [
                    "to find a god so present to my prayer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to something a person is referring to in the very context, with a deictic use similar to the demonstrative adjective this.",
                  "examples": [
                    "in the present study,  the present article,  the present results."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Attentive; alert; focused.",
                  "examples": [
                    "Sorry, I was distracted just now, I'll try to be more present from now on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Neither for or against (used in voting to express abstention)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "present (plural presents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The current moment or period of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The present tense.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English presenten, from Old French presenter, from Latin praesentāre (“to show”), from praesent-, praesens, present participle of praeesse (“be in front of”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "present (plural presents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gift, especially one given for birthdays, Christmas, anniversaries, graduations, weddings, or any other special occasions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The position of a soldier in presenting arms.",
                  "examples": [
                    "to stand at present"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "present (third-person singular simple present presents, present participle presenting, simple past and past participle presented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bring (someone) into the presence of (a person); to introduce formally. [from 14th c.]",
                  "examples": [
                    "to present an envoy to the king"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To nominate (a member of the clergy) for an ecclesiastical benefice; to offer to the bishop or ordinary as a candidate for institution. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To offer (a problem, complaint) to a court or other authority for consideration. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To charge (a person) with a crime or accusation; to bring before court. [from 14th c.]",
                  "examples": [
                    "In the diocese of Gloucester in 1548 two inhabitants of Slimbridge were presented for saying that holy oil was ‘of no virtue but meet to grease sheep’."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To come forward, appear in a particular place or before a particular person, especially formally. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put (something) forward in order for it to be seen; to show, exhibit. [from 14th c.]",
                  "examples": [
                    "Note: The offensive team must present a legal formation both before and after a shift."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make clear to one's mind or intelligence; to put forward for consideration. [from 14th c.]",
                  "examples": [
                    "I do begin to realize that the matter must be presented in such a way as may interest the reader."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put on, stage (a play etc.). [from 16th c.]",
                  "examples": [
                    "The theater is proud to present the Fearless Fliers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To point (a firearm) at something, to hold (a weapon) in a position ready to fire. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To offer oneself for mental consideration; to occur to the mind. [from 16th c.]",
                  "examples": [
                    "Well, one idea does present itself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, medicine) To come to the attention of medical staff, especially with a specific symptom. [from 19th c.]",
                  "examples": [
                    "The patient presented with insomnia."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, medicine) To appear (in a specific way) for delivery (of a fetus); to appear first at the mouth of the uterus during childbirth. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with \"as\") To appear or represent oneself (as having a certain gender).",
                  "examples": [
                    "At that time, Elbe was presenting as a man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To act as presenter on (a radio, television programme etc.). [from 20th c.]",
                  "examples": [
                    "Anne Robinson presents \"The Weakest Link\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give a gift or presentation to (someone). [from 14th c.]",
                  "examples": [
                    "She was presented with an honorary degree for her services to entertainment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give (a gift or presentation) to someone; to bestow. [from 14th c.]",
                  "examples": [
                    "My last, least offering, I present thee now."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deliver (something abstract) as though as a gift; to offer. [from 14th c.]",
                  "examples": [
                    "I presented my compliments to Lady Featherstoneshaw."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hand over (a bill etc.) to be paid. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, zoology) To display one's female genitalia in a way that signals to others that one is ready for copulation. Also referred to as lordosis behaviour. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fandom slang) In omegaverse fiction, to have one's secondary sex (alpha, omega, or beta) become apparent, typically at puberty. [from 21st c.]",
                  "examples": [
                    "Sherlock’s gender performance itself remains unchanged, with the exception of the hormonal changes he goes through after presenting as an omega."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}