{
  "word": "gomer",
  "etymologies": [
    {
      "description": [
        "From Latin gomor in the Vulgate, from Ancient Greek γομόρ (gomór) in the Septuagint, from Hebrew עומר‎ ('ómer, “sheaf; unit of dry measure”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gomer (plural gomers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical units of measure, archaic) Alternative form of omer: a former Hebrew unit of dry volume equal to about 2.3 L or 2.1 quarts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "After Louis-Gabriel de Gomer, the French artillery officer who invented the design. Attested in English since the early nineteenth century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gomer (plural gomers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conical chamber at the breech of the bore in heavy ordnance, especially in mortars.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Likely from the oafish fictional character Gomer Pyle from the 1960s American sitcom The Andy Griffith Show."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gomer (plural gomers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) A stupid, awkward, or oafish person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military slang, derogatory) An inept trainee or serviceperson.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military slang) An opponent in combat or in training.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Perhaps the same as, or influenced by Etymology 3, above. It is frequently claimed that the word is an acronym for \"grand old man of the emergency room\", or for \"Get Out of My ER\", the latter story popularized by the 1978 novel The House of God by Samuel Shem. John Algeo (1991) notes that various people claim the word is an acronym or is borrowed from Hebrew G-M-R (“finish; complete”), but suggests that these accounts are dubious. He concludes that a connection to Gomer Pyle or to the \"stupid, awkward person\" sense of the word is the most likely source. The Oxford English Dictionary online (2003) likewise treats the \"undesirable patient\" and \"stupid person\" senses as uses of the same word."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gomer (plural gomers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medical slang, derogatory) An undesirable hospital patient, or a patient who does not need medical care.",
                  "examples": [
                    "That patient is a total GOMER. Turf him and let's get some lunch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) A dirty, senile, or otherwise unpleasant patient.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, informal) A patient who does not respond to medical treatment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}