{
  "word": "wet",
  "etymologies": [
    {
      "description": [
        "From Middle English wet (“wet, moistened”), wett, wette, past participle of Middle English weten (“to wet”), from Old English wǣtan (“to wet, moisten, water”), from Proto-Germanic *wētijaną (“to wet, make wet”), from Proto-Indo-European *wed- (“water, wet”) (also the source of water).",
        "Cognate with Scots weit, wete (“to wet”), Saterland Frisian wäitje (“to wet; drench”), Icelandic væta (“to wet”). Compare also Middle English weet (“wet”), from Old English wǣt (“wet, moist, rainy”), from Proto-Germanic *wētaz (“wet, moist”), related to Scots weit, weet, wat (“wet”), North Frisian wiat, weet, wäit (“wet”), Saterland Frisian wäit (“wet”), West Frisian wiet (“wet”), Swedish and Norwegian våt (“wet”), Danish våd (“wet”), Faroese vátur (“wet”), Icelandic votur (“wet”)."
      ],
      "adjectives": [
        {
          "description": "wet (comparative wetter, superlative wettest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made up of liquid or moisture, usually (but not always) water.",
                  "examples": [
                    "Synonym: wetting",
                    "Water is wet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of an object, etc.: covered or impregnated with liquid, usually (but not always) water.",
                  "examples": [
                    "Synonyms: damp, saturated, soaked; see also Thesaurus:wet",
                    "Antonym: dry",
                    "I went out in the rain and now my clothes are all wet.",
                    "The baby is wet and needs its nappy changed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a burrito, sandwich, or other food: covered in a sauce.",
                  "examples": [
                    "A chimichanga (MWCD: 1982) is a burrito that is deep-fried, rather than baked, and is served in the fashion of a wet burrito."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of calligraphy and fountain pens: depositing a large amount of ink from the nib or the feed.",
                  "examples": [
                    "This pen’s a wet writer, so it’ll feather on this cheap paper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a sound recording: having had audio effects applied.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of weather or a time period: rainy.",
                  "examples": [
                    "Synonyms: damp, raining, rainy",
                    "Antonyms: dry, sunny",
                    "It’s going to be wet tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) Using afterburners or water injection for increased engine thrust.",
                  "examples": [
                    "This fighter jet's engine is rated for a maximum wet thrust of 450 kilonewtons, more than twice its max dry thrust, but the afterburner eats up a huge amount of fuel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Of a person: inexperienced in a profession or task; having the characteristics of a rookie.",
                  "examples": [
                    "Synonyms: green, wet behind the ears",
                    "That guy’s wet; after all, he just started yesterday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar, of a female) Sexually aroused and thus having the vulva moistened with vaginal secretions.",
                  "examples": [
                    "Synonyms: horny, moist; see also Thesaurus:randy",
                    "He got me all wet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) Ineffectual, feeble, showing no strength of character.",
                  "examples": [
                    "\"Wet! What currency that bit of slang has—and what awful power. It took me a long time to find out what the word meant, but after long research I think that I know. A man is wet if he isn't a 'regular guy'; he is wet if he isn't 'smooth'; he is wet if he has intellectual interests and lets the mob discover them; and, strangely enough, he is wet by the same token if he is utterly stupid. He is wet if he doesn't show at least a tendency to dissipate, but he isn't wet if he dissipates to excess. A man will be branded as wet for any of these reasons, and once he is so branded, he might as well leave college … \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(retronym) Permitting alcoholic beverages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) Refreshed with liquor; drunk.",
                  "examples": [
                    "Synonyms: inebriated, soused; see also Thesaurus:drunk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, chemistry) Of a scientist or laboratory: working with biological or chemical matter.",
                  "examples": [
                    "Antonym: dry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Employing, or done by means of, water or some other liquid.",
                  "examples": [
                    "the wet extraction of copper, in distinction from dry extraction in which dry heat or fusion is employed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, euphemistic) Involving assassination or \"wet work\".",
                  "examples": [
                    "a wet affair; a wet job; wet stuff"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated or obsolete, colloquial) Of a Quaker: liberal with respect to religious observance.",
                  "examples": [
                    "The Catholics thought him almost a Catholic. The Church of England claimed him as one of them. The Presbyterians thought him half a Presbyterian, and the Friends believed him a wet Quaker. The dissenting clergymen in England and America were among the most distinguished asserters and propagators of his renown. Indeed, all sects considered him, and I believe justly, a friend to unlimited toleration in matters of religion."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "wet (countable and uncountable, plural wets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Liquid or moisture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rainy weather.",
                  "examples": [
                    "Don't go out in the wet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) Rainy season. (often capitalized)",
                  "examples": [
                    "They'll be in the camp  […]  before the Wet's out, mark my words."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, UK politics, derogatory) A moderate Conservative; especially, one who opposed the hard-line policies of British Prime Minister Margaret Thatcher in the 1980s.",
                  "examples": [
                    "Antonym: dry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An alcoholic drink.",
                  "examples": [
                    "‘A pity,’ said Jim, ‘I thought we was going to have a free wet.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial) One who supports the consumption of alcohol and thus opposes Prohibition.",
                  "examples": [
                    "The drys were as unhappy with the second part of the speech as the wets were with the first half."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(motor racing, in the plural) A tyre for use in wet weather.",
                  "examples": [
                    "Wets, designed to channel water away from underneath the tyres, maximise grip and minimise the chance of aquaplaning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, derogatory) A weak or sentimental person; a wimp or softie.",
                  "examples": [
                    "Above all, he [Nigel Molesworth] is his own man, resolutely committed to a view of life that divides his fellow pupils into 'sissies', 'wets', 'swots' and 'old lags'."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wet (third-person singular simple present wets, present participle wetting, simple past and past participle wet or wetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or impregnate with liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (oneself, clothing, a bed, etc.) wet by accidental urination.",
                  "examples": [
                    "Johnny wets the bed several times a week.",
                    "She was laughing so hard she wet her pants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make or become wet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, soldering) To form an intermetallic bond between a solder and a metal substrate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To celebrate by drinking alcohol.",
                  "examples": [
                    "[He] invited some officers and other gentlemen to dine with him at the Dolphin tavern in Tower street, June 17, 1706, in order to wet his commission  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of whet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, MLE, MTE, slang) To kill or seriously injure.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}