{
  "word": "merchandise",
  "etymologies": [
    {
      "description": [
        "From Middle English marchaundise (“commerce, trading; buying, purchasing; business transaction, bargain, deal; agreement; trade, vocation; merchandise, goods, wares; possessions, wealth; reward; ability or right to carry on business; market; communication between God and humans; sale of indulgences; simony; paid advocate or orator (?)”), from Anglo-Norman marchaundise and Old French marcheandise (modern French marchandise), from Old French marcheant (“seller, vendor”) (ultimately from Latin mercātus (“buying and selling, trade, traffic; market; marketplace”), possibly originally Etruscan) + -ise (suffix forming feminine nouns, often denoting a quality or state). The English word is analysable as merchant +‎ -ise."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "merchandise (usually uncountable, plural merchandises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Goods which are or were offered or intended for sale.",
                  "examples": [
                    "Good business depends on having good merchandise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Commercial goods connected (branded) with an entity such as a team, band, company, charity, work of fiction, festival, or meme. (Commonly shortened to merch.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, archaic) A commodity offered for sale; an article of commerce; a kind of merchandise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, archaic) The act or business of trading; trade; traffic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English marchaundisen (“to engage in commerce, traffic”), from marchaundise (noun) (see etymology 1) + -en (suffix forming the infinitive of verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "merchandise (third-person singular simple present merchandises, present participle merchandising, simple past and past participle merchandised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To engage in trade; to carry on commerce.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in in-store promotion of the sale of goods, as by display and arrangement of goods.",
                  "examples": [
                    "He started his career merchandising in a small clothing store chain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To engage in the trade of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To engage in in-store promotion of the sale of.",
                  "examples": [
                    "He got hired to merchandise some new sporting goods lines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To promote as if for sale.",
                  "examples": [
                    "The record companies don't get as good a return on merchandising artists under contract."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}