{
  "word": "hammock",
  "etymologies": [
    {
      "description": [
        "Borrowed from Spanish hamaca, from Taíno *hamaka (compare Arawak hamaka, Wayuu jama'a), from Proto-Arawak *hamaka. Columbus, in the narrative of his first voyage, says: “A great many Indians in canoes came to the ship to-day for the purpose of bartering their cotton, and hamacas, or nets, in which they sleep.”"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hammock (plural hammocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A swinging couch or bed, usually made of netting or canvas about six feet wide, suspended by clews or cords at the ends.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, archaic outside dialects) A piece of land thickly wooded, and usually covered with bushes and vines.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hammock (third-person singular simple present hammocks, present participle hammocking, simple past and past participle hammocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lie in a hammock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a cloth) To hang in a way that resembles a hammock.",
                  "examples": [
                    "\"She hammocked their plaids between the table and the bed, then edged her way past Kenneth as she approached the central hearth.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make something be wrapped tight, like in a hammock.",
                  "examples": [
                    "\"She hammocked her breasts into her bra, snapped it, hitched at it, and gave herself a profile glance in the mirror.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, broadcasting) To schedule (a new or unpopular programme) between two popular ones in the hope that viewers will watch it.",
                  "examples": [
                    "Coordinate term: tentpole"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}