{
  "word": "meridian",
  "etymologies": [
    {
      "description": [
        "From Late Middle English meridian, meridien (“relating to midday or noon; southern; (astronomy) relating to the celestial meridian”) [and other forms], from Middle French meridien, Old French meridiane (“relating to midday; southern”) (whence Anglo-Norman meridien; modern French méridien), and from their etymon Latin merīdiānus (“relating to midday; southern”), from merīdiēs (“midday, noon; the south (due to the southward orientation of the sun at noon in the Northern Hemisphere)”) + -ānus (suffix meaning ‘of or pertaining to’). Merīdiēs is a dissimilated form of Old Latin medīdiēs (with the -d- sound shifted to -r-), from medius (“middle”) (ultimately from Proto-Indo-European *médʰyos (“middle”)) + diēs (“day”) (ultimately from Proto-Indo-European *dyew- (“heaven, sky; to be bright”))."
      ],
      "adjectives": [
        {
          "description": "meridian (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to a meridian (in various senses); meridional.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic except literary) Relating to midday or noon.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "Relating to the culmination or highest point.",
                  "examples": []
                },
                {
                  "meaning": "Relating to the south; meridional, southern.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is derived from Late Middle English meridian, meridien (“midday, noon; position of the sun at noon; the south; longitude of a place; (astronomy) celestial meridian”) [and other forms], from Anglo-Norman meridien (“midday”), Middle French meridien (“midday; the south; terrestrial meridian; (astronomy) celestial meridian”) (modern French méridien), and Old French meridiane, meridiiene, and from their etymon Latin merīdiānum (“midday; position of the sun at noon; the south”), a noun use of the neuter form of merīdiānus (“relating to midday; southern”); see further at etymology 1.",
        "Sense 1.1 (“celestial meridian”) is ultimately modelled after Latin merīdiāna līnea (“meridian line”). Sense 5.2 (“midday rest; siesta”) is modelled after Late Latin meridiana (“midday; midday rest”), probably short for Latin merīdiāna hōra (“midday time”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "meridian (plural meridians)",
          "definitionGroups": [
            {
              "group": "(astronomy)",
              "entries": [
                {
                  "meaning": "In full celestial meridian: a great circle passing through the poles of the celestial sphere and the zenith for a particular point on the Earth's surface. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(also geography) In full terrestrial meridian: a great circle on the Earth's surface, passing through the geographic poles (the terrestrial North Pole and South Pole); also, half of such a circle extending from pole to pole, all points of which have the same longitude. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "The place on the celestial meridian where it is crossed by the sun or a star at its highest point.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) The highest or most developed point, or most splendid stage, of something; culmination, peak, zenith. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(figuratively, specifically) Chiefly followed by of: the middle period of someone's life, when they are at their full abilities or strength; one's prime. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "A ring or half-ring with markings in which an artificial globe is installed and may spin.",
                  "examples": []
                },
                {
                  "meaning": "(mathematics) A line passing through the poles of any sphere; a notional line on the surface of a curved or round body (in particular, an eyeball). [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, printing, dated) The size of type between double great primer and canon, standardized as 44-point.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "The south. [14th–17th c.]",
                  "examples": []
                },
                {
                  "meaning": "Midday, noon. [14th–19th c.]",
                  "examples": [
                    "Synonyms: noontide; see also Thesaurus:midday"
                  ]
                },
                {
                  "meaning": "A midday rest; a siesta.",
                  "examples": []
                },
                {
                  "meaning": "A particular area or situation considered as having a specific characteristic or identity; also, the characteristics, habits, or tastes of a specific group, locale, etc. [16th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Scotland) An alcoholic drink taken at midday. [18th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "meridian (third-person singular simple present meridians, present participle meridianing, simple past and past participle meridianed) (rare, also figuratively)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause an object to reach the meridian or highest point of (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a celestial body: to reach its meridian.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French méridien or German Meridian (“pathway on the body along which life force is thought to flow”), from Latin merīdiānum (“midday; position of the sun at noon; the south”) (see further at etymology 2); the French and German words are calques of Mandarin 經／经, 经 (jīng, “pathway on the body along which life force is thought to flow; longitude; warp of woven fabric; to go or pass through”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "meridian (plural meridians)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(acupuncture, traditional Chinese medicine) Any of the pathways on the body along which chi or qi (life force) is thought to flow and, therefore, the acupoints are distributed; especially, one of twelve such pathways associated with organs of the body. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}