{
  "word": "suspension",
  "etymologies": [
    {
      "description": [
        "From Late Latin suspensiō, suspensiōnem (“arching, vaulting; suspension”), from suspendēre, from suspendō (“to hang up, to suspend”), from sub- (“prefix meaning ‘under’”) + pendere (from pendō (“to hang, to suspend”), from Proto-Italic *pendō (“to hang, to put in a hanging position”), from Proto-Indo-European *(s)pénd-e-ti, from *(s)pend- (“to pull; to spin”)). Compare Anglo-Norman suspensiun, French suspension, Occitan suspensio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "suspension (countable and uncountable, plural suspensions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of suspending, or the state of being suspended.",
                  "examples": [
                    "suspension from a hook"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A temporary or conditional delay, interruption or discontinuation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry, physics) The state of a solid or substance produced when its particles are mixed with, but not dissolved in, a fluid, and are capable of separation by straining.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Thus a kind of silt or sludge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of keeping a person who is listening in doubt and expectation of what is to follow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The temporary barring of a person from a workplace, society, etc. pending investigation into alleged misconduct.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) The process of barring a student from school grounds as a form of punishment (particularly out-of-school suspension).",
                  "examples": [
                    "suspension from school as a disciplinary measure"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The act of or discord produced by prolonging one or more tones of a chord into the chord which follows, thus producing a momentary discord, suspending the concord which the ear expects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, law) A stay or postponement of the execution of a sentence, usually by letters of suspension granted on application to the Lord Ordinary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(topology) A topological space derived from another by taking the product of the original space with an interval and collapsing each end of the product to a point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(topology) A function derived, in a standard way, from another, such that the instant function’s domain and codomain are suspensions of the original function’s.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vehicles) The system of springs and shock absorbers connected to the wheels in an automobile, which allows the vehicle to move smoothly with reduced shock to its occupants.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}