{
  "word": "wind",
  "etymologies": [
    {
      "description": [
        "From Middle English wynd, wind, from Old English wind (“wind”), from Proto-West Germanic *wind, from Proto-Germanic *windaz, from Proto-Indo-European *h₂wéh₁n̥tos (“wind”), from earlier *h₂wéh₁n̥ts (“wind”), derived from the present participle of *h₂weh₁- (“to blow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wind (countable and uncountable, plural winds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Real or perceived movement of atmospheric air usually caused by convection or differences in air pressure.",
                  "examples": [
                    "The wind blew through her hair as she stood on the deck of the ship.",
                    "As they accelerated onto the motorway, the wind tore the plywood off the car's roof-rack.",
                    "The winds in Chicago are fierce.",
                    "There was a sudden gust of wind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Air artificially put in motion by any force or action.",
                  "examples": [
                    "the wind of a cannon ball;  the wind of a bellows"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) The ability to breathe easily.",
                  "examples": [
                    "After the second lap he was already out of wind.",
                    "The fall knocked the wind out of him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "News of an event, especially by hearsay or gossip. (Used with catch, often in the past tense.)",
                  "examples": [
                    "Steve caught wind of Martha's dalliance with his best friend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the five basic elements in Indian and Japanese models of the Classical elements.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, colloquial) Flatus.",
                  "examples": [
                    "Eww. Someone just passed wind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Breath modulated by the respiratory and vocal organs, or by an instrument.",
                  "examples": [
                    "Their instruments were various in their kind,  Some for the bow, and some for breathing wind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The woodwind section of an orchestra.  Occasionally also used to include the brass section.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A direction from which the wind may blow; a point of the compass; especially, one of the cardinal points, which are often called the \"four winds\".",
                  "examples": [
                    "Come from the four winds, O breath, and breathe upon these slain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Types of playing-tile in the game of mah-jongg, named after the four winds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A disease of sheep, in which the intestines are distended with air, or rather affected with a violent inflammation. It occurs immediately after shearing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mere breath or talk; empty effort; idle words.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bird, the dotterel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing, slang) The region of the solar plexus, where a blow may paralyze the diaphragm and cause temporary loss of breath or other injury.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wind (third-person singular simple present winds, present participle winding, simple past and past participle winded or (proscribed) wound)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To blow air through a wind instrument or horn to make a sound.",
                  "examples": [
                    "\"If your Majesty is ever to use the Horn,\" said Trufflehunter, \"I think the time has now come.\" Caspian had of course told them of this treasure several days ago. […] \"Then in the name of Aslan we will wind Queen Susan's Horn,\" said Caspian."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (someone) to become breathless, as by a blow to the abdomen, or by physical exertion, running, etc.",
                  "examples": [
                    "The boxer was winded during round two."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain) To cause a baby to bring up wind by patting its back after being fed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain) To turn a boat or ship around, so that the wind strikes it on the opposite side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To expose to the wind; to winnow; to ventilate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To perceive or follow by scent.",
                  "examples": [
                    "The hounds winded the game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rest (a horse, etc.) in order to allow the breath to be recovered; to breathe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To turn a windmill so that its sails face into the wind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English wynden, from Old English windan, from Proto-Germanic *windaną. Compare West Frisian wine, Low German winden, Dutch winden, German winden, Danish vinde, Walloon windea. See also the related term wend."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wind (plural winds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of winding or turning; a turn; a bend; a twist.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wind (third-person singular simple present winds, present participle winding, simple past and past participle wound or winded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To turn coils of (a cord or something similar) around something.",
                  "examples": [
                    "to wind thread on a spool or into a ball"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tighten the spring of a clockwork mechanism such as that of a clock.",
                  "examples": [
                    "Please wind that old-fashioned alarm clock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To entwist; to enfold; to encircle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel in a way that is not straight.",
                  "examples": [
                    "Vines wind round a pole.  The river winds through the plain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have complete control over; to turn and bend at one's pleasure; to vary or alter at will; to regulate; to govern.",
                  "examples": [
                    "Were our legislature vested in the person of our prince, he might doubtless wind and turn our constitution at his pleasure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To introduce by insinuation; to insinuate.",
                  "examples": [
                    "'Tis pleasant to see what little arts and dexterities they have to wind in such things into discourse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or surround with something coiled about.",
                  "examples": [
                    "to wind a rope with twine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to move by exerting a winding force; to haul or hoist, as by a winch.",
                  "examples": [
                    "Quickly she slammed the door shut and panicking wound the window up as fast as her slippery fingers would allow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To turn (a ship) around, end for end.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}