{
  "word": "accident",
  "etymologies": [
    {
      "description": [],
      "adjectives": [
        {
          "description": "",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transport) Designating any form of transportation involved in an accident.",
                  "examples": [
                    "The NTSB report revealed that the accident airplane was a Cessna 172."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "accident (countable and uncountable, plural accidents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "An unexpected event with negative consequences occurring without the intention of the one suffering the consequences, and (in the strict sense) not directly caused by humans.",
              "entries": [
                {
                  "meaning": "(law) casus; such unforeseen, extraordinary, extraneous interference as is out of the range of ordinary calculation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transport) A collision or crash of a vehicle, aircraft, or other form of transportation that causes damage to the transportation involved; and sometimes injury or death to the transportation's occupants or bystanders in close proximity. (but see Usage notes)",
                  "examples": [
                    "There was a huge accident on I5 involving 15 automobiles.",
                    "My insurance went up after the second accident in three months."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any chance event.",
                  "examples": [
                    "He also objects to the idea of women arising by an accident of nature, preferring the notion that they came about as a 'result of some strong mental impression', and so 'the sex of the progeny would have been settled by the decision of the progenitor'."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Chance; random chance.",
                  "examples": [
                    "Thou cam'st not to thy place by accident, / It is the very place God meant for thee; […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "Any property, fact, or relation that is the result of chance or is nonessential or nonsubstantive.",
              "entries": [
                {
                  "meaning": "(grammar) A property attached to a word, but not essential to it, such as gender, number, or case.",
                  "examples": [
                    "An adjective, so called because adjectitious, or added to a substantive, denotes some quality or accident of the substantive to which it is joined  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(euphemistic) An instance of incontinence.",
              "entries": [
                {
                  "meaning": "Urine or feces excreted due to incontinence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(euphemistic) An unintended pregnancy.",
              "entries": [
                {
                  "meaning": "(derogatory or humorous) A person born from an unintended pregnancy.",
                  "examples": [
                    "Taylor was our sweet little accident, and we're so glad!",
                    "Well I may be annoying but at least I'm not an accident like you are"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) An irregular surface feature with no apparent cause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A sudden discontinuity of ground such as fault of great thickness, bed or lentil of unstable ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A point or mark which may be retained or omitted in a coat of arms.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}