{
  "word": "smother",
  "etymologies": [
    {
      "description": [
        "From Middle English smothren, smortheren, alteration (due to smother, smorther (“a suffocating vapour, dense smoke”, noun)) of Middle English smoren (“to smother”), from Old English smorian (“to smother, suffocate, choke”), from Proto-Germanic *smurōną (“to suffocate, strangle”), probably related to *smallijan (“to burn”) or Old English smoca (“smoke”).",
        "Cognate with Middle Low German smoren, smurten (“to choke, suffocate”), West Flemish smoren (“to smoke, reek”), Dutch smoren (“to suffocate, smother\", also \"to stew, simmer”), German schmoren (“to stew, simmer, braise”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "smother (third-person singular simple present smothers, present participle smothering, simple past and past participle smothered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To suffocate; stifle; obstruct, more or less completely, the respiration of something or someone.",
                  "examples": [
                    "He smothered her by pressing his hand over her mouth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To extinguish or deaden, as fire, by covering, overlaying, or otherwise excluding the air.",
                  "examples": [
                    "to smother a fire with ashes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce to a low degree of vigor or activity; suppress or do away with; extinguish",
                  "examples": [
                    "Synonyms: stifle, cover up, conceal, hide",
                    "The committee's report was smothered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cooking) To cook in a close dish.",
                  "examples": [
                    "beefsteak smothered with onions"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To daub or smear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be suffocated.",
                  "examples": [
                    "She is smothered by the rope."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To breathe with great difficulty by reason of smoke, dust, close covering or wrapping, or the like.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a fire) to burn very slowly for want of air; smolder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) to perish, grow feeble, or decline, by suppression or concealment; be stifled; be suppressed or concealed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) To get in the way of a kick of the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football) To get in the way of a kick of the ball, preventing it going very far. When a player is kicking the ball, an opponent who is close enough will reach out with his hands and arms to get over the top of it, so the ball hits his hands after leaving the kicker's boot, dribbling away.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing) To prevent the development of an opponent's attack by one's arm positioning.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English smother, smorther (“a suffocating vapour, dense smoke”), from Old English smorþor (“smoke”, literally “that which suffocates”), from smorian (“to suffocate, choke”) + -þor (instrumental suffix)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "smother (countable and uncountable, plural smothers)",
          "definitionGroups": [
            {
              "group": "That which smothers or appears to smother, particularly",
              "entries": [
                {
                  "meaning": "Smoldering; slow combustion.",
                  "examples": []
                },
                {
                  "meaning": "Cookware used in such cooking.",
                  "examples": []
                },
                {
                  "meaning": "(dated) The state of being stifled; suppression.",
                  "examples": []
                },
                {
                  "meaning": "(dated) Stifling smoke; thick dust.",
                  "examples": [
                    "Then we passed the Grand Opéra, at which our fine taste revolted; the Rue de la Paix, all in a smother with the dust caused by its improvement, at which our eyes naturally distilled water;  […]"
                  ]
                },
                {
                  "meaning": "(Australian rules football) The act of smothering a kick (see verb section).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}