{
  "word": "ejaculate",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin ēiaculātus, perfect passive participle of ēiaculor (“hurl, shoot out”), from ē (“out”) + iaculor (“throw, dart”), from iaculum (“a missile, a dart”), from iaciō (“to throw, to hurl”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "ejaculate (countable and uncountable, plural ejaculates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fluid or some other substance ejected or suddenly thrown from a duct or other body structure; specifically, semen or vaginal fluid ejected by a human being or other mammal during an ejaculation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "ejaculate (third-person singular simple present ejaculates, present participle ejaculating, simple past and past participle ejaculated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To eject abruptly; to throw out suddenly and swiftly.",
                  "examples": [
                    "Synonyms: eject, throw out"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To say abruptly.",
                  "examples": [
                    "Synonym: blurt out"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, transitive) To eject or suddenly throw fluid or some other substance from a duct or other body structure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically, transitive and intransitive) Of a human being or other mammal: to forcibly eject from the urethra in response to sexual stimulation, in a male, semen; and, in a female, vaginal fluid.",
                  "examples": [
                    "Synonyms: see Thesaurus:ejaculate",
                    "Men can ejaculate between 0.1 and 10 milliliters of semen on average. (transitive)",
                    "With a groan, he ejaculated on his abdomen. (intransitive)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To sexually stimulate (someone) so that they eject fluid from the urethra.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}