{
  "word": "caveat",
  "etymologies": [
    {
      "description": [
        "Learned borrowing from Latin caveat (“may he beware of”), third-person singular present active subjunctive of caveō (“I beware of”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "caveat (plural caveats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A warning.",
                  "examples": [
                    "There is at least one caveat in cultivation: you’ll have to stick to only one discipline, such as that according to Bhaiṣajyaguru, the Medicine Buddha."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A qualification or exemption.",
                  "examples": [
                    "He gave his daughter some hyacinth bulbs with the caveat that she plant them in the shade."
                  ]
                }
              ]
            },
            {
              "group": "(law) A formal objection.",
              "entries": [
                {
                  "meaning": "(law) A formal notice of interest in land under a Torrens land-title system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A notice requesting a postponement of a court proceeding.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "caveat (third-person singular simple present caveats, present participle caveating or caveatting, simple past and past participle caveated or caveatted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, regarded by some as nonstandard) To qualify a statement with a caveat or proviso.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive, law) To formally object to something.",
              "entries": [
                {
                  "meaning": "(transitive, law, specifically) To lodge a formal notice of interest in land under a Torrens land-title system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law, dated) To issue a notice requesting that proceedings be suspended.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To warn or caution against some event.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}