{
  "word": "justify",
  "etymologies": [
    {
      "description": [
        "From Middle English justifien, from Old French justifier, from Late Latin justificare (“make just”), from Latin justus, iustus (“just”) + ficare (“make”), from facere, equivalent to just +‎ -ify."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "justify (third-person singular simple present justifies, present participle justifying, simple past and past participle justified)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide an acceptable explanation for.",
                  "examples": [
                    "How can you justify spending so much money on clothes?",
                    "Paying too much for car insurance is not justified."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be a good, acceptable reason for; warrant.",
                  "examples": [
                    "Nothing can justify your rude behaviour last night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To arrange (text) on a page or a computer screen such that the left and right ends of all lines within paragraphs are aligned.",
                  "examples": [
                    "The text will look better justified."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To absolve, and declare to be free of blame or sin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To give reasons for one’s actions; to make an argument to prove that one is in the right.",
                  "examples": [
                    "She felt no need to justify herself for deciding not to invite him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To prove; to ratify; to confirm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To show (a person) to have had a sufficient legal reason for an act that has been made the subject of a charge or accusation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To qualify (oneself) as a surety by taking oath to the ownership of sufficient property.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}