{
  "word": "metarule",
  "etymologies": [
    {
      "description": [
        "meta- +‎ rule"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "metarule (plural metarules)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rule that governs the application of other rules.",
                  "examples": [
                    "The existence and durability of social rules—irrespective of the sources to which man may have attributed them—is evi- dence of the intensity of the human need to follow rules. Indeed, man's need for rules and his propensity to follow them is equaled only by his desire to reject rules and be free of them. As I will try to show later,15 this antithetical disposition is a special instance of a more general human ambivalence— namely, the simultaneous needs for intimacy and solitude. Alternating attitudes of submission to and rebellion against people and rules may be best viewed as manifestations of this fundamental human paradox. One of the most useful methods for resolving this dilemma is our capacity for abstraction which makes it possible to construct progressively higher levels of symbolization; these constructs, in turn, lead to a lessening of the feeling of compulsion attached to rules explic- itly understood as rules. Thus, for each set of rules we can, in principle, construct a set of metarules. The latter are made up of the specifications governing the formation of the rules at the next lower (logical) level. Explicit awareness of metarules implies an understanding of the origin, function, and scope of the (next lower level) rules. Acquiring such understanding constitutes a form of mastery. Only by practicing what may be called the metarule attitude—which is actually a special case of the scientific attitude applied to the domain of rules—can we acquire a secure yet flexible integration of rules as behav- ior-regulating agencies. Finally, the metarule attitude enables us to increase our range of choices about whether or not to comply with rules, and whether or not to try to change them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}