{
  "word": "dagger",
  "etymologies": [
    {
      "description": [
        "From Middle English daggere, daggare, dagard, probably adapted from Old French dague (1229), related to Occitan, Italian, Spanish daga, Dutch dagge, German Degen, Middle Low German dagge (“knife's point”), Old Norse daggarðr, Danish daggert, Faroese daggari, Welsh dager, dagr, Breton dac, Albanian thikë (“a knife, dagger”), thek (“to stab, to pierce with a sharp object”).",
        "In English attested from the 1380s.\nThe ultimate origin of the word is unclear. Grimm suspects Celtic origin.\nOthers have suggested derivation from an unattested Vulgar Latin *daca \"Dacian [knife]\", from the Latin adjective dācus. Chastelain (Dictionaire etymologique, 1750) thought that French dague was a derivation from German dagge, dagen, although not attested until a much later date).",
        "The knightly dagger evolves from the 12th century. Guillaume le Breton (died 1226) uses daca in his Philippide. Other Middle Latin forms include daga, dagga, dagha, dagger, daggerius, daggerium, dagarium, dagarius, diga; the forms with -r- are late 14th century adoptions of the English word).\nOED points out that there is also an English verb dag (“to stab”) from which this could be a derivation, but the verb is attested only from about 1400.",
        "Relation to Old Armenian դակու (daku, “adze, axe”) has also been suggested. Alternatively, a connection from Proto-Indo-European *dʰāg-u- and cognate with Ancient Greek θήγω (thḗgō, “to sharpen, whet”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dagger (plural daggers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) A stabbing weapon, similar to a sword but with a short, double-edged blade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) The text character †; the obelus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball, American football) A point scored near the end of the game (clutch time) to take or increase the scorer's team lead, so that they are likely to win.",
                  "examples": [
                    "Curry's last-minute 3-point dagger silenced the criticism for his so-called failure to come up big in big moments."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dagger (third-person singular simple present daggers, present participle daggering, simple past and past participle daggered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pierce with a dagger; to stab.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Perhaps from diagonal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dagger (plural daggers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A timber placed diagonally in a ship's frame.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}