{
  "word": "pedicel",
  "etymologies": [
    {
      "description": [
        "From Late Latin pedīcellus, diminutive of pedīculus (“foot-stalk or pedicle of a fruit or leaf”), diminutive of pēs (“foot”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pedicel (plural pedicels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A stalk of an individual flower (or fruit, e.g., once fertilised); a stalk bearing a single flower or spore-producing body within a cluster.",
                  "examples": [
                    "Synonyms: footstalk, strig",
                    "Coordinate term: peduncle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mycology) A stalk of a fungus fruiting body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A stalk-shaped body part; an anatomical part that resembles a stem or stalk.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(zoology) A narrow stalk-like body part connecting specific segments in certain insects and some other arthropods.",
              "entries": [
                {
                  "meaning": "A petiole; the connection between the thorax and abdomen of an insect of suborder Apocrita.",
                  "examples": []
                },
                {
                  "meaning": "The connection between the cephalothorax and abdomen of a spider.",
                  "examples": [
                    "Spiders have the body clearly divided into two pieces which are joined by a narrow stalk, the pedicel."
                  ]
                },
                {
                  "meaning": "The second segment of the antenna of an insect, between the scape and the flagellum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) The segment of an antler that attaches to the head of a cervid.",
                  "examples": [
                    "Table 5 lists 14 does with 1 or both antlers and 4 does and 1 doe fawn with incipient antler pedicels like those on male fawns."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}