{
  "word": "throat",
  "etymologies": [
    {
      "description": [
        "From Middle English throte, from Old English þrote, þrota, þrotu (“throat”), from Proto-Germanic *þrutō (“throat”), from Proto-Indo-European *trud- (“to swell, become stiff”). Cognate with Dutch strot (“throat”), German Drossel (“throttle, gorge of game (wild animals)”) (etymology 2), Icelandic þroti (“swelling”), Swedish trut."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "throat (plural throats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The front part of the neck.",
                  "examples": [
                    "The wild pitch bounced and hit the catcher in the throat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The gullet or windpipe.",
                  "examples": [
                    "As I swallowed I felt something strange in my throat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A narrow opening in a vessel.",
                  "examples": [
                    "The water leaked out from the throat of the bottle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Station throat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a chimney between the gathering, or portion of the funnel which contracts in ascending, and the flue.",
                  "examples": [
                    "By the throat of a Chimney, I mean the lower extremity of its canal, where it unites with the upper part of its open Fire-place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The upper fore corner of a boom-and-gaff sail, or of a staysail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) That end of a gaff which is next to the mast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The angle where the arm of an anchor is joined to the shank.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shipbuilding) The inside of a timber knee.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The orifice of a tubular organ; the outer end of the tube of a monopetalous corolla; the faux, or fauces.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "throat (third-person singular simple present throats, present participle throating, simple past and past participle throated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now uncommon) To utter in or with the throat.",
                  "examples": [
                    "He beat about and pecked the net until his mate was liberated, and, throating a song of gratitude, the bird he freed flew to the sky."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To take into the throat. (Compare deepthroat.)",
                  "examples": [
                    "The Roman began to throat his rigid flagpole of a mancock, making groaning noises."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect, obsolete) To mow (beans, etc.) in a direction against their bending.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}