{
  "word": "assist",
  "etymologies": [
    {
      "description": [
        "From Middle English assisten, from Old French assister (“to assist, to attend”), from Latin assistō (“stand at, bestand”, verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "assist (plural assists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A helpful action or an act of giving.",
                  "examples": [
                    "The foundation gave a much needed assist to the shelter."
                  ]
                }
              ]
            },
            {
              "group": "(sports) The act of helping another player score points or goals",
              "entries": [
                {
                  "meaning": "(soccer) A decisive pass made to the goal scorer",
                  "examples": [
                    "Özil has 16 assists in the Premier League and three goals; he has two more goals in the Champions League. On Monday, he took Bournemouth apart in the 2-0 win at the Emirates Stadium, setting up the first for Gabriel and scoring the second himself."
                  ]
                },
                {
                  "meaning": "(baseball) A defensive play, allowing a teammate to record a putout.",
                  "examples": [
                    "He had two assists in the game."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "assist (third-person singular simple present assists, present participle assisting, simple past and past participle assisted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To help.",
                  "examples": [
                    "This book will assist you in getting your life in order.",
                    "Tutor feedback assists the learning process."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) To make a pass that leads directly towards scoring.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) To help compensate for what is missing with the help of a medical technique or therapy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To stand (at a place) or to (an opinion).",
                  "examples": [
                    "A great part of the nobility assisted to his opinion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic) To be present (at an event, occasion etc.).",
                  "examples": [
                    "I assisted with pleasure at the representation of several tragedies and comedies."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}