{
  "word": "president",
  "etymologies": [
    {
      "description": [
        "From Old French president, from Latin praesidēns (“presiding over; president, leader”) (accusative: praesidentem). The Latin word is the substantivized present active participle of the verb praesideō (“preside over”). The verb is composed from prae (“before”) and sedeō (“sit”). The original meaning of the verb is 'to sit before' in the sense of presiding at a meeting. A secondary meaning of the verb is 'to command, to govern'. So praesidēns means 'the presiding one on a meeting' or 'governor, commander'."
      ],
      "adjectives": [
        {
          "description": "president (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Occupying the first rank or chief place; having the highest authority; presiding.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "president (plural presidents, feminine presidentess)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The head of state of a republic.",
                  "examples": [
                    "[…]  to change the pattern of the last 220 years of only voting for a white male president, and elect a woman president  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In presidential republics, the head of government and head of state.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Primary leader of a corporation. Not to be confused with CEO, which is a related but separate position that is sometimes held by a different person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person presiding over a meeting; a chair, presiding officer, presider.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete form of precedent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "president (third-person singular simple present presidents, present participle presidenting, simple past and past participle presidented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act as president; to do presidential duties.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}