{
  "word": "disenthrone",
  "etymologies": [
    {
      "description": [
        "dis- +‎ enthrone"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "disenthrone (third-person singular simple present disenthrones, present participle disenthroning, simple past and past participle disenthroned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove (someone) from their position as monarch; to deprive of a position of supremacy.",
                  "examples": [
                    "Synonyms: depose, dethrone, discrown, uncrown, unking, unthrone"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move (someone or something) from a desirable location or place of honour.",
                  "examples": [
                    "There were fruits of every kind; clusters of luscious grapes, quinces, pears, apples and pomegranates, long strings of figs, boxes of dates, and honey-dew melons sweeter than honey; all would be disenthroned from their lofty pantry dominions from which for months they had been tempting the yearning eyes of children, and placed before all to have and to hold until they could no more."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To remove (something) from a position of power or paramount importance.",
                  "examples": [
                    "As civilization has gradually progressed it has equalised the physical qualities of man. Instead of the strong arm it is the strong head that is now the moving principle of society. You have disenthroned Force, and placed on her high seat Intelligence  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}