{
  "word": "whiting",
  "etymologies": [
    {
      "description": [
        "white +‎ -ing"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whiting (usually uncountable, plural whitings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fine white chalk used in paints, putty, whitewash etc.",
                  "examples": [
                    "Synonym: whitening",
                    "Hyponyms: French white, Paris white, Spanish white"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "whiting",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "present participle of white",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English whityng, whytyng, perhaps an alteration of Old English hwītling (“whiting”), remodelled after white +‎ -ing (diminutive suffix). Related to the colour white. Cognate with Dutch wijting (“whiting”), Old Norse hvítingr (“a kind of whale”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whiting (plural whitings or whiting)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fish, Merlangius merlangus (family Gadidae), similar to cod, found in the North Atlantic; English whiting (US).",
                  "examples": []
                }
              ]
            },
            {
              "group": "Any fish of many species that resemble Merlangius merlangus:",
              "entries": [
                {
                  "meaning": "in family Gadidae:",
                  "examples": []
                },
                {
                  "meaning": "(US) Any of several marine fish found in North American coastal waters, including hakes (genus Merluccius), especially Merluccius bilinearis (the silver hake).",
                  "examples": []
                },
                {
                  "meaning": "(Canada) Alaska pollock (Gadus chalcogrammus, syn. Theragra chalcogramma).",
                  "examples": []
                },
                {
                  "meaning": "A blue whiting (Micromesistius poutassou), a marine fish of the Northern Hemisphere.",
                  "examples": []
                },
                {
                  "meaning": "A southern blue whiting (Micromesistius australis), a marine fish of the Southern Hemisphere.",
                  "examples": []
                },
                {
                  "meaning": "in family Sillaginidae, smelt-whitings, inhabiting Indo-Pacific marine coasts, many species of which are commercially important whitefish.",
                  "examples": []
                },
                {
                  "meaning": "in family Sciaenidae, Menticirrhus americanus (Carolina whiting, king whiting, southern kingcroaker, and southern kingfish) found along the Atlantic and Gulf Coasts of the United States.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}