{
  "word": "clerk",
  "etymologies": [
    {
      "description": [
        "From Middle English clerc, from Old English clerc, from Late Latin clēricus (“priest, clergyman, cleric”, also generally “learned man, clerk”), from Ancient Greek κληρικός (klērikós, “of the clergy”, adj. in church jargon), from κλῆρος (klêros, “lot, inheritance”, originally “shard used in casting lots”). Doublet of cleric."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clerk (plural clerks)",
          "definitionGroups": [
            {
              "group": "One who occupationally provides assistance by working with records, accounts, letters, etc.; an office worker.",
              "entries": [
                {
                  "meaning": "A salesclerk; a person who serves customers in a store or market.",
                  "examples": []
                },
                {
                  "meaning": "A law clerk.",
                  "examples": []
                },
                {
                  "meaning": "An employee at a hotel who deals with guests.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Quakerism) A facilitator of a Quaker meeting for business affairs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) In the Church of England, the layman that assists in the church service, especially in reading the responses (also called parish clerk).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A cleric or clergyman (the legal title for clergy of the Church of England is \"Clerk in Holy Orders\", still used in legal documents and cherished by some of their number).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A scholar.",
                  "examples": [
                    "And all was for an appel, an appel that he toke/As clerkès finden written in their boke."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clerk (third-person singular simple present clerks, present participle clerking, simple past and past participle clerked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act as a clerk, to perform the duties or functions of a clerk",
                  "examples": [
                    "In the winter, they lived in a town called Hoxie, Arkansas, where Evangelist Gerlash clerked in the Buttorf drugstore and preached and baptized on the side."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}