{
  "word": "commission",
  "etymologies": [
    {
      "description": [
        "From Middle English commissioun, from Old French commission, from Latin commissiō (“sending together; commission”), from prefix com- (“with”) + noun of action missiō (“sending”), from perfect passive participle missus (“sent”), from the verb mittō (“to send”) + noun of action suffix -iō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "commission (countable and uncountable, plural commissions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sending or mission (to do or accomplish something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An official charge or authority to do something, often used of military officers.",
                  "examples": [
                    "David received his commission after graduating from West Point."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The thing to be done as agent for another.",
                  "examples": [
                    "I have three commissions for the city."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A body or group of people, officially tasked with carrying out a particular function.",
                  "examples": [
                    "the European Commission",
                    "the Electoral Commission",
                    "the Federal Communications Commission",
                    "The company's sexual harassment commission made sure that every employee completed the on-line course."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fee charged by an agent or broker for carrying out a transaction.",
                  "examples": [
                    "a reseller's commission",
                    "The real-estate broker charged a four percent commission for their knowledge on bidding for commercial properties; for their intellectual perspective on making a formal offer and the strategy to obtain a mutually satisfying deal with the seller in favour of the buyer.",
                    "Hyponyms: (to a broker) brokerage, (to a shroff) shroffage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of committing (e.g. a crime or error).",
                  "examples": [
                    "the commission, preparation or instigation of an act of terrorism"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "commission (third-person singular simple present commissions, present participle commissioning, simple past and past participle commissioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send or officially charge someone or some group to do something.",
                  "examples": [
                    "James Bond was commissioned with recovering the secret documents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place an order for (often a piece of art).",
                  "examples": [
                    "He commissioned a replica of the Mona Lisa for his living room, but the painter gave up after six months."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, especially of a ship or boat) To put into active service.",
                  "examples": [
                    "The aircraft carrier was commissioned in 1944, during WWII."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}