{
  "word": "bureau",
  "etymologies": [
    {
      "description": [
        "Borrowed from French bureau, earlier \"coarse cloth (as desk cover), baize\", from Old French burel (“woolen cloth”), diminutive of *bure (compare Middle French bure (“coarse woolen cloth”), French bourre (“hair, fluff”)), from Late Latin burra (“wool, fluff, shaggy cloth, coarse fabric”); akin to Ancient Greek βερβέριον (berbérion, “shabby garment”). Doublet of burel and borrel, taken from Old French."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bureau (plural bureaus or bureaux)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An administrative unit of government; office.",
                  "examples": [
                    "Ashley Johnson is an energy, trade and economics expert at the National Bureau of Asian Research, based in the United States."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An organization or office for collecting or providing information or news.",
                  "examples": [
                    "a news bureau; a travel bureau; a service bureau; an employment bureau; the Citizens Advice Bureau"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An office (room where clerical or professional duties are performed).",
                  "examples": [
                    "There was an eerie silence in the dorm [... in] the factory. [...] The lamp glowed in his bureau, warm and reassuring and, through the window, I could see his papers strewn across the desk. [...] I called his name again. A movement from his bureau. [...] I banged on his door until it opened a crack[. ...] He pushed me out onto the staircase. \"Get out,\" he screamed. The door to his bureau slammed in my face."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) A desk, usually with a cover and compartments that are located above the level of the writing surface rather than underneath, and often used for storing papers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A chest of drawers for clothes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}