{
  "word": "commonality",
  "etymologies": [
    {
      "description": [
        "Variant form of commonalty."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "commonality (countable and uncountable, plural commonalities) #*: KLING: All four of them are located in the aft part of the left wing, right in front of the elevons, elevon actuators. And there is no commonality.CAIN: No commonality.(long pause)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The common people; the commonalty",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The joint possession of a set of attributes or characteristics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Such a shared attribute or characteristic",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telecommunications) A quality that applies to materiel or systems: (a) possessing like and interchangeable parts or characteristics enabling each to be utilized, or operated and maintained in common; (b) having interchangeable repair parts and/or components; (c) applying to consumable items interchangeably equivalent without adjustment.",
                  "examples": [
                    "KLING: FYI I've just lost four separate temperature transducers on the left side of the vehicle, hydraulic return temperatures. (pause) Two of them on system one and one in each of systems 2 and 3.CAIN: Four hyd return temps?KLING: To the left outboard and left inboard elevons.CAIN: OK, is there anything common to them, DSC or MDM or anything? I mean, you're telling me you lost them all at exactly the same time?KLING: No, not exactly. They were within probably four or five seconds of each other.CAIN: OK, where are those? Where is that instrumentation located?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}