{
  "word": "causeway",
  "etymologies": [
    {
      "description": [
        "From Middle English cauceweye, with the first element from Anglo-Norman, Old Northern French caucee or Old French caucie, cauchie (“route, highway”), from Vulgar Latin *calciāta (compare modern French chaussée from Old French chaucie, itself from the same source), either from Latin calx, calcis (“limestone”), or alternatively from Latin calciō (“to stamp with the heels, tread”), from calx (“heel”). The second element corresponds to English way."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "causeway (plural causeways)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A road that is raised so as to be above water, marshland, and similar low-lying obstacles. Originally causeways were much like dykes, generally pierced to let water through, whereas many modern causeways are more like bridges or viaducts.",
                  "examples": [
                    ". . .the passage over the water of the Luye at Stratford atte Bowe, anciently used to be in a certain place which is called the Old Forde, which is distant from the place where the bridges and causeway now are nearly one mile, at which passage many persons passing over it at divers times were drowned, and in great danger, and when after so much danger came to the knowledge of Lady Matilda, Queen of England […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "causeway (third-person singular simple present causeways, present participle causewaying, simple past and past participle causewayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To pave, to cobble.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}