{
  "word": "snape",
  "etymologies": [
    {
      "description": [
        "Origin obscure. Perhaps from snape, a dialectal variant of sneap (“to nip, bite, pinch”). More at sneap."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "snape (third-person singular simple present snapes, present participle snaping, simple past and past participle snaped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, shipbuilding) To bevel the end of a timber to fit against an inclined surface.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English snaipen (“to injure; of sleet or snow: to nip; to criticize, rebuke, revile”) [and other forms], from Old Norse sneypa (“to disgrace, dishonour; to outrage”), from Proto-Germanic *snupaną, *snubaną (“to cut; to snap”); further origin unknown. Doublet of sneap."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "snape (third-person singular simple present snapes, present participle snaping, simple past and past participle snaped) (archaic or Britain, dialectal)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To check or curtail (the growth of something); also, to check or curtail the growth of (a plant, etc.).",
                  "examples": []
                },
                {
                  "meaning": "Synonym of sneap (“to check or abruptly reprove (someone); to chide, to rebuke, to reprimand”)",
                  "examples": [
                    "The colnel (sic) I dont think like him much. I undirstand (sic) he was always snaping him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To chide, to rebuke, to reprimand.",
                  "examples": [
                    "I imagine her prodding my flab and snaping, \"There's nothing there — get rid of that!\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}