{
  "word": "traverse",
  "etymologies": [
    {
      "description": [
        "From Middle English traversen, from Old French traverser, from Latin trans (“across”) + versus (“turned”), perfect passive participle of Latin vertere (“to turn”)."
      ],
      "adjectives": [
        {
          "description": "traverse (comparative more traverse, superlative most traverse)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lying across; being in a direction across something else.",
                  "examples": [
                    "paths cut with traverse trenches"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "traverse (comparative more traverse, superlative most traverse)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "athwart; across; crosswise",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "traverse (plural traverses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) A route used in mountaineering, specifically rock climbing, in which the descent occurs by a different route than the ascent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surveying) A series of points, with angles and distances measured between, traveled around a subject, usually for use as \"control\" i.e. angular reference system for later surveying work.",
                  "examples": [
                    "At the entrance of the king, the first traverse was drawn, and the lower descent of the mountain discovered, which was the pendant of a hill to life, with divers boscages and grovets upon the steep or hanging grounds thereof."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A screen or partition.",
                  "examples": [
                    "Than sholde ye see there pressynge in a pace / Of one and other that wolde this lady see, / Whiche sat behynde a traves of sylke fyne, / Of golde of tessew the fynest that myghte be  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that thwarts or obstructs.",
                  "examples": [
                    "He will succeed, as long as there are no unlucky traverses not under his control."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A gallery or loft of communication from side to side of a church or other large building.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A formal denial of some matter of fact alleged by the opposite party in any stage of the pleadings. The technical words introducing a traverse are absque hoc (\"without this\", i.e. without what follows).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The zigzag course or courses made by a ship in passing from one place to another; a compound course.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A line lying across a figure or other lines; a transversal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) In trench warfare, a defensive trench built to prevent enfilade.",
                  "examples": [
                    "At night, when the Federal guns slowed their fire, the men created new traverses and bombproofs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A traverse board.",
                  "examples": [
                    "The whole care of the vessel rested, therefore, upon me, and I was obliged to direct her by my former experience, not being able to work a traverse."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "traverse (third-person singular simple present traverses, present participle traversing, simple past and past participle traversed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To travel across, often under difficult conditions.",
                  "examples": [
                    "He will have to traverse the mountain to get to the other side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To visit all parts of; to explore thoroughly.",
                  "examples": [
                    "to traverse all nodes in a network"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lay in a cross direction; to cross.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) To rotate a gun around a vertical axis to bear upon a military target.",
                  "examples": [
                    "to traverse a cannon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) To climb or descend a steep hill at a wide angle (relative to the slope).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering, skiing) To (make a cutting, an incline) across the gradients of a sloped face at safe rate.",
                  "examples": [
                    "the road traversed the face of the ridge as the right-of-way climbed the mountain",
                    "The last run, weary, I traversed the descents in no hurry to reach the lodge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act against; to thwart or obstruct.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pass over and view; to survey carefully.",
                  "examples": [
                    "My purpose is to  […]  traverse the nature, principles, and properties of this detestable vice—ingratitude."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(carpentry) To plane in a direction across the grain of the wood.",
                  "examples": [
                    "to traverse a board"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To deny formally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, fencing) To use the motions of opposition or counteraction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}