{
  "word": "chambers",
  "etymologies": [
    {
      "description": [
        "From chamber +‎ -s (suffix forming pluralia tantum and regular plurals of nouns, and the third-person singular simple present indicative forms of verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chambers pl (plural only)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A set of rooms in a building used as an office or a residential apartment.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension, law)",
              "entries": [
                {
                  "meaning": "Chiefly in in chambers: a judge's private office which is used for hearings that do not need to be held in open court.",
                  "examples": []
                },
                {
                  "meaning": "(Britain) Originally, a set of rooms at an Inn of Court used by one or more barristers as an office and residence; now, the office of one or more barristers in any building.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Euphemistic form of chamber pot (“a container used for defecation and urination”); also, synonym of potty (“a small (chiefly plastic) pot used by children for defecation and urination when toilet-training”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, historical) In full king's chambers: parts of the sea next to the coast of England and Wales delimited by imaginary lines connecting headlands, over which the Crown asserted exclusive jurisdiction; these have now been superseded by the concept of the territorial sea.",
                  "examples": []
                }
              ]
            }
          ]
        },
        {
          "description": "chambers",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "plural of chamber",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chambers",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "third-person singular simple present indicative form of chamber",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}