{
  "word": "meltdown",
  "etymologies": [
    {
      "description": [
        "From the verb phrase melt down."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "meltdown (countable and uncountable, plural meltdowns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Severe overheating of the core of a nuclear reactor resulting in the core melting and potentially in radiation escaping.",
                  "examples": [
                    "Four years have passed since the meltdown at the Chernobyl nuclear plant, but the grim legacy of the Soviet catastrophe is still unfolding. [1]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A situation being likened to a nuclear meltdown; a crisis.",
                  "examples": [
                    "Channel 4 switchboards went into meltdown this week when viewers called to complain about a Brass Eye programme on child sex."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) An autistic response to stress or sensory overload, in which the person is overwhelmed by intense, seemingly disproportionate emotions, behaving erratically and becoming unable to mask.",
                  "examples": [
                    "Now if I am really anxious, I can take a moment to think about what is making me anxious and what to do about it; before I would just spiral into a meltdown really quickly, with no understanding of why."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A tantrum or emotional outburst.",
                  "examples": [
                    "I had a major meltdown at work today. After being instructed one more time about additional work that I was to delegate to my direct reports, I snapped, but in a very polite manner."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}