{
  "word": "climber",
  "etymologies": [
    {
      "description": [
        "From Middle English climber, clymber, clymbare (“one who climbs, climber”), from climben (“to climb; to ascend, fly upward, rise; to slope upwards; to approach God in prayer; to advance; to overcome, triumph; to aspire; to be presumptuous”) + -er, -ere (suffix forming agent nouns). The English word is analysable as climb (verb) +‎ -er (suffix forming agent nouns)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "climber (plural climbers)",
          "definitionGroups": [
            {
              "group": "Someone or something that climbs (such as a mountain climber).",
              "entries": [
                {
                  "meaning": "(botany) A plant such as a vine that climbs upwards as it grows by attaching itself to some support.",
                  "examples": [
                    "Synonym: creeper"
                  ]
                },
                {
                  "meaning": "(cycle racing) A cyclist who specializes in riding especially well on steep hills or roads.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively, derogatory) A person who is constantly trying to get ahead socially.",
                  "examples": [
                    "Synonym: social climber"
                  ]
                },
                {
                  "meaning": "(ornithology) A bird that climbs, such as a parrot or woodpecker; specifically (archaic), a bird having two toes pointing forward, and two pointing backward, formerly regarded as being from the order Scansores or Zygodactyli (now obsolete as the birds formerly in this order have been reclassified into different orders); a zygodactyl.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something that is used for climbing.",
              "entries": [
                {
                  "meaning": "(chiefly Canada) Any structure on a playground designed to be climbed on.",
                  "examples": []
                },
                {
                  "meaning": "(climbing) Synonym of climbing iron (“a kind of crampon attached to the shoe to aid with climbing”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From climb +‎ -er (frequentative suffix); or a blend of climb +‎ clamber."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "climber (third-person singular simple present climbers, present participle climbering, simple past and past participle climbered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To ascend or mount with effort; to clamber, to climb.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}