{
  "word": "pistol",
  "etymologies": [
    {
      "description": [
        "Probably from Middle French pistole, or via  Middle English pistolet, from Middle French pistolet (“small firearm or small dagger”).\nThe origin is unclear, if via German to Romance probably  from Middle High German forms like pischulle from Czech píšťala (“firearm”, literally “tube, pipe”), from  Proto-Slavic *piščalь, from *piskati, *piščati (“to squeak, whistle”), from Proto-Balto-Slavic *pīṣk-.\nAlternatively, if from Romance to German, from or related to Italian pistolese (“short dagger”), from Italian Pistoia (“a Tuscan town noted for its gunsmithing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pistol (plural pistols)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A handgun[1570s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The mechanical component of a fuse in a bomb or torpedo responsible for firing the detonator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A creative and unpredictable jokester, a constant source of entertainment and surprises.",
                  "examples": [
                    "KENT NELSON —Until my wife Inza convinced me there was more to life. Ah, she was a real pistol, that Inza."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Southern US) A small boy who is bright, alert and very active.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) An offensive formation in which the quarterback receives the snap at a distance behind the center, but closer than in a shotgun formation, with a running back lined up behind him.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pistol (third-person singular simple present pistols, present participle pistoling, simple past and past participle pistoled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shoot (at) a target with a pistol.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}