{
  "word": "hip",
  "etymologies": [
    {
      "description": [
        "From Middle English hipe, hupe, from Old English hype, from Proto-Germanic *hupiz (compare Dutch heup, Low German Huop, German Hüfte), from Proto-Indo-European *ḱewb- (compare Welsh cysgu (“to sleep”), Latin cubāre (“to lie”), Ancient Greek κύβος (kúbos, “hollow in the hips”), Albanian sup (“shoulder”), Sanskrit शुप्ति (śúpti, “shoulder”)), from *ḱew- (“to bend”). More at high. The sense \"drug addict\" derives from addicts lying on their hips while using certain drugs such as opium."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hip (plural hips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The outward-projecting parts of the pelvis and top of the femur and the overlying tissue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The inclined external angle formed by the intersection of two sloping roof planes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a bridge truss, the place where an inclined end post meets the top chord.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, possibly dated) A drug addict, especially someone addicted to a narcotic like heroin.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hip (third-person singular simple present hips, present participle hipping, simple past and past participle hipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly sports) To use one's hips to bump into someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(wrestling) To throw (one's adversary) over one's hip (\"cross-buttock\").",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dislocate or sprain the hip of, to fracture or injure the hip bone of (a quadruped) in such a manner as to produce a permanent depression of that side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make with a hip or hips, as a roof.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English hepe, heppe, hipe, from Old English hēope, from Proto-Germanic *heupǭ (compare Dutch joop, German Hiefe, Faroese hjúpa), from Proto-Indo-European *ḱewb- (“briar, thorn”) (compare Old Prussian kaāubri (“thorn”), Lithuanian kaubrė̃ (“heap”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hip (plural hips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fruit of a rose.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unknown or disputed. Probably a variant of hep; both forms are attested from the first decade of the 20th century. Some sources suggest derivation from Wolof hepi (“to see”) or hipi (“to open one’s eyes”). Others suggest connection to the noun, as opium smokers were said to lie on a hip. Neither of these suggestions is widely accepted, however."
      ],
      "adjectives": [
        {
          "description": "hip (comparative hipper, superlative hippest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Aware, informed, up-to-date, trendy. [from early 20th c., popularized in 1960s]",
                  "examples": [
                    "Rudolph promoted Stevens Pass with restless zeal. In seven years there, he helped turn a relatively small, roadside ski area into a hip destination."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hip (third-person singular simple present hips, present participle hipping, simple past and past participle hipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To inform, to make knowledgeable.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}