{
  "word": "proposition",
  "etymologies": [
    {
      "description": [
        "From Middle English proposicioun, from Old French proposicion, from Latin prōpositiō, from the verb prōponō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "proposition (countable and uncountable, plural propositions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act of offering (an idea) for consideration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An idea or a plan offered.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, business settings) The terms of a transaction offered.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, politics) In some states, a proposed statute or constitutional amendment to be voted on by the electorate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A complete sentence.",
                  "examples": [
                    "Our English nouns remain unchanged, whether they form the subject or the object of a proposition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "English Wikipedia has an article on:PropositionWikipedia  (countable, logic) The content of an assertion that may be taken as being true or false and is considered abstractly without reference to the linguistic sentence that constitutes the assertion; (Aristotelian logic) a predicate of a subject that is denied or affirmed and connected by a copula.",
                  "examples": [
                    "“‘Wiktionary is a good dictionary’ is a proposition” is a proposition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, mathematics) An assertion so formulated that it can be considered true or false.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, mathematics) An assertion which is provably true, but not important enough to be called a theorem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A statement of religious doctrine; an article of faith; creed.",
                  "examples": [
                    "the propositions of Wyclif and Huss"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic) The part of a poem in which the author states the subject or matter of it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of preposition.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "proposition (third-person singular simple present propositions, present participle propositioning, simple past and past participle propositioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To make a suggestion of sexual intercourse to (someone with whom one is not sexually involved).",
                  "examples": [
                    "Synonyms: pass, come on, hit on"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To make an offer or suggestion to (someone).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}