{
  "word": "kingly",
  "etymologies": [
    {
      "description": [
        "From Middle English kyngly, from Old English *cyninglīċ (“kingly, royal”), equivalent to king +‎ -ly. Cognate with Dutch koninklijk (“kingly, royal”), German königlich (“kingly”), Swedish kunglig (“kingly”). Compare also Old English cynelīċ (“kingly, royal, public”)."
      ],
      "adjectives": [
        {
          "description": "kingly (comparative kinglier, superlative kingliest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Of or belonging to a king or kings; exercised by a king.",
                  "examples": [
                    "But in Sparta, which was called a kingly government, though the people were perfectly free, yet because the administration was in the two kings and the ephori, with the assistance of the senate, we read of no impeachments by the people;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic of kings, majestic, regal; as befits a king, in the manner of a king.",
                  "examples": [
                    "For then she sets foorth the liberty of his mind, the high flying of his thoughts, the fitnesse in him to beare rule, the singular loue the subiects bare him; that it was doubtful, whether his wit were greater in winning their fauours, or his courage in imploying their fauours: that he was not borne to liue a subiect-life, each action of his bearing in it Maiestie, such a kingly entertainement, such a kingly magnificence, such a kingly heart for enterprises: especially remembring those vertues, which in successor are no more honored by the subiects, then suspected of the Princes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English kyngly, from Old English *cyninglīċe (“kingly, royally”), equivalent to king +‎ -ly. Compare Old English cynelīċe (“kingly, royally, publicly”)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "kingly (comparative more kingly, superlative most kingly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a royal manner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}