{
  "word": "study",
  "etymologies": [
    {
      "description": [
        "From Middle English studien, from Old French estudier (Modern French étudier) from Medieval Latin studiāre and Latin studēre, from Proto-Indo-European *(s)tewd- (“to push, hit”). Displaced native Old English cneordlæcan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "study (third-person singular simple present studies, present participle studying, simple past and past participle studied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually academic) To review materials already learned in order to make sure one does not forget them, usually in preparation for an examination.",
                  "examples": [
                    "Students are expected to start studying for final exams in March.",
                    "I need to study my biology notes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(academic) To take a course or courses on a subject.",
                  "examples": [
                    "I study medicine at the university."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To acquire knowledge on a subject with the intention of applying it in practice.",
                  "examples": [
                    "Biologists study living things.",
                    "In 2015, scientists found that 82 percent of glaciers studied in China had decreased in size."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To look at minutely.",
                  "examples": [
                    "He studied the map in preparation for the hike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fix the mind closely upon a subject; to dwell upon anything in thought; to muse; to ponder.",
                  "examples": [
                    "I found a moral first, and studied for a fable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To endeavor diligently; to be zealous.",
                  "examples": [
                    "And that ye study to be quiet, and to do your own business, and to work with your own hands, as we commanded you  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English studie, from Old French estudie (Modern French étude), from Latin studium (“zeal, dedication, study”), from Proto-Indo-European *(s)tewd- (“to push, hit”). Doublet of studio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "study (countable and uncountable, plural studies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mental effort to acquire knowledge or learning.",
                  "examples": [
                    "The study of languages is fascinating."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of studying or examining; examination.",
                  "examples": [
                    "I made a careful study of his sister."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any particular branch of learning that is studied; any object of attentive consideration.",
                  "examples": [
                    "The Holy Scriptures, especially the New Testament, are her daily study."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A room in a house intended for reading and writing; traditionally the private room of the male head of household.",
                  "examples": [
                    "Father spends all his time in the study poring over manuscripts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artwork made in order to practise or demonstrate a subject or technique.",
                  "examples": [
                    "a study of heads or of hands for a figure picture"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The human face, bearing an expression which the observer finds amusingly typical of a particular emotion or state of mind.",
                  "examples": [
                    "Geoffrey's face was a study.",
                    "Geoffrey's face was a study in amazement [or in bewilderment, irritation, distress etc.]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A piece for special practice; an étude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(academic) An academic publication.",
                  "examples": [
                    "That new study on noncommutative symmetries looks promising."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who commits a theatrical part to memory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) An endgame problem composed for artistic merit, where one side is to play for a win or for a draw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A state of mental perplexity or worried thought.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Thought, as directed to a specific purpose; one's concern.",
                  "examples": [
                    "My study was to avoid disturbing her."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}