{
  "word": "author",
  "etymologies": [
    {
      "description": [
        "From Middle English auctour, from Anglo-Norman autour, from Old French autor, from Latin auctor, from augeō (“to increase, originate”). The h, also found in Middle French autheur, is unetymological as there is no h in the original Latin spelling. The OED attributes the h to contamination by authentic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "author (plural authors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The originator or creator of a work, especially of a literary composition.",
                  "examples": [
                    "The copyright of any original writing belongs initially and properly to its author."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who writes books for a living.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, criminal law) Principal; the primary participant in a crime.",
                  "examples": [
                    "We hear  […] of fratricidal murders, and stern reprisals on their authors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One's authority for something: an informant.",
                  "examples": [
                    "Let me inform you en passant, Ladies, that those Villains the Heathens, as my Authors tell me, (and I thought it wou'd[sic] not be amiss to communicate such a nice Observation to this House) used to call our Saviour Chrestus, and not Christus, by way of Contempt and Derision  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "author (third-person singular simple present authors, present participle authoring, simple past and past participle authored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, sometimes proscribed) To create a work as its author.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}