{
  "word": "concession",
  "etymologies": [
    {
      "description": [
        "From late Middle English concession, from Middle French concession, from Latin concessiō (“a grant, permission, conceding”), from concēdō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "concession (usually uncountable, plural concessions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of conceding.",
                  "examples": [
                    "Any parsone, prest or clerk, havyng any benefice... by wey of presentation, donation, concession, collation or institution."
                  ]
                }
              ]
            },
            {
              "group": "An act of conceding, particularly:",
              "entries": [
                {
                  "meaning": "A compromise: a partial yielding to demands or requests.",
                  "examples": [
                    "But these concessions failed, as I believe concessions to evil always do fail."
                  ]
                },
                {
                  "meaning": "Land granted by an authority for some specific purpose, particularly:",
                  "examples": [
                    "The French Concession in Shanghai"
                  ]
                },
                {
                  "meaning": "(historical) A portion of a township, especially equal lots once granted to settlers in Canada.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A territory—usually an enclave in a major port—yielded to the administration of a foreign power.",
                  "examples": [
                    "The French Concession in Shanghai"
                  ]
                },
                {
                  "meaning": "(Canada) A concession road: a narrow road between tracts of farmland, especially in Ontario, from their origin during the granting of concessions (see above).",
                  "examples": []
                },
                {
                  "meaning": "(chiefly US) The premises granted to a business as a concession (see below)",
                  "examples": []
                },
                {
                  "meaning": "A privilege granted by an authority, especially to conduct business on favorable terms within certain conditions and particularly:",
                  "examples": []
                },
                {
                  "meaning": "A right to use land or an offshore area for a specific purpose, such as oil exploration.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly US) A right to operate a quasi-independent franchise of a larger company.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly US) A right to operate a quasi-independent business within another's premises, as with concession stands.",
                  "examples": []
                },
                {
                  "meaning": "A preferential tax rate.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly UK) A discounted price offered to certain classes of people, such as students or the elderly.",
                  "examples": []
                },
                {
                  "meaning": "(rhetoric) An admission of the validity of an opponent's point in order to build an argument upon it or to move on to another of greater importance; an instance of this.",
                  "examples": [
                    "Synonym: concessio"
                  ]
                },
                {
                  "meaning": "(by extension) Any admission of the validity or rightness of a point; an instance of this.",
                  "examples": []
                },
                {
                  "meaning": "(originally US) An admission of defeat following an election.",
                  "examples": [
                    "Just moments ago, I spoke with George W. Bush and congratulated him on becoming the 43rd president of the United States. And I promised him that I wouldn't call him back this time... tonight, for the sake of our unity as a people and the strength of our democracy, I offer my concession."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gift freely given or act freely made as a token of respect or to curry favor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) A franchise: a business operated as a concession (see above).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, usually in the plural) An item sold within a concession (see above) or from a concessions stand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK) A person eligible for a concession price (see above).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "concession (third-person singular simple present concessions, present participle concessioning, simple past and past participle concessioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To grant or approve by means of a concession agreement.",
                  "examples": [
                    "[A] consultant was contracted for one year to prepare the legal and administrative framework for concessioning selected roads to the private sector and is expected to complete the framework in July 2005."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}