{
  "word": "proletariat",
  "etymologies": [
    {
      "description": [
        "From French prolétariat (“proletariats as a class; state of being a proletariat”), from Latin prōlētārius (“belonging to the lowest class of citizens, whose only contribution to the state was their offspring; member of this class”) + French -at (suffix denoting actions or the results of actions). Prōlētārius is derived from prōlēs (“offspring, posterity”) + -ārius (suffix forming adjectives from nouns, or forming nouns denoting agents of use from other nouns); prōlēs is from pro- (prefix meaning ‘bringing forth or into being; bringing into the open’) + *olēs (a variant of *oleō (“to grow”), ultimately from Proto-Indo-European *h₂el- (“to grow, nourish”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "proletariat (plural proletariats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often derogatory, also figuratively) The lowest class of society; also, the lower classes of society generally; the masses.",
                  "examples": [
                    "Synonym: proletary"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Marxism) Wage earners collectively, excluding salaried workers; people who own no capital and depend on their labour for survival; the working class, especially when seen as engaged in a class struggle with the bourgeoisie (“the capital-owning class”).",
                  "examples": [
                    "Synonyms: proletarian, proletary, prole",
                    "Antonym: bourgeoisie",
                    "Coordinate term: salariat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Ancient Rome, historical) The lowest class of citizens, who had no property and few rights, and were regarded as contributing only their offspring to the state.",
                  "examples": [
                    "Synonyms: proletarian, proletary"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}