{
  "word": "tenth",
  "etymologies": [
    {
      "description": [
        "From Middle English tenth, tenthe. Old English had tēoþa (origin of Modern English tithe), but the force of analogy to the cardinal number \"ten\" caused Middle English speakers to recreate the regular ordinal and re-insert the nasal consonant. Ultimately from Proto-Germanic *tehundô. Equivalent to ten (numeral) +‎ -th (suffix forming ordinals)."
      ],
      "adjectives": [
        {
          "description": "tenth (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ordinal numeral form of ten; next in order after that which is ninth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being one of ten equal parts of a whole.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tenth (plural tenths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The person or thing coming next after the ninth in a series; that which is in the tenth position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of ten equal parts of a whole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The interval between any tone and the tone represented on the tenth degree of the staff above it, as between one of the scale and three of the octave above; the octave of the third.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, law, historical, in the plural) A temporary aid issuing out of personal property, and granted to the king by Parliament; formerly, the real tenth part of all the movables belonging to the subject.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tenth (third-person singular simple present tenths, present participle tenthing, simple past and past participle tenthed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To divide by ten, into tenths.",
                  "examples": [
                    "A regular cistern may be inched or tenthed by the rule given for inching or tenthing the back, copper, or cooler, which inching or tenthing should be entered in a table book for use."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}