{
  "word": "institution",
  "etymologies": [
    {
      "description": [
        "From Middle English institucioun, from Old French institution, from Latin institūtiō, from instituō (“to set up”), from in- (“in, on”) + statuō (“to set up, establish”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "institution (countable and uncountable, plural institutions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A custom or practice of a society or community.",
                  "examples": [
                    "The institution of marriage is present in many cultures but its details vary widely across them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A  long established and respected organization, particularly one involved with education, public service, or charity work.",
                  "examples": [
                    "The University of the South Pacific is the only internationally accredited institution of higher education in Oceania."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The building or buildings which house such an organization.",
                  "examples": [
                    "He's been in an institution since the crash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, by shortening) A mental institution.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Any long established and respected place or business.",
                  "examples": [
                    "Over time, the local pub has become something of an institution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A person long established in a place, position, or field.",
                  "examples": [
                    "She's not just any old scholar; she is an institution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of instituting something.",
                  "examples": [
                    "The institution of higher speed limits was a popular move but increased the severity of crashes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The act by which a bishop commits a cure of souls to a priest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which institutes or instructs, particularly a textbook or system of elements or rules.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}