{
  "word": "degradation",
  "etymologies": [
    {
      "description": [
        "From French dégradation. Morphologically degrade +‎ -ation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "degradation (countable and uncountable, plural degradations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of reducing in rank, character, or reputation, or of abasing; a lowering from one's standing or rank in office or society",
                  "examples": [
                    "This feature of good organization, the conferring of definite local superior rank, and the protection of the incumbent from unnecessary degradation, was discovered centuries ago by another effective institution, the Catholic church."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being reduced in rank, character, or reputation; baseness; moral, physical, or intellectual degeneracy; disgrace; abasement; debasement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Diminution or reduction of strength, efficacy, or value; degeneration; deterioration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A gradual wearing down or wasting, as of rocks and banks, by the action of water, frost etc.",
                  "examples": [
                    "Overexploitation of land for fuelwood is a further cause of soil degradation in Africa, Asia and South America"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deleterious change in the chemical structure, physical properties or appearance of a material from natural or artificial exposure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or condition of a species or group which exhibits degraded forms; degeneration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Arrest of development, or degeneration of any organ, or of the body as a whole.",
                  "examples": [
                    "muscle degradation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The gradual breakdown of components of a material, as a result of a natural element, i.e.: heat, cold and wind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}