{
  "word": "twin",
  "etymologies": [
    {
      "description": [
        "From Middle English twinne, twynne, from Old English ġetwin, ġetwinn (“twin, multiple”, noun) and twinn (“twin, two-fold, double, two by two”, adjective), from Proto-Germanic *twinjaz, *twinaz (“two each”), from Proto-Indo-European *dwino- (“twin”), from *dwóh₁ (“two”). Cognate with Scots twyn (“twin”), Dutch tweeling (“twin”), German Zwilling (“twin”), Swedish tvilling (“twin”), Faroese tvinnur (“a double set”), Icelandic tvenna (“duo, pair”), Lithuanian dvynys (“twin”), Russian двойня (dvojnja, “twin”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "twin (plural twins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Either of two people (or, less commonly, animals) who shared the same uterus at the same time; one who was born at the same birth as a sibling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Either of two similar or closely related objects, entities etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A room in a hotel, guesthouse, etc. with two beds; a twin room.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A twin size mattress or a bed designed for such a mattress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A two-engine aircraft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(crystallography) A twin crystal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "twin (third-person singular simple present twins, present participle twinning, simple past and past participle twinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete outside Scotland) To separate, divide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete outside Scotland) To split, part; to go away, depart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the passive) To join, unite; to form links between (now especially of two places in different countries); to pair with.",
                  "examples": [
                    "Reading, the English town, is twinned with Clonmel in Ireland.",
                    "Coventry twinned with Dresden as an act of peace and reconciliation, both cities having been heavily bombed during the war."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To give birth to twins.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be, or be like, a twin to (someone else); to match in some way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be, or be like, a pair of twins (for example, to dress identically); to be paired or suited.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English *twin, *twyn, from Old English twin, twinn (“twin; double”, adjective), from Proto-Germanic *twīhnaz (“occurring in a pair; twofold; double”), from Proto-Indo-European *dwóh₁ (“two”). Cognate with Icelandic tvennur (“double”), Gothic 𐍄𐍅𐌴𐌹𐌷𐌽𐌰𐌹 (tweihnai, “two each”)."
      ],
      "adjectives": [
        {
          "description": "twin (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Double; dual; occurring as a matching pair.",
                  "examples": [
                    "twin beds, twin socks"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Forming a pair of twins.",
                  "examples": [
                    "the twin boys"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}