{
  "word": "trimmer",
  "etymologies": [
    {
      "description": [
        "From trim +‎ -er."
      ],
      "adjectives": [
        {
          "description": "trimmer",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "comparative form of trim: more trim",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "trimmer (plural trimmers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who trims, arranges, fits, or ornaments.",
                  "examples": [
                    "It put me to endless expense of having roof-men, gutter-men and tree-trimmers. At last I gave the grim order, “Cut her down.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device used to trim.",
                  "examples": [
                    "My new electric shaver has a beard trimmer attachment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A member of the crew who trims the sails.",
                  "examples": [
                    "Synonym: sail trimmer",
                    "Hyponyms: wing trimmer, headsail trimmer, mainsheet trimmer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who fluctuates between opposing factions, political parties etc., according to current interest, a flip-flopper.",
                  "examples": [
                    "Thus Halifax was a Trimmer on principle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A beam into which are framed the ends of headers in floor framing, as when a hole is to be left for stairs, or to avoid bringing joists near chimneys.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shipping, historical) A person employed to rearrange the coal in the hold of a vessel, so that it fills the vessel without forming a conical blockage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining, historical) A device for storing coal in gradually increasing piles made by building up at the point of the cone or top of the prism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A float bearing a baited hook and line, used in fishing for pike.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) One who or that which trims, or rebukes or reproves; a scold.",
                  "examples": [
                    "Mr. Hazeldean wrote him such a trimmer that it could not but produce an unconciliatory reply."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}