{
  "word": "walk",
  "etymologies": [
    {
      "description": [
        "From Middle English walken (“to move, roll, turn, revolve, toss”), from Old English wealcan (“to move round, revolve, roll, turn, toss”), ġewealcan (“to go, traverse”); and Middle English walkien (“to roll, stamp, walk, wallow”), from Old English wealcian (“to curl, roll up”); both from Proto-Germanic *walkaną, *walkōną (“to twist, turn, roll about, full”), from Proto-Indo-European *walg- (“to twist, turn, move”). Cognate with Scots walk (“to walk”), Saterland Frisian walkje (“to full; drum; flex; mill”), West Frisian swalkje (“to wander, roam”), Dutch walken (“to full, work hair or felt”), Dutch zwalken (“to wander about”), German walken (“to flex, full, mill, drum”), Danish valke (“to waulk, full”), Latin valgus (“bandy-legged, bow-legged”), Sanskrit वल्गति (valgati, “amble, bound, leap, dance”). More at vagrant and whelk. Doublet of waulk."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "walk (third-person singular simple present walks, present participle walking, simple past and past participle walked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move on the feet by alternately setting each foot (or pair or group of feet, in the case of animals with four or more feet) forward, with at least one foot on the ground at all times. Compare run.",
                  "examples": [
                    "To walk briskly for an hour every day is to keep fit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial, law) To \"walk free\", i.e. to win, or avoid, a criminal court case, particularly when actually guilty.",
                  "examples": [
                    "If you can’t present a better case, that robber is going to walk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial, euphemistic) Of an object, to go missing or be stolen.",
                  "examples": [
                    "If you leave your wallet lying around, it’s going to walk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cricket, of a batsman) To walk off the field, as if given out, after the fielding side appeals and before the umpire has ruled; done as a matter of sportsmanship when the batsman believes he is out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To travel (a distance) by walking.",
                  "examples": [
                    "I walk two miles to school every day.",
                    "The museum’s not far from here – you can walk it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take for a walk or accompany on a walk.",
                  "examples": [
                    "I walk the dog every morning.",
                    "Will you walk me home?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To allow a batter to reach base by pitching four balls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move something by shifting between two positions, as if it were walking.",
                  "examples": [
                    "I carefully walked the ladder along the wall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To full; to beat cloth to give it the consistency of felt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To traverse by walking (or analogous gradual movement).",
                  "examples": [
                    "I walked the streets aimlessly.",
                    "Debugging this computer program involved walking the heap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, aviation) To operate the left and right throttles of (an aircraft) in alternation.",
                  "examples": [
                    "Still keeping his tail in the air, Red coaxed the “Airknocker” ahead and as we grasped his struts he slowly retarded the throttle. We walked the plane between two tiedown blocks and not until we had tied the struts did Red cut the switch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial) To leave, resign.",
                  "examples": [
                    "If we don't offer him more money he'll walk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To push (a vehicle) alongside oneself as one walks.",
                  "examples": [
                    "The county had a successful defense only because the judge kept telling the jury at every chance that the cyclist should have walked his bicycle like a pedestrian."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To behave; to pursue a course of life; to conduct oneself.",
                  "examples": [
                    "We walk perversely with God, and he will walk crookedly toward us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be stirring; to be abroad; to go restlessly about; said of things or persons expected to remain quiet, such as a sleeping person, or the spirit of a dead person.",
                  "examples": [
                    "I heard a pen walking in the chimney behind the cloth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be in motion; to act; to move.",
                  "examples": [
                    "Do you think I'd walk in any plot?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, historical) To put, keep, or train (a puppy) in a walk, or training area for dogfighting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal, hotel) To move a guest to another hotel if their confirmed reservation is not available on day of check-in.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English walk, walke, walc, from Old English *wealc (as in Old English wealcspinl) and ġewealc (“a rolling motion, attack”), from Proto-Germanic *walką. Cognate with Icelandic válk (“a rolling around, a tossing to and fro, trouble, distress”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "walk (plural walks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trip made by walking.",
                  "examples": [
                    "I take a walk every morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distance walked.",
                  "examples": [
                    "It’s a long walk from my house to the library."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) An Olympic Games track event requiring that the heel of the leading foot touch the ground before the toe of the trailing foot leaves the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A manner of walking; a person's style of walking.",
                  "examples": [
                    "The Ministry of Silly Walks is underfunded this year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A path, sidewalk/pavement or other maintained place on which to walk.",
                  "examples": [
                    "Coordinate term: trail"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A person's conduct or course in life.",
                  "examples": [
                    "Men like Stuart who had no desire to extol Coleridge's virtues, and other witnesses quite as hostile, to whom a moral dereliction could hardly be a mortal offence, were loud in praise of the purity of his walk in life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) A situation where all players fold to the big blind, as their first action (instead of calling or raising), once they get their cards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) An award of first base to a batter following four balls being thrown by the pitcher; known in the rules as a \"base on balls\".",
                  "examples": [
                    "The pitcher now has two walks in this inning alone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In coffee, coconut, and other plantations, the space between them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Caribbean, Belize, Guyana, Jamaica) An area of an estate planted with fruit-bearing trees.",
                  "examples": [
                    "Twenty Acres of Land well kept in a Plantain Walk, will afford a very considerable Support, as Plantains are as hearty a Food as Eddoes, and the Plantain Walk may be a Nursery for declining Slaves, as well as to fatten old Cattle when they are past Labour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A place for keeping and training puppies for dogfighting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An enclosed area in which a gamecock is confined to prepare him for fighting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A sequence of alternating vertices and edges, where each edge's endpoints are the preceding and following vertices in the sequence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Something very easily accomplished; a walk in the park.",
                  "examples": [
                    "And for the strongroom itself, he can tell us where to find the combination of the day. We had allowed four hours, Joe, but with this help, once you get us inside, it's a walk! I've been timing it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, finance, slang, dated) A cheque drawn on a bank that was not a member of the London Clearing and whose sort code was allocated on a one-off basis; they had to be \"walked\" (hand-delivered by messengers).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}