{
  "word": "simp",
  "etymologies": [
    {
      "description": [
        "1903. Clipping of simpleton."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "simp (plural simps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A simple person lacking common sense; a fool or simpleton.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, by extension) Someone who is not worthy of respect.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "1980s (American rap culture). Unknown. Possibly from a special use of simpleton (above); a clipping of simper; a respelled clipping of sympathetic; or a blend of sissy +‎ pimp."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "simp (plural simps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A man who foolishly overvalues and defers to a woman, putting her on a pedestal.",
                  "examples": [
                    "Until you are sure that this girl has a genuine interest and might be compatible, no dates or gifts. Why should you be the one who feeds every straggler in your town? It's time to break away from these byzantine patterns of square behavior. It's time right now to break away from all those years of bad programming. You're a simp because your family made you that way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, by extension) Someone who foolishly overvalues someone else and defers to them, putting them on a pedestal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An advocate for an ideology or cause.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "simp (third-person singular simple present simps, present participle simping, simple past and past participle simped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, of a man) To be especially deferential to and emotionally vulnerable with a woman, often with the intent of receiving sexual gratification.",
                  "examples": [
                    "Dudes wanna talk down on other dudes when they start simping like they're feminine or something when in fact the majority of all dudes and even those motherfuckers saying that shit be simping too."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, by extension) To obsequiously praise or admire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, by extension) To reminisce melancholically; to recall once fond memories now tinged with sadness, especially regarding a former lover.",
                  "examples": [
                    "the dick can't be that good honey stop simping over that boy"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of simplified."
      ],
      "adjectives": [
        {
          "description": "simp (comparative more simp, superlative most simp)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Abbreviation of simplified.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}