{
  "word": "utter",
  "etymologies": [
    {
      "description": [
        "From Middle English utter, from out (adjective) and Old English ūtera, comparative of ūt (“out”). Compare outer."
      ],
      "adjectives": [
        {
          "description": "utter (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now poetic, literary) Outer; furthest out, most remote. [from 10th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Outward. [13th–16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Absolute, unconditional, total, complete. [from 15th c.]",
                  "examples": [
                    "utter ruin; utter darkness"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English utter, partly from utter (adjective, adverb), partly from Middle Dutch uteren."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "utter (third-person singular simple present utters, present participle uttering, simple past and past participle uttered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To produce (speech or other sounds) with one's voice.",
                  "examples": [
                    "Synonyms: let out, say, speak",
                    "Don't you utter another word!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reveal or express (an idea, thought, desire, etc.) with speech.",
                  "examples": [
                    "Synonyms: declare, say, tell"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To produce (a noise) (of an inanimate object).",
                  "examples": [
                    "Synonyms: emit, let out",
                    "Sally's car uttered a hideous shriek when she applied the brakes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To spit or blow (something) out of one's mouth.",
                  "examples": [
                    "Four little winged marble boys used to play their virgin fancies, spouting out ever fresh streams from their innocent-wanton lips, in the square of Lincoln’s-inn  […]  Are the stiff-wigged living figures, that still flitter and chatter about that area, less gothic in appearance? or, is the splutter of their hot rhetoric one half so refreshing and innocent, as the little cool playful streams those exploded cherubs uttered?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To emit or give off (breath).",
                  "examples": [
                    "[…]  now the King forsakes",
                    "The Campe, he must maintaine luxurious mouthes,",
                    "Such as can vtter perfum’d breath,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To shed (a tear or tears).",
                  "examples": [
                    "[…]  a mythological matron, in a classical helmet, uttering a tear at a rustic cross bound in blue and white ribbons and inscribed TO THE FALLEN—1912,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To offer (something) for sale; to sell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To put (currency) into circulation.",
                  "examples": [
                    "Synonym: circulate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To show (something that has been hidden); to reveal the identity of (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To send or put (something) out.",
                  "examples": [
                    "As fier beyng enclosed in a strayte place, wil by force vtter his flamme  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To commit the crime of uttering (knowingly presenting forged documentation).",
                  "examples": [
                    "A man named Edward Agar was convicted in October 1855 of uttering a forged cheque, and sentenced to be transported for life."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}