{
  "word": "haunch",
  "etymologies": [
    {
      "description": [
        "From Middle English haunche, hanche, from Old French hanche, hance, anche (compare French hanche, Italian anca), from a Germanic source, probably Frankish *hanka, from Proto-Germanic *ankijǭ (“joint; ankle”), from Proto-Indo-European *ang- (“joint; lith”). Cognate with Old High German ancha, encha, einka (“the leg; joint, bend”) (compare Old High German anchila, enchila (“ankle”), German Hanke (“haunch”), West Frisian hancke (“haunch”). More at ankle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "haunch (plural haunches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The area encompassing the upper thigh, hip and buttocks on one side of a human, primate, or quadruped animal, especially one that can sit on its hindquarters.",
                  "examples": [
                    "While Heracles, - the thews and cordage of his thighsStraitened and strained beyond the utmost stretchFrom quivering heel to haunch like sweating hawsers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The loin and leg of a quadruped, especially when used as food.",
                  "examples": [
                    "On the rough-hewn oaken table the venison haunch was shared."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A squat vertical support structure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) A jerked underhand throw.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "haunch (third-person singular simple present haunches, present participle haunching, simple past and past participle haunched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, architecture) To provide with a haunch or supporting structure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dialect) To throw with an underhand movement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}