{
  "word": "toggle",
  "etymologies": [
    {
      "description": [
        "Of uncertain origin. Possible alteration of tug (“to pull”) +‎ -le"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "toggle (plural toggles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A wooden or metal pin, short rod, crosspiece or similar, fixed transversely in the eye of a rope or chain to be secured to any other loop, ring, or bight, e.g. a sea painter to a lifeboat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in particular, fashion) A rod-shaped button bound with slack to the fabric.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A toggle switch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An appliance for transmitting force at right angles to its direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A horizontal piece of wood that is placed on a door, flat, or other wooden structure, but is not on one of the edges of the structure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fastener that has flaps that align vertically to penetrate a surface and then spread out to secure the fastener in position, e.g. a molly bolt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(skydiving) A loop of webbing or a dowel affixed to the end of the steering/brake lines of a parachute providing the pilot with a means of control.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "toggle (third-person singular simple present toggles, present participle toggling, simple past and past participle toggled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To alternate between two positions using a single switch or lever.",
                  "examples": [
                    "Clicking a button will alternately toggle its light on OR off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To switch between alternate states.",
                  "examples": [
                    "toggle to lower/upper case",
                    "You can quickly toggle the case of selected text by pressing Alt+C."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive) To fix like a toggle iron; to fix fast.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}