{
  "word": "diet",
  "etymologies": [
    {
      "description": [
        "From Middle English diet, dyet, diete, from Old French diete, from Medieval Latin dieta (“regimen, regulation; assembly”), from Latin diaeta, from Ancient Greek δίαιτα (díaita)."
      ],
      "adjectives": [
        {
          "description": "diet (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a food or beverage) Containing less fat, salt, sugar, or calories than normal, or claimed to have such.",
                  "examples": [
                    "diet soda"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, figurative) Having certain traits subtracted.",
                  "examples": [
                    "Synonym: lite",
                    "You folks reduce it to the bible only as being authoritative, impoverishing the faith. \"Christianity Lite\", diet Christianity for those who can't handle the Whole Meal."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "diet (plural diets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The food and beverage a person or animal consumes.",
                  "examples": [
                    "The diet of the giant panda consists mainly of bamboo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A controlled regimen of food and drink, as to gain or lose weight or otherwise influence health.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any habitual intake or consumption.",
                  "examples": [
                    "He's been reading a steady diet of nonfiction for the last several years."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English dieten, dyeten, diȝeten, from Old French dïeter and Medieval Latin diētāre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "diet (third-person singular simple present diets, present participle dieting, simple past and past participle dieted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To regulate the food of (someone); to put on a diet.",
                  "examples": [
                    "they will diet themselves, feed and live alone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To modify one's food and beverage intake so as to decrease or increase body weight or influence health.",
                  "examples": [
                    "I've been dieting for six months, and have lost some weight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To eat; to take one's meals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To cause to take food; to feed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English diet, dyet, from Old French diete, from Medieval Latin diēta, diaeta (“a public assembly; set day of trial; a day's journey”), from Ancient Greek δῐ́αιτα (díaita, “way of living, living space; decision, judgement”), influenced by Latin diēs (“day”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "diet (plural diets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually capitalized as a proper noun) A council or assembly of leaders; a formal deliberative assembly.",
                  "examples": [
                    "They were given representation of some important diet committees.",
                    "The National Diet of Japan"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A session of exams",
                  "examples": [
                    "Normally the diet begins towards the end of April."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, law) The proceedings under a criminal libel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A clerical or ecclesiastical function in Scotland.",
                  "examples": [
                    "a diet of worship"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}