{
  "word": "elevation",
  "etymologies": [
    {
      "description": [
        "From Old French elevation, from Latin elevatio, equal to elevate +‎ -ion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "elevation (countable and uncountable, plural elevations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of raising from a lower place, condition, or quality to a higher; said of material things, persons, the mind, the voice, etc.",
                  "examples": [
                    "the elevation of grain; elevation to a throne; elevation to sainthood; elevation of mind, thoughts, or character"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The condition of being or feeling elevated; heightened; exaltation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is raised up or elevated; an elevated place or station.",
                  "examples": [
                    "A hill is an elevation of the ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) The distance of a celestial object above the horizon, or the arc of a vertical circle intercepted between it and the horizon; altitude.",
                  "examples": [
                    "the elevation of the pole, or of a star"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The measured vertical distance from the peak of a mountain or hill to its bordering lowlands.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The angle which the gnomon makes with the substylar line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The movement of the axis of a piece in a vertical plane; also, the angle of elevation, that is, the angle between the axis of the piece and the line of sight; distinguished from direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A geometrical projection of a building, or other object, on a plane perpendicular to the horizon; orthographic projection on a vertical plane; called by the ancients the orthography.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, chiefly Roman Catholicism) The raising of the host—representing Christ’s body—in a mass or Holy Communion service.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}