{
  "word": "child",
  "etymologies": [
    {
      "description": [
        "From Middle English child, from Old English ċild, from Proto-West Germanic *kilþ, *kelþ, from Proto-Germanic *kelþaz (“womb; fetus”), from Proto-Indo-European *ǵelt- (“womb”).",
        "Cognate with Danish kuld (“brood, litter”), Swedish kull (“brood, litter”), Icelandic kelta, kjalta (“lap”), Gothic 𐌺𐌹𐌻𐌸𐌴𐌹 (kilþei, “womb”), Sanskrit जर्त (jarta), जर्तु (jártu, “vulva”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "child (plural children or (dialectal or archaic) childer)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(broadly) A person who has not yet reached adulthood, whether natural (puberty), cultural (initiation), or legal (majority).",
              "entries": [
                {
                  "meaning": "(pediatrics, sometimes, in a stricter sense) A kid aged 1 to 11 years, whereas neonates are aged 0 to 1 month, infants are aged 1 month to 12 months, and adolescents are aged 12 years to 18 years.",
                  "examples": [
                    "Regular chores can be appropriate for both children and adolescents, given age-appropriate limits on difficulty level and time on task.",
                    "Hypernym: kid",
                    "Coordinate terms: newborn, neonate, infant, adolescent, teenager, teen"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with possessive) One's direct descendant by birth, regardless of age; one's offspring; a son or daughter.",
                  "examples": [
                    "My youngest child is forty-three this year.",
                    "His adult children visit him yearly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) The thirteenth Lenormand card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(figurative) A figurative offspring, particularly:",
              "entries": [
                {
                  "meaning": "A person considered a product of a place or culture, a member of a tribe or culture, regardless of age.",
                  "examples": [
                    "The children of Israel.",
                    "He is a child of his times."
                  ]
                },
                {
                  "meaning": "Anything derived from or caused by something.",
                  "examples": []
                },
                {
                  "meaning": "(computing) A data item, process, or object which has a subservient or derivative role relative to another.",
                  "examples": [
                    "The child node then stores the actual data of the parent node."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of childe (“youth of noble birth”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A subordinate node of a tree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, specifically) A female child, a girl.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English childen, from the noun child."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "child (third-person singular simple present childs, present participle childing, simple past and past participle childed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive, intransitive) To give birth; to beget or procreate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}