{
  "word": "bicameral",
  "etymologies": [
    {
      "description": [
        "From bi- +‎ Latin camera (“chamber”)  +‎ -al."
      ],
      "adjectives": [
        {
          "description": "bicameral (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being or having a system with two, often unequal, chambers or compartments; of, signifying, relating to, or being the product of such a two-chambered system.",
                  "examples": [
                    "the bicameral anatomy of the brain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(government) Of, having, or relating to two separate legislative chambers or houses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) Of a script or typeface: having two cases, upper case and lower case.",
                  "examples": [
                    "Aspect values on bicameral fonts are based on the size of the lowercase characters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mentality) Relating to the functions of the two cerebral hemispheres in the history of human beings ‘hearing’ the speech of gods or idols, according to Julian Jaynes's theory of the bicameral mind.",
                  "examples": [
                    "[The Linear B Tablets] were written directly in what I am calling the bicameral period. p.80;",
                    "…to have an idea of the nature and range of the bicameral voices heard in the early civilizations. p.88;",
                    "…how could [the brain] have been organized so that a bicameral mentality was possible? p.101;",
                    "Like the queen in a termite nest or a beehive, the idols of a bicameral world are the carefully tended centers of social control, with auditory hallucinations instead of pheromones. p.144;",
                    "…wherever and whenever civilization first began…there was a succession of kingdoms all with similar characteristics that, somewhat prematurely, I shall call bicameral. p.149;",
                    "Bicameral gods [of conquering civilizations] are jealous gods. p.156, footnote;",
                    "…I suggest that given man, language, and cities organized on a bicameral basis, there are only certain fixed patterns into which history can fit. p.159.",
                    "How can we know that…idols ‘spoke’ in the bicameral sense? p.174."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}