{
  "word": "giddy",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Middle English gidi, gedy, gydy (“demonically controlled or possessed; crazy, insane; foolish, idiotic, ridiculous, unwise; unsure; (rare) dizzy, shaky; (rare) of an animal: crazed, out of control; a fool”) [and other forms], from Old English gidiġ, gydiġ (“possessed by a demon or spirit, insane, mad”), from Proto-West Germanic *gudīg (“ghostly, spirited”, literally “possessed by a god or spirit”), from *god (“god”) (ultimately from Proto-Indo-European *ǵʰew- (“to pour”), possibly in the sense of a libation made to a deity) + *-ig, *-g (suffix forming adjectives with the senses of being, doing, or having). The English word is analysable as god +‎ -y (suffix meaning ‘having the quality of’, forming adjectives).",
        "The noun and the verb are derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "giddy (comparative giddier, superlative giddiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Feeling a sense of spinning in the head, causing a perception of unsteadiness and being about to fall down; dizzy.",
                  "examples": [
                    "Synonyms: fuzzy, fuzzy-headed, fuzzy-minded, light-headed, rattleheaded, (Scotland) shoogly, vertiginate, (Britain, dialectal) westy, woozy",
                    "The man became giddy upon standing up so fast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Causing or likely to cause dizziness or a feeling of unsteadiness.",
                  "examples": [
                    "Synonym: vertiginous",
                    "They climbed to a giddy height."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moving around something or spinning rapidly.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "Unable to concentrate or think seriously; easily excited; impulsive; also, lightheartedly silly; frivolous.",
                  "examples": [
                    "Synonyms: (obsolete) brainsick, changeable, (informal) feather-headed, flighty, (obsolete) giglot, inconsistent, light-headed, (dated) overlight"
                  ]
                },
                {
                  "meaning": "(dated) Used as an intensifier.",
                  "examples": []
                },
                {
                  "meaning": "Joyfully elated; overcome with excitement or happiness.",
                  "examples": [
                    "The boy was giddy when he opened his birthday presents."
                  ]
                },
                {
                  "meaning": "(Britain, dialectal) Feeling great anger; furious, raging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialectal, agriculture, veterinary medicine) Of an animal, chiefly a sheep: affected by gid (“a disease caused by parasitic infestation of the brain by tapeworm larvae”), which may result in the animal turning around aimlessly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, figuratively) Of a thing, especially a ship: unsteady, as if dizzy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "giddy (plural giddies) (archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone or something that is frivolous or impulsive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, agriculture, veterinary medicine) Synonym of gid (“a disease caused by parasitic infestation of the brain by tapeworm larvae”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "giddy (third-person singular simple present giddies, present participle giddying, simple past and past participle giddied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (someone or something) dizzy or unsteady; to dizzy.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To become dizzy or unsteady.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To move around something or spin rapidly; to reel; to whirl.",
                  "examples": [
                    "Synonym: vertiginate"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}