{
  "word": "survey",
  "etymologies": [
    {
      "description": [
        "From Middle English surveyen, from Old French sourveoir, surveer (“to oversee”), from sour-, sur- (“over”) + veoir, veeir (“to see”), from Latin videre. See sur- and vision."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "survey (plural surveys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of surveying; a general view.",
                  "examples": [
                    "Under his proud survey the city lies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular view; an examination, especially an official examination, of a particular group of items, in order to ascertain the condition, quantity, or quality.",
                  "examples": [
                    "A survey of the stores of a ship; a survey of roads and bridges; a survey of buildings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The operation of finding the contour, dimensions, position, or other particulars of any part of the Earth's surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A measured plan and description of any portion of country.",
                  "examples": [
                    "The owners of the adjoining plots had conflicting surveys."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An examination of the opinions of a group of people.",
                  "examples": [
                    "The local council conducted a survey of its residents to help it decide whether to go ahead with the roadside waste collection service."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A questionnaire or similar instrument used for examining the opinions of a group of people.",
                  "examples": [
                    "I just filled out that survey on roadside waste pick-up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An auction at which a farm is let for a lease for lives.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A district for the collection of customs under a particular officer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "survey (third-person singular simple present surveys, present participle surveying, simple past and past participle surveyed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To inspect, or take a view of; to view with attention, as from a high place; to overlook",
                  "examples": [
                    "He stood on a hill, and surveyed the surrounding country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To view with a scrutinizing eye; to examine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To examine with reference to condition, situation, value, etc.; to examine and ascertain the state of",
                  "examples": [
                    "It was his job to survey buildings in order to determine their value and risks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To determine the form, extent, position, etc., of, as a tract of land, a coast, harbor, or the like, by means of linear and angular measurements, and the application of the principles of geometry and trigonometry",
                  "examples": [
                    "to survey land or a coast"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To examine and ascertain, as the boundaries and royalties of a manor, the tenure of the tenants, and the rent and value of the same.",
                  "examples": [
                    "all the Tenants Leases and Copies are surveyed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To investigate the opinions, experiences, etc., of people by asking them questions; to conduct a survey; to administer a questionnaire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}