{
  "word": "rehearse",
  "etymologies": [
    {
      "description": [
        "From Middle English rehersen, from Anglo-Norman reherser (“to repeat word-for-word”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rehearse (third-person singular simple present rehearses, present participle rehearsing, simple past and past participle rehearsed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To repeat, as what has been already said; to tell over again; to recite.",
                  "examples": [
                    "There’s no need to rehearse the same old argument; we’ve heard it before, and we all agree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To narrate; to relate; to tell.",
                  "examples": [
                    "The witness rehearsed the events of the night before for the listening detectives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To practise by recitation or repetition in private for experiment and improvement, prior to a public representation, especially in theater",
                  "examples": [
                    "In sober mornings, do not thou reherse",
                    "The holy incantation of a verse ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, theater) To cause to rehearse; to instruct by rehearsal.",
                  "examples": [
                    "The director rehearsed the cast incessantly in the days leading up to opening night, and as a result they were tired and cranky when it arrived."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To contrive and carefully prepare (a story, etc.) to offer consistency.",
                  "examples": [
                    "The Crown argued that the accused had rehearsed her story."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}