{
  "word": "cunning",
  "etymologies": [
    {
      "description": [
        "From Middle English cunning, kunning, konnyng, alteration of earlier Middle English cunninde, kunnende, cunnand, from Old English cunnende, present participle of cunnan (“to know how to, be able to”), equivalent to con +‎ -ing. Cognate with Scots cunnand (“cunning”), German könnend (“able to do”), Icelandic kunnandi (“cunning”). More at con, can."
      ],
      "adjectives": [
        {
          "description": "cunning (comparative more cunning, superlative most cunning)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sly; crafty; clever in surreptitious behaviour.",
                  "examples": [
                    "Synonyms: see Thesaurus:wily"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Skillful, artful.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Wrought with, or exhibiting, skill or ingenuity; ingenious.",
                  "examples": [
                    "cunning work"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial, dated, New England) Cute, appealing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English cunning, kunnyng, partially from Old English *cunning (verbal noun), from Old English cunnan (“to know how to, be able to”); partially from Old English cunnung (“knowledge, trial, probation, experience, contact, carnal knowledge”), from cunnian (“to search into, try, test, seek for, explore, investigate, experience, have experience of, to make trial of, know”), equivalent to con +‎ -ing."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cunning (countable and uncountable, plural cunnings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Practical knowledge or experience; aptitude in performance; skill, proficiency; dexterity.",
                  "examples": [
                    "indeed at this very moment he's slipped away with the utmost cunning into a form that's most perplexing to investigate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Practical skill employed in a secret or crafty manner; craft; artifice; skillful deceit; art or magic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The disposition to employ one's skill in an artful manner; craftiness; guile; artifice; skill of being cunning, sly, conniving, or deceitful.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The natural wit or instincts of an animal.",
                  "examples": [
                    "the cunning of the fox or hare"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Knowledge; learning; special knowledge (sometimes implying occult or magical knowledge).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}