{
  "word": "sustain",
  "etymologies": [
    {
      "description": [
        "From Middle English susteinen, sustenen, from Old French sustenir (French soutenir), from Latin sustineō, sustinēre (“to uphold”), from sub- (“from below, up”) + teneō (“hold”, verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sustain (plural sustains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A mechanism which can be used to hold a note, as the right pedal on a piano.",
                  "examples": [
                    "To call this music bland is to ignore the down-the-drain vocal fade-aways, the extended sax sustains  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sustain (third-person singular simple present sustains, present participle sustaining, simple past and past participle sustained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To maintain, or keep in existence.",
                  "examples": [
                    "The professor had trouble sustaining students’ interest until the end of her lectures.",
                    "The city came under sustained attack by enemy forces.",
                    "Sam managed to sustain his erection for two straight hours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide for or nourish.",
                  "examples": [
                    "provisions to sustain an army"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To encourage or sanction (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To experience or suffer (an injury, etc.).",
                  "examples": [
                    "The building sustained major damage in the earthquake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To confirm, prove, or corroborate; to uphold.",
                  "examples": [
                    "to sustain a charge, an accusation, or a proposition"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, of a judge) To allow, accept, or admit (e.g. an objection or motion) as valid.",
                  "examples": [
                    "Antonym: overrule"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To keep from falling; to bear; to uphold; to support.",
                  "examples": [
                    "A foundation sustains the superstructure; an animal sustains a load; a rope sustains a weight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To aid, comfort, or relieve; to vindicate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}