{
  "word": "clarion",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English clarion, clarioun (“trumpet with a narrow tube and a shrill sound, clarion; clarion player”) [and other forms], from Old French claron, clarïon (“clarion”) [and other forms], from Medieval Latin clāriōn, clario, clārōn (“clarion; trumpet”), from Latin clārus (“audible; clear, distinct, loud; (visually) bright, clear”), ultimately from Proto-Indo-European *kelh₁- (“to call, summon; to cry”).",
        "The adjective is from an attributive use of the noun."
      ],
      "adjectives": [
        {
          "description": "clarion (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a sound, a voice, a message, etc.: brilliantly clear.",
                  "examples": [
                    "her clarion top notes"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "clarion (plural clarions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, historical or poetic) A medieval brass instrument chiefly used as a battle signal; related to the trumpet, it had a narrow, straight pipe and a high-pitched, piercing sound.",
                  "examples": [
                    "The clarion’s call to action has been heard."
                  ]
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(poetic) The sound of a clarion (sense 1), or any sound resembling the loud, high-pitched note of a clarion.",
                  "examples": []
                },
                {
                  "meaning": "(music) An organ stop consisting of pipes with reeds giving a high-pitched note like that of a clarion (sense 1).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A charge thought to represent a type of wind instrument, a keyboard instrument like a spinet, or perhaps a rest used by a knight to support a lance during jousting.",
                  "examples": [
                    "Synonyms: clarichord, clavicord, rest, sufflue"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English clariounen (“of a horn or trumpet: to blow, sound”), from clarioun (noun) (see etymology 1) + -en (suffix forming the infinitives of verbs). Later uses may also be derived directly from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "clarion (third-person singular simple present clarions, present participle clarioning, simple past and past participle clarioned) (rare)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To announce or herald (something) using a clarion (noun sense 1).",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To announce or herald (something) clearly, especially so as to stir or unite people.",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) Of a thing: to cause (a place) to echo with a sound like that of a clarion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To sound a clarion; also, to make a high-pitched, piercing sound like that of a clarion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}