{
  "word": "washing",
  "etymologies": [
    {
      "description": [
        "From Middle English waschynge, weschynge, from Old English *weasċing, *wæsċing (attested in weasċingweġ), from Proto-West Germanic *waskingu, equivalent to wash +‎ -ing. Cognate with Saterland Frisian Waaskenge (“washing”), West Frisian wasking (“washing”), Dutch wassing (“washing”), German Waschung (“washing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "washing (countable and uncountable, plural washings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The action of the verb to wash",
                  "examples": [
                    "I then took a piece of dry stone, ground it fine in a mortar, and placed the powder in water, the sand particles sunk rapidly to the bottom, while the clay remained suspended, and by several washings and decantings the sand and clay could be approximately separated  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, chiefly Britain, New Zealand, Australia) Clothing, bedlinen or soft furnishings that have been, are currently being, or are to be washed; laundry.",
                  "examples": [
                    "My mother used to do the washing on a Monday"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, often in the plural) The residue after an ore, etc, has been washed",
                  "examples": [
                    "The washings have a higher concentration of metal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The liquid used to wash an ore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where a precious metal found in gravel is separated from lighter material by washing.",
                  "examples": [
                    "the gold-washings, or silver-washings"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin covering or coat.",
                  "examples": [
                    "a washing of silver"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(stock exchange) A fraudulent transaction in which the same stock is simultaneously bought and sold for the purpose of manipulating the market.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pottery) The covering of a piece with an infusible powder, which prevents it from sticking to its supports, while receiving the glaze.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English waschyng, wasschynge, wasschinge, wesschinge, wassende, from Old English *wasċende, *wæsċende, from Proto-West Germanic *waskandī, from Proto-Germanic *waskandz (“washing”), present participle of Proto-Germanic *waskaną (“to wash”), equivalent to wash +‎ -ing. Cognate with Dutch wassend, German waschend, Swedish vaskande."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "washing",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "present participle of wash",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}