{
  "word": "cataphract",
  "etymologies": [
    {
      "description": [
        "From Latin cataphractes (“suit of armour”), from Ancient Greek κατάφρακτος (katáphraktos, “suit of armour”), from κατα- (kata-, prefix indicating a great degree or intensity) + φρακτός (phraktós, “protected; fenced in”) (from φράσσω (phrássō, “to fortify, secure; to fence in”)) + -της (-tēs, suffix forming nouns indicating a state of being)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cataphract (plural cataphracts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) Defensive armour covering the entire body of a soldier and often the soldier's horse as well, especially the linked mail or scale armour of some eastern nations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ichthyology, by extension, obsolete) An outer covering of some fish resembling armour or plate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The adjective is derived from Ancient Greek κατάφρακτος (katáphraktos, “covered, enclosed, shut up; completely suited in armour”), from καταφράσσειν (kataphrássein, “to suit in armour”) (see further at etymology 1) + -τος (-tos, “suffix forming adjectives”).",
        "The noun is derived from Latin cataphractus (“wearing armour, mailed”), from Ancient Greek κατάφρακτος (katáphraktos, “covered, enclosed, shut up; completely suited in armour”); see above."
      ],
      "adjectives": [
        {
          "description": "cataphract",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, historical) Of a galley such as a trireme: with the upper tier of rowers shielded rather than exposed.",
                  "examples": [
                    "Antonym: aphract"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cataphract (plural cataphracts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) A soldier (especially a horseman) covered with a cataphract (etymology 1, sense 1).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}