{
  "word": "ram",
  "etymologies": [
    {
      "description": [
        "From Middle English ram, rom, ramme, from Old English ramm (“ram”), from Proto-Germanic *rammaz (“ram”), possibly from *rammaz (“strong”). Cognate with Saterland Frisian Rom (“ram”), Dutch ram (“a male sheep”), German Ramm, Ramme (“ram”). Possibly akin also to Danish ram (“sharp; acrid; rank”), Swedish ram (“strong; perfect”), Faroese ramur (“strong; competent”), Icelandic rammur (“strong; sturdy”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ram (plural rams)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, agriculture) A male sheep, typically uncastrated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A battering ram; a heavy object used for breaking through doors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, nautical, chiefly historical) A warship intended to sink other ships by ramming them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, nautical, chiefly historical) A reinforced section of the bow of a warship, intended to be used for ramming other ships.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piston powered by hydraulic pressure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of ramming.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A weight which strikes a blow, in a ramming device such as a pile driver, steam hammer, or stamp mill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English rammen, from the noun (see above). Compare Old High German rammen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "ram (third-person singular simple present rams, present participle ramming, simple past and past participle rammed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To collide with (an object), usually with the intention of damaging it or disabling its function.",
                  "examples": [
                    "The man, driving an SUV, then rammed the gate, according to police.",
                    "Two snatch thieves who snatched a woman's bag experienced swift karma when their victim accidentally rammed into their motorcycle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike (something) hard, especially with an implement.",
                  "examples": [
                    "To build a sturdy fence, you have to ram the posts deep into the ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seat a cartridge, projectile, or propellant charge in the breech of a firearm by pushing or striking.",
                  "examples": [
                    "After placing the cartridge in the musket, ram it down securely with the ramrod."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill or compact by pounding or driving.",
                  "examples": [
                    "rammed earth walls"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To thrust during sexual intercourse.",
                  "examples": [
                    "like feel a soft butt against their pelvis or ram a girl really hard with piston-like speed while she begs and screams for more"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Likely from Old Norse ramr, rammr (“strong, rank, bitter”), from Proto-Germanic *rammaz (“strong, overbearing; acrid, rank”), perhaps ultimately related to Etymology 1 above. Compare Scots ram (“a rank odour”). Compare also Middle English rammish (“rank, offensive in smell”)."
      ],
      "adjectives": [
        {
          "description": "ram (comparative more ram, superlative most ram)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England) Rancid; offensive in smell or taste.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}