{
  "word": "spindrift",
  "etymologies": [
    {
      "description": [
        "Borrowed from Scots spindrift; further etymology uncertain. The Oxford English Dictionary suggests it is a variant of spoondrift (archaic), apparently due to the pronunciation of this word in southwestern Scotland, which is derived from spoon +‎ drift (“mass of matter driven or forced onward together in a body, etc., especially by wind or water”); spoon is a variant of spoom (“to sail briskly with the wind astern, with or without sails hoisted”). However, this is doubted by the Scottish National Dictionary because spoondrift is attested later than spindrift and it seems unlikely that the Scots spelling would have superseded the English one, and because the early use of the Scots word in the form spenedrift by James Melville (1556–1614) is unlikely to have derived from spoondrift.",
        "The word was popularized in English from the late 19th century by its use in the novels of the Scottish-born author William Black (1841–1898): see, for example, the 1878 quotation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spindrift (countable and uncountable, plural spindrifts) (originally Scotland)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Sea spray (clouds of water droplets) blown from the tops of waves by the wind and whipped along the surface of the sea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Clouds of sand, snow, etc., whipped along the ground by the wind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}