{
  "word": "underlive",
  "etymologies": [
    {
      "description": [
        "From under- +‎ live."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "underlive (third-person singular simple present underlives, present participle underliving, simple past and past participle underlived)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To live under; live beneath (something); to fail to live up to (something).",
                  "examples": [
                    "Such a Man looks upon Fame, not as a Reward of his present Virtue, but as an Earnest he has given of his future Performances; and is ashamed to underlive the Credit he has won, and not outshine his past illustrious Actions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fail to reach (a certain age).",
                  "examples": [
                    "In the course of a few generations we shall have cultivated a vitality which would give us invariably at birth, an expectancy of 130 years, which age would be usual and except for unavoidable accident would never be underlived, but generally exceeded."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To live on fewer resources than (someone).",
                  "examples": [
                    "Many of that class who live in the country, and have farms, by their industry and frugal way of living, grow rich, for they can underlive the Britons, &c."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To live on insufficient resources.",
                  "examples": [
                    "Whole groups of underpaid workers may in consequence of underliving sink into such a condition of inefficiency and hopelessness that they are altogether powerless to extricate themselves from it by their own efforts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To live in an overcautious or unfulfilling manner.",
                  "examples": [
                    "“Making plans based on professional advice can help you avoid overspending or underliving,” said Cottee. “An advisor will support you in making decisions based on fact, not fear, and ensure you have access to all the strategies you need to live an enjoyable and rewarding life in retirement.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}