{
  "word": "shower",
  "etymologies": [
    {
      "description": [
        "From Middle English shour, from Old English scūr, from Proto-West Germanic *skūru, from Proto-Germanic *skūrō, probably from Proto-Indo-European *(s)ḱēwer- (“north; north wind; cold wind; rain shower”). Cognate with Dutch schoer, German Schauer, Norwegian skur."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shower (plural showers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief fall of precipitation (spell of rain, or a similar fall of snow, sleet, or cascade).",
                  "examples": [
                    "Today there will be frequent showers and some sunny spells."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for bathing by which water is made to fall on the body from a height, either from a tank or by the action of a pump.",
                  "examples": [
                    "Synonym: shower bath"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of using of this device in order to bathe oneself.",
                  "examples": [
                    "I′m going to have a shower. (UK, Australia)",
                    "I′m going to take a shower. (especially US)",
                    "Synonym: shower bath"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quantity of something that has characteristics of a rain shower.",
                  "examples": [
                    "a shower of sparks;  a meteor shower;  a Gatorade shower"
                  ]
                }
              ]
            },
            {
              "group": "A party associated with a significant event in a person's life, at which the person usually receives gifts.",
              "entries": [
                {
                  "meaning": "A bridal shower.",
                  "examples": [
                    "The shower will be held at the home of the bridesmaid."
                  ]
                },
                {
                  "meaning": "A baby shower.",
                  "examples": [
                    "Her friends are throwing her a shower after her mom leaves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling)  A pattern where the juggler passes objects horizontally from one hand to the other around chest height, and upward over the juggler's head to return to the first hand.",
                  "examples": [
                    "See also  shower (juggling) on  Wikipedia.Wikipedia"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A battle, an attack; conflict.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Ireland, UK, Australia, derogatory) A shower of shit.",
                  "examples": [
                    "You all behaved like a shower, now you are to be treated like a shower"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Ireland, euphemistic, derogatory, with of and an invective) Used as an intensifying pluralizer or intensifier",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shower (third-person singular simple present showers, present participle showering, simple past and past participle showered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(followed by with) To spray with (a specified liquid).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bathe using a shower.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bestow liberally, to give or distribute in abundance.",
                  "examples": [
                    "The individual in the army becomes used to holding human life in contempt, in fact the greater the slaughter, the greater is his merit; and the more medals, ribbons, and honors of hero-worship are showered on him, the more he becomes, after a time, indifferent to all sorts of human suffering and loss of human life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rain in a shower; to cascade down.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From show +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shower (plural showers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who shows.",
                  "examples": [
                    "When you show a credential there's a protocol whereby the showee has assurance that the shower possesses a credential of the particular type without actually seeing the bit string."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object or activity that is shown in a contest.",
                  "examples": [
                    "That calf is going to be a great shower at the fair this year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A man whose penis is close to its full (erect) size when flaccid, or the penis itself. [from 1990s]",
                  "examples": [
                    "Antonym: grower"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}