{
  "word": "authority",
  "etymologies": [
    {
      "description": [
        "From Middle English auctorite, autorite (“authority, book or quotation that settles an argument”), from Old French auctorité, from Latin stem of auctōritās (“invention, advice, opinion, influence, command”), from auctor (“master, leader, author”). For the presence of the h, compare the etymology of author."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "authority (countable and uncountable, plural authorities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Power or right to make or enforce rules or give orders; or a position having such power or right.",
                  "examples": [
                    "Synonyms: command, rulership, sovereignty",
                    "I have the authority to penalise the staff in my department, but not the authority to sack them.",
                    "Vigilantes may have the power to nab criminals, but they lack the authority.",
                    "She lost all respect and authority after turning up drunk at the meeting.",
                    "Respect my authority!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plural) Persons, regarded collectively, who occupy official positions of power; police or law enforcement.",
                  "examples": [
                    "Authorities say the suspect fled on foot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A reliable, definitive source of information on a subject.",
                  "examples": [
                    "the world's foremost authority on orangutans",
                    "My cheap dictionary is not the authority on word derivations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Status as a trustworthy source of information, reputation for mastery or expertise; or claim to such status or reputation.",
                  "examples": [
                    "Synonyms: cred, gravitas",
                    "Some thinkers regard appealing to authority as a logical fallacy; others regard it as a legitimate form of argument."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Official permission; authorisation to act in some capacity on behalf of a ruling entity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A government-owned agency that runs a revenue-generating activity for public benefit.",
                  "examples": [
                    "New York Port Authority",
                    "Chicago Transit Authority"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}