{
  "word": "macaroni",
  "etymologies": [
    {
      "description": [
        "From Italian maccaroni, obsolete variant of maccheroni (“macaroni”), plural of maccherone. This is of unknown origin, possibly from maccare (“bruise, batter, crush”), which itself is of unknown origin, or from late Ancient Greek μακαρία (makaría, “food made from barley”).\nCompare Sicilian maccarruni (“a single piece of macaroni”)."
      ],
      "adjectives": [
        {
          "description": "macaroni (comparative more macaroni, superlative most macaroni)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Chic, fashionable, stylish; in the manner of a macaroni.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "macaroni (countable and uncountable, plural macaronis or macaronies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A type of pasta in the form of short tubes; sometimes loosely, pasta in general. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, historical) A fop, a dandy; especially a young man in the 18th century who had travelled in Europe and who dressed and often spoke in an ostentatiously affected Continental manner. [from 17th c.]",
                  "examples": [
                    "'Sure never were seen two such beautiful Ponies;",
                    "Other Horses are Clowns—and these macaronies"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French macaron. Doublet of macaron."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "macaroni (plural macaronis)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A macaroon.",
                  "examples": [
                    "1777,  Charlotte Mason,  The lady's assistant for regulating and supplying her table: being a complete system of cookery, containing one hundred and fifty select bills of fare, properly disposed for family dinners ... with upwards of fifty bills of fare for suppers ... and several desserts: including likewise, the fullest and choicest receipts of various kinds ... (cooking), pages 436:Macaroni. It comes from Italy. It is a biscuit made of almonds, eggs, flower, and sugar."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}