{
  "word": "reticence",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Middle French réticence (“act of keeping silent, silence; reserve; aposiopesis”) (modern French réticence (“tight-lippedness, reticence”)), or derived from its etymon Latin reticentia (“act of keeping silent, silence; aposiopesis”), from reticēns (“keeping silent, reticent, silent; keeping secret, concealing”) + -ia (suffix forming feminine abstract nouns). Reticēns is the present active participle of reticeō (“to keep silent; to keep secret, conceal”), from re- (prefix meaning ‘again’) + taceō (“to be silent, keep quiet”) (possibly ultimately from Proto-Indo-European *tak- or *tHk-). The English word is cognate with Italian reticenza (“reticence”), Portuguese reticência, Spanish reticencia (“reticence; reluctance”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reticence (countable and uncountable, plural reticences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, also figuratively) Avoidance of saying or reluctance to say too much; discretion, tight-lippedness; (countable) an instance of acting in this manner.",
                  "examples": [
                    "Synonyms: reserve, taciturnity"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A silent and reserved nature.",
                  "examples": [
                    "Synonyms: introversion, reservation; see also Thesaurus:shyness",
                    "Antonyms: ostentation; see also Thesaurus:talkativeness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Followed by of: discretion or restraint in the use of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, proscribed) Often followed by to: hesitancy or reluctance (to do something).",
                  "examples": [
                    "Synonyms: disinclination, hesitation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, rhetoric, obsolete) Synonym of aposiopesis (“an abrupt breaking-off in speech”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "reticence (third-person singular simple present reticences, present participle reticencing, simple past and past participle reticenced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To deliberately not listen or pay attention to; to disregard, to ignore.",
                  "examples": [
                    "Synonym: pass over"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}