{
  "word": "circus",
  "etymologies": [
    {
      "description": [
        "From Latin circus (“ring, circle”), from Proto-Indo-European *(s)ker-, *ker- (“to turn, to bend”). Doublet of cirque. Displaced native Old English hringsetl (literally “ring seat”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "circus (plural circuses or circusses or circi)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A traveling company of performers that may include acrobats, clowns, trained animals, and other novelty acts, that gives shows usually in a circular tent. [from late 18th c.]",
                  "examples": [
                    "The circus will be in town next week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A round open space in a town or city where multiple streets meet.",
                  "examples": [
                    "Oxford Circus in London is at the north end of Regent Street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A spectacle; a noisy fuss; a chaotic and/or crowded place.",
                  "examples": [
                    "The village would be turned into a circus over this. He groaned, it was just the sort of case the media had a field day over. He had to get the whole thing sorted fast before anyone got wind of it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) In the ancient Roman Empire, a building for chariot racing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, World War II) A code name for bomber attacks with fighter escorts in the day time. The attacks were against short-range targets with the intention of occupying enemy fighters and keeping their fighter units in the area concerned.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Circuit; space; enclosure.",
                  "examples": [
                    "The narrow circus of my dungeon wall."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "circus (third-person singular simple present circuses or circusses, present participle circusing or circussing, simple past and past participle circused or circussed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take part in a circus; or to be displayed as if in a circus",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}