{
  "word": "waiter",
  "etymologies": [
    {
      "description": [
        "Late 14th century, \"attendant, watchman,\" agent noun from the verb wait +‎ -er. Sense of \"servant who waits at tables\" is from late 15th century, originally in reference to household servants; in reference to inns, eating houses, etc., it is attested from 1660s. Feminine form waitress first recorded 1834.",
        "The London Stock Exchange sense harks back to the early days of trading in coffee-shops."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waiter (plural waiters, feminine waitress)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male or female attendant who serves customers at their tables in a restaurant, café or similar.",
                  "examples": [
                    "Waiter! There's a fly in my soup."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who waits for somebody or something; a person who is waiting.",
                  "examples": [
                    "However, the NTPF also contained implicit negative incentives for the public sector by offering alternative private sector treatment for the longest waiters at no extra cost to patients or no penalty to public providers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A person working as an attendant at the London Stock Exchange.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A vessel or tray on which something is carried, as dishes, etc.; a salver. (See etymology of dumbwaiter.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A custom house officer; a tide waiter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A watchman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "waiter (third-person singular simple present waiters, present participle waitering, simple past and past participle waitered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(stative) To work as a waiter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}