{
  "word": "gang",
  "etymologies": [
    {
      "description": [
        "From Middle English gangen, from Old English gangan (“to go, walk, turn out”), from Proto-Germanic *ganganą (“to go, walk”), from Proto-Indo-European *ǵʰengʰ- (“to step, walk”).",
        "Cognate with Scots gang (“to go on foot, walk”), Swedish gånga (“to walk, go”), Faroese ganga (“to walk”), Icelandic ganga (“to walk, go”), Vedic Sanskrit जंहस् (jáṃhas). Ultimately: related to etym. 2, see below."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "gang (third-person singular simple present gangs, present participle ganging, simple past and past participle ganged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Northern England, Scotland) To go; walk; proceed.",
                  "examples": [
                    "(Colin alone) Ah, Colin, thou’rt a prodigal; a thriftless loon thou’st been, that cou’d na’ keep a little pelf to thysall when thou had’st got it; now thou may’st gang in this poor geer to thy live's end, and worse too for aught I can tell; ’faith, mon, ’twas a smeart little bysack of money thou hadst scrap’d together, an the best part of it had na’ being last amongst thy kinsfolk, in the Isles of Skey and Mull; muckle gude may it do the weams of them that ha’ it! There was Jamie MacGregor and Sawney MacNab, and the twa braw lads of Kinruddin, with old Charley MacDougall, my mother's first husband's second cousin: by my sol I cou’d na’ see such near relations, and gentlemen of sich auncient families gang upon bare feet, while I rode a horseback: I had been na’ true Scot, an I cou’d na’ ge’en a countryman a gude last upon occasion (as he is going out, Miss Aubrey enters.)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gang, from Old English gang (“a journey; way; passage”), from Proto-West Germanic *gang, from Proto-Germanic *gangaz, from Proto-Indo-European *ǵʰongʰ-o-s, from *ǵʰengʰ- (“to step; stride”).",
        "Cognate with Saterland Frisian Gong, Dutch gang, German Gang, Norwegian gang, Swedish gång, Icelandic gangur, Vedic Sanskrit जंहस् (jáṃhas)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gang (plural gangs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number going in company; a number of friends or persons associated for a particular purpose.",
                  "examples": [
                    "the Gashouse Gang",
                    "The gang from our office is going out for drinks Friday night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of laborers under one foreman; a squad.",
                  "examples": [
                    "a gang of sailors; a railroad gang; a labor gang or pool."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A criminal group with a common cultural background and identifying features, often associated with a particular section of a city.",
                  "examples": [
                    "a youth gang; a neighborhood gang; motorcycle gang."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of criminals or alleged criminals who band together for mutual protection and profit.",
                  "examples": [
                    "The Winter Hill Gang was quite proficient at murdering rival mobsters in order to take over their rackets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of politicians united in furtherance of a political goal.",
                  "examples": [
                    "The Gang of Four was led by Jiang Qing, the fourth wife of Mao Zedong.",
                    "Not all members of the Gang of Six are consistent in their opposition to filibuster."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A chain gang.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A combination of similar tools or implements arranged so as, by acting together, to save time or labor; a set.",
                  "examples": [
                    "a gang of saws; a gang of plows; a gang drill; gang milling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set; all required for an outfit.",
                  "examples": [
                    "a new gang of stays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrics) A number of switches or other electrical devices wired into one unit and covered by one faceplate.",
                  "examples": [
                    "an outlet gang box; a double gang switch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrics) A group of wires attached as a bundle.",
                  "examples": [
                    "a gang of wires",
                    "Do a drop for the telephone gang, then another drop for the Internet gang, both through the ceiling of the wiring closet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) A going, journey; a course, path, track.",
                  "examples": [
                    "In unploughed Maine he sought the lumberers’ gang / Where from a hundred lakes young rivers sprang"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An outhouse: an outbuilding used as a lavatory.",
                  "examples": [
                    "Þaða he to gange com."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gang (third-person singular simple present gangs, present participle ganging, simple past and past participle ganged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attach similar items together to form a larger unit.",
                  "examples": [
                    "Volume controls may be ganged to mode switches to provide maximum output  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See gan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "gang",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pronunciation spelling of gan.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening of gangbang."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "gang (third-person singular simple present gangs, present participle ganging, simple past and past participle ganged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of gangbang: to have sex with a single partner as a gang.",
                  "examples": [
                    "[…]  there's a thin line to tread to avoid fights or getting “ganged” when rejecting the sexual overtures of incarcerated women."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gang (countable and uncountable, plural gangs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) Alternative form of gangue",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}