{
  "word": "righteous",
  "etymologies": [
    {
      "description": [
        "From earlier rightuous, rightwose, rightwos, rightwise, from Middle English rightwise, rightwis, from Old English rihtwīs (“righteous, just”), corresponding to right +‎ -wise (with assimilation of second element to -ous), or to right +‎ wise (“way, manner”). Cognate with Scots richtwis (“righteous”), Old High German rehtwīsic (“righteous, just”), Icelandic réttvíss (“righteous, just”). Compare also thefteous, mighteous."
      ],
      "adjectives": [
        {
          "description": "righteous (comparative more righteous, superlative most righteous)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from sin or guilt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moral and virtuous, to the point of sanctimony.",
                  "examples": [
                    "Human beings should take a righteous path, and so should art. We should promote kindness and beauty through art."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Justified morally.",
                  "examples": [
                    "righteous indignation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, US) Awesome; great.",
                  "examples": [
                    "He sold me a bulging paper sack full of Cambodian Red for two dolla' MPC. A strange experience, copping from a kid, but it was righteous weed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "righteous (third-person singular simple present righteouses, present participle righteousing, simple past and past participle righteoused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make righteous; specifically, to justify religiously, to absolve from sin.",
                  "examples": [
                    "Thus for the purposes of being ‘righteoused’, the Law was irrelevant; yet Paul could not bear to see all the Law disappear."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}