{
  "word": "toboggan",
  "etymologies": [
    {
      "description": [
        "The noun is attested since 1829, the verb since 1846. Both derive from French tabaganne, which derives from an Algonquian word, probably Mi'kmaq tepaqan or Abenaki dabôgan, influenced by similar words in other Eastern Canadian Algonquian languages. The sense of \"hat\" is recorded since 1929 and is short for toboggan cap (1928), a cap suitable for wearing while tobogganing."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "toboggan (plural toboggans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long sled without runners, with the front end curled upwards, which may be pulled across snow by a cord or used to coast down hills.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) A similar sled of wood, pulled by dogs, possibly with steel runners, made to transport cargo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Something which, once it starts going (figuratively) downhill, is unstoppable until it reaches the bottom.",
                  "examples": [
                    "McGinnity began to hit the toboggan in 1906, after he had pitched his arm off the previous year. Last season his efforts at times were painful."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Southern US, especially South Carolina, North Carolina, Virginia, West Virginia) A knit cap, designed to provide warmth in cold weather.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "toboggan (third-person singular simple present toboggans, present participle tobogganing or tobogganning, simple past and past participle tobogganed or tobogganned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To slide down a hill on a toboggan or other object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To go downhill unstoppably until one reaches the bottom.",
                  "examples": [
                    "A depression in one nation can become the slide on which our civilization would toboggan into economic collapse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, intransitive) To fly sharply downward so as to build up speed to facilitate in-flight refueling of a faster aircraft.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}