{
  "word": "mayonnaise",
  "etymologies": [
    {
      "description": [
        "Borrowed from French mayonnaise, possibly named after the city Maó (Mahón in Spanish), Minorca, whence the recipe was brought back to France. Compare Spanish mahonesa. Alternative suggested origins include the city of Bayonne (bayonnaise); the French word manier (“to handle”); the Old French moyeu (“egg yolk”); and the Duke of Mayenne."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mayonnaise (countable and uncountable, plural mayonnaises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dressing made from vegetable oil, raw egg yolks, vinegar or lemon juice, and seasoning, used on salads, with french fries, in sandwiches etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any cold dish with that dressing as an ingredient.",
                  "examples": [
                    "We served a lobster mayonnaise as a starter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any cream, for example for moisturizing the face or conditioning the hair, for which the base is egg yolks and oil.",
                  "examples": [
                    "hair mayonnaise",
                    "facial mayonnaise"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mayonnaise (third-person singular simple present mayonnaises, present participle mayonnaising, simple past and past participle mayonnaised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or season with mayonnaise.",
                  "examples": [
                    "Jones himself presided in the kitchen, mincing truffles, mayonnaising lobster, booting waiters out the door with tray after tray of steaming savories and teeth-numbing sweets,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}