{
  "word": "safety",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English savete, from Old French sauveté, from earlier salvetet, from Medieval Latin salvitās, salvitātem, from Latin salvus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "safety (countable and uncountable, plural safeties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The condition or feeling of being safe; security; certainty.",
                  "examples": [
                    "If you push it to the limit, safety is not guaranteed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanics) A mechanism on a weapon or dangerous equipment designed to prevent accidental firing.",
                  "examples": [
                    "Be sure that the safety is set before proceeding."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) An instance of a player being sacked or tackled in the end zone, or stepping out of the end zone and off the field, resulting in two points to the opposite team.",
                  "examples": [
                    "He sacked the quarterback in the end zone for a safety."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) Any of the defensive players who are in position furthest from the line of scrimmage and whose responsibility is to defend against passes as well as to be the tacklers of last resort.",
                  "examples": [
                    "The free safety made a game-saving tackle on the runner who had broken past the linebackers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A safety squeeze.",
                  "examples": [
                    "Boy wondered about that bunt. He had a notion Fowler would commit himself soon because time was on the go. But Fowler didn’t, making it another sweep of three Pirates. He had thus far given up only two safeties."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Preservation from escape; close custody.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A safety bicycle.",
                  "examples": [
                    "Many wheelmen and wheelwomen, riding safeties, tandems and tricycles, stopped there during the evening and we had good opportunity for comparing American and English bicycles  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "safety (third-person singular simple present safeties, present participle safetying, simple past and past participle safetied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To secure (a mechanical component, as in aviation) to keep it from becoming detached even under vibration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to secure a firing pin, as in guns, to keep the gun from firing",
                  "examples": [
                    "Time went back to normal for him; he safetied his own weapon and dropped it, jumping forward."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}