{
  "word": "lazaretto",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian lazzareto (archaic), lazzaretto, lazzeretto, from lazzaro (“leper”) + -etto (diminutive or meliorative suffix). Lazzaro is derived from Medieval Latin lazarus (“leper”), from Lazarus, from Ancient Greek Λᾱ́ζᾱρος (Lā́zāros), from Hebrew אֶלְעָזָר‎ ('el'azár, literally “God has helped”), from אֵל‎ ('él, “God; a deity, god”) + עָזַר‎ ('azár, “to assist, help”). Lazarus is a Biblical character mentioned in the parable of Jesus known as “The rich man and Lazarus” who is described as being a beggar covered in sores: see Luke 16:20–21. Doublet of lazar and lazaret.",
        "The plural form lazaretti is borrowed from Italian lazzaretti, lazzeretti."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lazaretto (plural lazarettos or lazarettoes or lazaretti)",
          "definitionGroups": [
            {
              "group": "(historical)",
              "entries": [
                {
                  "meaning": "A place reserved for people with infectious diseases (especially leprosy or plague) to live on a long-term basis. [from mid 16th c.]",
                  "examples": [
                    "Synonyms: lazaret, lazar house, pesthouse",
                    "Hyponyms: leper colony, leprosarium, leprosery"
                  ]
                },
                {
                  "meaning": "(also figuratively) A building such as a hospital, or occasionally a ship, used to temporarily isolate sick people to prevent the spread of infectious diseases; a quarantine. [from early 17th c.]",
                  "examples": [
                    "Synonym: lazaret"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, nautical) A place at the front of the tweendecks of a merchant ship where provisions are stored. [from early 18th c.]",
                  "examples": [
                    "Synonym: lazaret"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}