{
  "word": "nature",
  "etymologies": [
    {
      "description": [
        "From Middle English nature, natur, from Old French nature, from Latin nātūra (“birth, origin, natural constitution or quality”), future participle from perfect passive participle (g)natus (“born”), from deponent verb (g)nasci (“to be born, originate”) + future participle suffix -urus. Displaced native Old English ġecynd. More at kind."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nature (countable and uncountable, plural natures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, often capitalized) The way things are, the totality of all things in the physical universe and their order, especially the physical world in contrast to spiritual realms and flora and fauna as distinct from human conventions, art, and technology.",
                  "examples": [
                    "In the works of nature we find, in many instances, beauty and sublimity involved among circumstances, which are either indifferent, or which obstruct the general effect: and it is only by a train of experiments, that we can separate those circumstances from the rest... Accordingly, the inexperienced artist, when he copies nature, will copy her servilely... and the beauties of his performances will be encumbered with a number of superfluous or disagreeable concomitants. Experience and observation alone can enable him to make this determination: to exhibit the principles of beauty pure and unadulterated, and to form a creation of his own, more faultless, than ever fell under the observation of his senses."
                  ]
                }
              ]
            },
            {
              "group": "The particular way someone or something is, especially",
              "entries": [
                {
                  "meaning": "The essential or innate characteristics of a person or thing which will always tend to manifest, especially in contrast to specific contexts, reason, religious duty, upbringing, and personal pretense or effort.",
                  "examples": [
                    "Nature passes norture."
                  ]
                },
                {
                  "meaning": "The distinguishing characteristic of a person or thing, understood as its general class, sort, type, etc.",
                  "examples": [
                    "For the French, it was impossible for them to serve her in that nature."
                  ]
                },
                {
                  "meaning": "(UK military, obsolete) Synonym of caliber: the class of a gun.",
                  "examples": [
                    "...One Hundred of each Nature of Case-Shot..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The vital functions or strength of someone or something, especially (now dialect) as requiring nourishment or careful maintenance or (medicine) as a force of regeneration without special treatment.",
                  "examples": [
                    "Any such corrasiue, sharpe or eager medicine... as the said H. shal think his nature is vnable to suffer..."
                  ]
                }
              ]
            },
            {
              "group": "A requirement or powerful impulse of the body's physical form, especially",
              "entries": [
                {
                  "meaning": "The need to urinate and defecate.",
                  "examples": [
                    "He withdrew from the Company to ease Nature."
                  ]
                },
                {
                  "meaning": "(now chiefly African-American Vernacular) Sexual desire.",
                  "examples": [
                    "She marvelled \"What he saw in such a baby\"As that prim, silent, cold Aurora Raby?\"...Why Adeline had this slight prejudice...For me appears a question far too nice,Since Adeline was liberal by Nature;But Nature’s Nature, and has more capricesThan I have time, or will to take to pieces..."
                  ]
                },
                {
                  "meaning": "(now chiefly UK regional and African-American Vernacular) Spontaneous love, affection, or reverence, especially between parent and child.",
                  "examples": [
                    "Have we not seen (the blood of Laius shed)The murd'ring son ascend his parent's bed,Thro' violated Nature force his way,And stain the sacred womb where once he lay?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A product of the body's physical form, especially semen and vaginal fluids, menstrual fluid, and (obsolete) feces.",
                  "examples": [
                    "...vnkyndely synne by which man or womman shedeth hire nature in manere or in place ther as a child may nat be conceyued..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A part of the body's physical form, especially (obsolete) the female genitalia.",
                  "examples": [
                    "... offer her the Horse, and... wash her Nature with cold Water ..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nature (third-person singular simple present natures, present participle naturing, simple past and past participle natured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To endow with natural qualities.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}