{
  "word": "spider",
  "etymologies": [
    {
      "description": [
        "From Middle English spiþre, spydyr, spider, spiþer, from Old English spīþra (“spider”), from Proto-West Germanic *spinþrijō, from Proto-Germanic *spinnaną (“to spin”). Mostly displaced attercop (“spider, unpleasant person”), now a dialectal term."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spider (countable and uncountable, plural spiders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various eight-legged, predatory arthropods, of the order Araneae, most of which spin webs to catch prey.",
                  "examples": [
                    "Synonyms: (obsolete except in dialects) attercop, (obsolete) cop"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, dated) A program which follows links on the World Wide Web in order to gather information.",
                  "examples": [
                    "Synonym: crawler"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia and New Zealand) A float (drink) made by mixing ice-cream and a soda or fizzy drink (such as lemonade).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, obsolete) An alcoholic drink made with brandy and lemonade or ginger beer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A spindly person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A man who persistently approaches or accosts a woman in a public social setting, particularly in a bar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, billiards) A stick with a convex arch-shaped notched head used to support the cue when the cue ball is out of reach at normal extension; a bridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking, US, UK, chiefly historical and now dialectal) A cast-iron frying pan with three legs, once common in open-hearth cookery.",
                  "examples": [
                    "Cut slices and lay them in cold water in the spider; boil them up two or three minutes, then pour off the water and set the spider again on the coals and brown the slices on each side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) Implement for moving food in and out of hot oil for deep frying, with a circular metal mesh attached to a long handle; a spider skimmer",
                  "examples": [
                    "If you are deep-frying your falafel, use a spider or basket to place them gently into the hot oil, which should be preheated to a temperature of 175°C (330°F)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling) A part of a crank, to which the chainrings are attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Heroin.",
                  "examples": [
                    "Synonyms: see Thesaurus:heroin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Part of a resonator instrument that transmits string vibrations from the bridge to a resonator cone at multiple points.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A skeleton or frame with radiating arms or members, often connected by crosspieces, such as a casting forming the hub and spokes to which the rim of a fly wheel or large gear is bolted; the body of a piston head; or a frame for strengthening a core or mould for a casting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fly fishing, England) A soft-hackle fly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The network of wires separating the areas of a dartboard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A spider graph or spider tree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A type of light phaeton.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) A support for a camera tripod, preventing it from sliding.",
                  "examples": [
                    "The spider is very useful for shooting in the studio or on locations with smooth floors where tripod legs tend to slide."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spider (third-person singular simple present spiders, present participle spidering, simple past and past participle spidered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move like a spider.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover a surface like a cobweb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, of a computer program) To follow links on the World Wide Web in order to gather information.",
                  "examples": [
                    "The online dictionary is regularly spidered by search engines."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}