{
  "word": "principal",
  "etymologies": [
    {
      "description": [
        "From Middle English principal, from Old French principal, from Latin prīncipālis."
      ],
      "adjectives": [
        {
          "description": "principal (comparative more principal, superlative most principal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Primary; most important; first level in importance.",
                  "examples": [
                    "Smith is the principal architect of this design.",
                    "The principal cause of the failure was poor planning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Latinism) Of or relating to a prince; princely.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Chosen or assumed among a branch of possible values of a multi-valued function so that the function is single-valued.",
                  "examples": [
                    "Two is the principal square root of 4. Both −2 and +2 are square roots of 4."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "principal (countable and uncountable, plural principals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, uncountable) The money originally invested or loaned, on which basis interest and returns are calculated.",
                  "examples": [
                    "A portion of your mortgage payment goes to reduce the principal, and the rest covers interest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, Australia, New Zealand) The chief administrator of a school.",
                  "examples": [
                    "The important administrative figure to the teacher is the school principal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Canada) The chief executive and chief academic officer of a university or college.",
                  "examples": [
                    "Unlike the students, Principal Robertson, who now resided almost alone in the College, continued to use the accustomed route on his visits to the Old Town; and it “became the joke of the day that from being the principal gate it had become only a gate for the Principal.”5"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A legal person that authorizes another (the agent) to act on their behalf; or on whose behalf an agent or gestor in a negotiorum gestio acts.",
                  "examples": [
                    "When an attorney represents a client, the client is the principal who permits the attorney, the client′s agent, to act on the client′s behalf.",
                    "My principal sells metal shims."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The primary participant in a crime.",
                  "examples": [
                    "Coordinate term: accessory",
                    "Hypernym: accomplice"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) A partner or owner of a business.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A diapason, a type of organ stop on a pipe organ.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture, engineering) The construction that gives shape and strength to a roof, generally a truss of timber or iron; or, loosely, the most important member of a piece of framing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The first two long feathers of a hawk's wing.",
                  "examples": [
                    "The first two feathers - Principals"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the turrets or pinnacles of waxwork and tapers with which the posts and centre of a funeral hearse were formerly crowned",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An essential point or rule; a principle.",
                  "examples": [
                    "Set two classes of monitors to question each other; so that one may try to outquestion the other. Explain to them the principal of every subject they have to teach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dancer at the highest rank within a professional dance company, particularly a ballet company.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A security principal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}