{
  "word": "askance",
  "etymologies": [
    {
      "description": [
        "Unknown. Possibly from Middle English askances (“as if”), or from Old French a escone (“hidden”) or Italian a scancio (“obliquely”). Compare asquint, Middle English askoyn (“at a slant, askance”), Dutch schuin, schuins (“sideways”), schuiven (“to shove”), schuinte (“slope”)."
      ],
      "adjectives": [
        {
          "description": "askance (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Turned to the side, especially of the eyes.",
                  "examples": [
                    "My first thought was, he lied in every word,That hoary cripple, with malicious eyeAskance to watch the working of his lie"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "askance (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a look or glance) With disapproval, skepticism, or suspicion.",
                  "examples": [
                    "The beggar asked for change, but the haughty woman only looked at him askance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sideways; obliquely.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "askance (third-person singular simple present askances, present participle askancing, simple past and past participle askanced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, transitive) To look at (someone or something) with a sideways glance.",
                  "examples": [
                    "Bowed heads, Aunt Ellen's, Aunt Laura's, her sister's — bowed but askancing her yellow dress — yes, yellow, golden yellow, hue of sun and life, Dad's favorite, to see him off on this, his greatest journey."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, transitive) To turn (one's eye or gaze) to the side.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}