{
  "word": "breakaway",
  "etymologies": [
    {
      "description": [
        "break +‎ away"
      ],
      "adjectives": [
        {
          "description": "breakaway (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having broken away from a larger unit.",
                  "examples": [
                    "Nor is it true, although it has been suggested as true, that I am in favour of breakaway or splinter unions—"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Capable of breaking off without damaging the larger structure.",
                  "examples": [
                    "In Hollywood, rehearsing for his show, Red Skelton plunged headlong into a \"breakaway\" door. It didn't break, and Red was hospitalized with concussion and a mild case of shock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) Occurring during or as a result of a breakaway (see Noun)",
                  "examples": [
                    "In a league starved for scoring, the challenge ensures that some super-sweet breakaway goals will be overturned because a dude was three microns offside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entertainment industry) Enjoying rapid popular success.",
                  "examples": [
                    "The New York quintet call themselves Dr. Buzzard's Original Savannah Band, and their RCA debut LP is this season's breakaway disco act."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "breakaway (plural breakaways)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of breaking away from something.",
                  "examples": [
                    "[…]  this Finance Bill represents a definite breakaway from the old practice of mass bribing, vote catching, and political Finance Bills which we were in grave danger of establishing as a permanent part of our national activities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycle racing) A group of riders which has gone ahead of the peloton.",
                  "examples": [
                    "The summit of the climb came 38km from the end of stage 14, which began in Limoux and ended in Foix in the foothills of the Pyrenees, and the incident occurred as the peloton emerged into the light and passed under the banner at the top, a quarter of an hour behind a five-man breakaway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) A situation in the game where one or more players of a team attack towards the goal of the other team without having any defenders in front of them.",
                  "examples": [
                    "With the game tied 1-1 early in the third, Henrik got free on a breakaway and was stopped by Oilers goalie Anders Nilsson  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing) The act of getting away from one's opponent; the separation of the boxers after a spell of infighting.",
                  "examples": [
                    "The gong sounded almost immediately after the breakaway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A stampede of animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) An animal that breaks away from a herd.",
                  "examples": [
                    "The smartest stock horse that ever brought his rider up within whip distance of a breakaway or dodged the horns of a sulky beast, took the chance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, geography) An eroding steep slope on the edge of a plateau; an escarpment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A channel of floodwater that has burst from its usual course; or the track or channel eroded by the water. [from 19th c.]",
                  "examples": [
                    "He was forced to slow to a walking pace in order to negotiate a rack of deep breakaways."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular yo-yo trick [12].",
                  "examples": [
                    "After watching some older kids try out for the New York City Parks Department's yo-yo championship, Stephen Awerman, an eleven-year-old from Jamaica, L.I., decided that he could hold his own with the big boys. He spun his yo-yo through the required figures—spinner, walking-the-dog, breakaway […] —then unreeled 312 loop-the-loops to latch onto the title."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A swing dance in which the leader occasionally swings the follower out into an open position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) An item of scenery designed to be broken or destroyed during the performance.",
                  "examples": [
                    "EFFECT  […]  This usually refers to special effects such as flash pots, torches, crashes, breakaways, etc."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}