{
  "word": "splash",
  "etymologies": [
    {
      "description": [
        "Probably an alteration of plash."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "splash (plural splashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(onomatopoeia) The sound made by an object hitting a liquid.",
                  "examples": [
                    "I heard a splash when the rock landed in the pond."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small amount of liquid.",
                  "examples": [
                    "I felt a splash of rain, so I put up my hood.",
                    "I felt a splash of water on my leg as the car drove into the nearby puddle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small amount (of color).",
                  "examples": [
                    "The painter put a splash of blue on the wall to make it more colorful"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mark or stain made from a small amount of liquid.",
                  "examples": [
                    "There was a visible splash on his pants after he went to the bathroom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An impact or impression.",
                  "examples": [
                    "The new movie made quite a splash upon its release."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, informal) A splash screen.",
                  "examples": [
                    "When the splash appears with Please wait, wait for Windows to start configuration."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(wrestling) A body press; a move where the wrestler jumps forward from a raised platform such as the top turnbuckle, landing stomach first across an opponent lying on the ground below.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A cosmetic powder to whiten the complexion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) A large, prominent headline or article.",
                  "examples": [
                    "So for a local newspaper, a splash on a fatal crash is just the first of a series of reports."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, slang) The shooting down of an aircraft over water.",
                  "examples": [
                    "Hits were observed, but again the poor functioning of VT ammunition hindered in effecting a splash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(MLE, slang) The bleeding caused by a knife wound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(MLE, slang) A knife.",
                  "examples": [
                    "Synonyms: splasher, jooka ~ jooker, nank, shank, bassy, rambo, pokey, chete, ying"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "splash (third-person singular simple present splashes, present participle splashing, simple past and past participle splashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hit or agitate liquid so that part of it separates from the principal liquid mass.",
                  "examples": [
                    "sit and splash in the bathtub"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To disperse a fluid suddenly; to splatter.",
                  "examples": [
                    "water splashed everywhere"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit or expel liquid at.",
                  "examples": [
                    "The children were splashing each other playfully in the sea.",
                    "When she comes in the door, splash her with perfume."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To create an impact or impression; to print, post, or publicize prominently.",
                  "examples": [
                    "The headline was splashed across newspapers everywhere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spend (money).",
                  "examples": [
                    "After pay day I can afford to splash some cash and buy myself a motorbike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To roughly fill with color.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To launch a ship.",
                  "examples": [
                    "In the two years following Midway, Japanese shipyards managed to splash only six additional fleet carriers. The United States in the same period added seventeen, along with ten medium carriers and eighty-six escort carriers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, slang) To shoot down (an aircraft) over water.",
                  "examples": [
                    "Planes were sighted at about 5000 yards, fire was opened at 4500 yards; the first plane was splashed about 1800 yards from the ship, the second was splashed about 3000 yards from the ship and rudder shifted to hard right."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, MLE) To stab (a person), causing them to bleed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}