{
  "word": "gook",
  "etymologies": [
    {
      "description": [
        "First attested in the 1890s in reference to Filipinos (in particular, it is defined in an 1893 citation in Slang and Its Analogues as referring to prostitutes who followed army camps; it is defined similarly in a 1914 work). The word was used of Nicaraguans during the US military occupation there in the 1910s, and Haitians during the US invasion there, when Herbert Seligman noted in 1920 that \"The Haitians [...] are nicknamed 'Gooks'\".",
        "Other early uses in the 1920 and 30s still refer to people from the Philippines (a 1921 work refers to the Philippines as \"Gook Land\"), and the term seems to be connected to goo-goo (“a Philippine person”), for which a variety of etymologies have been proposed; see that entry for more. (A later folk etymology suggests that during the Korean War, Koreans would shout Korean 美國 (Miguk, “America”) at Americans, who interpreted it as \"me gook\"; this ignores the many earlier examples of the word outside Korea.) Gook was used of Pacific Islanders by World War II, and Koreans and Vietnamese people by the time of the 1950s and 60s US military interventions there, which cemented the shift to meaning \"Asian\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gook (plural gooks)",
          "definitionGroups": [
            {
              "group": "(slang, vulgar, derogatory, offensive, ethnic slur) A person of (South) East Asian descent; originally a native of the Philippines, but now especially:",
              "entries": [
                {
                  "meaning": "(US, derogatory) A Korean person (especially during the Korean War).",
                  "examples": []
                },
                {
                  "meaning": "(US, derogatory) A Vietnamese insurgent in the Vietnam War, particularly a member of the Vietcong.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(dated, derogatory) A foreigner (to the speaker), especially the (enemy) natives of a place the speaker's military is at war with or in.",
              "entries": [
                {
                  "meaning": "(Rhodesia, derogatory) A black insurgent in the Rhodesian Bush War.",
                  "examples": [
                    "\"But shit, man, don't we do a fucking good job of it. Jesus, we slew long gooks this last trip,\" quipped Mark."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possible blend of goop +‎ gunk, or related to gobbledygook."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gook (plural gooks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Grime or mud.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gook (plural gooks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A dull or hapless person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}