{
  "word": "bespeak",
  "etymologies": [
    {
      "description": [
        "From Middle English bespeken, bispeken, from Old English *bespecan, besprecan (“to speak about, speak against, accuse of, claim at law, complain”), from Proto-Germanic *bisprekaną (“to discuss, blame”), equivalent to be- +‎ speak. Cognate with Scots bespeke (“to beseech, speak or negotiate with”), West Frisian besprekke (“to discuss”), Dutch bespreken (“to discuss, review, debate”), German besprechen (“to discuss, review, talk about”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bespeak (plural bespeaks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A request for a specific performance; a benefit performance, by a patron.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bespeak (third-person singular simple present bespeaks, present participle bespeaking, simple past bespoke or (archaic) bespake, past participle bespoken or (archaic) bespoke)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To speak about; tell of; relate; discuss.",
                  "examples": [
                    "[They] bespoke dangers […] in order to scare the allies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To speak for beforehand; engage in advance; make arrangements for; order or reserve in advance.",
                  "examples": [
                    "I walked on into the village, with the desertion of this house upon my mind, and I found the landlord of the little inn, sanding his door-step. I bespoke breakfast, and broached the subject of the house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stipulate, solicit, ask for, or request, as in a favour.",
                  "examples": [
                    "to bespeak a calm hearing;  I bespeak your patience in advance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To forbode; foretell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, poetic) To speak to; address.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To betoken; show; indicate; foretell; suggest; allude to.",
                  "examples": [
                    "This act bespeaks his kindness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To speak up or out; exclaim; speak.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}