{
  "word": "elephant",
  "etymologies": [
    {
      "description": [
        "From Middle English elefant, elefaunt, from Old French elefant, elefan, olifant, re-latinized in Middle French as elephant, from Latin elephantus, from Ancient Greek ἐλέφᾱς (eléphās) (gen. ἐλέφαντος (eléphantos)). Believed to be derived from an Afroasiatic form such as Proto-Berber *eḷu (“elephant”) (compare Tamahaq êlu, Tamasheq alu) or Egyptian ꜣbw (“elephant; ivory”). More at ivory. Replaced Middle English olifant (from the aforementioned Old French form, from Vulgar Latin *olifantus), which replaced Old English elpend (“elephant”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "elephant (countable and uncountable, plural elephants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mammal of the order Proboscidea, having a trunk, and two large ivory tusks jutting from the upper jaw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in particular) Any member of the subfamily Elephantinae not also of the genera Mammuthus and Primelephas.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Anything huge and ponderous.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(paper, printing) Synonym of elephant paper",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, childish) used when counting to add length, so that each count takes about one second",
                  "examples": [
                    "Let's play hide and seek. I'll count. One elephant, two elephant, three elephant..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Ivory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(xiangqi) A xiangqi piece, that is moved two points diagonally, may not jump over intervening pieces and may not cross the river.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}