{
  "word": "struggle",
  "etymologies": [
    {
      "description": [
        "From Middle English struglen, stroglen, strogelen, of obscure origin. Cognate with Scots strugil (“to struggle, grapple, contend”). Perhaps from a variant of *strokelen, *stroukelen (> English stroll), from Middle Dutch struyckelen (\"to stumble, trip, falter\"; > Modern Dutch struikelen), the frequentative form of Old Dutch *strūkon (“to stumble”), from Proto-Germanic *strūkōną, *strūkēną (“to be stiff”), from Proto-Indo-European *strug-, *ster- (“to be stiff; to bristle, strut, stumble, fall”), related to Middle Low German strûkelen (\"to stumble\"; > Low German strükeln), Old High German strūhhēn, strūhhōn (\"to stumble, trip, tumble, go astray\"; > German strauchen, straucheln).",
        "Alternative etymology derives the base of struggle from Old Norse strúgr (“arrogance, pride, spitefulness, ill-will”) + -le (frequentative suffix), from Proto-Germanic *strūkaz (“stiff, rigid”), ultimately from the same Proto-Indo-European root above, which would make it cognate with dialectal Swedish strug (“contention, strife, discord”), Norwegian stru (“obstinate, unruly”), Danish struende (“reluctantly”), Scots strug (“difficulty, perplexity, a laborious task”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "struggle (plural struggles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contortion of the body in an attempt to escape or to perform a difficult task.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Strife, contention, great effort.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "struggle (third-person singular simple present struggles, present participle struggling, simple past and past participle struggled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strive, to labour in difficulty, to fight (for or against), to contend.",
                  "examples": [
                    "During the centuries, the people of Ireland struggled constantly to assert their right to govern themselves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strive, or to make efforts, with a twisting, or with contortions of the body.",
                  "examples": [
                    "She struggled to escape from her assailant's grasp."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}