{
  "word": "kitchen",
  "etymologies": [
    {
      "description": [
        "From Middle English kychyn, kytchen, kichene, küchen, from Old English cyċen, cyċene, from Proto-West Germanic *kukinā, a borrowing from Late Latin cocīna, from earlier coquīna (“kitchen; cuisine”), from coquō (“to cook”), from Proto-Indo-European *pekʷ- (“to cook, become ripe”).",
        "In other languages, the cognate term often refers both to the room and the type of cooking. In English, the distinction is generally made via the etymological twins kitchen (“room”) (Latin via Germanic) and cuisine (“type of cooking”) (Latin via French)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kitchen (plural kitchens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A room or area for preparing food.",
                  "examples": [
                    "We cook in the kitchen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Cuisine; style of cooking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly African-American Vernacular) The nape of a person's hairline, often referring to its uncombed or \"nappy\" look.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The percussion section of an orchestra.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A utensil for roasting meat.",
                  "examples": [
                    "There are two modes of roasting: One is to use a tin kitchen before an open fire, and the other, and more common way, is to use a hot oven."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive) A domesticated or uneducated form of a language.",
                  "examples": [
                    "Sir Henry and Umbopo sat conversing in a mixture of broken English and kitchen Zulu, in low voices, but earnestly enough."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A public gaming room in a casino.",
                  "examples": [
                    "Having done what was required to gain admittance to the \"kitchen,\" as the public rooms are termed, as well as to the more exclusive \"Salle Privée\"  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Anything eaten as a relish with bread, potatoes, etc.; a condiment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "kitchen (third-person singular simple present kitchens, present participle kitchening, simple past and past participle kitchened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To do kitchen work; to prepare food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To embellish a basic food; to season, add condiments, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) To embellish; to dress up.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}