{
  "word": "roller",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "roller (plural rollers)",
          "definitionGroups": [
            {
              "group": "(heading) Anything that rolls.",
              "entries": [
                {
                  "meaning": "Any rotating cylindrical device that is part of a machine, especially one used to apply or reduce pressure.",
                  "examples": []
                },
                {
                  "meaning": "A cylindrical (or approximately cylindrical) item used under a heavy object to facilitate moving it; usually several are needed.",
                  "examples": []
                },
                {
                  "meaning": "A person who rolls something, such as cigars or molten metal.",
                  "examples": []
                },
                {
                  "meaning": "(cricket) A large rolling device used to flatten the surface of the pitch.",
                  "examples": []
                },
                {
                  "meaning": "A cylindrical tool for applying paint or ink.",
                  "examples": [
                    "Synonyms: paint roller, rolling paint brush, rolling brush"
                  ]
                },
                {
                  "meaning": "An agricultural machine used for flattening land and breaking up lumps of earth.",
                  "examples": []
                },
                {
                  "meaning": "One of a set of small cylindrical tubes used to curl hair.",
                  "examples": []
                },
                {
                  "meaning": "A roller towel.",
                  "examples": []
                },
                {
                  "meaning": "A small wheel, as of a caster, a roller skate, etc.",
                  "examples": []
                },
                {
                  "meaning": "(cycling) One of a set of rolling cylinders allowing a rider to practise balance while training indoors.",
                  "examples": []
                },
                {
                  "meaning": "Any insect whose larva rolls up leaves, especially those in family Tortricidae.",
                  "examples": []
                },
                {
                  "meaning": "A dung beetle that rolls dung into balls.",
                  "examples": []
                },
                {
                  "meaning": "The cylinder snakes, small ground snakes of the genus Cylindrophis.",
                  "examples": []
                },
                {
                  "meaning": "A rolling pin",
                  "examples": []
                },
                {
                  "meaning": "(disc golf) A throw which involves the player throwing the disc in a way that makes it roll, by that being able to travel further than if thrown in the air. Only used on holes with open areas with short or no grass.",
                  "examples": [
                    "He threw a beautiful roller that cut the corner perfectly and stopped just outside the circle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long wide bandage used in surgery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large, wide, curling wave that falls back on itself as it breaks on a coast.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(heading) A bird.",
              "entries": [
                {
                  "meaning": "A breed or variety of roller pigeon that rolls (i.e. tumbles or somersaults) backwards (compare Penson roller, Birmingham roller, tumbler).",
                  "examples": []
                },
                {
                  "meaning": "Any of various aggressive birds, of the family Coraciidae, having bright blue wings and hooked beaks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A police patrol car or patrolman (rather than an unmarked police car or a detective)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A padded surcingle that is used on horses for training and vaulting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, film) A roll of titles or (especially) credits played over film or video; television or film credits.",
                  "examples": [
                    "I learned a lot from watching, but the part that I should have studied harder was the roller. The names of the writers went on for ever."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A wheelchair user.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "roller (third-person singular simple present rollers, present participle rollering, simple past and past participle rollered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To roller skate.",
                  "examples": [
                    "One day Frankie rollered up our drive and asked me if I fancied a skate."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}