{
  "word": "babbitt",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Babbitt, the surname of the American inventor Isaac Babbitt (1799–1862) who invented the alloy.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "babbitt (countable and uncountable, plural babbitts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for babbitt metal, Babbitt metal (“a soft white alloy of variable composition (for example, nine parts of tin to one of copper, or fifty parts of tin to five of antimony and one of copper) used in bearings to diminish friction”).",
                  "examples": [
                    "Synonyms: (rare) Babbitt's metal, bearing metal"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "babbitt (third-person singular simple present babbitts, present participle babbitting, simple past and past participle babbitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To line (something) with babbitt metal to reduce friction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Babbitt, the surname of George Babbitt, the title character of the novel Babbitt (1922) by the American author Sinclair Lewis (1885–1951). The word was also popularized by the George (1898–1937) and Ira Gershwin (1896–1983) song “The Babbitt and the Bromide”, first featured in the 1927 musical Funny Face and later in the film Ziegfeld Follies (1945)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "babbitt (plural babbitts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated) Alternative letter-case form of Babbitt (“a person who subscribes complacently to materialistic middle-class ideals”)",
                  "examples": [
                    "One speaks of a babbitt habit, a babbitt era. Nothing is more true. America recognized itself in Babbitt, it demurred, but it also admired."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}