{
  "word": "neighbour",
  "etymologies": [
    {
      "description": [
        "From Middle English neyghebour, neighebor, neighbour, neihebur, from Old English nēahġebūr (“neighbour”), from Proto-Germanic *nēhwagabūrô (“neighbour”), equivalent to nigh +‎ bower. Cognate with Scots nichbour (“neighbour”), Saterland Frisian Noaber (“neighbour”), Dutch nabuur (“neighbour”), German Low German Navur (“neighbour”), German Nachbar (“neighbour”), Danish nabo (“neighbour”), Norwegian nabo (“neighbour”), Icelandic nábúi (“neighbour”). More at nigh, bower (“farmer”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "neighbour (plural neighbours) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person living on adjacent or nearby land; a person situated adjacently or nearby; anything (of the same type of thing as the subject) in an adjacent or nearby position.",
                  "examples": [
                    "My neighbour has two noisy cats.",
                    "They′re our neighbours across the street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is near in sympathy or confidence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biblical) A fellow human being.",
                  "examples": [
                    "You shall not take vengeance, nor bear any grudge against the children of your people, but you shall love your neighbor as yourself: I am the Lord."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "neighbour (third-person singular simple present neighbours, present participle neighbouring, simple past and past participle neighboured) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be adjacent to",
                  "examples": [
                    "Though France neighbours Germany, its culture is significantly different."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, followed by \"on\"; figurative) To be similar to, to be almost the same as.",
                  "examples": [
                    "That sort of talk is neighbouring on treason."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To associate intimately with; to be close to.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}