{
  "word": "polaroid",
  "etymologies": [
    {
      "description": [
        "Genericization of the trademark Polaroid, owned by Polaroid Corporation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "polaroid (plural polaroids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sheet of plastic embedded with microscopic crystals of herapathite or similarly acting material, so that light passing through it is polarised.",
                  "examples": [
                    "In the simplest form of this system, applicable to many microscopes, the substage polar consists only of semicircles of polaroid orientated to give respective planes of polarisation at right angles. Polaroids over the eyepieces are orientated so extinguish the inner halves of the exit pupils."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, in the plural) Spectacles made with lenses of polaroid, once used to view certain 3-D movies.",
                  "examples": [
                    "She went to see BWANA DEVIL and, after donning the polaroids, saw correctly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) Polaroid sunglasses.",
                  "examples": [
                    "One reel, loaded with a floating or intermediate line, a few braided leaders of varying sinking-rates, a few spare spools of leader-material in 6, 8 and 10lb breaking-strain, a box of assorted fly-patterns, a good pair of polaroids to stop the glare and to protect eyes, and a collapsible line-tray as the rocks are very sharp and soon ruin lines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A camera that develops its own film.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A print from such a camera.",
                  "examples": [
                    "Simons slides a pair of Polaroids across the table. They depict a couple of color-lit high schoolers standing in what appears to be an empty warehouse."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "polaroid (third-person singular simple present polaroids, present participle polaroiding, simple past and past participle polaroided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, informal) To photograph with a polaroid camera.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}