{
  "word": "chair",
  "etymologies": [
    {
      "description": [
        "From Middle English chayer, chaire, chaiere, chaere, chayre, chayere, from Old French chaiere, chaere, from Latin cathedra (“seat”), from Ancient Greek καθέδρα (kathédra), from κατά (katá, “down”) + ἕδρα (hédra, “seat”). Displaced native stool and settle, which now have more specialised senses. Doublet of cathedra and chaise."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chair (plural chairs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An item of furniture used to sit on or in, comprising a seat, legs or wheels, back, and sometimes arm rests, for use by one person. Compare stool, couch, sofa, settee, loveseat and bench.",
                  "examples": [
                    "All I need to weather a snowstorm is hot coffee, a warm fire, a good book and a comfortable chair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often with definite article, also written Chair) Clipping of chairperson.",
                  "examples": [
                    "Under the rules of order adopted by the board, the chair may neither make nor second motions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The seating position of a particular musician in an orchestra.",
                  "examples": [
                    "My violin teacher used to play first chair with the Boston Pops."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) An iron block used on railways to support the rails and secure them to the sleepers, and similar devices.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) One of two possible conformers of cyclohexane rings (the other being boat), shaped roughly like a chair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, with the) Ellipsis of electric chair (“device used for performing execution”).",
                  "examples": [
                    "The court will show no mercy; if he gets convicted, it's the chair for him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) A distinguished professorship at a university.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vehicle for one person; either a sedan borne upon poles, or a two-wheeled carriage drawn by one horse; a gig.",
                  "examples": [
                    "She always leaves her Chair at the milliner's in the next Street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The seat or office of a person in authority, such as a judge or bishop.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chair (third-person singular simple present chairs, present participle chairing, simple past and past participle chaired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To act as chairperson at; to preside over.",
                  "examples": [
                    "Bob will chair tomorrow's meeting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carry in a seated position upon one's shoulders, especially in celebration or victory.",
                  "examples": [
                    "The time you won your town the race",
                    "We chaired you through the marketplace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Wales, UK) To award a chair to (a winning poet) at a Welsh eisteddfod.",
                  "examples": [
                    "The poet was chaired at the national Eisteddfod."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}