{
  "word": "burst",
  "etymologies": [
    {
      "description": [
        "From Middle English bresten, bersten, from Old English berstan, from Proto-Germanic *brestaną (compare West Frisian boarste, Dutch barsten, Swedish brista), from Proto-Indo-European *bʰres- (“to burst, break, crack, split, separate”) (compare Irish bris (“to break”)), enlargement of *bʰreHi- (“to snip, split”). More at brine. Also cognate to debris."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "burst (plural bursts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or instance of bursting.",
                  "examples": [
                    "The bursts of the bombs could be heard miles away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden, often intense, expression, manifestation or display.",
                  "examples": [
                    "Synonym: spurt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A series of shots fired from an automatic firearm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The explosion of a bomb or missile.",
                  "examples": [
                    "a ground burst; a surface burst"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A drinking spree.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "burst (third-person singular simple present bursts, present participle bursting, simple past burst or (archaic) brast or (nonstandard) bursted, past participle burst or (rare) bursten or (nonstandard) bursted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To break from internal pressure.",
                  "examples": [
                    "I blew the balloon up too much, and it burst."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to break from internal pressure.",
                  "examples": [
                    "I burst the balloon when I blew it up too much."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To cause to break by any means.",
                  "examples": [
                    "He burst his lance against the sand below."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To separate (printer paper) at perforation lines.",
                  "examples": [
                    "I printed the report on form-feed paper, then burst the sheets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To enter or exit hurriedly and unexpectedly.",
                  "examples": [
                    "Like hungry dogs who have sniffed their meat, the mob bursts in, trampling down the women who sought to bar the entrance with their bodies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To erupt; to change state suddenly as if bursting.",
                  "examples": [
                    "The flowers burst into bloom on the first day of spring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To produce as an effect of bursting.",
                  "examples": [
                    "to burst a hole through the wall"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To interrupt suddenly in a violent or explosive manner; to shatter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}