{
  "word": "badger",
  "etymologies": [
    {
      "description": [
        "From Middle English bageard (“marked by a badge”), from bage (“badge”), referring to the animal's badge-like white blaze, equivalent to badge +‎ -ard. Displaced earlier brock, from Old English brocc."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "badger (plural badgers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any mammal of three subfamilies, which belong to the family Mustelidae: Melinae (Eurasian badgers), Mellivorinae (ratel or honey badger), and Taxideinae (American badger).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A native or resident of the American state, Wisconsin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A brush made of badger hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, obsolete, cant) A crew of desperate villains who robbed near rivers, into which they threw the bodies of those they murdered.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "badger (third-person singular simple present badgers, present participle badgering, simple past and past participle badgered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pester; to annoy persistently; to press.",
                  "examples": [
                    "He kept badgering her about her bad habits."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unknown (Possibly from \"bagger\". \"Baggier\" is cited by the OED in 1467-8)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "badger (plural badgers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An itinerant licensed dealer in commodities used for food; a hawker; a huckster; -- formerly applied especially to one who bought grain in one place and sold it in another.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}