{
  "word": "whale",
  "etymologies": [
    {
      "description": [
        "From Middle English whale, from Old English hwæl (“whale”), from Proto-West Germanic *hwal, from Proto-Germanic *hwalaz (“whale”) (compare German Wal, Swedish val, Danish and Norwegian Bokmål hval, Norwegian Nynorsk kval; compare also Dutch walvis, West Frisian walfisk, from Proto-Indo-European *(s)kʷálos (“sheatfish”) (compare German Wels, Latin squalus (“big sea fish”), Old Prussian kalis, Ancient Greek ἄσπαλος (áspalos), Avestan 𐬐𐬀𐬭𐬀‎ (kara, “kind of fish”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whale (plural whales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any one of numerous large marine mammals comprising an informal group within infraorder Cetacea that usually excludes dolphins and porpoises.",
                  "examples": [
                    "Synonym: (obsolete) baleen"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any species of Cetacea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something, or someone, that is very large.",
                  "examples": [
                    "It was a whale of a job.  […]  It took two months, and the fair blush of youth off my cheeks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, as \"whale of a ___\") Something, or someone, that is excellent.",
                  "examples": [
                    "My own father only wrote one poem in his life as far as I know, but it was a whale of a lyric, the kind you would give your whole life to write, which he did, but that is another story."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) In a casino, a person who routinely bets at the maximum limit allowable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, informal) An investor who deals with very large amounts of money.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marketing, by extension) A person who spends large amounts of money on things that are marketed to them.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "whale (third-person singular simple present whales, present participle whaling, simple past and past participle whaled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hunt for whales.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Uncertain. Perhaps a variant of wale influenced by whack, whap, etc."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "whale (third-person singular simple present whales, present participle whaling, simple past and past participle whaled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To thrash, to flog, to beat vigorously or soundly.",
                  "examples": [
                    "Brought him back, put him in the stall—low stable—got out of his reach, and then begun to whale him. Then he kicked up agin;  […]"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}