{
  "word": "night",
  "etymologies": [
    {
      "description": [
        "From Middle English nighte, night, nyght, niȝt, naht, from Old English niht, from Proto-West Germanic *naht (“night”), from Proto-Germanic *nahts (“night”), from Proto-Indo-European *nókʷts (“night”).",
        "Cognate with Scots nicht, neicht (“night”), West Frisian nacht (“night”), Dutch nacht (“night”), Low German Nacht (“night”), German Nacht (“night”), Danish nat (“night”), Swedish and Norwegian natt (“night”), Faroese nátt (“night”), Icelandic nótt (“night”), Greek νύχτα (nýchta, “night”), Russian ночь (nočʹ, “night”), Sanskrit नक्ति (nákti, “night”), and Latin nox (“night”), whence English nox, a doublet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "night (countable and uncountable, plural nights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The period between sunset and sunrise, when a location faces far away from the sun, thus when the sky is dark.",
                  "examples": [
                    "How do you sleep at night when you attack your kids like that!?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy, countable) The period of darkness beginning at the end of evening astronomical twilight when the sun is 18 degrees below the horizon, and ending at the beginning of morning astronomical twilight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, countable) A period of time often defined in the legal system as beginning 30 minutes after sunset, and ending 30 minutes before sunrise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An evening or night spent at a particular activity.",
                  "examples": [
                    "a night on the town"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A night (and part of the days before and after it) spent in a place away from home, e.g. a hotel.",
                  "examples": [
                    "I stayed my friend's house for three nights."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Nightfall.",
                  "examples": [
                    "from noon till night"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Darkness (due to it being nighttime).",
                  "examples": [
                    "The cat disappeared into the night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A dark blue colour, midnight blue.",
                  "examples": [
                    "night:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, colloquial) A night's worth of competitions, generally one game.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "night (third-person singular simple present nights, present participle nighting, simple past and past participle nighted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To spend a night (in a place), to overnight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}