{
  "word": "crackle",
  "etymologies": [
    {
      "description": [
        "From Middle English crakelen, equivalent to crack +‎ -le (frequentative suffix). The physics sense is part of a facetious sequence \"snap, crackle, pop\", after the mascots of Rice Krispies cereal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crackle (plural crackles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prolonged, frequent cracking sound; a fizzing, popping sound.",
                  "examples": [
                    "I heard a crackle from the frying pan as I was frying bacon.",
                    "There was an annoying crackle during the phone call, due to poor connection."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pottery) A style of glaze giving the impression of many small cracks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) The fifth derivative of the position vector with respect to time (after velocity, acceleration, jerk, and jounce), i.e. the rate of change of jounce.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of crackling (“crispy rind of roast pork”)",
                  "examples": [
                    "By the look on my face I must have anticipated the joy of the crackle, apparently having come to look forward to the roast pig that appeared only at gatherings such as this. I bet I asked for another piece once I was done."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crackle (third-person singular simple present crackles, present participle crackling, simple past and past participle crackled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a prolonged, frequent cracking sound which sounds like fizzing or popping.",
                  "examples": [
                    "a crackling fire"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of cackle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}