{
  "word": "wreck",
  "etymologies": [
    {
      "description": [
        "From Middle English wrek, from Anglo-Norman wrek, from Old Norse *wrek (Norwegian and Icelandic rek, Swedish vrak), from Proto-Germanic *wrekaną, whence also Old English wrecan (English wreak), Old High German rehhan, Old Saxon wrekan, Gothic 𐍅𐍂𐌹𐌺𐌰𐌽 (wrikan)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wreck (plural wrecks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something or someone that has been ruined.",
                  "examples": [
                    "He was an emotional wreck after the death of his wife.",
                    "Synonym: basket case, mess"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The remains of something that has been severely damaged or worn down.",
                  "examples": []
                }
              ]
            },
            {
              "group": "An event in which something is damaged through collision.",
              "entries": [
                {
                  "meaning": "(specifically, nautical) A shipwreck: an event in which a ship is heavily damaged or destroyed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, not countable) Goods, etc. cast ashore by the sea after a shipwreck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) A large number of birds that have been brought to the ground, injured or dead, by extremely adverse weather.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wreck (third-person singular simple present wrecks, present participle wrecking, simple past and past participle wrecked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To destroy violently; to cause severe damage to something, to a point where it no longer works, or is useless.",
                  "examples": [
                    "He wrecked the car in a collision.",
                    "That adulterous hussy wrecked my marriage!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ruin or dilapidate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Australia) To dismantle wrecked vehicles or other objects, to reclaim any useful parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To involve in a wreck; hence, to cause to suffer ruin; to balk of success, and bring disaster on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be involved in a wreck; to be damaged or destroyed.",
                  "examples": [
                    "[…]  Mrs. Marleen Ketchum was not quite certain if the train wrecked or if the volcano blew its top. It took a moment before she was certain it had to be the passenger train."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}