{
  "word": "spa",
  "etymologies": [
    {
      "description": [
        "The term is derived from the name of the Belgian town of Spa, where since medieval times illnesses caused by iron deficiency were treated by drinking chalybeate (iron-bearing) spring water. In 16th century England the old Roman ideas of medicinal bathing were revived at towns like Bath, and in 1571 William Slingsby who had been to the Belgian town (which he called Spaw) discovered a chalybeate spring in Yorkshire. He built an enclosed well at what became known as Harrogate, the first resort in England for drinking medicinal waters, then in 1596 Dr. Timothy Bright called the resort The English Spaw, beginning the use of the word Spa as a generic description rather than as the place name of the Belgian town. At first this term referred specifically to resorts for water drinking rather than bathing, but this distinction was gradually lost and many spas offer external remedies.",
        "There are various stories about the origin of the name. A Belgian spring of iron-bearing water was called Espa from the Walloon term for \"fountain\", and was used in 1326 as a cure by an iron master with such success that he founded a health resort that developed into the town, though it has been suggested that this term may be derived from the name of the resort. Some have suggested that the town's name can be ultimately sourced from Latin spargere (“to scatter, sprinkle, or moisten”), though this derivation is problematic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spa (plural spas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A health resort near a mineral spring or hot spring.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trendy or fashionable resort.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A health club.",
                  "examples": [
                    "They went to a spa for a massage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hot tub.",
                  "examples": [
                    "Their bath is fitted  with a spa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) A convenience store.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortened form of spastic"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spa (plural spas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, slang) An idiot; a gobshite",
                  "examples": [
                    "What the fuck was she talking about, he must think she's such a spa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, slang) A clumsy person (see spastic)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}