{
  "word": "lowball",
  "etymologies": [
    {
      "description": [
        "American railroad term that described one of two positions of the ball of a ball signal. Compare highball."
      ],
      "adjectives": [
        {
          "description": "lowball",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Significantly below the actual cost or value.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lowball (plural lowballs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The position of the ball on an American railroad ball signal that indicated Stop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) A form of poker in which the lowest-ranking poker hand wins the pot. Usually the ace is the lowest-ranking card, straights and flushes do not count making the best possible hand being A, 2, 3, 4, 5 regardless of suits (in contrast to deuce-to-seven lowball.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A form of cribbage in which the first to score 121 (or 61) is the loser.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unmixed alcohol drink served on ice or water in a short glass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lowball (third-person singular simple present lowballs, present participle lowballing, simple past and past participle lowballed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give an intentionally low estimate of anything, not necessarily with deceptive intent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give (a customer) a deceptively low price or cost estimate that one has no intention of honoring or to prepare a cost estimate deliberately and misleadingly low.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make an offer well below an item's true value, often to take advantage of the seller's desperation or desire to sell the item quickly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}