{
  "word": "lobby",
  "etymologies": [
    {
      "description": [
        "From Old French *lobie, from Medieval Latin lobium, lobia, laubia (“a portico, covered way, gallery”), borrowed from Frankish *laubijā (“arbour, shelter”).",
        "Related to Old English lēaf (“foliage”). More at leaf. Doublet of loggia.",
        "Political sense derives from the entrance hall of legislatures, where people traditionally tried to influence legislators because it was the most convenient place to meet them."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lobby (plural lobbies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An entryway or reception area; vestibule; passageway; corridor.",
                  "examples": [
                    "I had to wait in the lobby for hours before seeing the doctor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That part of a hall of legislation not appropriated to the official use of the assembly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) A class or group of interested people who try to influence public officials; collectively, lobbyists.",
                  "examples": [
                    "The influence of the tobacco lobby has decreased considerably in the US."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A virtual area where players can chat and find opponents for a game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) An apartment or passageway in the fore part of an old-fashioned cabin under the quarter-deck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A confined place for cattle, formed by hedges, trees, or other fencing, near the farmyard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A margin along either side of the playing field in the sport of kabaddi.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(when preceded by \"elevator\") A waiting area in front of a bank of elevators.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lobby (third-person singular simple present lobbies, present participle lobbying, simple past and past participle lobbied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To attempt to influence (a public official or decision-maker) in favor of a specific opinion or cause.",
                  "examples": [
                    "For years, pro-life groups have continued to lobby hard for restrictions on abortion."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortened from lobscouse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lobby (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(West Midlands) lobscouse",
                  "examples": [
                    "My mam cooked us lobby for tea last night."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}