{
  "word": "gay",
  "etymologies": [
    {
      "description": [
        "From Middle English gay, from Old French gai (“joyful, laughing, merry”), usually thought to be a borrowing of Old Occitan gai (“impetuous, lively”), from Gothic *𐌲𐌰𐌷𐌴𐌹𐍃 (*gaheis, “impetuous”), merging with earlier Old French jai (\"merry\"; see jay), from Frankish *gāhi; both from Proto-Germanic *ganhuz, *ganhwaz (“sudden”). This is possibly derived from Proto-Indo-European *ǵʰengʰ- (“to stride, step”), from *ǵʰēy- (“to go”), but Kroonen rejects this derivation and treats the Germanic word as having no known etymology."
      ],
      "adjectives": [
        {
          "description": "gay (comparative gayer, superlative gayest)",
          "definitionGroups": [
            {
              "group": "Homosexual:",
              "entries": [
                {
                  "meaning": "(of a person) Possessing sexual and/or romantic attraction towards people one perceives to be the same sex or gender as oneself.",
                  "examples": [
                    "Cliff is gay, but his twin brother is straight."
                  ]
                },
                {
                  "meaning": "(strictly) Describing a homosexual man.",
                  "examples": [
                    "gay and lesbian people"
                  ]
                },
                {
                  "meaning": "(of an animal, by extension) Tending to partner or mate with other individuals of the same sex.",
                  "examples": [
                    "In fact, as several letter writers to the New York Times pointed out in their response to the article, the disjuncture between these two popularized penguins shows how radically separated from each other are communities of gay people and communities of right-wing religious conservatives: if the Christian fundamentalists had looked up \"gay penguins\" or even \"penguins\" on the Internet, they would have encountered several gay penguin sites, including the story of Roy and Silo, the Central Park Zoo gay penguin couple about whom a children's book was written; the saga of the gay penguin community at a German zoo; and the campaign of Gay Penguin for President (whose slogan was \"George W. Bush talks the talk, but Gay Penguin walks the walk.\")"
                  ]
                },
                {
                  "meaning": "(of a romantic or sexual act or relationship) Between two or more persons perceived to be of the same sex or gender as each other.",
                  "examples": [
                    "Although the number of gay weddings has increased significantly, many gay and lesbian couples — like many straight couples — are not interested in getting married.",
                    "gay marriage",
                    "gay sex"
                  ]
                },
                {
                  "meaning": "(colloquial) Not heterosexual, or not cisgender: homosexual, bisexual, asexual, transgender, etc.",
                  "examples": [
                    "Coordinate term: LGBTQ"
                  ]
                },
                {
                  "meaning": "(of an institution or group) Intended for gay people, especially gay men.",
                  "examples": [
                    "She professes an undying love for gay bars and gay movies, and even admits to having watched gay porn."
                  ]
                },
                {
                  "meaning": "(slang, with for) Homosexually in love with someone.",
                  "examples": [
                    "[…]  the pirates, who are obviously totally gay for each other  […]"
                  ]
                },
                {
                  "meaning": "(slang, humorous, with for) Infatuated with something, aligning with homosexual stereotypes.",
                  "examples": [
                    "Vanilla straight guy here.  […]  Is it socially acceptable for me to good-naturedly say, \"I'm totally gay for musical theater\"?"
                  ]
                },
                {
                  "meaning": "In accordance with stereotypes of homosexual people:",
                  "examples": [
                    "This incident has become a source of much discussion, and the jury is still out on who is more gay: the guy who touched a dick or the guy who let a guy touch his dick."
                  ]
                },
                {
                  "meaning": "(loosely, of appearance or behavior) Being in accordance with stereotypes of gay people, especially gay men.",
                  "examples": []
                },
                {
                  "meaning": "(loosely, of a person, especially a man) Exhibiting appearance or behavior that accords with stereotypes of gay people, especially gay men.",
                  "examples": [
                    "This incident has become a source of much discussion, and the jury is still out on who is more gay: the guy who touched a dick or the guy who let a guy touch his dick."
                  ]
                }
              ]
            },
            {
              "group": "A pejorative:",
              "entries": [
                {
                  "meaning": "(slang, derogatory) Effeminate or flamboyant in behavior.",
                  "examples": []
                },
                {
                  "meaning": "(slang, derogatory) Used to express dislike: lame, uncool, stupid, burdensome, contemptible, generally bad.",
                  "examples": [
                    "Synonym: ghey",
                    "This game is gay; let’s play a different one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Happy, joyful, and lively.",
                  "examples": [
                    "The Gay Science"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Quick, fast.",
                  "examples": [
                    "I went a gay shack, / For it started to rain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Festive, bright, or colourful.",
                  "examples": [
                    "Pennsylvania Dutch include the plain folk and the gay folk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sexually promiscuous (of any gender), (sometimes particularly) engaged in prostitution.",
                  "examples": [
                    "As our heroes passed along the Strand, they were accosted by a hundred gay ladies, who asked them if they were good-natured. \"Devil take me!\" exclaimed Echo, \"if I know which way my ship heads; but there is not a girl in the Strand that I would touch with my gloves on.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a dog's tail) Upright or curved over the back.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Northern England, possibly obsolete) Considerable, great, large in number, size, or degree. In this sense, also in the variant gey.",
                  "examples": [
                    "As his reply was rather characteristic, I will give it : Many of them come a gay bit off."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "gay",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Northern England) Considerably, very.",
                  "examples": [
                    "And, tho' his guts ware lank and toom, / They're twice as big's this gay big room."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "gay (plural gays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly in the plural) A homosexual, especially a male homosexual.",
                  "examples": [
                    "Coordinate term: lesbian"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal, obsolete) Something which is bright or colorful, such as a picture or a flower.",
                  "examples": [
                    "At a stall soon Mary bote / A hume-book full ov gays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An ornament, a knick-knack.",
                  "examples": [
                    "If however the stranger be suspected of “sailing under false colours,\" when they are all in familiar chat about nothing in particular, “Cousin Jacky” will take occasion to say to the new chum, “My dear; ded 'e ever see a duck clunk a gay?\"  […]  no more deceived by him than a duck can be made to clunk (swallow) a gay (fragment of broken crockery)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gay (third-person singular simple present gays, present participle gaying, simple past and past participle gayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated, uncommon) To make happy or cheerful. [since at least the 1920s]",
                  "examples": [
                    "SAYING GOOD-BYE (song)",
                    "WE are always saying / \"Good-bye, good-bye! / In work, in playing, / In gloom, in gaying  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, uncommon) To cause (something, e.g. AIDS) to be associated with homosexual people. [popularized in the 1990s]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Pitman kay, which it is derived from graphically, and the sound it represents. The traditional name gee was considered inappropriate, as the Pitman letter never has the sound of that name."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gay (plural gays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The letter —, which stands for the sound /ɡ/, in Pitman shorthand.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}