{
  "word": "massacre",
  "etymologies": [
    {
      "description": [
        "1580, from Middle French massacre, from Old French macacre, marcacre, macecre, macecle (“slaughterhouse, butchery”), usually thought to be deverbal from Old French macecrer, macecler (“to slaughter”), though the noun seems to be attested somewhat earlier. It is also found in Medieval Latin mazacrium (“massacre, slaughter, killing”, also “the head of a newly killed stag”). Further origin disputed:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "massacre (countable and uncountable, plural massacres)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The killing of a considerable number (usually limited to people) where little or no resistance can be made, with indiscriminate violence, without necessity, and contrary to civilized norms.",
                  "examples": [
                    "St. Bartholomew's Day Massacre",
                    "St. Valentine's Day Massacre",
                    "Amritsar Massacre"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Murder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any overwhelming defeat, as in a game or sport.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "massacre (third-person singular simple present massacres, present participle massacring, simple past and past participle massacred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To kill in considerable numbers where little or no resistance can be made, with indiscriminate violence, without necessity, and contrary to civilized norms. (Often limited to the killing of human beings.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To win against (an opponent) very decisively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To perform (a work, such as a musical piece or a play) very poorly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, proscribed) To kill with great force or brutality.",
                  "examples": [
                    "Look how they massacred my boy."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}