{
  "word": "redact",
  "etymologies": [
    {
      "description": [
        "From Old French redacter, from Latin redactus, perfect passive participle of redigō (“drive, lead, collect, reduce”), from re- (“back”) + agō (“put in motion, drive”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "redact (third-person singular simple present redacts, present participle redacting, simple past and past participle redacted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To censor, to black out or remove parts of a document while leaving the remainder.",
                  "examples": [
                    "The military will redact the document before releasing it, blacking out sections that are classified.",
                    "The names and email addresses of the users were redacted from the public data."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To black out legally protected sections of text in a document provided to opposing counsel, typically as part of the discovery process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reduce to form, as literary matter; to digest and put in shape (matter for publication); to edit. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) To draw up or frame a decree, statement, etc. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To bring together in one unit; to combine or bring together into one. [15th–16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To gather or organize works or ideas into a unified whole; to collect, order, or write in a written document or to put into a particular written form. [15th–17th c.]",
                  "examples": [
                    "Synonym: collate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) To insert or assimilate into a written system or scheme. [16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) To bring an area of study within the comprehension capacity of a person. [17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To reduce to a particular condition or state, especially one that is undesirable. [16th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To reduce something physical to a certain form, especially by destruction. [16th–17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}