{
  "word": "cantilever",
  "etymologies": [
    {
      "description": [
        "First attested in the 1660s, probably from cant (“slope”) + lever, but the earliest form (c. 1610) was cantlapper. First element may also be Spanish can (“dog”), an architect's term for an end of timber jutting out of a wall, on which beams rested."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cantilever (plural cantilevers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A beam anchored at one end and projecting into space, such as a long bracket projecting from a wall to support a balcony.",
                  "examples": [
                    "He loved Litchfield, Sharon, Williamsburg; he preferred the Georgian, and he had theories about developing a truly American style. He was called a plodder by all the Kivis, and in turn he disliked their bleak blocks of Modernist cement, their glass-fronted hen-houses, their architectural spiders with cantilever claws."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A beam anchored at one end and used as a lever within a microelectromechanical system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figure skating) A technique, similar to the spread eagle, in which the skater travels along a deep edge with knees bent and bends their back backwards, parallel to the ice.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cantilever (third-person singular simple present cantilevers, present participle cantilevering, simple past and past participle cantilevered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To project (something) in the manner of or by means of a cantilever.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}