{
  "word": "teal",
  "etymologies": [
    {
      "description": [
        "From Middle English tele, probably from an unrecorded Old English *tǣle, cognate with West Frisian tjilling (“teal”), Middle Dutch teling (“teal”) (modern Dutch taling), Middle Low German telink, from Proto-Germanic *tailijaz, of unknown ultimate origin, with no cognates outside of Germanic. As the name of a shade of dark greenish-blue like the color patterns on the fowl's head and wings, it is attested from 1923. The Australian political sense derives from the colour teal being intermediate between green (signifying environmentalism) and blue (signifying the conservative Australian Liberal Party)."
      ],
      "adjectives": [
        {
          "description": "teal (comparative more teal, superlative most teal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a bluish-green colour",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "teal (countable and uncountable, plural teals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any of various small freshwater ducks of the genus Anas that are brightly coloured and have short necks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable and uncountable) A dark, somewhat bluish-green colour; a dark cyan.",
                  "examples": [
                    "teal:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Australia, politics, chiefly attributive) A teal independent, a politician who espouses environmentally and socially progressive but economically conservative ideas, especially in the context of a group of independent candidates who ran in the 2022 federal election.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}