{
  "word": "gauge",
  "etymologies": [
    {
      "description": [
        "From Middle English gauge, gaugen, from Anglo-Norman, Old Northern French gauger (compare Modern French jauger from Old French jaugier), from gauge (“gauging rod”), from Frankish *galga (“measuring rod, pole”), from Proto-Germanic *galgô (“pole, stake, cross”), from Proto-Indo-European *ǵʰalgʰ-, *ǵʰalg- (“perch, long switch”). Cognate with Old High German galgo, Old Frisian galga, Old English ġealga (“cross-beam, gallows”), Old Norse galgi (“cross-beam, gallows”), Old Norse gelgja (“pole, perch”). Doublet of gallows."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gauge (countable and uncountable, plural gauges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A measure; a standard of measure; an instrument to determine dimensions, distance, or capacity; a standard",
                  "examples": [
                    "the gauge and dimensions of misery, depression, and contempt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of measuring.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An estimate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any instrument for ascertaining or regulating the level, state, dimensions or forms of things",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thickness of sheet metal or wire designated by any of several numbering schemes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) Ellipsis of track gauge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) Ellipsis of loading gauge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, mathematical analysis) A semi-norm; a function that assigns a non-negative size to all vectors in a vector space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(knitting) The number of stitches per inch, centimetre, or other unit of distance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Relative positions of two or more vessels with reference to the wind.",
                  "examples": [
                    "A vessel has the weather gauge of another when on the windward side of it, and the lee gauge when on the lee side of it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The depth to which a vessel sinks in the water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plastering) The quantity of plaster of Paris used with common plaster to make it set more quickly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That part of a shingle, slate, or tile, which is exposed to the weather, when laid; also, one course of such shingles, slates, or tiles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) A unit of measurement which describes how many spheres of bore diameter of a shotgun can be had from one pound of lead; 12 gauge is roughly equivalent to .75 caliber.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, by extension) A shotgun (synecdoche for 12 gauge shotgun, the most common chambering for combat and hunting shotguns).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tunnel-like ear piercing consisting of a hollow ring embedded in the lobe.",
                  "examples": [
                    "Synonym: ear gauge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Cannabis.",
                  "examples": [
                    "[…]  smoking gauge was a new phenomenon to Himes: “When I looked up after turning the corner, all the grimy facades seemed to be a blaze of bright colors, gold, scarlet, blue, green, like an array of peacocks.  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gauge (third-person singular simple present gauges, present participle gauging, simple past and past participle gauged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To measure or determine with a gauge; to measure the capacity of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To estimate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To appraise the character or ability of; to judge of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textile, transitive) To draw into equidistant gathers by running a thread through it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mix (a quantity of ordinary plaster) with a quantity of plaster of Paris.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To chip, hew or polish (stones, bricks, etc) to a standard size and/or shape.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}