{
  "word": "insight",
  "etymologies": [
    {
      "description": [
        "From Middle English insight, insiht (“insight, mental vision, intelligence, understanding”), equivalent to in- +‎ sight. Perhaps continuing Old English insiht (“narrative, argument, account”), from Proto-Germanic *insahtiz (“account, narrative, argument”). Compare West Frisian ynsjoch (“insight”), Dutch inzicht (“insight, awareness, view, opinion”), German Low German Insicht (“insight”), German Einsicht (“insight, knowledge, perception, understanding”), Danish indsigt (“insight”), Swedish insikt (“insight”), Icelandic innsýn (“insight”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "insight (countable and uncountable, plural insights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sight or view of the interior of anything; a deep inspection or view; introspection; frequently used with into.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Power of acute observation and deduction",
                  "examples": [
                    "Synonyms: penetration, discernment, perception"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marketing) Knowledge (usually derived from consumer understanding) that a company applies in order to make a product or brand perform better and be more appealing to customers",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Intuitive apprehension of the inner nature of a thing or things; intuition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(artificial intelligence) An extended understanding of a subject resulting from identification of relationships and behaviors within a model, context, or scenario.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychiatry) An individual's awareness of the nature and severity of one's mental illness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}