{
  "word": "originalist",
  "etymologies": [
    {
      "description": [
        "original +‎ -ist"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "originalist (plural originalists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who has, or tends to have, original ideas.",
                  "examples": [
                    "It seems to us, however, according to the rate at which novels have lately been published, that unless some great reformer or originalist shall, establish a new school, or unless some new principle of concoction be employed, by which the appetite for fresh stimulants may be satisfied, novel readers must soon become insensible to the charms of fiction,  […]"
                  ]
                }
              ]
            },
            {
              "group": "One who aims to discover how the writers of a document intended it to be interpreted, and to interpret it in that way.",
              "entries": [
                {
                  "meaning": "(theology) Specifically, one who aims to discover how the writers of the Jewish and Christian scriptures intended them to be interpreted, and to interpret them in that way.",
                  "examples": [
                    "Before explicating the possibility of a non-textualist strategy let me address Philipse's arguments in favour of textualism as appropriate method in theology. Some of these arguments appeal to the religious traditions, and thus suggest that a believer qua believer (rather than qua historian) has to be originalist."
                  ]
                },
                {
                  "meaning": "(US) Specifically, one who aims to discover how the writers of the United States Constitution intended it to be interpreted, and to interpret it in that way.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}