{
  "word": "soothe",
  "etymologies": [
    {
      "description": [
        "From Middle English sothen (“to verify, prove the validity of”), from Old English sōþian (“to verify, prove, confirm, bear witness to”), from Proto-West Germanic *sanþōn, from Proto-Germanic *sanþōną (“to prove, certify, acknowledge, testify”), from Proto-Indo-European *h₁es- (“to be”). Cognate with Danish sande (“to verify”), Swedish sanna (“to verify”), Icelandic sanna (“to verify”). See also: sooth."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "soothe (third-person singular simple present soothes, present participle soothing, simple past and past participle soothed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To restore to ease, comfort, or tranquility; relieve; calm; quiet; refresh.",
                  "examples": [
                    "Yet Wayne Rooney scored at a good time, three minutes after the restart, to soothe any gathering nerves and the night can ultimately be chalked off as one of the finest occasions of Hodgson's 17 months in the job."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allay; assuage; mitigate; soften.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To smooth over; render less obnoxious.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To calm or placate someone or some situation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ease or relieve pain or suffering.",
                  "examples": [
                    "I am a cider drinker, I drinks it all of the dayI am a cider drinker, it soothes all me troubles away"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To temporise by assent, concession, flattery, or cajolery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bring comfort or relief.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep in good humour; wheedle; cajole; flatter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To prove true; verify; confirm as true.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To confirm the statements of; maintain the truthfulness of (a person); bear out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To assent to; yield to; humour by agreement or concession.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}