{
  "word": "defy",
  "etymologies": [
    {
      "description": [
        "From Old French desfier, from Vulgar Latin *disfidare (“renounce one's faith”), from Latin dis- (“away”) + fidus (“faithful”). Meaning shifted in the 14th century from \"be disloyal\" to \"challenge\". Contrast confide, fidelity, faith."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "defy (plural defies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A challenge.",
                  "examples": [
                    "And, safe intrench'd within, her foes without defies"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "defy (third-person singular simple present defies, present participle defying, simple past and past participle defied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To challenge (someone) or brave (a hazard or opposition).",
                  "examples": [
                    "to defy an enemy;   to defy the power of a magistrate;   to defy the arguments of an opponent;   to defy public opinion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To refuse to obey.",
                  "examples": [
                    "If you defy your teacher you may end up in detention."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To not conform to or follow a pattern, set of rules or expectations.",
                  "examples": [
                    "By tossing this nineteenth electron back and forth between its own orbit and that of its lost companion more than twenty-five thousand times a second, a mutilated stone atom is able partially to defy gravity and thus successfully to ride the emerging streams of light and energy, the sunbeams, to liberty and adventure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To renounce or dissolve all bonds of affiance, faith, or obligation with; to reject, refuse, or renounce.",
                  "examples": [
                    "For thee I have defied my constant mistress."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}