{
  "word": "reckon",
  "etymologies": [
    {
      "description": [
        "From Middle English rekenen, from Old English recenian (“to pay; arrange, dispose, reckon”) and ġerecenian (“to explain, recount, relate”); both from Proto-West Germanic *rekanōn (“to count, explain”), from Proto-West Germanic *rekan (“swift, ready, prompt”), from Proto-Indo-European *h₃reǵ- (“to make straight or right”).",
        "Cognate with Scots rekkin (“to ennumerate, mention, narrate, rehearse, count, calculate, compute”), Saterland Frisian reekenje (“to calculate, figure, reckon”), West Frisian rekkenje (“to account, tally, calculate, figure”), Dutch rekenen (“to count, calculate, reckon”), German Low German reken (“to reckon”), German rechnen (“to count, reckon, calculate”), Swedish räkna (“to count, calculate, reckon”), Icelandic reikna (“to calculate”), Latin rectus (“straight, right”). See also reck, reach."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "reckon (third-person singular simple present reckons, present participle reckoning, simple past and past participle reckoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To count; to enumerate; to number; also, to compute; to calculate.",
                  "examples": [
                    "I reckoned above two hundred and fifty on the outside of the church."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To count as in a number, rank, or series; to estimate by rank or quality; to place by estimation; to account; to esteem; to repute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To charge, attribute, or adjudge to one, as having a certain quality or value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) To conclude, as by an enumeration and balancing of chances; hence, to think; to suppose; -- followed by an objective clause",
                  "examples": [
                    "I reckon he won't try that again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reckon with something or somebody or not, i.e to reckon without something or somebody: to take into account, deal with, consider or not, i.e. to misjudge, ignore, not take into account, not deal with, not consider or fail to consider; e.g. reckon without one's host",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make an enumeration or computation; to engage in numbering or computing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To come to an accounting; to draw up or settle accounts; to examine and strike the balance of debt and credit; to adjust relations of desert or penalty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reckon (plural reckons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) Alternative form of rackan (“chain”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}