{
  "word": "switchback",
  "etymologies": [
    {
      "description": [
        "The noun is derived from switch (“to turn (a train) from one railway track to another using a switch”, verb) +‎ back (“so as to reverse direction and return”, adverb).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "switchback (plural switchbacks) (often attributively or figuratively)",
          "definitionGroups": [
            {
              "group": "(rail transport)",
              "entries": [
                {
                  "meaning": "A railway track on a steep slope in a zigzag formation, in which a train travels in a reverse direction at each switch. [from mid to late 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A railway track on which there are steep ascents and descents, a train moving partially or fully by the force of gravity using the momentum generated when descending to travel up an ascending part of the track; especially (Britain, dated), such a track built for fun rides at an amusement park; a type of rollercoaster.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(aviation) A flight path consisting of a series of steep ascents and descents, generally flown as a stunt.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Britain) A path or road having a series of steep ascents and descents.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Canada, US, road transport) A sharp bend in a path or road which causes a traveller to almost reverse their direction of travel, especially one of a series of such bends on an incline; a hairpin bend; also a path or road having such a series of bends.",
                  "examples": [
                    "Coordinate term: horseshoe curve"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "switchback (third-person singular simple present switchbacks, present participle switchbacking, simple past and past participle switchbacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take a zigzag course or path.",
                  "examples": [
                    "Synonym: zigzag"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}