{
  "word": "churl",
  "etymologies": [
    {
      "description": [
        "From Middle English churl, cherl, cheorl (“person not of the nobility or clergy; bondsman, serf, villein; peasant; (also figuratively) servant, slave; unlearned or unrefined person, boor, ignoramus; chap, fellow, man; husband”) [and other forms], from Old English ċeorl (“freeman ranking below a þegn but above a thrall; commoner, peasant; countryman, husbandman; man; husband”), from Proto-West Germanic *kerl, from Proto-Germanic *karilaz (“elder; man”), from Proto-Indo-European *ǵerh₂- (“to grow old; to mature”). Doublet of carl, carle.",
        "Sense 2.1 (“rough, surly, ill-bred person”) is probably an extension of sense 1 (“free peasant of the lowest rank; person without royal or noble status; bondman, serf”) and sense 2.2 (“countryman, peasant, rustic”). Sense 2.3 (“person who is stingy”) was influenced by Nabal, who is described in the King James Version of the Bible as “churlish and evil in his doings”; when Nabal, a rich man, is asked to give provisions to David’s men, he replies, “Who is David? and who is the son of Jesse? There be many servants nowadays that break away every man from his master. Shall I then take my bread and my water, and my flesh that I have killed for my shearers, and give it unto men, whom I know not whence they be?” (1 Samuel 25:3 and 10–11; spelling modernized)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "churl (plural churls)",
          "definitionGroups": [
            {
              "group": "(feudalism, obsolete except historical)",
              "entries": [
                {
                  "meaning": "A free peasant (as opposed to a serf) of the lowest rank, below an earl and a thane; a freeman; also (more generally), a person without royal or noble status; a commoner.",
                  "examples": []
                },
                {
                  "meaning": "A bondman or serf.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(derogatory) A rough, surly, ill-bred person; a boor. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(archaic) A countryman, a peasant, a rustic.",
                  "examples": [
                    "Synonym: carl"
                  ]
                },
                {
                  "meaning": "(archaic) A person who is stingy, especially with money; a selfish miser, a niggard.",
                  "examples": [
                    "Synonym: (Scotland, obsolete) carl"
                  ]
                },
                {
                  "meaning": "(Theodism) A freedman, ranked below a thane but above a thrall.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}