{
  "word": "agreement",
  "etymologies": [
    {
      "description": [
        "From Middle English agrement, agreement, from Old French agrement, agreement. Morphologically agree +‎ -ment."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "agreement (countable and uncountable, plural agreements)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An understanding between entities to follow a specific course of conduct.",
                  "examples": [
                    "Coordinate term: conspiracy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A state whereby several parties share a view or opinion; the state of not contradicting one another.",
                  "examples": [
                    "The results of my experiment are in agreement with those of Michelson and with the law of General Relativity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, law) A legally binding contract enforceable in a court of law.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, linguistics, grammar) Rules that exist in many languages that force some parts of a sentence to be used or inflected differently depending on certain attributes of other parts.",
                  "examples": [
                    "Having clarified what we mean by ‘Personʼ and ‘Numberʼ, we can now return to our earlier observation that a finite I is inflected not only for Tense, but also for Agreement. More particularly, I inflects for Person and Number, and must ‘agreeʼ with its Subject, in the sense that the Person/Number features of I must match those of the Subject."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, chiefly in the plural) An agreeable quality.",
                  "examples": [
                    "Her nymph-like features such agreements have / That I could venture with her to the grave [...]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}