{
  "word": "wort",
  "etymologies": [
    {
      "description": [
        "From Middle English wort, wurt, wyrte (“any herb or plant; herb or plant used as food or medicine; (specifically) cabbage or vegetable of the genus Brassica; (chiefly plural) dish of cooked vegetables”) [and other forms], from Old English wyrt (“a plant; vegetable; herb, spice”) [and other forms], from Proto-West Germanic *wurti (“a root; a spice”), from Proto-Germanic *wrōts (“a root”), from Proto-Indo-European *wréh₂ds (“a root”). Doublet of root and related to orchard."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wort (plural worts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or historical) Now chiefly as the second element in the names of plants: a plant used for food or medicine.",
                  "examples": [
                    "(food): Synonyms: herb, potherb, vegetable",
                    "(medicine): Synonym: herb"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically, historical) Chiefly in the plural: a plant of the genus Brassica used as a vegetable; a brassica; especially, a cabbage (Brassica oleracea).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, botany) A non-vascular plant growing on land from the division Anthocerotophyta (the hornworts) or Marchantiophyta (liverworts); an anthocerotophyte or marchantiophyte.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English wort, worte (“infusion of grain (probably malted barley) for brewing ale or beer; unfermented or incompletely fermented beer; infusion of honey and water for making mead; unfermented decoction or infusion of other substances used for food or medicine”) [and other forms], from Old English wurt, wyrt, wyrte (“wort in brewing”), from a merger of Proto-West Germanic *wurtiju (“wort in brewing; seasoning, spice”) and *wurti (“root; spice”), both ultimately from Proto-Germanic *wrōts (“a root”): see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wort (countable and uncountable, plural worts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(brewing, distilling) Also worts: a liquid extracted from mash (ground malt or some other grain soaked in hot water), which is then distilled to make beer or a malt liquor such as whisky.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}