{
  "word": "jackal",
  "etymologies": [
    {
      "description": [
        "From French chacal, chacale, checale, schakal, ciacale, from Turkish çakal, from Persian شغال‎ (šağâl), borrowed from  Sanskrit शृगाल (śṛgāla, “jackal”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jackal (plural jackals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of certain wild canids of the genera Lupulella and Canis, native to the tropical Old World and smaller than a wolf.",
                  "examples": [
                    "In passing, it also mentions how the jackal and the tiger acquired their reddish spots. All of the animals referred to, except the deer, have tricksterlike personalities, both in this tale and in other story contexts. But the jackal is the most renowned of all for roguishness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who performs menial/routine tasks, a dogsbody.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A person who behaves in an opportunistic way; especially a base collaborator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, rare) A jack (the playing card).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby union) A player who steals the ball at the tackle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jackal (third-person singular simple present jackals, present participle jackalling, simple past and past participle jackalled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perform menial or routine tasks",
                  "examples": [
                    "They have jackalled for the great beast, to pick in turns the bones of each other; they have subserved those above, to oppress and defraud those below; and they are suffering, and, so far as classes can, justly suffering their purgation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}