{
  "word": "cabinet",
  "etymologies": [
    {
      "description": [
        "From cabin +‎ -et, influenced by French cabinet.\nIn sense of “a government group”, compare salon, also named for a room used to gather."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cabinet (plural cabinets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A storage closet either separate from, or built into, a wall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cupboard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The upright assembly that houses a coin-operated arcade game, a cab.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A size of photograph, specifically one measuring 3⅞\" by 5½\".",
                  "examples": [
                    "Holmes took a note of it. “One other question,” said he. “Was the photograph a cabinet?”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of advisors to a government or business entity.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(politics, often capitalized) In parliamentary and some other systems of government, the group of ministers responsible for creating government policy and for overseeing the departments comprising the executive branch.",
              "entries": [
                {
                  "meaning": "(Kentucky) A cabinet-level agency in the executive branch; that is, an agency headed by a member of the governor's cabinet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A small chamber or private room.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often capitalized) A collection of art or ethnographic objects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal, Rhode Island) Milkshake.",
                  "examples": [
                    "One of Rhode Island's most famous beverages is the Awful Awful, an enormous 32-ounce, rich, creamy milk shake sold at the Newport Creamery stores, a soda fountain and casual restaurant chain. This ultra-thick cabinet is \"awful big and awful good,\" thus the name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A hut; a cottage; a small house.",
                  "examples": [
                    "Hearken a while from thy green cabinet, / The rural song of careful Colinet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enclosure for mechanical or electrical equipment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}