{
  "word": "tranche",
  "etymologies": [
    {
      "description": [
        "Borrowed from French tranche, form of trancher (“to cut, to slice”), from Old French trenchier (“cut, make a cut”), possibly from Vulgar Latin *trinicāre (“cut in three parts”). Doublet of traunch and trench."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tranche (plural tranches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slice, section or portion.",
                  "examples": [
                    "Servants, carrying huge baskets suspended before them in which were huge tranches of bread, speedily distributed the contents; and they were followed by others bearing huge cans of milk, hot and cold."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(insurance) A distinct subdivision of a single policyholder's benefits, typically relating to separate premium increments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pensions) A pension scheme's or scheme member's benefits relating to distinct accrual periods with different rules.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) One of a set of classes or risk maturities that compose a multiple-class security, such as a CMO or REMIC; a class of bonds. Collateralized mortgage obligations are structured with several tranches of bonds that have various maturities.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tranche (third-person singular simple present tranches, present participle tranching, simple past and past participle tranched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, transitive) To divide into tranches.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}