{
  "word": "elbow",
  "etymologies": [
    {
      "description": [
        "From Middle English elbowe, from Old English elboga, elnboga (“elbow”), from Proto-Germanic *alinabugô (“elbow”), equivalent to ell +‎ bow. Cognate with Scots elbuck (“elbow”), Saterland Frisian Älbooge (“elbow”), Dutch elleboog (“elbow”), Low German Ellebage (“elbow”), German Ellbogen, Ellenbogen (“elbow”), Danish albue (“elbow”), Icelandic olbogi, olnbogi (“elbow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "elbow (plural elbows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The joint between the upper arm and the forearm.",
                  "examples": [
                    "Synonym: elbow joint"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any turn or bend like that of the elbow, in a wall, building, coastline, etc.; an angular or jointed part of any structure, such as the raised arm of a chair or sofa, or a short pipe fitting, turning at an angle or bent.",
                  "examples": [
                    "the sides of windows, where the jamb makes an elbow with the window back"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated, early 20th-century slang) A detective.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) Part of a basketball court located at the intersection of the free-throw line and the free-throw lane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hit with the elbow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(knots) Two nearby crossings of a rope.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "elbow (third-person singular simple present elbows, present participle elbowing, simple past and past participle elbowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To push with the elbow or elbows; to forge ahead using the elbows to assist.",
                  "examples": [
                    "He elbowed his way through the crowd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To nudge, jostle or push.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, with \"out\" or \"aside\") To make someone quit or lose their job so that someone else can get it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}