{
  "word": "runout",
  "etymologies": [
    {
      "description": [
        "run +‎ out."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "runout (countable and uncountable, plural runouts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that has been run out.",
                  "examples": [
                    "The landslide had a long runout.",
                    "The freeway guardrail runout around this object is shorter than recommended."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A run out, a running out. The method of getting out in which a batsman, in making a run, has not reached the popping crease when a fielder breaks his wicket with the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(skiing) A relatively flat portion at the end of a ski run to slow down, or to connect trails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(skiing) Slowing down at the end of a ski run, skiing on a runout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The end portion of the groove of a phonographic record, after the recorded sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A supposed auction employing shill bidders in order to convince legitimate buyers to purchase worthless articles.",
                  "examples": [
                    "There is a lot of trouble in Petticoat Lane. In fact, the mock auction boys have muscled in to such an extent on the bomb damaged ground that there is a danger that Petticoat Lane may lose its good name by the boys coming in now with the \"runouts\" to make quick profits and then get out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanical engineering) Deviation of the axis of rotation of a rotating object (especially a milling cutter or workpiece) relative to that object's centerline; the specific amount of deviation.",
                  "examples": [
                    "We determined that inaccuracy was caused by a large amount of tool runout."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}