{
  "word": "carbonado",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Spanish carbonada (“carbonized”) (from carbonar (“to carbonize”)) + -ado (suffix forming past participles of regular verbs ending in -ar). Carbonada appears to have been modelled after Italian carbonata (“coal pile; stew of beef in red wine”), from carbone (“coal; charcoal”) (from Latin carbō (“coal; charcoal”), from Proto-Indo-European *ker- (“to burn”)) + -ata.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carbonado (plural carbonados or carbonadoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking, dated) Meat or fish that has been scored and broiled.",
                  "examples": [
                    "Synonym: carbonade"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "carbonado (third-person singular simple present carbonados, present participle carbonadoing, simple past and past participle carbonadoed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated, also figuratively) To make a carbonado of; to score and broil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To cut or hack, as in combat.",
                  "examples": [
                    "Synonym: slash"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Portuguese carbonado (“carbonized”), probably from carbono (“carbon”) (currently only attested later than carbonado) + -ado (suffix forming adjectives from nouns meaning ‘something or someone who has suffered the action’). Carbono is borrowed from French carbone (“carbon”), from Latin carbō (“coal; charcoal”); for further derivation, see etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carbonado (plural carbonados or carbonadoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mineralogy) A dark, non-transparent, impure form of polycrystalline diamond (also containing graphite and amorphous carbon) used in drilling.",
                  "examples": [
                    "Synonym: black diamond"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}