{
  "word": "baggage",
  "etymologies": [
    {
      "description": [
        "From Middle English bagage, from Old French bagage, baguage, from bague (“bundle, sack”), from Germanic (compare English bag)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "baggage (usually uncountable, plural baggages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Portable cases, large bags, and similar equipment for manually carrying, pushing, or pulling personal items while traveling",
                  "examples": [
                    "Please put your baggage in the trunk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, informal) Factors, especially psychological ones, which interfere with a person's ability to function effectively.",
                  "examples": [
                    "This person has got a lot of emotional baggage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, countable, derogatory) A woman.",
                  "examples": [
                    "However, terrible as it may seem to the tall maiden sisters of J.P.'s in Queen Anne houses with walled vegetable gardens, this courtesan, strumpet, harlot, whore, punk, fille de joie, street-walker, this trollop, this trull, this baggage, this hussy, this drab, skit, rig, quean, mopsy, demirep, demimondaine, this wanton, this fornicatress, this doxy, this concubine, this frail sister, this poor Queenie--did actually solicit me, did actually say 'coming home to-night, dearie' and my soul was not blasted enough to call a policeman."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, countable (obsolete) and uncountable) An army's portable equipment; its baggage train.",
                  "examples": [
                    "In Poland, for example, the unknown Bolesław Bierut, who appeared in 1944 in the baggage of the Red Army, and who played a prominent role as a ‘non-party figure’ in the Lublin Committee, turned out to be a Soviet employee formerly working for the Comintern."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}