{
  "word": "one",
  "etymologies": [
    {
      "description": [
        "From Middle English oon, on, oan, an, from Old English ān (“one”), from Proto-West Germanic *ain, from Proto-Germanic *ainaz (“one”), from Proto-Indo-European *óynos (“single, one”).",
        "Cognate with Scots ae, ane, wan, yin (“one”); North Frisian ån (“one”); Saterland Frisian aan (“one”); West Frisian ien (“one”); Dutch een, één (“one”); German Low German een; German ein, eins (“one”); Danish en (“one”); Swedish en (“one”); Norwegian Nynorsk ein (“one”), Icelandic einn (“one”); Latin ūnus (“one”) (Old Latin oinos); Russian оди́н (odín). Doublet of a, an, and Uno.",
        "Use as indefinite personal pronoun influenced by unrelated French on.",
        "Verb form from Middle English onen."
      ],
      "adjectives": [
        {
          "description": "one (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a period of time, being particular.",
                  "examples": [
                    "One day the prince set forth to kill the dragon that had brought terror to his father’s kingdom for centuries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being a single, unspecified thing; a; any.",
                  "examples": [
                    "My aunt used to say, \"One day is just like the other.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sole, only.",
                  "examples": [
                    "He is the one man who can help you.",
                    "The one male audience member at the concert is invited on stage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Whole, entire.",
                  "examples": [
                    "Body and soul are not separate; they are one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In agreement.",
                  "examples": [
                    "We are one on the importance of learning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The same.",
                  "examples": [
                    "The two types look very different, but are one species."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being a preeminent example.",
                  "examples": [
                    "He is one hell of a guy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being an unknown person with the specified name; see also \"a certain\".",
                  "examples": [
                    "The town records from 1843 showed the overnight incarceration of one “A. Lincoln”."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "one (plural ones)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The digit or figure 1.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The neutral element with respect to multiplication in a ring.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A one-dollar bill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One o'clock, either a.m. or p.m.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) One run scored by hitting the ball and running between the wickets; a single.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A joke or amusing anecdote.",
                  "examples": [
                    "Did you hear the one about the agnostic dyslexic insomniac?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A particularly special or compatible person or thing.",
                  "examples": [
                    "I knew as soon I met him that John was the one for me and we were married within a month.",
                    "That car's the one — I'll buy it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) (euphemistic or derogatory) A gay person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang, leetspeak, sarcastic) Used instead of ! to amplify an exclamation, parodying unskilled typists who forget to press the shift key while typing exclamation points, thus typing \"1\".",
                  "examples": [
                    "A: SUM1 Hl3p ME im alwyz L0ziN!1!?1!Someone help me; I'm always losing!?",
                    "B: y d0nt u just g0 away l0zer!!1!!one!!one!!eleven!!1!Why don't you just go away loser!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "one (third-person singular simple present ones, present participle oning, simple past and past participle oned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause to become one; to gather into a single whole; to unite.",
                  "examples": [
                    "Toldyng of temporell ordinaunce, assembled and oned in the lokyng of the Divine thoughte"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Analogous to several senses of Min Nan ê and Mandarin 的 (de, declarative particle, nominalizer, etc.); it is likely that one originated as a semantic loan from Min Nan ê. Its association with English one might have stemmed from the apparent similarity between one as a prop-word (e.g. the green one) and 的 / --ê as a nominalizer (e.g. 青色的 (chheⁿ-sek--ê, “the green one; green ones”)). Compare Cantonese 嘅 (ge3)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}