{
  "word": "gingerly",
  "etymologies": [
    {
      "description": [
        "The adverb is possibly derived from Anglo-Norman gençur and Old French gençor, gensor (“more beautiful; more polite”) [and other forms] + English -ly (suffix forming adverbs). Gençor is the comparative form of gent (“beautiful, fair, handsome; high-born, noble; of a person: pleasant, polite; of language: courteous, eloquent; courteously; elegantly, tastefully”), from Late Latin *gentus, a variant of Latin genitus (“(well-)begotten”), the perfect passive participle of gignō (“to bear, beget, give birth to; to cause, produce, yield”), ultimately from Proto-Indo-European *ǵenh₁- (“to beget, give birth to; to produce”).",
        "The Oxford English Dictionary notes there is a gap of a few centuries in written works between the Anglo-Norman and Old French words which date from the 12th century, and the modern French word which is only attested after the end of the 13th century. Thus, if the modern English word is derived from the Anglo-Norman and Old French words, it must have been transmitted orally or in writings now lost, perhaps as a technical term in dancing.",
        "The adjective is derived from the adverb, possibly because -ly is also a suffix forming adjectives."
      ],
      "adjectives": [
        {
          "description": "gingerly (comparative more gingerly, superlative most gingerly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Often of movements: very careful, cautious, or delicate.",
                  "examples": [
                    "Synonyms: (chiefly Britain, regional, Canada, US) ginger, gingerish, tentative, wary"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Often of a person or the way they move: dainty, delicate; also, excessively delicate; affected, mincing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "gingerly (comparative more gingerly, superlative most gingerly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a cautious and delicate manner; (very) carefully or cautiously.",
                  "examples": [
                    "Synonyms: (chiefly Britain, regional, Canada, US) ginger, tentatively, warily",
                    "He placed the glass jar gingerly on the concrete step."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Chiefly of dancing or walking: done with small, dainty steps; daintily; also, with excessive delicacy; affectedly, mincingly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}