{
  "word": "gudgeon",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Late Middle English gojoun [and other forms], from Old French gojon, goujon (“gudgeon”), from Late Latin gōbiōnem, the accusative of gōbiō, the augmentative of Latin gōbius (“gudgeon”), from Ancient Greek κωβῐός (kōbiós, “fish of the gudgeon kind”), probably of Semitic origin. The English word is a doublet of goby and goujon.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gudgeon (plural gudgeons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small freshwater fish, Gobio gobio, that is native to Eurasia.",
                  "examples": [
                    "Synonyms: goby, (Britain, dialectal) wapper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) Cottus bairdii, more widely known as mottled sculpin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) Any of various similar small fish of the family Eleotridae, often used as bait.",
                  "examples": [
                    "Synonym: sleeper goby"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Other fish, similar in appearance, principally in families Butidae and Eleotridae, but also in others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, archaic) A person apt to take the bait; one easily cheated or duped; also, an idiot.",
                  "examples": [
                    "Synonyms: see Thesaurus:dupe, Thesaurus:idiot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, archaic) Something used to lure or tempt; bait, a lure.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gudgeon (third-person singular simple present gudgeons, present participle gudgeoning, simple past and past participle gudgeoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To deprive (someone) fraudulently; to cheat, to dupe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To take the bait; to be defrauded or duped.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gojoun (“metal fitting with a ring at one end”) [and other forms], from Old French goujon (“dowel; pin”) [and other forms], from gouge (“gouge (tool)”) + -on (suffix forming diminutives). Gouge is derived from Late Latin gulbia, gubia (“chisel”), ultimately from Proto-Celtic *gulbā, *gulbīnos (“beak, bill”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gudgeon (plural gudgeons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also attributively) A circular or cylindrical fitting, often made of metal, into which a pin or pintle fits to create a hinge or pivoting joint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, specifically) In a vessel with a stern-mounted rudder: the fitting into which the pintle of the rudder fits, allowing the rudder to swing freely.",
                  "examples": [
                    "Synonym: brace"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}