{
  "word": "forge",
  "etymologies": [
    {
      "description": [
        "From Middle English forge, from Old French forge, early Old French faverge, from Latin fabrica (“workshop”), from faber (“workman in hard materials, smith”) (genitive fabri). Cognate with Franco-Provençal favèrge."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "forge (plural forges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A furnace or hearth where metals are heated prior to hammering them into shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A workshop in which metals are shaped by heating and hammering them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of beating or working iron or steel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A Web-based collaborative platform for developing and sharing software.",
                  "examples": [
                    "If the project uses a forge like GitLab, GitHub, or BitBucket, it can be very easy to search all past commit logs  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English forgen, from Anglo-Norman forger and Old French forgier, from Latin fabrico (“to frame, construct, build”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "forge (third-person singular simple present forges, present participle forging, simple past and past participle forged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metallurgy) To shape a metal by heating and hammering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form or create with concerted effort.",
                  "examples": [
                    "The politician's recent actions are an effort to forge a relationship with undecided voters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To create a forgery of; to make a counterfeit item of; to copy or imitate unlawfully.",
                  "examples": [
                    "He had to forge his ex-wife's signature.  The jury learned the documents had been forged."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make falsely; to produce, as that which is untrue or not genuine; to fabricate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Make way, move ahead, most likely an alteration of force, but perhaps from forge (n.), via notion of steady hammering at something. Originally nautical, in reference to vessels."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "forge (third-person singular simple present forges, present participle forging, simple past and past participle forged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often as forge ahead) To move forward heavily and slowly (originally as a ship); to advance gradually but steadily; to proceed towards a goal in the face of resistance or difficulty.",
                  "examples": [
                    "The party of explorers forged through the thick underbrush.",
                    "We decided to forge ahead with our plans even though our biggest underwriter backed out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes as forge ahead) To advance, move or act with an abrupt increase in speed or energy.",
                  "examples": [
                    "With seconds left in the race, the runner forged into first place."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}