{
  "word": "mother",
  "etymologies": [
    {
      "description": [
        "From Middle English moder, from Old English mōdor, from Proto-Germanic *mōdēr, from Proto-Indo-European *méh₂tēr. Superseded non-native Middle English mere (“mother”) borrowed from Old French mere (“mother”). Doublet of mater.",
        "Some have proposed that the \"dregs\" sense is from Middle Dutch modder (“filth”), from Proto-Germanic *muþraz (“sediment”), but modder is not known in this meaning. On the other hand, words for \"mother\" have developed the secondary sense of \"dregs\" in several Romance and Germanic languages; compare Dutch moer, French mère de vinaigre, German Essigmutter, Italian madre, Medieval Latin māter, and Spanish madre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mother (plural mothers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female parent, sometimes especially a human; a female who parents a child (which she has given birth to, adopted, or fostered).",
                  "examples": [
                    "I am visiting my mother today.",
                    "The lioness was a mother of four cubs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female who has given birth to a baby; this person in relation to her child or children.",
                  "examples": [
                    "My sister-in-law has just become a mother for the first time.",
                    "He had something of his mother in him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pregnant female, possibly as a shortened form of mother-to-be; a female who gestates a baby.",
                  "examples": [
                    "Nutrients and oxygen obtained by the mother are conveyed to the fetus."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female who donates a fertilized egg or donates a body cell which has resulted in a clone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A female ancestor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A source or origin.",
                  "examples": [
                    "The Mediterranean was mother to many cultures and languages."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is the greatest or most significant of its kind. (See mother of all.)",
                  "examples": [
                    "The great duel, the mother of all battles has begun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, when followed by a surname) A title of respect for one's mother-in-law.",
                  "examples": [
                    "Mother Smith, meet my cousin, Doug Jones."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A term of address for one's wife.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any elderly woman, especially within a particular community.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any person or entity which performs mothering.",
                  "examples": [
                    "The inhabitants of the villages ceased, they ceased in Israel, until that I Deborah arose, that I arose a mother in Israel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dregs, lees; a stringy, mucilaginous or film- or membrane-like substance (consisting of acetobacters) which develops in fermenting alcoholic liquids (such as wine, or cider), and turns the alcohol into acetic acid with the help of oxygen from the air.",
                  "examples": [
                    "pieces of mother, adding mother to vinegar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A locomotive which provides electrical power for a slug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The principal piece of an astrolabe, into which the others are fixed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The female superior or head of a religious house; an abbess, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Hysterical passion; hysteria; the uterus.",
                  "examples": [
                    "T.V. dicusseth tumors and mollifieth them, helps inflammations, rising of the mother and the epilepsie being burnt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A disc produced from the electrotyped master, used in manufacturing phonograph records.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English modren, from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "mother (third-person singular simple present mothers, present participle mothering, simple past and past participle mothered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly transitive) To give birth to or produce (as its female parent) a child. (Compare father.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat as a mother would be expected to treat her child; to nurture.",
                  "examples": [
                    "She had seen fewer years than any of us, but she was of such superb Evehood and simplicity that she mothered us from the beginning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to contain mother (“that substance which develops in fermenting alcohol and turns it into vinegar”).",
                  "examples": [
                    "mothered oil, mothered vinegar, mothered wine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of an alcohol) To develop mother.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of motherfucker"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mother (plural mothers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, mildly vulgar, slang) Motherfucker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, colloquial) A striking example.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Coined from moth by analogy to mouser."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mother (plural mothers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of moth-er",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}