{
  "word": "paste",
  "etymologies": [
    {
      "description": [
        "From Middle English paste, from Old French paste (modern pâte), from Late Latin pasta, from Ancient Greek πάστα (pásta). Doublet of pasta and patty."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "paste (countable and uncountable, plural pastes)",
          "definitionGroups": [
            {
              "group": "A soft moist mixture, in particular:",
              "entries": [
                {
                  "meaning": "One of flour, fat, or similar ingredients used in making pastry.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Pastry.",
                  "examples": [
                    "And that day month, he had the paste rolled out, and cut the fair twin's head off, and chopped her in pieces, and peppered her, and salted her, and put her in the pie, and sent it to the baker's, and ate it all, and picked the bones."
                  ]
                },
                {
                  "meaning": "One of pounded foods, such as fish paste, liver paste, or tomato paste.",
                  "examples": []
                },
                {
                  "meaning": "One used as an adhesive, especially for putting up wallpapers, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A substance that behaves as a solid until a sufficiently large load or stress is applied, at which point it flows like a fluid",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hard lead-containing glass, or an artificial gemstone made from this glass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Pasta.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mineralogy) The mineral substance in which other minerals are embedded.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "paste (third-person singular simple present pastes, present participle pasting, simple past and past participle pasted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stick with paste; to cause to adhere by or as if by paste.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To insert a piece of media (e.g. text, picture, audio, video) previously copied or cut from somewhere else.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To strike or beat someone or something.",
                  "examples": [
                    "He got up and pasted Byfield in the mouth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To defeat decisively or by a large margin.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}