{
  "word": "stealth",
  "etymologies": [
    {
      "description": [
        "From Middle English stelthe, from Old English stǣlþ, from Proto-Germanic *stēliþō, equivalent to steal +‎ -th. Compare Old English stalu (“theft, stealth”), Old High German stāla (“theft”), German Diebstahl (“theft”)."
      ],
      "adjectives": [
        {
          "description": "stealth",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Surreptitious; secret; not openly acknowledged.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transgender) Hiding one's transgender status (in general or in specific areas of one's life, e.g. at work) after transition.",
                  "examples": [
                    "Synonym: closeted",
                    "go stealth; be stealth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, aviation, vehicles, technology) Having properties that diminish radar signatures.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "stealth (comparative more stealth, superlative most stealth)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transgender) While hiding one's transgender status from society after transition.",
                  "examples": [
                    "He has lived stealth for 10 years."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "stealth (countable and uncountable, plural stealths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The attribute or characteristic of acting in secrecy, or in such a way that the actions are unnoticed or difficult to detect by others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, countable) An act of secrecy, especially one involving thievery.",
                  "examples": [
                    "[The King] thinks it fit[...] that restitution according to this order be made to the petitioners for stealths committed upon them last winter (273)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stealth (third-person singular simple present stealths, present participle stealthing, simple past and past participle stealthed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially military, computing) To conceal or infiltrate through the use of stealth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, intransitive) To have sexual intercourse without a condom through deception (for example, removing the condom mid-act).",
                  "examples": [
                    "“Stealthing” is an immoral behaviour practiced by both men and women, but only punishes men."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}