{
  "word": "china",
  "etymologies": [
    {
      "description": [
        "From clippings of attributive use of China, q.v., the country in East Asia. In reference to porcelain and porcelain objects, via clipping of china-ware and via this sense of Persian چین‎ (čini) in Persia and India, which influenced the pronunciation (see below). In reference to medicine, via clipping of China root. In reference to flowers, via clipping of China rose. In reference to tea, via clipping of China tea. In Cockney slang, a clipping of china plate as a rhyme of mate (“friend”). In reference to drum cymbals, a clipping of China cymbal and as a genericization of a kind of Zildjian-brand cymbal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "china (countable and uncountable, plural chinas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Synonym of porcelain, a hard white translucent ceramic made from kaolin, now (chiefly US) sometimes distinguished in reference to tableware as fine or good china.",
                  "examples": [
                    "It's a china doll."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Chinaware: porcelain tableware.",
                  "examples": [
                    "They sell Callicoes, Cheney Sattin, Cheney ware."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, chiefly US, dated) Cheaper and lower-quality ceramic and ceramic tableware, distinguished from porcelain.",
                  "examples": [
                    "What is porcelain? A fine earthenware differing from china in being harder, whiter, harder to fuse and more translucent than ordinary pottery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Synonym of China root, the root of Smilax china (particularly) as a medicine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Synonym of cheyney: worsted or woolen stuff.",
                  "examples": [
                    "...And then the last boon I'll implore,Is to bless us with China so tight..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Synonym of China rose, in its various senses.",
                  "examples": [
                    "Rosa indica (the common China); Rosa semperflorens (the monthly China)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Cockney rhyming slang, Australia, South Africa) Synonym of mate (rhyme of china-plate).",
                  "examples": [
                    "All right, me old china?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, dated) Tea from China, (particularly) varieties cured by smoking or opposed to Indian cultivars.",
                  "examples": [
                    "Tea... Finest China, Plain (Moning)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, games, chiefly US, obsolete) A glazed china marble.",
                  "examples": [
                    "The marbles, in those days, had their primitive names. The unglazed china ones were called plasters because they looked like plaster; the glazed china marbles were called chinas. I remember how charming were the partly colored lines which encircled them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, music) A kind of drum cymbal approximating a Chinese style of cymbal, but usually with Turkish influences.",
                  "examples": [
                    "China cymbals are a type of short sound cymbal. [Brand X] makes chinas with really short sounds."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}