{
  "word": "slipper",
  "etymologies": [
    {
      "description": [
        "slip +‎ -er"
      ],
      "adjectives": [
        {
          "description": "slipper (comparative more slipper, superlative most slipper)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) slippery",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "slipper (plural slippers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low soft shoe that can be slipped on and off easily.",
                  "examples": [
                    "Synonyms: babouche, pantofle",
                    "Hyponym: chinela",
                    "Coordinate terms: flip-flop, sandal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Such a shoe intended for indoor use; a bedroom or house slipper.",
                  "examples": [
                    "Coordinate term: bootee",
                    "Get out of bed, put on your slippers, and come downstairs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Hawaii, Singapore) A flip-flop (type of rubber sandal).",
                  "examples": [
                    "Synonyms: flip-flop, sandal, thong"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who slips.",
                  "examples": [
                    "Virtually all human action is liable to opposing interpretations, depending mainly upon distance: to take the familiar case of the banana peel, the fall is painful to the slipper, hilarious to the spectator across the street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of apron or pinafore for children.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of brake or shoe for a wagon wheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A piece, usually a plate, applied to a sliding piece, to receive wear and permit adjustment; a gib.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A form of corporal punishment where the buttocks are repeatedly struck with a plimsoll; \"the slipper\".",
                  "examples": [
                    "\"Mrs Marlene Foster  […] , an opponent of the slipper, said her son Gary had a bottom \"as red as a beetroot\" after he was punished for writing on desks. \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) The plimsoll or gym shoe used in this form of punishment.",
                  "examples": [
                    "\"All teachers had what was referred to as a 'slipper', but in reality was a cut down gym shoe designed for smacking our bottoms.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A kind of bedpan urinal shaped like a shoe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slipper (third-person singular simple present slippers, present participle slippering, simple past and past participle slippered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand) To spank with a plimsoll as corporal punishment.",
                  "examples": [
                    "\"One boy was slippered five times in four days for offences such as missing detention, fooling about and being out of bounds.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}