{
  "word": "represent",
  "etymologies": [
    {
      "description": [
        "From Old French représenter, from Latin repraesentō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "represent (third-person singular simple present represents, present participle representing, simple past and past participle represented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To present again or anew; to present by means of something standing in the place of; to exhibit the counterpart or image of; to typify.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To portray visually; to delineate",
                  "examples": [
                    "a landscape can be represented in a picture.",
                    "The sculptor represented a horse in bronze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To portray by mimicry or acting; to act the part or character of",
                  "examples": [
                    "It has always been his dream to represent Hamlet on Broadway.",
                    "Synonym: play"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stand or act in the place of; to perform the duties, exercise the rights, or otherwise act on behalf of",
                  "examples": [
                    "He sent his agent to represent himself at the meeting.",
                    "As he was too ill to accept the award, his brother represented him at the ceremony.",
                    "An attorney's job is to represent his client in court"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, transitive) To act as a representative of (a country, state, district etc.)",
                  "examples": [
                    "They chose a member of Congress to represent their district."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To portray to another using language; to show; to give one's own impressions and judgement of",
                  "examples": [
                    "He represented that he was investigating for the police department."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give an account of; to describe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To serve as a sign or symbol of",
                  "examples": [
                    "The @ symbol represents the online world.",
                    "A dove is often used to represent peace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring a certain sensation of into the mind; to cause to be known, felt, or apprehended; to present.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form or image again in consciousness, as an object of cognition or apprehension (something presentative, which was originally apprehended by direct presentation).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To constitute, to make up, to be an example of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, transitive) To participate as a team member",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, African-American Vernacular) To constitute a good example or symbol of a group of people; to acquit oneself well.",
                  "examples": [
                    "I'm representing for the gangsters all across the world.",
                    "Still hitting them corners in them low lows girl."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "re- +‎ present."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "represent (third-person singular simple present represents, present participle representing, simple past and past participle represented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) To present again, for instance for medical attention.",
                  "examples": [
                    "represented to the emergency department"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}