{
  "word": "vessel",
  "etymologies": [
    {
      "description": [
        "From Middle English vessel, vessell, from Old French vaissel (compare modern French vaisseau), from Latin vāscellum, diminutive of vāsculum, diminutive of vās (“vase, vessel”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vessel (plural vessels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Any craft designed for transportation on water, such as a ship or boat. [From c.1300]",
                  "examples": [
                    "Hyponyms: ship, boat, barge, raft, canoe, kayak"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A craft designed for transportation through air or space. [From 1915]",
                  "examples": [
                    "Hyponyms: spaceship, ship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete or dialectal) Dishes and cutlery collectively, especially if made of precious metals. [c.1300–c.1600]",
                  "examples": [
                    "All his Vessell was of golde and siluer, pottis, basons, ewers, dysshes, flagons, barels, cuppes, and all other thyngis."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A container of liquid or other substance, such as a glass, goblet, cup, bottle, bowl, or pitcher. [From c.1300]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person as a container of qualities or feelings. [From 1382]",
                  "examples": [
                    "A teacher should be a vessel of knowledge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A tube or canal that carries fluid in an animal or plant. [From 1398]",
                  "examples": [
                    "Hyponyms: blood vessel, lymph vessel",
                    "Blood and lymph vessels are found in humans; xylem and phloem vessels are found in plants."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vessel (third-person singular simple present vessels, present participle vesselling or (US) vesseling, simple past and past participle vesselled or (US) vesseled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put into a vessel.",
                  "examples": [
                    "Our hony alſo is taken and reputed to be the beſt bycauſe it is harder, better wrought & clenlyer veſſelled vp, thẽ that which cõmeth from beyond the ſea, where they ſtampe and ſtraine their combes, Bées, & young Blow|inges altogither into the ſtuffe, as I haue béene informed."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}