{
  "word": "blight",
  "etymologies": [
    {
      "description": [
        "Uncertain, however given that it was used at one point to refer to inflammation of the skin , quite possibly from Middle English *bleighte, *bleȝte, from Old English blǣcþa (“leprosy”) (related to Old English blǣċo (“paleness, leprosy”) and blǣċe (“an itching skin-disease”)); or from Old Norse blikna (“to grow pallid”). Related to bleak."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blight (countable and uncountable, plural blights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phytopathology) A rapid and complete chlorosis, browning, then death of plant tissues such as leaves, branches, twigs, or floral organs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bacterium, virus or fungus that causes such a condition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Anything that impedes growth or development or spoils any other aspect of life.",
                  "examples": [
                    "She moved about the country like a ghost, gathering herbs in dark loanings, lingering in kirkyairds, and casting a blight on innocent bairns."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blight (third-person singular simple present blights, present participle blighting, simple past and past participle blighted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To affect with blight; to blast; to prevent the growth and fertility of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To suffer blight.",
                  "examples": [
                    "This vine never blights."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spoil, ruin, or destroy (something).",
                  "examples": [
                    "Those obscene tattoos are going to blight your job prospects."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}