{
  "word": "juice",
  "etymologies": [
    {
      "description": [
        "From Middle English jus, juis, from Old French jus, jous, from Latin jūs (“broth, soup, sauce”), from Proto-Indo-European *yows-, from *yew- (“to mix (of meal preparation)”). Doublet of jus. In this sense, mostly displaced native Middle English sew (“juice”), from Old English sēaw (“juice, sap”) (> English sew (“juice, broth, gravy”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "juice (usually uncountable, plural juices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A liquid from a plant, especially fruit.",
                  "examples": [
                    "You are aware, I presume, that immense quantities of sugar are annually made from the juice of the A`cer sacchárinum,[sic] in the west of Pennsylvania and New York, with which our forests abound (Professor Kid, in his Bridgwater Treatise, says they are “cultivated”!); and, as the peculiarities attending the flow of this juice have puzzled me to explain them, I have resolved to state them to you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A beverage made of juice.",
                  "examples": [
                    "The bottled juice must be heated to a temperature and for a time sufficient to attain a sterilizing temperature at the coolest point, usually the center of the bottle."
                  ]
                }
              ]
            },
            {
              "group": "(uncountable) Any liquid resembling juice.",
              "entries": [
                {
                  "meaning": "(Scotland) A soft drink.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, slang) Liquor.",
                  "examples": []
                },
                {
                  "meaning": "(informal) The liquid that is used to submerge a substance kept in a container",
                  "examples": [
                    "Hyponyms: pickle juice (the brine in a jar of pickles), sauerkraut juice (the brine in a jar of sauerkraut)"
                  ]
                },
                {
                  "meaning": "(slang) The leftover liquid of some wet or damp substance.",
                  "examples": [
                    "Hyponym: dumpster juice (liquid which oozes out of garbage dumpsters)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Vitality, strength.",
                  "examples": [
                    "This chance manner of her laying herself fallow gives her an opportunity of recovering her juices, or strength, to enable her to breed a stronger foal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Political power.",
                  "examples": [
                    "CNBC's Matthews: \"The power in the Republican party[sic] in terms of who's got the juice, who knows how to win elections, has clearly moved tonight ... from Capitol Hill, the Newt Gingrich crowd, to the governors' crowd\" (\"Hardball,\" CNBC. 11/3)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Petrol; gasoline.",
                  "examples": [
                    "Drove across the road to the petrol station and waited for five minutes—without buying juice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Electricity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Steroids.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, vulgar, sex) Semen.",
                  "examples": [
                    "The demand that a woman drink semen is repeated throughout pornography. Volume after volume presents such scenes as this which we find in The Skin Flick Rapist: \"Maria gagged on his juice. It made him so angry that he reached out with his right hand and pulled at her hair.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, vulgar, sex) The vaginal lubrication that a female naturally produces when sexually aroused.",
                  "examples": [
                    "Lily shuddered and looked at me as I came up from between her legs with her juices dripping all over me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) The amount charged by a bookmaker for betting services.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, music) Musical agreement between instrumentalists.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "juice (third-person singular simple present juices, present participle juicing, simple past and past participle juiced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To extract the juice from something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To energize or stimulate something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To take a performance-enhancing drug.",
                  "examples": [
                    "Synonym: juice up"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Dialectal spelling of Jew's, a particle of unclear origin. See Jew's harp for more."
      ],
      "adjectives": [
        {
          "description": "juice (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of Jew's (used in certain set phrases like juice harp)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}