{
  "word": "knee",
  "etymologies": [
    {
      "description": [
        "From Middle English kne, from Old English cnēow, from Proto-West Germanic *kneu, from Proto-Germanic *knewą, from Proto-Indo-European *ǵnéw-o-m, a thematic derivative of *ǵónu.",
        "See also Low German Knee, Dutch knie, German Knie, Danish knæ, Norwegian kne, Swedish knä; also Hittite 𒄀𒉡 (genu), Latin genū, Tocharian A kanweṃ (dual), Tocharian B kenī, Ancient Greek γόνυ (gónu, “knee”), γωνία (gōnía, “corner, angle”), Welsh glin (“knee”), Old Armenian ծունր (cunr), Avestan 𐬲𐬥𐬎𐬨‎ (žnum), Sanskrit जानु (jā́nu).",
        "The obsolete plural kneen is from Middle English kneen, knen, kneon, kneuwene."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "knee (plural knees or (obsolete or dialectal) kneen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In humans, the joint or the region of the joint in the middle part of the leg between the thigh and the shank.",
                  "examples": [
                    "Penny was wearing a miniskirt, so she skinned her exposed knees when she fell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the horse and allied animals, the carpal joint, corresponding to the wrist in humans.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a garment that covers the knee.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shipbuilding) A piece of timber or metal formed with an angle somewhat in the shape of the human knee when bent.",
                  "examples": [
                    "Deck beams were supported by hanging knees, triangular pieces of wood typically found underneath the timbers they are designed to support, but in this case found above them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with the verb \"take\") An act of kneeling on one knee, typically to acknowledge an injury or sacrifice or otherwise to show respect.",
                  "examples": [
                    "After Kyle went down hard on the ice, both teams took a knee as he was carried off on a stretcher."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) An act of kneeling, especially to show respect or courtesy.",
                  "examples": [
                    "[…]  and he made a knee to the Caesar of Patna, giving that man all honour due to him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any knee-shaped item or sharp angle in a line; an inflection point.",
                  "examples": [
                    "the knee of a graph"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blow made with the knee; a kneeing.",
                  "examples": [
                    "Tante was groggy but not quite out so Winnie gave him a knee to the jaw that Rose had shown her, and that was enough. He slumped like a rag-doll to the floor."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "knee (third-person singular simple present knees, present participle kneeing, simple past and past participle kneed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To kneel to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To poke or strike with the knee.",
                  "examples": [
                    "When I blocked her from leaving, she kneed me in the groin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To move on the knees; to use the knees to move.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}