{
  "word": "blandishment",
  "etymologies": [
    {
      "description": [
        "From blandish (“to persuade someone by using flattery, to cajole;\nto praise someone dishonestly, to flatter or butter up”) +‎ -ment (suffix forming nouns from verbs, having the sense of ‘the action or result of what is denoted by the verbs’). Blandish is derived from Middle English blaundishen (“to flatter; to fawn; to be enticing or persuasive; to be favourable; of the sea: to become calm”) [and other forms] (whence blaundice (“flattery, blandishment; caresses, dalliance; allurement, attractiveness; deceitfulness, deception”) [and other forms]), from Anglo-Norman blaundishen, from blandiss-, the extended stem of Middle French blandir + Middle English -ishen (suffix forming verbs). Blandir is derived from Latin blandīrī, the present active infinitive of blandior (“to fawn, flatter; to delude”), from blandus (“fawning, flattering, smooth, suave; persuasive; alluring, enticing, seductive; agreeable, pleasant”) (ultimately from Proto-Indo-European *(s)mel- (“erroneous, false; bad, evil”)) + -iō (suffix forming causative verbs from adjectives)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blandishment (plural blandishments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Often in the plural form blandishments: a flattering speech or action designed to influence or persuade.",
                  "examples": [
                    "Synonyms: cajolery; see also Thesaurus:flattery"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something alluring or attractive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figurative) Allurement, attraction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}