{
  "word": "growler",
  "etymologies": [
    {
      "description": [
        "From growl +‎ -er. Sense \"jug\" is 19th century American slang, of uncertain origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "growler (plural growlers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, creature or thing that growls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, slang) A horse-drawn cab with four wheels.",
                  "examples": [
                    "Lew pulled his socks from a jacket pocket, grabbed his own shoes, and together they proceeded to the street and into a growler, and were off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small iceberg or ice floe which is barely visible over the surface of the water.",
                  "examples": [
                    "A great ‘growler’ iceberg was sighted this afternoon at a distance of approximately half a mile; the size of a large London house, more or less."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, Canada, US, Australia) A kind of jug used to carry beer (in current usage, a 2-liter or 64-ounce container with or without a handle; sometimes extended to similarly shaped 32-ounce jug, but not bottles).",
                  "examples": [
                    "[…]  their favoring breeze has the stink of nickel whiskey on its breath, and their sea is a growler of lager and ale  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect, UK, Yorkshire) A pork pie.",
                  "examples": [
                    "Now, on first impression, a pork pie - or a ‘growler’ if you're from Yorkshire - looks like a delicious snack."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) The vulva.",
                  "examples": [
                    "On our first meeting he'd asked me if I dyed my hair. I told him I did and his follow up[sic] question had been the much under rated[sic], \"What colour's your growler then?\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialect) A fish of the perch family, abundant in North American rivers, so named from the sound it emits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for checking electrical equipment for short circuits etc.",
                  "examples": [
                    "Includes voltmeters, ammeters, circuit testers, armature tester (external growler), field tester, (internal growler), coil and condenser tester, etc."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}