{
  "word": "kitten",
  "etymologies": [
    {
      "description": [
        "From Middle English kitoun, kytton, kyton, keton (“kitten”). Seemingly from, and usually explained as being from, unattested Anglo-Norman *kitoun, *ketun (compare Old French chitoun, cheton, chaton (“kitten”), diminutive of cat, chat (“cat”)); whence Modern French chaton (“kitten”).",
        "Similar words of Germanic origin may have reinforced this word; compare English kitling (“kit, kitten”), Low German Kitten (“kitten”), Icelandic kettlingur (“kitten”), Middle English chitte (\"whelp, pup\", see chit).",
        "The idea that kitoun, rather than being of Anglo-Norman origin, was in fact a purely Germanic derivation from one of these words is etymologically problematic, but cannot be definitively ruled out."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kitten (plural kittens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A young cat, especially before sexual maturity (reached at about seven months).",
                  "examples": [
                    "It was supposed to have happened thus: the cat had young kittens, and frequently carried them mice, and other animals its prey, and among the rest a young rat: the kittens, not being hungry, played with it, and when the cat came to give suck to the kittens, the rat likewise sucked her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A young rabbit, rat, hedgehog, squirrel, fox, beaver, badger, etc.",
                  "examples": [
                    "The first move at beaver raising in North Dakota had its starting in the fall of 1874, when a kitten beaver was taken out of Mandan Lake by the writer and given to a little Indian girl who then lived with her guardians at Pretty Point near the present village of Sanger, Oliver county."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A moth of the genus Furcula.",
                  "examples": [
                    "Two of these formed cocoons in a manner I have not seen before. They were supplied when full-grown with plenty of rotten willow wood, which I have always found a most suitable material for insects using bark or old wood in forming cocoons such as the kittens, Apatele alni, etc., and most made the usual cycle of cocoons on it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A term of endearment, especially for a woman.",
                  "examples": [
                    "Speak only when spoken to, kitten."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "kitten (third-person singular simple present kittens, present participle kittening, simple past and past participle kittened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give birth to kittens.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}