{
  "word": "carbon",
  "etymologies": [
    {
      "description": [
        "Borrowed from French carbone, coined by Antoine Lavoisier, from Latin carbō, carbōnem (“charcoal, coal”), from Proto-Indo-European *kerh₃- (“to burn”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carbon (countable and uncountable, plural carbons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The chemical element (symbol C) with an atomic number of 6. It can be found in pure form for example as graphite, a black, shiny and very soft material, or diamond, a colourless, transparent, crystalline solid and the hardest known material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An atom of this element, in reference to a molecule containing it.",
                  "examples": [
                    "A methane molecule is made up of a single carbon with four hydrogens."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) A sheet of carbon paper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) A carbon copy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fossil fuel that is made of impure carbon such as coal or charcoal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecology, uncountable) carbon dioxide, in the context of climate change.",
                  "examples": [
                    "carbon neutral"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A carbon rod or pencil used in an arc lamp.",
                  "examples": [
                    "To trim an arc lamp, first remove the old carbons and carefully and thoroughly wipe the carbon rods, holders, &c. with a clean, dry rag."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plate or piece of carbon used as one of the elements of a voltaic battery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Ellipsis of carbon fiber (reinforced polymer)..",
                  "examples": [
                    "carbon bike frame"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "carbon (third-person singular simple present carbons, present participle carboning, simple past and past participle carboned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, transitive, uncommon) To cause (someone) to receive a carbon copy of an email message.",
                  "examples": [
                    "Synonyms: cc, copy",
                    "When I send it, I'll carbon Julia so she's aware."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}