{
  "word": "variety",
  "etymologies": [
    {
      "description": [
        "From Middle French varieté (“variety”) (modern French variété (“variety; genre, type”)) or directly from its etymon Latin varietās (“difference; diversity, variety”) + English -ty (suffix forming abstract nouns from adjectives). Varietās is derived from varius (“different, diverse, various; variegated”) (possibly ultimately from Proto-Indo-European *h₁weh₂- (“to abandon; to give out; to leave”)) + -tās (suffix forming feminine abstract nouns indicating a state of being). The English word displaced the native Old English mislīcnes.",
        "Sense 1.3.2 (“total number of distinct states of a system; logarithm to the base 2 of the total number of distinct states of a system”) was coined by the English psychiatrist William Ross Ashby (1903–1972) in his work An Introduction to Cybernetics (1956)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "variety (countable and uncountable, plural varieties)",
          "definitionGroups": [
            {
              "group": "(countable)",
              "entries": [
                {
                  "meaning": "A deviation or difference.",
                  "examples": []
                },
                {
                  "meaning": "A specific variation of something.",
                  "examples": [
                    "Synonym: (abbreviation) var.",
                    "Capsicum annuum var. glabriusculum is a variety of Capsicum annuum commonly known as chiltepin or Indian pepper."
                  ]
                },
                {
                  "meaning": "(biology, loosely) An animal or plant (or a group of such animals or plants) with characteristics causing it to differ from other animals or plants of the same species; a cultivar.",
                  "examples": [
                    "Synonym: (abbreviation) var.",
                    "Capsicum annuum var. glabriusculum is a variety of Capsicum annuum commonly known as chiltepin or Indian pepper."
                  ]
                },
                {
                  "meaning": "(botany, taxonomy) A rank in a taxonomic classification below species and (if present) subspecies, and above form; hence, an organism of that rank.",
                  "examples": [
                    "Synonym: (abbreviation) var.",
                    "Capsicum annuum var. glabriusculum is a variety of Capsicum annuum commonly known as chiltepin or Indian pepper."
                  ]
                },
                {
                  "meaning": "(linguistics) A specific form of a language, neutral to whether that form is an accent, dialect, register, etc., and to its prestige level; an isolect or lect.",
                  "examples": []
                },
                {
                  "meaning": "(philately) A stamp, or set of stamps, which has one or more characteristics (such as colour, paper, etc.) differing from other stamps in the same issue, especially if such differences are intentionally introduced.",
                  "examples": []
                },
                {
                  "meaning": "A collection or number of different things.",
                  "examples": [
                    "Synonyms: array, assortment",
                    "Antonym: uniformity"
                  ]
                },
                {
                  "meaning": "(algebra)",
                  "examples": [
                    "Synonyms: equational variety, variety of algebras"
                  ]
                },
                {
                  "meaning": "In universal algebra: an equational class; the class of all algebraic structures of a given signature, satisfying a given set of identities.",
                  "examples": [
                    "Synonyms: equational variety, variety of algebras"
                  ]
                },
                {
                  "meaning": "(algebraic geometry) Ellipsis of algebraic variety (“the set of solutions of a given system of polynomial equations over the real or complex numbers; any of certain generalisations of such a set that preserves the geometric intuition implicit in the original definition”).",
                  "examples": []
                },
                {
                  "meaning": "(cybernetics) The total number of distinct states of a system; also, the logarithm to the base 2 of the total number of distinct states of a system. [from 1956.]",
                  "examples": []
                },
                {
                  "meaning": "(radio, television, theater) Ellipsis of variety performance. or variety show (“a type of entertainment featuring a succession of short, unrelated performances by various artistes such as (depending on the medium) acrobats, comedians, dancers, magicians, singers, etc.”).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(uncountable)",
              "entries": [
                {
                  "meaning": "The quality of being varied; diversity.",
                  "examples": [
                    "Synonyms: see Thesaurus:nonuniformity",
                    "Antonyms: sameness; see also Thesaurus:uniformity",
                    "Variety is the spice of life."
                  ]
                },
                {
                  "meaning": "(radio, television, theater) The kind of entertainment given in variety performances or shows; also, the production of, or performance in, variety performances or shows.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}