{
  "word": "weapon",
  "etymologies": [
    {
      "description": [
        "From Middle English wepen, from Old English wǣpn, from Proto-West Germanic *wāpn, from Proto-Germanic *wēpną (“weapon”), of unknown origin, possibly from Proto-Indo-European *wēbnom. Cognate with Scots wapyn, wappen (“weapon”), West Frisian wapen (“weapon”), Dutch wapen (“weapon; coat of arms”), Low German wapen (“weapon”), German Waffe (“weapon”) and Wappen (“coat of arms”), Danish våben (“weapon; coat of arms”) Swedish vapen (“weapon”), Norwegian Bokmål våpen (“weapon”), Icelandic vopn (“weapon”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "weapon (plural weapons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instrument of attack or defense in combat or hunting, e.g. most guns, missiles, or swords; arm.",
                  "examples": [
                    "The club that is now mostly used for golf was once a common weapon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instrument or other means of harming or exerting control over another.",
                  "examples": [
                    "Money is the main weapon of modern oligarchs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, humorous) A tool of any kind.",
                  "examples": [
                    "Choose your weapon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Britain, slang, derogatory) An idiot, an oaf, a fool, a tool; a contemptible or incompetent person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, slang) A very skilled, competent, or capable person or thing worthy of awe.",
                  "examples": [
                    "Synonyms: legend, champion, unit"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "weapon (third-person singular simple present weapons, present participle weaponing, simple past and past participle weaponed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To equip with a weapon; to arm.",
                  "examples": [
                    "[…]  the friends of the country and of the equal rights of all men, the friends of enfranchising the black man and of weaponing his hand for defense; the friends of taking the governments of these rebel States out of the hands of their rebel possessors,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}