{
  "word": "creep",
  "etymologies": [
    {
      "description": [
        "From Middle English crepen, from Old English crēopan (“to creep, crawl”), from Proto-West Germanic *kreupan, from Proto-Germanic *kreupaną (“to twist, creep”), from Proto-Indo-European *grewbʰ- (“to turn, wind”). Cognate with West Frisian krippe, krûpe, West Frisian crjippa (“to creep”), Low German krepen and krupen, Dutch kruipen (“to creep, crawl”), Middle High German kriefen (“to creep”), Danish krybe (“to creep”), Norwegian krype (“to creep”), Swedish krypa (“to creep, crawl”), Icelandic krjúpa (“to stoop”).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "creep (countable and uncountable, plural creeps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The movement of something that creeps (like worms or snails).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A relatively small gradual change, variation or deviation (from a planned value) in a measure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slight displacement of an object; the slight movement of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The gradual expansion or proliferation of something beyond its original goals or boundaries, considered negatively.",
                  "examples": [
                    "christmas creep",
                    "feature creep",
                    "instruction creep",
                    "mission creep"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(publishing) In sewn books, the tendency of pages on the inside of a quire to stand out farther than those on the outside of it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(materials science) An increase in strain with time; the gradual flow or deformation of a material under stress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) The imperceptible downslope movement of surface rock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, derogatory) Someone unpleasantly strange or eccentric.",
                  "examples": [
                    "Synonym: weirdo"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, derogatory) A frightening and/or disconcerting person, especially one who gives the speaker chills.",
                  "examples": [
                    "Stop following me, you creep!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture) A barrier with small openings used to keep large animals out while allowing smaller animals to pass through.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "creep (third-person singular simple present creeps, present participle creeping, simple past crept or creeped or (archaic) crope, past participle crept or creeped or (archaic) cropen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move slowly with the abdomen close to the ground.",
                  "examples": [
                    "Lizards and snakes crept over the ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of plants) To grow across a surface rather than upwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move slowly and quietly in a particular direction.",
                  "examples": [
                    "He tried to creep past the guard without being seen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make small gradual changes, usually in a particular direction.",
                  "examples": [
                    "Prices have been creeping up all year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move in a stealthy or secret manner; to move imperceptibly or clandestinely; to steal in; to insinuate itself or oneself.",
                  "examples": [
                    "Old age creeps upon us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To slip, or to become slightly displaced.",
                  "examples": [
                    "The collodion on a negative, or a coat of varnish, may creep in drying.",
                    "The quicksilver on a mirror may creep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move or behave with servility or exaggerated humility; to fawn.",
                  "examples": [
                    "A creeping sycophant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have a sensation as of insects creeping on the skin of the body; to crawl.",
                  "examples": [
                    "The sight made my flesh creep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To drag in deep water with creepers, as for recovering a submarine cable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, African-American Vernacular, slang) To covertly have sex (with a person other than one's primary partner); to cheat with.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}