{
  "word": "prosecutrix",
  "etymologies": [
    {
      "description": [
        "Latin pro sequor: to pursue."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "prosecutrix (plural prosecutrixes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female prosecutor",
                  "examples": [
                    "The appellant contended that the trial was rendered unfair as a result of the conduct of the prosecutrix. She accused the prosecutrix of having a conversation with members of the jury in which the prosecutrix was alleged to have pointed out certain items on a flip chart that was erected in the court for the purposes of the trial. This was alleged to have occurred shortly before the trial judge entered the court to resume the trial on the morning of June 9, 2004."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female victim of a crime on whose behalf the state is prosecuting a suspect",
                  "examples": [
                    "The prosecutrix was the wife of a ticket-of-leave man, named Daniel Jackson, and she was also separated from her husband, and lived for some time with a man named Clarke, who died on the day before the alleged robbery was committed. Clarke left a will bequeathing all his property to the prosecutrix, who, immediately on his death, possessed herself of sixty pound in money which was in his box, which she rolled up and placed in her bosom. (The) Prosecutrix shortly after missed the money but could not account how it had parted from her, and the warrant for £30, and bank-note for £20, laid in the indictment, was part of the money so lost. The prosecutrix admitted, that both before, at the time, and some time after she missed the money, she was overcome with grief and brandy, but she could not say which of these acted most strongly."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}