{
  "word": "punk",
  "etymologies": [
    {
      "description": [
        "Uncertain. Possibly from the application of the sense punk (“rotten wood dust used as tinder”) (attested since 1678) to anything worthless (attested since 1869) and then to any undesirable person (since 1908)."
      ],
      "adjectives": [
        {
          "description": "punk (comparative punker, superlative punkest)",
          "definitionGroups": [
            {
              "group": "(US, colloquial) Worthless, contemptible, particularly [1907]",
              "entries": [
                {
                  "meaning": "Bad, substandard.",
                  "examples": []
                },
                {
                  "meaning": "Thuggish, criminal.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly African-American Vernacular) Cowardly. [1930]",
                  "examples": []
                },
                {
                  "meaning": "Poorly, sickly.",
                  "examples": []
                },
                {
                  "meaning": "Inexperienced.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or concerning punk rock or its associated subculture. [1971]",
                  "examples": [
                    "You look very punk with your t-shirt, piercing, and chains."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "punk (countable and uncountable, plural punks)",
          "definitionGroups": [
            {
              "group": "(countable) A person used for sex, particularly:",
              "entries": [
                {
                  "meaning": "(now historical and rare) Synonym of prostitute: a person paid for sex. [1575]",
                  "examples": [
                    "However, terrible as it may seem to the tall maiden sisters of J.P.'s in Queen Anne houses with walled vegetable gardens, this courtesan, strumpet, harlot, whore, punk, fille de joie, street-walker, this trollop, this trull, this baggage, this hussy, this drab, skit, rig, quean, mopsy, demirep, demimondaine, this wanton, this fornicatress, this doxy, this concubine, this frail sister, this poor Queenie—did actually solicit me, did actually say 'coming home to-night, dearie' and my soul was not blasted enough to call a policeman."
                  ]
                },
                {
                  "meaning": "(LGBT, obsolete) Synonym of catamite: a boy or younger man used by an older as a (usually passive) homosexual partner. [1698]",
                  "examples": [
                    "The Beaus...At night make a Punk of him that's first drunk."
                  ]
                },
                {
                  "meaning": "(chiefly US, LGBT) Synonym of bottom: any passive or effeminate homosexual male.",
                  "examples": []
                },
                {
                  "meaning": "(US, LGBT, slang) A boy who accompanies a hobo, especially as used for sex. [1893]",
                  "examples": [
                    "They'd pick up youngsters as, well—as their playthings. These kids were called punks."
                  ]
                },
                {
                  "meaning": "(US, LGBT, derogatory, chiefly African-American Vernacular) Synonym of faggot: any male homosexual. [1933]",
                  "examples": []
                },
                {
                  "meaning": "(US, LGBT, prison slang) Synonym of bitch: a man forced or coerced into a homosexual relationship, especially in prison. [1946]",
                  "examples": [
                    "If he is small and weak, he may decide to become a ‘punk’ and allow himself to be raped by the inmate most likely to protect him."
                  ]
                }
              ]
            },
            {
              "group": "(countable, US slang) A worthless person, particularly: [1904]",
              "entries": [
                {
                  "meaning": "(humorous, rare) Synonym of fellow: any person, especially a male comrade. [1904]",
                  "examples": []
                },
                {
                  "meaning": "(derogatory) A petty criminal, especially a juvenile delinquent. [1908]",
                  "examples": [
                    "He said the prisoner called them ‘punk’... He admitted that he shouted ‘punk’ to them."
                  ]
                },
                {
                  "meaning": "(derogatory) Synonym of sissy: a weak, timid person. [1939]",
                  "examples": [
                    "Do you think a little thing like a scratch would bother me? I'm no punk."
                  ]
                },
                {
                  "meaning": "Synonym of amateur. [1923]",
                  "examples": []
                },
                {
                  "meaning": "(circus slang) A young, untrained animal or worker. [1926]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, music) Short for punk rock, a genre known for short, loud, energetic songs with electric guitars and strong drums. [1970]",
                  "examples": [
                    "Who else... would have the nerve to actually begin a song with the line ‘Whatchew gonna do, mama, now that the roast beef's gone...?’ Man, that is true punk; that is so fucked up it's got class up the ass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Short for punk rocker, a musician known for playing punk rock or a fan of the genre. [1976]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The larger nonconformist social movement associated with punk rock and its fans.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "punk (third-person singular simple present punks, present participle punking, simple past and past participle punked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To pimp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To forcibly perform anal sex upon (an unwilling partner).",
                  "examples": [
                    "Ricky punked his new cell-mates."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To prank.",
                  "examples": [
                    "I got expelled when I punked the principal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially with \"out\") To give up or concede; to act like a wimp.",
                  "examples": [
                    "Jimmy was going to help me with the prank, but he punked (out) at the last minute."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, often with \"out\" or \"up\") To adapt or embellish in the style of the punk movement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unclear; first attested circa 1680 in writings about Native American practices, probably from Unami punkw (“dust”), though it has also been suggested it could be an alteration of spunk (“tinder”) (compare funk (“rotten wood”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "punk (countable and uncountable, plural punks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Any material used as tinder for lighting fires, such as agaric, dried wood, or touchwood, but especially wood altered by certain fungi.",
                  "examples": [
                    "As the East-Indians use Moxa, so these burn with Punk, which is the inward Part of the Excrescence or Exuberance of an Oak."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A utensil for lighting wicks or fuses (such as those of fireworks) resembling stick incense.",
                  "examples": [
                    "On the end a coal of fire slowly smouldered. It would last for hours, and my cell-mate called it a \"punk.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "punk (plural punks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the punk genres: dieselpunk, solarpunk, steampunk etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}