{
  "word": "livingly",
  "etymologies": [
    {
      "description": [
        "From living +‎ -ly."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "livingly (comparative more livingly, superlative most livingly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In actual living experience; really, vitally.",
                  "examples": [
                    "If we believed—if the great mass of people known as the civilized world did actually and livingly believe—that there was really anything beyond or above the physical order of nature, our children's literature, wrongly so called, would not be what it is."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Realistically; as if experienced in life or as if alive.",
                  "examples": [
                    "Take an extreme case. A group of people are photographed by Edison's new process—say Titiens, Trebelli, and Jenny Lind, with any two of the finest men singers the age has known—let them be photographed incessantly for half an hour while they perform a scene in \"Lohengrin\"; let all be done stereoscopically. Let them be phonographed at the same time so that their minutest shades of intonation are preserved, let the slides be coloured by a competent artist, and then let the scene be called suddenly into sight and sound, say a hundred years hence. Are those people dead or alive? Dead to themselves they are, but while they live so powerfully and so livingly in us, which is the greater paradox—to say that they are alive or that they are dead?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}