{
  "word": "congee",
  "etymologies": [
    {
      "description": [
        "From late Middle English congie, from Old French congié, congiet (modern French congé), from Latin commeātus (“passage, permission to leave”), from commeō (“I go and come”), from con- + meō (“I go, I pass”). Figurative senses generally borrowed from developments in French congé."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "congee (countable and uncountable, plural congees)",
          "definitionGroups": [
            {
              "group": "Leave, formal permission for some action, (originally and particularly):",
              "entries": [
                {
                  "meaning": "(obsolete) Formal permission to leave; a passport.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Formal dismissal; (figurative) any dismissal; (originally & particularly humorously ironic) abrupt dismissal without ceremony.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Formal leavetaking; (figurative) any farewell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Scotland) A fee paid to make another go away, (particularly) alms to a persistent beggar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A bow, curtsey, or other gesture (originally) made at departure but (later) including at greeting or in obeissance or respect.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "congee (third-person singular simple present congees, present participle congeeing, simple past and past participle congeed)",
          "definitionGroups": [
            {
              "group": "(archaic) To give congee, (particularly)",
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To give formal permission to leave; to dismiss.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, transitive) To give formal permission to do something; to license.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To take congee: to leave ceremoniously.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To make a congee: to bow, curtsey, etc., (particularly dialectal) while leaving; (figuratively) to make obeissance, show respect, or defer to someone or something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Tamil கஞ்சி (kañci), possibly via Portuguese canje."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "congee (usually uncountable, plural congees)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Asian cooking) A type of thick rice porridge or soup, sometimes prepared with vegetables and/or meat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}