{
  "word": "smut",
  "etymologies": [
    {
      "description": [
        "From Middle English smutten (“to defile, debase”), related to German Schmutz (“filth, dirt, smut”) and schmutzen (“to make dirty, stain”).  Doublet of schmutz.",
        "Compare also Old English smitta (“smear; blot; mark; stain; pollution”), Old English besmītan (“to besmut; defile; dirty; pollute; contaminate”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "smut (countable and uncountable, plural smuts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Soot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A flake of ash or soot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Sexually vulgar material; something that is sexual in a dirty way; pornographic material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Obscene language; ribaldry; obscenity.",
                  "examples": [
                    "He does not stand upon decency  […]  but will talk smut, though a priest and his mother be in the room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of a range of fungi, mostly Ustilaginomycetes, that cause plant disease in grasses, including cereal crops; the disease so caused.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) Bad, soft coal containing earthy matter, found in the immediate locality of faults.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "smut (third-person singular simple present smuts, present participle smutting, simple past and past participle smutted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To stain (or be stained) with soot or other dirt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To taint (grain, etc.) with the smut fungus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become tainted by the smut fungus.",
                  "examples": [
                    "It smutted to a far greater degree than the year before, say three fourths, or more. I obtained but little more than the seed sown, and that was handsome wheat. This failure I imputed to the same supposed cause which operated the last year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clear of the smut fungus.",
                  "examples": [
                    "to smut grain for the mill"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}