{
  "word": "abet",
  "etymologies": [
    {
      "description": [
        "From Middle English abetten, abette, from Old French abeter (“to entice”), from a- (“to”) + beter (“hound on, urge, to bait”), either from Middle Dutch bētan (“incite”) or from Old Norse beita (“to cause to bite, bait, incite”), from Proto-Germanic *baitijaną (“to cause to bite”), from Proto-Indo-European *bʰeyd- (“to split”). Cognate with Icelandic beita (“to set dogs on; to feed”).",
        "Alternate etymology traces the Middle English and Old French words through Old English *ābǣtan (“to hound on”), from ā- + bǣtan (“to bait”), from the same Proto-Germanic [Term?] source.",
        "See also bait, bet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "abet (plural abets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Fraud or cunning. [mid-12th–mid-14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An act of abetting; of helping; of giving aid. [from ca. 1350—1470]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "abet (third-person singular simple present abets, present participle abetting, simple past and past participle abetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To incite; to assist or encourage by aid or countenance in crime. [from ca. 1350–1470]",
                  "examples": [
                    "Synonyms: instigate, foment, encourage, support",
                    "Antonyms: baffle, confound, counteract, denounce, deter; see also Thesaurus:hinder",
                    "aid and abet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To support, countenance, maintain, uphold, or aid (any good cause, opinion, or action); to maintain. [from late 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To urge on, stimulate (a person to do) something desirable. [late 14th–early 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To back up one's forecast of a doubtful issue, by staking money, etc., to bet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}