{
  "word": "song",
  "etymologies": [
    {
      "description": [
        "From Middle English song, sang, from Old English sang, from Proto-West Germanic *sangu, from Proto-Germanic *sangwaz (“singing, song”), from Proto-Indo-European *sengʷʰ- (“to sing”). Cognate with Scots sang, song (“singing, song”), Saterland Frisian Song (“song”), West Frisian sang (“song”), Dutch zang (“song”), Low German sang (“song”), German Sang (“singing, song”), Swedish sång (“song”), Norwegian Bokmål sang (“song”), Norwegian Nynorsk song (“song”), Icelandic söngur (“song”), Ancient Greek ὀμφή (omphḗ, “voice, oracle”). More at sing."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "song (plural songs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A musical composition with lyrics for voice or voices, performed by singing.",
                  "examples": [
                    "Thomas listened to his favorite song on the radio yesterday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any musical composition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Poetical composition; poetry; verse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or art of singing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A melodious sound made by a bird, insect, whale or other animal.",
                  "examples": [
                    "I love hearing the song of canary birds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) The distinctive sound that a male bird utters to attract a mate or to protect his territory; contrasts with call; also, similar vocalisations made by female birds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low price, especially one under the expected value; chiefly in for a song.",
                  "examples": [
                    "He bought that car for a song."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object of derision; a laughing stock.",
                  "examples": [
                    "And now am I their song, yea, I am their byword."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}