{
  "word": "would",
  "etymologies": [
    {
      "description": [
        "From Old English wolde, past tense of willan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "would (plural woulds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that would happen, or would be the case, under different circumstances; a potentiality.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "would",
          "definitionGroups": [
            {
              "group": "Past tense of will; usually followed by a bare infinitive.",
              "entries": [
                {
                  "meaning": "Used to form the \"anterior future\", or \"future in the past\", indicating a futurity relative to a past time. [from 9th c.]",
                  "examples": [
                    "On my first day at University, I met the woman who would become my wife."
                  ]
                },
                {
                  "meaning": "Used to; was or were habitually accustomed to; indicating an action in the past that happened repeatedly or commonly. [from 9th c.]",
                  "examples": [
                    "When we were younger, we would cycle out to the beach most summer Sundays."
                  ]
                },
                {
                  "meaning": "Was or were determined to; indicating someone's insistence upon doing something. [from 18th c.]",
                  "examples": [
                    "I asked her to stay in with me, but she would go out."
                  ]
                },
                {
                  "meaning": "Could naturally have been expected to (given the tendencies of someone's character etc.). [from 18th c.]",
                  "examples": [
                    "He denied it, but then he would, wouldn't he?"
                  ]
                },
                {
                  "meaning": "(archaic) Wanted to. [from 9th c.]",
                  "examples": [
                    "The Greeks, especially those who would be thought adepts in mystic theology, ran after fantastic allegories […]."
                  ]
                },
                {
                  "meaning": "(archaic) Used with ellipsis of the infinitive verb, or postponement to a relative clause, in various senses. [from 9th c.]",
                  "examples": [
                    "At which time he told me, he would to London that week, and so to Oxford."
                  ]
                },
                {
                  "meaning": "(obsolete) Wished, desired (something). [9th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "A modal verb, the subjunctive of will; usually followed by a bare infinitive.",
              "entries": [
                {
                  "meaning": "Used as the auxiliary of the simple conditional modality, indicating a state or action that is conditional on another. [from 9th c.]",
                  "examples": [
                    "If I won the lottery, I would give half the money to charity."
                  ]
                },
                {
                  "meaning": "Without explicit condition, or with loose or vague implied condition, indicating a hypothetical or imagined state or action.",
                  "examples": [
                    "I would love to come and visit.",
                    "Look at that yummy cake! I would eat that all up!"
                  ]
                },
                {
                  "meaning": "Suggesting conditionality or potentiality in order to express a sense of politeness, tentativeness, indirectness, hesitancy, uncertainty, etc. [from 9th c.]",
                  "examples": [
                    "I would ask you all to sit down.",
                    "I would imagine that they have already left."
                  ]
                },
                {
                  "meaning": "Used to express what the speaker would do in another person's situation, as a means of giving a suggestion or recommendation.",
                  "examples": [
                    "It's disgraceful the way that they've treated you. I would write and complain."
                  ]
                },
                {
                  "meaning": "Used to express the speaker's belief or assumption.",
                  "examples": [
                    "He's very security-conscious, so he would have remembered to lock the door.",
                    "They would be arriving in London round about now."
                  ]
                },
                {
                  "meaning": "Used interrogatively to express a polite request; are (you) willing to …? [from 15th c.]",
                  "examples": [
                    "Would you pass the salt, please?"
                  ]
                },
                {
                  "meaning": "(chiefly archaic) Might wish (+ verb in past subjunctive); often used in the first person (with or without that) in the sense of \"if only\". [from 13th c.]",
                  "examples": [
                    "But as the youth increased their annoyance by declaring that the goddess was quite right, because the Emperor was Archon Eponym of the city of Athens, he said: \"Would that he also presided the Panathenaic festival.\""
                  ]
                },
                {
                  "meaning": "(chiefly archaic, transitive or control verb) Might desire; wish (something). [from 15th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}