{
  "word": "coal",
  "etymologies": [
    {
      "description": [
        "From Middle English cole, from Old English col, from Proto-West Germanic *kol, from Proto-Germanic *kulą (compare West Frisian koal, Dutch kool, German Kohle, Danish kul), from *ǵwelH- (“to burn, shine”).",
        "Compare Old Irish gúal (“coal”), Lithuanian žvìlti (“to twinkle, glow”), Persian زغال‎ (zoğâl, “live coal”), Sanskrit ज्वल् (jval, “to burn, glow”), Tocharian B śoliye (“hearth”), all from the same root."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coal (countable and uncountable, plural coals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(uncountable) A black or brownish black rock formed from prehistoric plant remains, composed largely of carbon and burned as a fuel.",
              "entries": [
                {
                  "meaning": "(countable) A type of coal, such as bituminous, anthracite, or lignite, and grades and varieties thereof, as a fuel commodity ready to buy and burn.",
                  "examples": [
                    "See also: stockpile",
                    "Put some coal on the fire.",
                    "Order some coal from the coalyard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A piece of coal used for burning (this use is less common in American English)",
                  "examples": [
                    "Put some coals on the fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A glowing or charred piece of coal, wood, or other solid fuel.",
                  "examples": [
                    "Just as the camp-fire died down to just coals, with no flames to burn the marshmallows, someone dumped a whole load of wood on, so I gave up and went to bed.",
                    "Coordinate terms: ember, ash, clinker"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "charcoal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "coal (third-person singular simple present coals, present participle coaling, simple past and past participle coaled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take on a supply of coal (usually of steam ships).",
                  "examples": [
                    "shortly after that she coaled again at Simon's Bay; and that after remaining in the neighbourhood of our ports for a time, she proceeded to Mauritius, where she coaled again, and then returned to this colony."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To supply with coal.",
                  "examples": [
                    "to coal a steamer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be converted to charcoal.",
                  "examples": [
                    "After the initial burn the goal of any good fire should be coaling; that is, creating a bed of solid coals that will sustain the fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To burn to charcoal; to char.",
                  "examples": [
                    "Char-coal of roots, coaled into great pieces."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark or delineate with charcoal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}