{
  "word": "stress",
  "etymologies": [
    {
      "description": [
        "From a shortening of Middle English destresse, borrowed from Old French destrecier, from Latin distringō (“to stretch out”). This form probably coalesced with Middle English stresse, from Old French estrece (“narrowness”), from Vulgar Latin *strictia, from Latin strictus (“narrow”).",
        "In the sense of \"mental strain\" or “disruption”, used occasionally in the 1920s and 1930s by psychologists, including Walter Cannon (1934); in “biological threat”, used by endocrinologist Hans Selye, by metaphor with stress in physics (force on an object) in the 1930s, and popularized by same in the 1950s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stress (countable and uncountable, plural stresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A physical, chemical, infective agent aggressing an organism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Aggression toward an organism resulting in a response in an attempt to restore previous conditions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, physics) The internal distribution of force across a small boundary per unit area of that boundary  (pressure) within a body. It causes strain or deformation and is typically symbolised by σ or τ.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, physics) Force externally applied to a body which cause internal stress within the body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Emotional pressure suffered by a human being or other animal.",
                  "examples": [
                    "Go easy on him, he's been under a lot of stress lately."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, phonetics, loosely) A suprasegmental feature of a language having additional attention raised to a sound, word or word group by means of of loudness, duration or pitch; phonological prominence.",
                  "examples": [
                    "Synonym: accent",
                    "Some people put the stress on the first syllable of “controversy”; others put it on the second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, phonetics, strictly) The suprasegmental feature of a language having additional attention raised to a sound by means of of loudness and/or duration; phonological prominence phonetically achieved by means of dynamics as distinct from pitch.",
                  "examples": [
                    "Synonym: stress accent",
                    "Antonyms: pitch, pitch accent"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Emphasis placed on a particular point in an argument or discussion (whether spoken or written).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete form of distress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, law) distress; the act of distraining; also, the thing distrained.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stress (third-person singular simple present stresses, present participle stressing, simple past and past participle stressed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply force to (a body or structure) causing strain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply emotional pressure to (a person or animal).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To suffer stress; to worry or be agitated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To emphasise (a syllable of a word).",
                  "examples": [
                    "“Emphasis” is stressed on the first syllable, but “emphatic” is stressed on the second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To emphasise (words in speaking).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To emphasise (a point) in an argument or discussion.",
                  "examples": [
                    "I must stress that this information is given in strict confidence."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}