{
  "word": "treaty",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English trete, trety (“bargaining, negotiation; discussion; conference, meeting; entreaty, persuasion; agreement, contract, covenant; arrangement, settlement; agreement between two rulers, states, etc.; written work on a particular subject, treatise; subdivision of a written work, section”) [and other forms], from Anglo-Norman treté, traité, treaté, and Old French traité, traitié [and other forms] (modern French traité (“agreement between two rulers, states, etc.; treatise”)); traité or traitié is:",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "treaty (countable and uncountable, plural treaties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, international law) A formal binding agreement concluded by subjects of international law, namely, states and international organizations; a convention, a pact.",
                  "examples": [
                    "to sign a peace treaty",
                    "to write up a treaty touching climate change"
                  ]
                }
              ]
            },
            {
              "group": "(archaic)",
              "entries": [
                {
                  "meaning": "(uncountable) Chiefly in in treaty: discussions or negotiations in order to reach an agreement.",
                  "examples": []
                },
                {
                  "meaning": "(countable) Chiefly in private treaty: an agreement or settlement reached following negotiations; a compact, a contract, a covenant.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "(uncountable) The manner or process of treating someone or something; treatment; also, the manner in which someone or something acts or behaves; behaviour.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) The addressing or consideration of a subject; discussion, treatment.",
                  "examples": []
                },
                {
                  "meaning": "(countable) A formal, systematic discourse on some subject; a treatise.",
                  "examples": []
                },
                {
                  "meaning": "(countable) An act of beseeeching or entreating; an entreaty, a plea, a request.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "treaty (third-person singular simple present treaties, present participle treatying, simple past and past participle treatied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To get into (a specific situation) through a treaty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To enter into a treaty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}