{
  "word": "conversation",
  "etymologies": [
    {
      "description": [
        "From Middle English conversacioun, from French conversation, from Latin conversātiōnem, accusative singular of conversātiō (“conversation”), from conversor (“abide, keep company with”).\nMorphologically converse +‎ -ation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "conversation (countable and uncountable, plural conversations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Expression and exchange of individual ideas through talking with other people; also, a set instance or occasion of such talking. [from 16th c.]",
                  "examples": [
                    "Synonyms: banter, chat, chinwag, dialogue, discussion, interlocution, powwow, table talk",
                    "I had an interesting conversation with Nicolas yesterday about how much he's getting paid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) The back-and-forth play of the blades in a bout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, networking) The protocol-based interaction between systems processing a transaction. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Interaction; commerce or intercourse with other people; dealing with others. [14th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Behaviour, the way one conducts oneself; a person's way of life. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sexual intercourse. [16th–19th c.]",
                  "examples": [
                    "Synonyms: see Thesaurus:copulation",
                    "criminal conversation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Engagement with a specific subject, idea, field of study etc. [16th–18th c.]",
                  "examples": [
                    "Synonyms: understanding, familiarity"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "conversation (third-person singular simple present conversations, present participle conversationing, simple past and past participle conversationed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard, transitive, intransitive) To engage in conversation (with).",
                  "examples": [
                    "Gone now are the \"high-minded\" style, the \"adapted from literature\" feel, the voice-over narration, and the abstract conversationing about ideas, values..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}