{
  "word": "wobbler",
  "etymologies": [
    {
      "description": [
        "wobble +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wobbler (plural wobblers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who or that which wobbles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is undecided, and might go to either side.",
                  "examples": [
                    "Towns fell to him like so many houses of cards; and the fall of each town represented not only an accession to the prestige of the Royalist commander but a physical accession of strength as the wobblers flocked to the successful army."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) A stone that rocks from side to side as it travels because it is not resting on its running surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, law) A case that could go either way depending on factors that cannot be controlled.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, law) A class of crime that can be charged as a lower penalty or a higher penalty, e.g. a crime punishable as either a misdemeanor or a felony at the discretion of the prosecutor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A fishing lure made to resemble a prey fish and that wobbles in the water; plug, minnow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain) A sudden unexpected outburst of anger or rage; a tantrum.",
                  "examples": [
                    "Synonym: wobbly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(advertising) A small publicity notice which appears to float at eye level, being attached to a fixture by a flexible arm.",
                  "examples": [
                    "A wire \"Wobbler\" holds a card for counter display"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The end of the roll in a roller mill for shaping steel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A boiled leg of mutton.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}