{
  "word": "whiff",
  "etymologies": [
    {
      "description": [
        "The noun is possibly:",
        "Noun sense 6 (“name of a number of flatfish”) is possibly derived from sense 1 (“brief, gentle breeze; a light gust of air”), sense 4 (“small quantity of cloud, smoke, vapour, etc.”), and other such senses.",
        "The verb and adjective are derived from the noun. Verb sense 2.6 (“to catch fish by dragging a handline near the surface of the water from a moving boat”) is possibly derived from sense 1.1 (“to carry or convey (something) by, or as by, a whiff or puff of air”), sense 2.2 (“to be carried, or move as if carried, by a puff of air”), and other such senses.",
        "The interjection is derived from noun sense 7.4 (“a sound like that of air passing through a small opening; a short or soft whistle”)."
      ],
      "adjectives": [
        {
          "description": "whiff (comparative more whiff, superlative most whiff)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Having a strong or unpleasant odour.",
                  "examples": [
                    "Synonyms: stinking, whiffy; see also Thesaurus:malodorous"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "The noun is possibly: Noun sense 6 (“name of a number of flatfish”) is possibly derived from sense 1 (“brief, gentle breeze; a light gust of air”), sense 4 (“small quantity of cloud, smoke, vapour, etc.”), and other such senses. The verb and adjective are derived from the noun. Verb sense 2.6 (“to catch fish by dragging a handline near the surface of the water from a moving boat”) is possibly derived from sense 1.1 (“to carry or convey (something) by, or as by, a whiff or puff of air”), sense 2.2 (“to be carried, or move as if carried, by a puff of air”), and other such senses. The interjection is derived from noun sense 7.4 (“a sound like that of air passing through a small opening; a short or soft whistle”).",
          "definitionGroups": []
        },
        {
          "description": "whiff (plural whiffs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief, gentle breeze; a light gust of air; a waft.",
                  "examples": [
                    "Synonym: puff"
                  ]
                }
              ]
            },
            {
              "group": "A short inhalation or exhalation of breath, especially when accompanied by smoke from a cigarette or pipe.",
              "entries": [
                {
                  "meaning": "(by extension, archaic) A cigarette or small cigar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An odour (usually unpleasant) carried briefly through the air.",
                  "examples": [
                    "Synonym: sniff"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small quantity of cloud, smoke, vapour, etc.; specifically (obsolete), chiefly in take the whiff: a puff of tobacco smoke.",
                  "examples": [
                    "Synonym: puff"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flag used as a signal.",
                  "examples": [
                    "Synonyms: waff, waif, wheft"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The name of a number of flatfish such as (dated) the lemon sole (Microstomus kitt) and now, especially, the megrim (Lepidorhombus whiffiagonis) and (with a descriptive word) a species of large-tooth flounder or sand flounder (family Paralichthyidae).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "A slight sign of something; a burst, a glimpse, a hint.",
                  "examples": []
                },
                {
                  "meaning": "A slight attack or touch.",
                  "examples": []
                },
                {
                  "meaning": "A characteristic quality of something; a flavour, a savour, a taste.",
                  "examples": []
                },
                {
                  "meaning": "A sound like that of air passing through a small opening; a short or soft whistle.",
                  "examples": []
                },
                {
                  "meaning": "(sports, chiefly US, slang) A failure to hit a ball in various sports (for example, golf); a miss.",
                  "examples": []
                },
                {
                  "meaning": "(baseball) From the batter's perspective: a strike.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) An expulsion of explosive or shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) An outrigged boat for one person propelled by oar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A sip of an alcoholic beverage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "whiff (third-person singular simple present whiffs, present participle whiffing, simple past and past participle whiffed)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To carry or convey (something) by, or as by, a whiff or puff of air; to blow, puff, or waft away.",
                  "examples": []
                },
                {
                  "meaning": "To say (something) with an exhalation of breath.",
                  "examples": []
                },
                {
                  "meaning": "To inhale or exhale (smoke from tobacco, etc.) from a cigarette, pipe, or other smoking implement; to smoke (a cigarette, pipe, etc.); to puff.",
                  "examples": []
                },
                {
                  "meaning": "To breathe in or sniff (an odour); to smell.",
                  "examples": []
                },
                {
                  "meaning": "(slang)",
                  "examples": []
                },
                {
                  "meaning": "(archaic or dated) To shoot (someone) with a firearm; hence, to assassinate or kill (someone).",
                  "examples": []
                },
                {
                  "meaning": "(US, baseball) Of a pitcher: to strike out (a batter); to fan.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To consume (an alcoholic beverage).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To move in a way that causes a light gust of air, or a whistling sound.",
                  "examples": []
                },
                {
                  "meaning": "To be carried, or move as if carried, by a puff of air; to waft.",
                  "examples": []
                },
                {
                  "meaning": "To smoke a cigarette, pipe, or other smoking implement.",
                  "examples": []
                },
                {
                  "meaning": "To smell; to sniff.",
                  "examples": []
                },
                {
                  "meaning": "(slang)",
                  "examples": []
                },
                {
                  "meaning": "To give off or have an unpleasant smell; to stink.",
                  "examples": []
                },
                {
                  "meaning": "(US, chiefly sports) Especially in baseball or golf: to completely miss hitting a ball; hence (baseball), of a batter: to strike out; to fan.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) To fail spectacularly.",
                  "examples": []
                },
                {
                  "meaning": "(video games) In fighting games, to execute a move that fails to hit the opponent.",
                  "examples": []
                },
                {
                  "meaning": "(fishing) To catch fish by dragging a handline near the surface of the water from a moving boat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}