{
  "word": "country",
  "etymologies": [
    {
      "description": [
        "From Middle English contre, contree, contreie, from Old French contree, from Vulgar Latin (terra) contrāta (“(land) lying opposite; (land) spread before”), derived from Latin contra (“against, opposite”). Cognate with Scots kintra."
      ],
      "adjectives": [
        {
          "description": "country (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "From or in the countryside or connected with it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or connected to country music.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India, historical) Originating in India rather than being imported from Europe or elsewhere.",
                  "examples": [
                    "We have seen that the Company manufactured silk stuffs at three of its Residencies, but from country-wound silk."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "country (plural countries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly British) An area of land; a district, region. [from 13th c.]",
                  "examples": [
                    "We walk along flat, open country, red dirt and spinifex grass, a few short trees […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set region of land having particular human occupation or agreed limits, especially inhabited by members of the same race, speakers of the same language etc., or associated with a given person, occupation, species etc. [from 13th c.]",
                  "examples": [
                    "This is condor country – the only region this far east where you can see the magnificent vulture – and a small national park straddling the passes, El Condorito, is a good stopover for walkers and birders."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The territory of a nation, especially an independent nation state or formerly independent nation; a political entity asserting ultimate authority over a geographical area; a sovereign state. [from 14th c.]",
                  "examples": [
                    "Synonyms: see Thesaurus:country"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, usually preceded by “the”) A rural area, as opposed to a town or city; the countryside. [from 16th c.]",
                  "examples": [
                    "I have always thought that one of the main reasons for the popularity of blood sports in the country is the pointlessness of going outdoors with no purpose or destination in mind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ellipsis of country music. [from 20th c.]",
                  "examples": [
                    "a country song",
                    "a country singer",
                    "a country festival"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) The rock through which a vein runs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}