{
  "word": "treat",
  "etymologies": [
    {
      "description": [
        "From Middle English treten, from Anglo-Norman treter, Old French tretier, traiter, from Latin tractāre (“to pull\", \"to manage”), from the past participle stem of trahere (“to draw\", \"to pull”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "treat (plural treats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An entertainment, outing, food, drink, or other indulgence provided by someone for the enjoyment of others.",
                  "examples": [
                    "I took the kids to the zoo for a treat.",
                    "Here are some healthy Halloween treats for ghouls and witches of all ages."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unexpected gift, event etc., which provides great pleasure.",
                  "examples": [
                    "It was such a treat to see her back in action on the London stage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A snack food item designed to be given to pets.",
                  "examples": [
                    "I lured the cat into her carrier by throwing a couple of treats in there."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A parley or discussion of terms; a negotiation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An entreaty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "treat (third-person singular simple present treats, present participle treating, simple past and past participle treated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To negotiate, discuss terms, bargain (for or with). [from 13th c.]",
                  "examples": [
                    "Now halting a few paces before the Captains of the West he looked them up and down and laughed. 'Is there any in this rout with authority to treat with me?' he asked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To discourse; to handle a subject in writing or speaking; to conduct a discussion. [from 14th c.]",
                  "examples": [
                    "Cicero's writing treats mainly of old age and personal duty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To discourse on; to represent or deal with in a particular way, in writing or speaking. [from 14th c.]",
                  "examples": [
                    "The article treated feminism as a quintessentially modern movement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete) To entreat or beseech (someone). [14th–17th c.]",
                  "examples": [
                    "Only let my family live, I treat thee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To handle, deal with or behave towards in a specific way. [from 14th c.]",
                  "examples": [
                    "You treated me like a fool.",
                    "She was tempted to treat the whole affair as a joke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To entertain with food or drink, especially at one's own expense; to show hospitality to; to pay for as celebration or reward. [from 16th c.]",
                  "examples": [
                    "I treated my son to some popcorn in the interval.",
                    "I've done so well this month, I'll treat you all to dinner (or Dinner is my treat.)",
                    "My husband treated me to a Paris holiday for our anniversary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK politics, law) To commit the offence of providing food, drink, entertainment or provision to corruptly influence a voter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To care for medicinally or surgically; to apply medical care to. [from 18th c.]",
                  "examples": [
                    "They treated me for malaria."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To subject to a chemical or other action; to act upon with a specific scientific result in mind. [from 19th c.]",
                  "examples": [
                    "He treated the substance with sulphuric acid.",
                    "I treated the photo somewhat to make the colours more pronounced."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To provide something special and pleasant.",
                  "examples": [
                    "The Chelsea captain was a virtual spectator as he was treated to his side's biggest win for almost two years as Stamford Bridge serenaded him with chants of \"there's only one England captain,\" some 48 hours after he announced his retirement from international football."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}