{
  "word": "gimp",
  "etymologies": [
    {
      "description": [
        "Attested since about 1660, perhaps from Dutch gimp or French guimpe, and likely from Old French guimpre, a variant of guipure, a kind of trimming.",
        "The regional sense of \"gumption\" is attested since about 1905, and may have developed due to the reinforced nature of gimp cord, or possibly the influence of the words gumption and gumph."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gimp (countable and uncountable, plural gimps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A narrow ornamental fabric or braid of silk, wool, or cotton, often stiffened with metallic wire or coarse cord running through it, used as trimming for dresses, curtains, furniture, etc. Also guimpe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any coarse or reinforced thread, such as a glazed thread employed in lacemaking to outline designs, or silk thread used as a fishing leader, protected from the bite of fish by a wrapping of fine wire.",
                  "examples": [
                    "I'm a fisher of men and my gimp is doing a saltarello over every body of water to fetch up what it may."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The plastic cord used in the plaiting and knotting craft Scoubidou (lanyard making); or, the process itself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, chiefly North Eastern US) Gumption",
                  "examples": [
                    "Synonyms: spirit, ambition, vigor, pep"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gimp (third-person singular simple present gimps, present participle gimping, simple past and past participle gimped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of yarn, cord, thread, etc.) To wrap or wind (surround) with another length of yarn or wire in a tight spiral, often by means of a gimping machine, creating 'gimped yarn', etc. Also, generally, to wrap or twist with string or wire. See gimped.",
                  "examples": [
                    "It consists of seventy fine spun cotton threads, gimped or tied around with thread by a machine similar to that for wrapping bonnet wire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To notch or indent; to jag or make jagged; to edge with serrations or grooves.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Attested in US slang since the 1920s. Maybe influenced by, or cognate with limp."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gimp (plural gimps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A person who is lame due to a crippling of the legs or feet.",
                  "examples": [
                    "Synonyms: cripple, disabled (person)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A crippled leg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A limp or a limping gait.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) A name-calling word, generally for a person who is perceived to be inept, deficient or peculiar",
                  "examples": [
                    "Synonyms: dweeb, nerd, geek, gump, spod, dork"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM) A sexual submissive, almost always male, dressed generally in a black leather suit. See Gimp (sadomasochism) in Wikipedia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, slang, derogatory) A character or ability that is underpowered.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gimp (third-person singular simple present gimps, present participle gimping, simple past and past participle gimped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To limp; to hobble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, video games, slang) To make underpowered; to limit or restrict the useful effects of.",
                  "examples": [
                    "Synonym: nerf"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Scots. Alternate form of jimp. Compare Welsh gwymp (“fair, neat, comely”)."
      ],
      "adjectives": [
        {
          "description": "gimp (comparative more gimp, superlative most gimp)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, Scotland and N England) Neat; trim; delicate; slender; handsome; spruce; elegant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}