{
  "word": "epistle",
  "etymologies": [
    {
      "description": [
        "From Middle English epistel, pistel, from a combination of Old English epistol and Old French epistre, from Latin epistola, from Ancient Greek ἐπιστολή (epistolḗ), from ἐπιστέλλω (epistéllō, “I send a message”), from ἐπί (epí, “upon”) + στέλλω (stéllō, “I prepare, send”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "epistle (plural epistles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A letter, or a literary composition in the form of a letter.",
                  "examples": [
                    "he may be hurried from this plan by the vehemence of thought, as in an ode, or drop it carelessly, as in an epistle or essay"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) One of the letters included as a book of the New Testament.",
                  "examples": [
                    "Even last century scholars had begun to search for the cities in Asia Minor whose names have become so familiar to the Christian world through the Acts of the Apostles and the Epistles of St. Paul."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "epistle (third-person singular simple present epistles, present participle epistling, simple past and past participle epistled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, intransitive) To write; to communicate in a letter or by writing.",
                  "examples": [
                    "Deuinitie (the Heauen of all Artes) for a while drew his thoughts vnto it, but shortly after the world the flesh and the diuell with-drewe him from that, and needes he would be of a more Gentleman-like lustie cut; whereupon hee fell to morrall Epistling and Poetrie."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}