{
  "word": "burlap",
  "etymologies": [
    {
      "description": [
        "Uncertain. Attested since about 1695 in the spelling bore-lap, borelapp. Likely from burel (“a coarse woollen cloth”) +‎ lap (“flap of a garment”), where the first element is from Middle English burel, borel. Others feel that \"its character and time of appearance makes a Dutch origin very likely\" (and the earliest references as to its importation from the Netherlands); the NED suggests derivation from Dutch boenlap (“coarse, rubbing linen or cloth”) with the first element perhaps confused with boer; Bense instead suggests derivation from an unattested Dutch *boerenlap, where *boeren supposedly has an extended sense of \"coarse\" as in Dutch boerenkost (“coarse, heavy food as is eaten by farmers”) and boerengoed (from Dutch boer (“farmer, peasant”); compare English boor), though this word is not attested."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "burlap (countable and uncountable, plural burlaps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A very strong, coarse cloth, made from jute, flax, or hemp, and used to make sacks, etc.",
                  "examples": [
                    "Synonyms: (UK) hessian, (Jamaica, Trinidad and Tobago) crocus"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "burlap (third-person singular simple present burlaps, present participle burlapping, simple past and past participle burlapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wrap or cover in burlap.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}