{
  "word": "gadfly",
  "etymologies": [
    {
      "description": [
        "From gad (“(obsolete) sharp point, spike; (dialectal) sharp-pointed rod for driving cattle, horses, etc., goad”) +‎ fly, in the sense of a fly which irritates cattle, etc., by biting them, similar to the prodding of a goad. Gad is derived from Middle English gad, gadde (“metal spike with a sharp point; stick with a sharp point for driving animals, goad; metal bar or rod, ingot; (by extension) lump of material; metal rod for measuring land; (by extension) unit of linear measure equal to about 10 to 16 feet”), borrowed from Old Norse gaddr (“spike; goad”), from Proto-Germanic *gazdaz (“spike; goad”), further etymology uncertain.",
        "Sense 2.1.1 (“person who upsets the status quo”) may allude to the Apology by the Greek philosopher Plato (428/427 or 424/423 – 348/347 B.C.E.), where he describes Socrates (c. 470 – 399 B.C.E.) acting as a goad to the Athenian political scene like a gadfly (Ancient Greek μῠ́ωψ (múōps)) arousing a sluggish horse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gadfly (plural gadflies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any dipterous (“two-winged”) insect or fly of the family Oestridae (commonly known as a botfly) or Tabanidae (horsefly), noted for irritating animals by buzzing about them, and biting them to suck their blood; a gadbee.",
                  "examples": [
                    "(botfly): Synonym: warble fly",
                    "(horsefly): Synonyms: stoat-fly, stout"
                  ]
                }
              ]
            },
            {
              "group": "(figuratively, also attributively)",
              "entries": [
                {
                  "meaning": "A person or thing that irritates or instigates.",
                  "examples": [
                    "Synonyms: see Thesaurus:maverick"
                  ]
                },
                {
                  "meaning": "(specifically) A person who upsets the status quo by posing novel or upsetting questions, or attempts to stimulate innovation by being an irritant.",
                  "examples": [
                    "Synonyms: see Thesaurus:maverick"
                  ]
                },
                {
                  "meaning": "Synonym of gadabout (“a person who restlessly moves from place to place, seeking amusement or the companionship of others”)",
                  "examples": [
                    "Synonym: social butterfly"
                  ]
                },
                {
                  "meaning": "(derogatory, slang) A person who takes without giving back; a bloodsucker.",
                  "examples": [
                    "Synonyms: see Thesaurus:scrounger",
                    "He’s a regular gadfly and takes advantage of his friend’s generosity."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}