{
  "word": "scent",
  "etymologies": [
    {
      "description": [
        "From c.1400, from Middle English sent (noun) and senten (verb), from Old French sentir (“to feel, perceive, smell”), from Old French sentire \"to feel, perceive, sense\", from Latin sentīre, present active infinitive of sentiō. Ultimately from Proto-Indo-European *sent- (“to feel”), and thus related to Dutch zin (“sense, meaning”), German Sinn (“sense”), Low German Sinn (“sense”), Luxembourgish Sënn (“sense, perception”), Saterland Frisian Sin (“sense”), West Frisian sin (“sense”). The -c- appeared in the 17th century, possibly by influence of ascent, descent, etc., or by influence of science."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scent (countable and uncountable, plural scents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distinctive smell.",
                  "examples": [
                    "Synonyms: aroma, bouquet, fragrance, nosegay, odor, perfume, redolence, smell",
                    "the scent of flowers / of a skunk",
                    "to give off / release / exude a scent",
                    "to breathe in / inhale a scent"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A smell left by an animal that may be used for tracing.",
                  "examples": [
                    "The dogs picked up / caught the scent but then quickly lost it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sense of smell.",
                  "examples": [
                    "Synonym: olfaction",
                    "I believe the bloodhound has the best scent of all dogs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly uncountable) A substance (usually liquid) created to provide a pleasant smell.",
                  "examples": [
                    "Synonyms: aftershave, cologne, eau de toilette, perfume, toilet water",
                    "a scent shop",
                    "a scent bazaar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any trail or trace that can be followed to find something or someone, such as the paper left behind in a paperchase.",
                  "examples": [
                    "The minister's off-hand remark put journalists on the scent of a cover-up.",
                    "The tip put the detectives on a false / the wrong scent.",
                    "to pick up a scent / get scent of something ― discover one of a series of clues in the trail of evidence",
                    "to throw / put someone off the scent ― distract them from following the trail of evidence"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sense, perception.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scent (third-person singular simple present scents, present participle scenting, simple past and past participle scented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To detect the scent of; to discern by the sense of smell.",
                  "examples": [
                    "Synonym: smell",
                    "The hounds scented the fox in the woods."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To inhale in order to detect the scent of (something).",
                  "examples": [
                    "Synonyms: sniff, smell"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To have a suspicion of; to detect the possibility of (something).",
                  "examples": [
                    "Synonyms: detect, discern, perceive, sense",
                    "I scented trouble when I saw them running down the hill towards me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To impart an odour to, to cause to have a particular smell.",
                  "examples": [
                    "Synonyms: perfume, odorize",
                    "Scent the air with burning sage before you begin your meditation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To have a smell; (figuratively) to give an impression (of something).",
                  "examples": [
                    "Synonym: smell"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hunt animals by means of the sense of smell.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}