{
  "word": "rectitude",
  "etymologies": [
    {
      "description": [
        "From Middle English rectitude, from Middle French rectitude, from Late Latin rectitūdō (“straightness, uprightness”), from Latin rectus (“straight”), perfect passive participle of regō (“regulate, guide”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rectitude (countable and uncountable, plural rectitudes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Straightness; the state or quality of having a constant direction and not being crooked or bent. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The fact or quality of being right or correct; correctness of opinion or judgement. [from 15th c.]",
                  "examples": [
                    "A consciousness of rectitude can be a terrible thing, and in those days I didn't just think that I was right: I thought that “we” (our group of International Socialists in particular) were being damn well proved right."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Conformity to the rules prescribed for moral conduct; (moral) uprightness, virtue. [from 16th c.]",
                  "examples": [
                    "We, therefore, the Repreſentatives of the united States of America, in General Congreſs, Aſsembled, appealing to the Supreme Judge of the world for the rectitude of our intentions, do, in the Name, and by Authority of the good People of theſe Colonies, ſolemnly publiſh and declare, That theſe United Colonies are, and of right ought to be Free and Independent States […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}