{
  "word": "panhandle",
  "etymologies": [
    {
      "description": [
        "From pan +‎ handle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "panhandle (plural panhandles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The handle of a pan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartography, US) On a map, any arm or projection suggestive of the handle of a pan.",
                  "examples": [
                    "The three counties that form the Oklahoma panhandle were originally part of the Cimarron Strip.",
                    "The very wide Texas panhandle butts up, at its north, against the Oklahoma panhandle.",
                    "The Florida panhandle is the area west, along the Gulf coast, of the Florida Peninsula.",
                    "Part of Fairfield County, Connecticut constitutes a panhandle, extending into Bronx County, New York.",
                    "The Alaska Panhandle is that portion of the state to the south of Yakutat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The handle that activates an ejector seat.",
                  "examples": [
                    "The Captain Keith Handscomb was the occupant of that ejector seat and the only survivor; his narrow escape was by just being able to reach the seat panhandle with his third and fourth fingers of his left hand."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Probable back-formation from panhandler."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "panhandle (third-person singular simple present panhandles, present participle panhandling, simple past and past participle panhandled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) To beg for money, especially with a container in hand for receiving loose change, especially on the street, and particularly, as a bum.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}