{
  "word": "height",
  "etymologies": [
    {
      "description": [
        "From Middle English heighte, heiȝþe, from Old English hēahþu, hēhþo, hīehþo (“height”), Proto-West Germanic *hauhiþu, from Proto-Germanic *hauhiþō (compare *hauhaz). Corresponds to high +‎ -th."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "height (countable and uncountable, plural heights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The distance from the base of something to the top.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The distance of something above the ground or some other chosen level.",
                  "examples": [
                    "We flew at a height of 15 000 meters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) A quality of vowels, indicating the vertical position of the tongue relative to the roof of the mouth; in practice, the first formant, associated with the height of the tongue.",
                  "examples": [
                    "Coordinate terms: (horizontal dimension) backness, (lip articulation) roundedness, length, nasalization, reduction"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The vertical distance from the ground to the highest part of a standing person or animal (withers in the case of a horse).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The highest point or maximum degree.",
                  "examples": [
                    "During the height of Italian immigration in the United States and in New York City, gangs flourished not only because of poverty but also because of political and social corruption. Policemen and politicians were often as crooked as the gang leaders themselves."
                  ]
                }
              ]
            },
            {
              "group": "A high point.",
              "entries": [
                {
                  "meaning": "A mountain, especially a very high one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Sussex) An area of land at the top of a cliff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The amplitude of a sine function",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}