{
  "word": "wye",
  "etymologies": [
    {
      "description": [
        "Attested as wi c. 1200. Of uncertain origin. Perhaps borrowed from Old French ui or gui."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wye (plural wyes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The name of the Latin-script letter Y.",
                  "examples": [
                    "Thus first C checks to see if ex and wye are equal. The resulting value of 1 or 0 (true or false) then is compared to the value of zee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Y-shaped object: a wye level, wye-connected. Especially a Y-shaped connection of three sections of road or railroad track.",
                  "examples": [
                    "A wye is used to split a single line [hose or cable] into two lines.",
                    "By going around the wye, a train can change direction."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wye (third-person singular simple present wyes, present participle wyeing or wying, simple past and past participle wyed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make something into a wye (letter Y) shape.",
                  "examples": [
                    "When a hose line is divided into two or more lines, these lines are known as wyed lines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rail transport) To reverse the direction of a train using a wye.",
                  "examples": [
                    "Since the train didn't have a control cab at the other end, they wyed the train to turn it around for the trip back to the city.",
                    "Committee contend that when these trains are wyed at Springfield, the road passenger crews are performing yard work at that point to eliminate switching by yard crews."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Old English wiga."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wye (plural wyes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic, obsolete) A warrior or fighter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic, obsolete) A hero; a man, person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}