{
  "word": "elixir",
  "etymologies": [
    {
      "description": [
        "From Medieval Latin elixir, from Arabic اَلْإِكْسِير‎ (al-ʔiksīr), from Ancient Greek ξηρίον (xēríon, “medicinal powder”), from ξηρός (xērós, “dry”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "elixir (plural elixirs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alchemy) A liquid which converts lead to gold.",
                  "examples": [
                    "For Chinese alchemists, gold held the key to the Elixir, the Eastern equivalent of the Philosopher's Stone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alchemy) A substance or liquid which is believed to cure all ills and give eternal life.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The alleged cure for all ailments; cure-all, panacea.",
                  "examples": [
                    "The silver-bullet cancer cures of yesterday’s newsmagazine covers, like interferon and angiogenesis inhibitors, disappointed the breathless expectations, as have elixirs such as antioxidants, Vioxx, and hormone replacement therapy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pharmacy) A sweet flavored liquid (usually containing a small amount of alcohol) used in compounding medicines to be taken by mouth in order to mask an unpleasant taste.",
                  "examples": [
                    "The subcommittee's report to the Council on Pharmacy and Chemistry shows that the action of somnos is practically identical with that of a 5 per cent elixir of hydrated chloral."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}