{
  "word": "freak",
  "etymologies": [
    {
      "description": [
        "1560, \"sudden change of mind, whim\", of uncertain origin. Probably from a dialectal word related to Middle English frekynge (“capricious behaviour; whims”) and Middle English friken, frikien (“to move briskly or nimbly”), from Old English frician (“to leap, dance”), or Middle English frek (“insolent, daring”), from Old English frec (“desirous, greedy, eager, bold, daring”), from Proto-West Germanic *frek, from Proto-Germanic *frekaz, *frakaz (“hard, efficient, greedy, bold, audacious”) (in which case, it would be related to the noun under Etymology 2). Compare Old High German freh (“eager”), Old English frēcne (“dangerous”)."
      ],
      "adjectives": [
        {
          "description": "freak (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Strange, weird, unexpected.",
                  "examples": [
                    "Synonyms: freakish; see also Thesaurus:strange, Thesaurus:lucky",
                    "a freak genius",
                    "freak accident"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "freak (plural freaks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A sudden change of mind",
                  "examples": [
                    "Synonyms: whim, vagary, caprice, fancy; see also Thesaurus:whim"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Someone or something that is markedly unusual or unpredictable.",
                  "examples": [
                    "Synonyms: anomaly, outlier; see also Thesaurus:anomaly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hippie.",
                  "examples": [
                    "Synonyms: longhair, tree hugger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drug addict.",
                  "examples": [
                    "Synonyms: druggie, user; see also Thesaurus:addict"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is extremely abnormal in appearance due to a severe medical condition (originally, a freak of nature); later extended to meaning a person who is extremely abnormal in social behavior, sexual orientation, gender identity, and/or business practices; an oddball, especially in physiology (e.g., \"circus freak\"); a unique person, originally in a displeasing or alienating way.",
                  "examples": [
                    "Synonyms: odd duck, weirdo; see also Thesaurus:strange person, Thesaurus:maverick"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bodybuilding) A person whose physique has grown far beyond the normal limits of muscular development; often a bodybuilder weighing more than  260 pounds (117.934 kilos).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enthusiast, or person who has an obsession with, or extreme knowledge of, something.",
                  "examples": [
                    "Synonyms: fanatic, geek; see also Thesaurus:fan"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, sometimes endearing) A very sexually perverse individual.",
                  "examples": [
                    "Synonyms: horn dog, hypersexual, pervert; see also Thesaurus:libidinist",
                    "She's a freak in the sack!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A streak of colour; variegation.",
                  "examples": [
                    "Synonyms: (birds) superciliary, vein"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Euphemistic form of fuck.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "freak (third-person singular simple present freaks, present participle freaking, simple past and past participle freaked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To react extremely or irrationally, usually under distress or discomposure.",
                  "examples": [
                    "But after one night turned into five days, I was freaking out. I missed him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive, intransitive) To be placed or place someone under the influence of a psychedelic drug, (especially) to experience reality withdrawal, or hallucinations (nightmarish), to behave irrational or unconventional due to drug use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To streak; to variegate",
                  "examples": [
                    "[…]  in fine diaper of silver and mother-of-pearl freaking the intense azure; Now scurrying close overhead, wild ink-hued random racers that fling sheeted  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English freke, freike (“a bold man, warrior, man, creature”), from Old English freca (“a bold man, warrior, hero”), from Proto-Germanic *frekô (“an active or eager man, warrior, wolf”), from *frekaz (“active, bold, desirous, greedy”), from Proto-Indo-European *pereg-, *spereg- (“to shrug, be quick, twitch, splash, blast”).",
        "Cognate with Old Norse freki (“greedy or avaricious one, a wolf”), Old High German freh (“eager”), German frech, Old English frēcne (“dangerous, daring, courageous, bold”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "freak (plural freaks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A man, particularly a bold, strong, vigorous man.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Scotland) A fellow; a petulant young man.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}