{
  "word": "sappy",
  "etymologies": [
    {
      "description": [
        "From Middle English sappy, sapy, from Old English sæpiġ (“full of sap, succulent”), equivalent to sap +‎ -y. Cognate with West Frisian sappig (“juicy”), Dutch sappig (“juicy, succulent”), Middle High German saffic, seffec (\"juicy, succulent\"; > German saftig), Danish saftig (“juicy”), Swedish saftig (“juicy”). Doublet of zaftig."
      ],
      "adjectives": [
        {
          "description": "sappy (comparative sappier, superlative sappiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Excessively sweet, emotional, nostalgic; cheesy; mushy. (British equivalent: soppy)",
                  "examples": [
                    "To himself, already beginning to resent the new employer as all that morning he had been resenting the old one, Dr. Planish groaned, “He’s getting saintly on me!  A careerist in holiness! I'll never be happy till I've got an organization where I’m sole boss—unless it’s one run by a fellow like Colonel Marduc, who has real brains and power—and cash!—and not a lot of sappy sentimentality like Vesper or psychopathic malice like Sneaky Sandy—Oh dear!”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having (a particularly large amount of) sap.",
                  "examples": [
                    "But these, tho’ fed with careful dirt,Are neither green nor sappy;Half-conscious of the garden-squirt,The spindlings look unhappy,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Juicy.",
                  "examples": [
                    "In her left hand a Cup of gold she held,",
                    "And with her right the riper fruit did reach,",
                    "Whose sappy liquor, that with fulnesse sweld,",
                    "Into her cup she scruzd, with daintie breach",
                    "Of her fine fingers, without fowle empeach,",
                    "That so faire winepresse made the wine more sweet:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, of wood) Spongy; Having spaces in which large quantities of sap can flow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Compare Latin sapere (“to taste”)."
      ],
      "adjectives": [
        {
          "description": "sappy (comparative more sappy, superlative most sappy)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Musty; tainted; rancid.",
                  "examples": [
                    "sappie or unsavourie flesh"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}