{
  "word": "dipper",
  "etymologies": [
    {
      "description": [
        "From Middle English dippere; equivalent to dip +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dipper (plural dippers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who, or that which, dips (immerses something, or itself, into a liquid).",
                  "examples": [
                    "A chocolate dipper dips the cream centers into warm chocolate by hand; when taken out the creams are shaped [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various small passerine birds of the genus Cinclus that live near fast-flowing streams and feed along the bottom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cup-shaped vessel with a long handle, for dipping into and ladling out liquids; a ladle or scoop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, India) The control in a vehicle that switches between high-beam and low-beam (i.e. dips the lights), especially when used to signal other vehicles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any snack food intended to be dipped in sauce.",
                  "examples": [
                    "chicken dippers"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A pickpocket.",
                  "examples": [
                    "It is doubtful if the Victorian Londoner needed any warning, for the artful mobsmen, toolers, whizzers and dippers, together with their stickman accomplices, were everywhere in the crowds, in the underground, on railway trains  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A person employed in a tin plate works to coat steel plates in molten tin by dipping them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A person employed to assist a bather in and out of the sea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, informal, Christianity) A Baptist or Dunker.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}