{
  "word": "la",
  "etymologies": [
    {
      "description": [
        "From Latin labii, from the first word of the sixth line of Ut queant laxis, the medieval hymn on which solfège was based because its lines started on each note of the scale successively."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "la (plural las)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A syllable used in solfège to represent the sixth note of a major scale.",
                  "examples": [
                    "And now Mrs Waters (for we must confess she was in the same bed), being, I suppose, awakened from her sleep, and seeing two men fighting in her bedchamber, began to scream in the most violent manner, crying out murder! robbery! and more frequently rape! which last, some, perhaps, may wonder she should mention, who do not consider that these words of exclamation are used by ladies in a fright, as fa, la, la, ra, da, &c., are in music, only as the vehicles of sound, and without any fixed ideas."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Sound used to form meaningless song refrains. Of imitative origin. Compare Old English lā (a common exclamation), Ancient Greek λαλαγε (lalage, “babble”), German lallen (“to babble”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English la, from Old English lā. More at lo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French la, Italian la."
      ],
      "adjectives": [
        {
          "description": "la (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Prefixed to the name of a woman, with ironic effect (as though an opera prima donna).",
                  "examples": [
                    "Following lukewarm on the heels of an article a few weeks ago, where (I paraphrase due to having filed the relevant copy in the recycling bin) Victoria Beckham made a \"well-meaning\" remark that the other Spice Girls might want to lose a few pounds, we now have a new incidence of La Beckham's scintillating and entirely well-meaning humour."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly a shortened form of lad."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "la (plural las)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Liverpudlian) lad, kid",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Cantonese 啦 (laa1). Doublet of lah."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}