{
  "word": "lek",
  "etymologies": [
    {
      "description": [
        "From Germanic roots meaning \"play\". In the biology sense, it comes specifically from Swedish lek (“child's play”), by means of Swedish leka (“to play”). The verb is first attested in English in 1871 and the noun at least as early as 1867."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lek (plural leks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) An aggregation of male animals for the purposes of courtship and display.",
                  "examples": [
                    "Each of the three displaying cocks occupies a small territory at the mating center of the lek."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lek (third-person singular simple present leks, present participle lekking, simple past and past participle lekked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) To take part in the courtship and display behaviour of a lek.",
                  "examples": [
                    "Males in many lekking species have conspicuous morphological ornaments that may be targets of female choice, but male contest competition may also be involved."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect, Yorkshire, colloquial) To play.",
                  "examples": [
                    "T’lads are lekkin in t’park."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Albanian lek, named after Alexander the Great, whose name is often shortened to Leka in Albanian."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lek (plural leks or lek or leku or lekë)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The currency unit of Albania, divided into 100 qindarka.",
                  "examples": [
                    "With the loss of control by the Government over foreign exchange surrender requirements and the almost complete depletion of foreign exchange reserves, in early 1992 the official rate was further devalued to leks 50 = $1."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}