{
  "word": "eclipse",
  "etymologies": [
    {
      "description": [
        "From Old French eclipse, from Latin eclīpsis, from Ancient Greek ἔκλειψις (ékleipsis, “eclipse”), from ἐκλείπω (ekleípō, “I abandon, go missing, vanish”), from ἐκ (ek, “out”) and λείπω (leípō, “I leave behind”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "eclipse (countable and uncountable, plural eclipses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) An alignment of astronomical objects whereby one object comes between the observer (or notional observer) and another object, thus obscuring the latter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Especially, an alignment whereby a planetary object (for example, the Moon) comes between the Sun and another planetary object (for example, the Earth), resulting in a shadow being cast by the middle planetary object onto the other planetary object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) A seasonal state of plumage in some birds, notably ducks, adopted temporarily after the breeding season and characterised by a dull and scruffy appearance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obscurity, decline, downfall.",
                  "examples": [
                    "All the posterity of our first parents suffered a perpetual eclipse of spiritual life."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "eclipse (third-person singular simple present eclipses, present participle eclipsing, simple past and past participle eclipsed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Of astronomical or atmospheric bodies, to cause an eclipse.",
                  "examples": [
                    "The Moon eclipsed the Sun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To overshadow; to be better or more noticeable than.",
                  "examples": [
                    "Synonym: upstage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Irish grammar) To undergo eclipsis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}