{
  "word": "chef",
  "etymologies": [
    {
      "description": [
        "Borrowed from French chef (from the positions of chef d'office and chef de cuisine), from Old French chief (“head, leader”) (English chief), from Vulgar Latin capus (“head”) (from which also captain, chieftain), from Latin caput (“head”) (English cap (“head covering”)), from Proto-Indo-European *kauput- (English head). Doublet of chief and caput."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chef (plural chefs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The presiding cook in the kitchen of a large household.",
                  "examples": [
                    "The Chef's peace of mind was restor'd, And in due time a banquet was placed on the board."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The head cook of a restaurant or other establishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any cook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) One who manufactures illegal drugs; a cook.",
                  "examples": [
                    "But trying to stop all the nation's meth chefs makes as much sense as building a wall along the Mexican border."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A reliquary in the shape of a head.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chef (third-person singular simple present chefs, present participle cheffing or (now less common) chefing, simple past cheffed, past participle cheffed or (now less common) chefed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(stative, informal) To work as a chef; to prepare and cook food professionally.",
                  "examples": [
                    "It was Brick who talked on alumni relations with the active chapters and who cheffed at our steak fry (more of that later) and Mrs. Cowles who took over  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(MLE, transitive) To stab with a knife, to shank.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}