{
  "word": "heart",
  "etymologies": [
    {
      "description": [
        "From Middle English herte, from Old English heorte (“heart”), from Proto-West Germanic *hertā, from Proto-Germanic *hertô (“heart”), from Proto-Indo-European *ḱérd (“heart”). Doublet of cardia.",
        "Most of the modern figurative senses (such as passion or compassion, spirit, inmost feelings, especially love, affection, and courage) were present in Old English. However, the meaning “center” dates from the early 14th century.",
        "The verb sense “to love” is from the 1977 I ❤ NY advertising campaign."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "heart (countable and uncountable, plural hearts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A muscular organ that pumps blood through the body, traditionally thought to be the seat of emotion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) One's feelings and emotions, especially considered as part of one's character.",
                  "examples": [
                    "She has a cold heart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The seat of the affections or sensibilities, collectively or separately, as love, hate, joy, grief, courage, etc.; rarely, the seat of the understanding or will; usually in a good sense; personality.",
                  "examples": [
                    "a good, tender, loving, bad, hard, or selfish heart"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Emotional strength that allows one to continue in difficult situations; courage; spirit; a will to compete.",
                  "examples": [
                    "The team lost, but they showed a lot of heart.",
                    "Synonyms: bravery, nerve, spirit; see also Thesaurus:courage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Vigorous and efficient activity; power of fertile production; condition of the soil, whether good or bad.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A term of affectionate or kindly and familiar address.",
                  "examples": [
                    "Synonyms: honey, sugar; see also Thesaurus:sweetheart",
                    "Listen, dear heart, we must go now."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, except in the phrase \"by heart\") Memory.",
                  "examples": [
                    "I  know almost every Beatles song by heart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A wight or being.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conventional shape or symbol used to represent the heart, love, or emotion: ♥ or sometimes <3.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A playing card of the suit hearts featuring one or more heart-shaped symbols.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) The twenty-fourth Lenormand card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) The centre, essence, or core.",
                  "examples": [
                    "Synonyms: crux, gist; see also Thesaurus:gist",
                    "The wood at the heart of a tree is the oldest.",
                    "Buddhists believe that suffering is right at the heart of all life."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "heart (third-person singular simple present hearts, present participle hearting, simple past and past participle hearted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, humorous, informal) To be fond of. Often bracketed or abbreviated with a heart symbol. [from late 20th c.]",
                  "examples": [
                    "Synonyms: love, less than three"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To give heart to; to hearten; to encourage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, masonry) To fill an interior with rubble, as a wall or a breakwater.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, agriculture, botany) To form a dense cluster of leaves, a heart, especially of lettuce or cabbage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}