{
  "word": "create",
  "etymologies": [
    {
      "description": [
        "From Middle English createn, from Latin creātus, the perfect passive participle of creō. In this sense, mostly displaced Old English wyrċan (whence Modern English work) and ġesċieppan (whence Modern English shape)."
      ],
      "adjectives": [
        {
          "description": "create (comparative more create, superlative most create)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Created, resulting from creation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "create (third-person singular simple present creates, present participle creating, simple past and past participle created)",
          "definitionGroups": [
            {
              "group": "(transitive) To bring into existence; (sometimes in particular:)",
              "entries": [
                {
                  "meaning": "(especially of a god) To bring into existence out of nothing, without the prior existence of the materials or elements used.",
                  "examples": []
                },
                {
                  "meaning": "To make or produce from other (e.g. raw, unrefined or scattered) materials or combinable elements or ideas; to design or invest with a new form, shape, function, etc.",
                  "examples": [
                    "Couturiers create exclusive garments for an affluent clientele."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause, to bring (a non-object) about by an action, behavior, or event, to occasion.",
                  "examples": [
                    "crop failures created food shortages and high prices; his stubbornness created many difficulties",
                    "A sudden chemical spill on the highway created a chain‐collision which created a record traffic jam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To confer or invest with a rank or title of nobility, to appoint, ordain or constitute.",
                  "examples": [
                    "Henry VIII created him a Duke.   Last month, the queen created two barons.",
                    "Under the concordate with Belgium, at least one Belgian clergyman must be created cardinal; by tradition, every archbishop of Mechelen is thus created a cardinal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be or do something creative, imaginative, originative.",
                  "examples": [
                    "Children usually enjoy creating, never mind if it is of any use!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) In theatre, to be the first performer of a role; to originate a character.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, intransitive, colloquial) To make a fuss, complain; to shout.",
                  "examples": [
                    "'What's the time?' she said. 'I must fly. Miss'll start creating.'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}