{
  "word": "decretal",
  "etymologies": [
    {
      "description": [
        "From Middle French decretal, from Late Latin dēcrētālis, from Latin decretum."
      ],
      "adjectives": [
        {
          "description": "decretal (comparative more decretal, superlative most decretal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to a decree.",
                  "examples": [
                    "[T]his finding, when read in conjunction with the other findings, as well as decretal portions of the final judgment, is more logically interpreted as a reference to the successful operation of the business  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "decretal (plural decretals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism) A papal decree, particularly one derived from an ecclesiastical letter.",
                  "examples": [
                    "DECRETALS... are the answers sent by the Pope to applications made to him as head of the church, chiefly by bishops, but also by synods, and even private individuals, for guidance in cases involving points of doctrine or discipline... From the 4th century onwards they formed the most prolific source of canon law. Decretals... ought, properly speaking, to be distinguished, on the one hand from constitutions... enacted by the Pope sua sponte without reference to any particular case, and on the other hand from rescripts... which apply only to special circumstances or individuals, and constitute no general precedent. But this nomenclature is not strictly observed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Any decree or pronounced instruction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}