{
  "word": "philology",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English philologie, from Latin philologia, from Ancient Greek φιλολογίᾱ (philologíā, “love of argument or reasoning, love of learning and literature”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "philology (countable and uncountable, plural philologies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The humanistic study of language.",
                  "examples": [
                    "Meronyms: see Thesaurus:philology"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) Linguistics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) Love and study of learning and literature, broadly speaking.",
                  "examples": [
                    "Indeed philology properly is terse and polite learning...; being that florid skill containing only the roses of learning, without the prickles thereof, in which narrow sense thorny philosophy is discharged, as no part of philology. But we take it in the larger notion, as inclusive of all human liberal studies..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(culture) Scholarship and culture, particularly classical, literary and linguistic.",
                  "examples": [
                    "Philology and philosophy are treated as reciprocal. They exist on equal footing, and neither functions satisfactorily without the other. Their methods ... are opposite; philology attains to knowledge through induction, whereas philosophy starts from a concept. To formulate his concepts soundly, the philosopher needs an adequate fund of knowledge or data; too many philosophers ... lack a basis in knowledge or tradition"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}