{
  "word": "quill",
  "etymologies": [
    {
      "description": [
        "From late Middle English quil, which is first attested in the early 15th century with the meanings \"fragment of reed\" and \"shaft of a feather\", probably from Low German and Middle Low German quiele, possibly ultimately from Proto-Indo-European *gʷelH- (“to pierce, stick”).",
        "Compare Middle High German kil (“large feather, quill”), which is derived from the Low German term."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quill (plural quills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lower shaft of a feather, specifically the region lacking barbs.",
                  "examples": [
                    "Synonym: calamus"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pen made from a feather.",
                  "examples": [
                    "Synonyms: feather pen, quill pen"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any pen.",
                  "examples": [
                    "He picked up his quill and wrote a poem."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharply pointed, barbed, and easily detached needle-like structure that grows on the skin of a porcupine or hedgehog as a defense against predators. [from early 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin piece of bark, especially of cinnamon or cinchona, curled up into a tube.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The pen of a squid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The plectrum with which musicians strike the strings of certain instruments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The tube of a musical instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something having the form of a quill, such as the fold or plain of a ruff, or (weaving) a spindle, or spool, upon which the thread for the woof is wound in a shuttle.",
                  "examples": [
                    "His hair still stood up in punk-rock quills and spikes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quill (third-person singular simple present quills, present participle quilling, simple past and past participle quilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pierce or be pierced with quills.",
                  "examples": [
                    "Coyotes, bears, and mountain lions which occasionally kill porcupines are sometimes quilled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To write.",
                  "examples": [
                    "One has only to recall that Coleridge and Wordsworth one day were lounging by the sea shore, while nearby sat an English police agent on snitch patrol prepared to rush to headquarters to quill a report about the conversation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form fabric into small, rounded folds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To decorate with quillwork.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US and Canada, especially Appalachia and the Prairies, transitive) To subject (a woman who is giving birth) to the practice of quilling (blowing pepper into her nose to induce or hasten labor).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}