{
  "word": "douche",
  "etymologies": [
    {
      "description": [
        "Borrowed from French douche (“shower”), from Italian doccia (“shower”). Sense 4 from douche bag."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "douche (plural douches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A jet or current of water or vapour directed upon some part of the body to benefit it medicinally; in particular, such a jet directed at the vagina for vaginal irrigation.",
                  "examples": [
                    "Massage, or kneading of the whole body, is carried out in this bath after which a steam douche or a warm spray is turned upon the affected parts, according to the nature of the case."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that produces the jet or current in the previous sense, such as a syringe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A jet or spray of any liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory, vulgar) Ellipsis of douchebag: A contemptible person; a worthless, brainless or disgusting person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "douche (third-person singular simple present douches, present participle douching, simple past and past participle douched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To administer a douche to; to shower; to douse",
                  "examples": [
                    "[…]  a frizzy half-white woman who looked as if she had fallen into a flour-sack, her face was so deep in powder, and her frizzy hair and her brown silk dress so douched with the white dust of it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use a douche.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}