{
  "word": "pragmatist",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek πρᾶγμα (prâgma, “thing”)."
      ],
      "adjectives": [
        {
          "description": "pragmatist (comparative more pragmatist, superlative most pragmatist)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Advocating pragmatism.",
                  "examples": [
                    "Historians also suggest that Roosevelt was a pragmatist in foreign affairs, in that his policies were determined by practical consequences rather than by any philosophy."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pragmatist (plural pragmatists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who acts in a practical or straightforward manner; one who is pragmatic; one who values practicality or pragmatism.",
                  "examples": [
                    "A pragmatist would never plant such a messy tree, but I like its flowers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who acts in response to particular situations rather than upon abstract ideals; one who is willing to ignore their ideals to accomplish goals.",
                  "examples": [
                    "I'm not a thief, I am a pragmatist. I need this bread to feed my family.",
                    "We cannot trust him not to lie for his own gain: he's an opportunist and a pragmatist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who belongs to the philosophic school of pragmatism; one who holds that the meaning of beliefs are the actions they entail, and that the truth of those beliefs consist in the actions they entail successfully leading a believer to their goals.",
                  "examples": [
                    "[S]ome pragmatists (such as William James) took a more pantheist or pandeist approach by rejecting views of God as separate from the world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) An advocate of pragmatism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) one who studies pragmatics.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}