{
  "word": "zinc",
  "etymologies": [
    {
      "description": [
        "From German Zink, related to Zinke (“point, prong”), from Middle High German zinke, from Old High German zinko (“prong, tine”), allied to zint (“a jag, point”), from Proto-Germanic *tindaz (“prong, pinnacle”), from Proto-Indo-European *h₃dónts (“tooth, projection”). Cognate with Old English tind (“tine, prong”), Middle Low German tinde, Icelandic tindur (“spike, tooth of a rake or harrow, pinnacle, peak, battlement”). See also Dutch tinne (“battlement”), German Zinne (“pinnacle, battlement”), Danish tinde (“pinnacle, battlement”), Swedish tinne (“tooth of a rake”), More at tine. Doublet of zincum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "zinc (countable and uncountable, plural zincs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chemical element (symbol Zn) with an atomic number of 30, a slightly brittle blue-silvery metal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A single atom of this element.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Nigeria) A corrugated iron roof.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dated, colloquial) A zinc countertop.",
                  "examples": [
                    "Then, three workmen throwing dice for drinks. And their heads come sharply together as they count the scores. And so violently do they throw the dice that they shoot off \"the zinc\" on to the floor."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "zinc (third-person singular simple present zincs, present participle zincing or zinking or zincking, simple past and past participle zinced or zinked or zincked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) To electroplate with zinc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) To coat with sunblock incorporating zinc oxide.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}