{
  "word": "leverage",
  "etymologies": [
    {
      "description": [
        "lever +‎ -age"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leverage (usually uncountable, plural leverages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A force compounded by means of a lever rotating around a pivot; see torque.",
                  "examples": [
                    "Synonym: mechanical advantage",
                    "A crowbar uses leverage to pry nails out of wood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any influence which is compounded or used to gain an advantage.",
                  "examples": [
                    "Try using competitors’ prices for leverage in the negotiation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) The use of borrowed funds with a contractually determined return to increase the ability to invest and earn an expected higher return, but usually at high risk.",
                  "examples": [
                    "Leverage is great until something goes wrong with your investments and you still have to pay your debts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) The debt-to-equity ratio.",
                  "examples": [
                    "Synonym: gearing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) The ability to earn very high returns when operating at high-capacity utilization of a facility.",
                  "examples": [
                    "Synonym: operating leverage",
                    "Their variable-cost-reducing investments have dramatically increased their leverage."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "leverage (third-person singular simple present leverages, present participle leveraging, simple past and past participle leveraged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly US, slang, business) To use; to exploit; to manipulate in order to take full advantage (of something).",
                  "examples": [
                    "They plan to leverage the publicity into a good distribution agreement.",
                    "They plan to leverage off the publicity to get a good distribution agreement."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}