{
  "word": "prescription",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French, from Old French prescripcion, from Latin praescriptio (“preface; pretext; something written ahead of time”), from prae- (“pre-, before”) + scribere (“to write”) + -tio (“-tion, forming nouns”)."
      ],
      "adjectives": [
        {
          "description": "prescription (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a drug, etc.) only available with a physician or nurse practitioner's written prescription",
                  "examples": [
                    "Many powerful pain killers are prescription drugs in the U.S."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "prescription (countable and uncountable, plural prescriptions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, pharmacy, pharmacology) A written order from an authorized medical practitioner for provision of a medicine or other treatment, such as (ophthalmology) the specific lenses needed for a pair of glasses.",
                  "examples": [
                    "Synonyms: scrip, forescript, Rx, ℞",
                    "The surgeon had written thousands of prescriptions for pain killers without proper examinations before the police raided the clinic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The medicine or treatment provided by such an order.",
                  "examples": [
                    "I need you to pick up gramma's prescriptions on your way home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any plan of treatment or planned treatment.",
                  "examples": [
                    "Early to bed and early to rise is a prescription for a long, healthy, and terrible life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Synonym of enactment, the act of establishing a law, regulation, etc., particularly in writing; an instance of this.",
                  "examples": [
                    "A statute that cannot find justification for its prescription in one or more of these principles violates international law."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) The act of establishing or formalizing ideal norms for language use, as opposed to describing the actual norms of such use; an instance of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An established time period within which a right must be exercised and after which it is null and permanently unenforceable.",
                  "examples": [
                    "Synonyms: extinctive prescription, liberative prescription"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An established time period after which a person who has uninterruptedly, peacefully, and publicly used another's property acquires full ownership of it.",
                  "examples": [
                    "Synonyms: acquisitive prescription, usucaption"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Synonym of self-restraint, limiting of one's actions especially according to a moral code or social conventions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}