{
  "word": "tryst",
  "etymologies": [
    {
      "description": [
        "From Middle English tryst, trist, from Old French triste, tristre (“waiting place, appointed station in hunting”), probably from a North Germanic source such as Old Norse treysta (“to make safe, secure”), from traust (“confidence, trust, security, help, shelter, safe abode”), from Proto-Germanic *traustą (“trust, shelter”), from Proto-Indo-European *deru-, *dreu-, *drū- (“to be firm, be solid”). Doublet of trust (which see)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tryst (plural trysts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prearranged meeting or assignation, now especially between lovers to meet at a specific place and time.",
                  "examples": [
                    "If someone trusts you, what is lost if you betray that trust? As Scarlett is tempted to see it, sometimes nothing at all. If her husband remains ignorant of her tryst, then his trust in her will remain intact. ‘No one gets hurt’ runs her reasoning, so why not go ahead?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A mutual agreement, a covenant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, historical) A market fair, especially a recurring one held on a schedule, where livestock sales took place.",
                  "examples": [
                    "Coordinate terms: fair, mart, market, farmers' market"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tryst (third-person singular simple present trysts, present participle trysting, simple past and past participle trysted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a tryst; to agree to meet at a place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To arrange or appoint (a meeting time etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To keep a tryst, to meet at an agreed place and time.",
                  "examples": [
                    "He said he was jealous, and craved something to ease his care. 'It's but a small thing I ask,' says he, 'but it will make me a happy man, and nothing ever shall come atween us. Tryst wi' me for Beltane's E'en on the Sker sands, at the green link o' the burn where the sands begin, on the ebb o' the tide when midnight is by, but afore cockcrow. For,' said he, 'that was our forbears' tryst for true lovers, and wherefore no for you and me?'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}