{
  "word": "biology",
  "etymologies": [
    {
      "description": [
        "A classical compound, being a naturalization into English via the German Biologie from the New Latin coinage biologia, with components derived from Ancient Greek βίος (bíos, “bio-, life”) +‎ -λογία (-logía, “-logy, branch of study, to speak”). The term *βιολογία (*biología) did not exist in Ancient Greek. The New Latin word was coined in the 18th century but did not yet have the sense that it now has. That sense was developed circa 1800 when the German word Biologie was naturalized from the New Latin word; see Wikipedia at Biology § Etymology for the details. The modern sibling cognates came into various European languages in the 19th century (e.g., French biologie, English biology). As the scientific era progressed in the 19th century, the modern surface analysis of the English word developed, as a compound using the combining forms bio- +‎ -logy. As for modern Greek βιολογία (viología): it is borrowed from both English and French biologie via international scientific vocabulary."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "biology (countable and uncountable, plural biologies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The study of all life or living matter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The living organisms of a particular region.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The structure, function, and behavior of an organism or type of organism.",
                  "examples": [
                    "the biology of the whale"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}