{
  "word": "abut",
  "etymologies": [
    {
      "description": [
        "From Middle English abutten, from Medieval Latin abuttare and Old French abuter, aboter, abouter (“to touch at one end, to come to an end, aim, reach”), from Old French but (“end, aim, purpose”); akin to Old Norse butr (“piece of wood”). Equivalent to a- (“to”) +‎ butt (“boundary mark”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "abut (third-person singular simple present abuts, present participle abutting, simple past and past participle abutted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To touch by means of a mutual border, edge or end; to border on; to lie adjacent (to); to be contiguous (said of an area of land) [First attested around 1350 to 1470.]",
                  "examples": [
                    "It was a time when Germany still abutted upon Russia.",
                    "His land abuts on the road."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To border upon; be next to; abut on; be adjacent to. [First attested in the mid 19th century.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English abutten, from Old French aboter (“to touch at one end, border on”), abouter (“to join end to end”), abuter (“to buttress, to put an end to”), from a- (“towards”) + bout (“end”), boter, bouter (“to strike”), buter (“to strike, finish”). Equivalent to a- (“towards, change to”) +‎ butt (“push”)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "abut (third-person singular simple present abuts, present participle abutting, simple past and past participle abutted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lean against on one end; to end on, of a part of a building or wall. [First attested in the late 16th century.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}