{
  "word": "magpie",
  "etymologies": [
    {
      "description": [
        "From Mag, a nickname for Margaret that was used to denote a chatterer, + archaic pie (“magpie”), from Old French pie, from Latin pīca, from Proto-Indo-European *(s)peyk- (“woodpecker, magpie”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "magpie (plural magpies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of several kinds of bird in the family Corvidae, especially Pica pica.",
                  "examples": [
                    "Synonyms: maggie, Eurasian magpie, European magpie, common magpie, pica, (obsolete) pie, (regional) piet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A superficially similar Australian bird, Gymnorhina tibicen or Cracticus tibicen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Someone who displays a magpie-like quality such as hoarding or stealing objects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A fan or member of Newcastle United F.C.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, firearms) The third circle on a target, between the inner and outer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A halfpenny.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "magpie (third-person singular simple present magpies, present participle magpieing, simple past and past participle magpied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark with patches of black and white or light and dark.",
                  "examples": [
                    "Synonym: mottle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To steal or hoard (items) as magpies are believed to do.",
                  "examples": [
                    "[…]  she liked to be able to have a picturesque fact or two with which to support herself when she too, to hold attention, wanted to issue moving statements as to revolutions, anarchies and strife in the offing. And she had noticed that when she magpied Tietjens’ conversations more serious men in responsible positions were apt to argue with her and to pay her more attention than before...."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To talk idly; to talk about other people's private business.",
                  "examples": [
                    "Synonyms: chatter, gossip"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}