{
  "word": "dabble",
  "etymologies": [
    {
      "description": [
        "From earlier dable, equivalent to dab +‎ -le (frequentative suffix), possibly from Middle Dutch dabbelen (“to pinch; knead; to fumble; to dabble”); cognate with Icelandic dafla (“to dabble”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dabble (plural dabbles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spattering or sprinkling of a liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of splashing in soft mud, water, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of participation in an activity in a casual or superficial way.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dabble (third-person singular simple present dabbles, present participle dabbling, simple past and past participle dabbled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make slightly wet or soiled by spattering or sprinkling a liquid (such as water, mud, or paint) on it; to bedabble. [from late 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause splashing by moving a body part like a bill or limb in soft mud, water, etc., often playfully; to play in shallow water; to paddle.",
                  "examples": [
                    "The children sat on the dock and dabbled their feet in the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of waterfowl) To feed without diving, by submerging the head and neck underwater to seek food, often also tipping up the tail straight upwards above the water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To participate or have an interest in an activity in a casual or superficial way.",
                  "examples": [
                    "She’s an actress by trade, but has been known to dabble in poetry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To interfere or meddle in; to tamper with.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}