{
  "word": "spy",
  "etymologies": [
    {
      "description": [
        "From Middle English spien, aphetic variant of earlier espien (“to espy”), from Old French espier (“to spy”), from Frankish *spehōn (“to spy”), from Proto-Germanic *spehōną (“to see, look”), from Proto-Indo-European *speḱ- (“to look”). Akin to German spähen (“to spy”), Dutch spieden (“to spy”).",
        "The noun displaced native Old English sċēawere (literally “watcher”), which was also the word for \"mirror.\" In this sense, the verb displaced Old English sċēawian, which was also the word for \"to watch\" and became the Modern English word show."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spy (plural spies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who secretly watches and examines the actions of other individuals or organizations and gathers information on them (usually to gain an advantage).",
                  "examples": [
                    "Synonyms: (obsolete) espy, intelligencer; see also Thesaurus:spy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A defensive player assigned to cover an offensive backfield player man-to-man when they are expected to engage in a running play, but the offensive player does not run with the ball immediately.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spy (third-person singular simple present spies, present participle spying, simple past and past participle spied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act as a spy.",
                  "examples": [
                    "During the Cold War, Russia and America would each spy on each other for recon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spot; to catch sight of.",
                  "examples": [
                    "I think I can spy that hot guy coming over here."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To search narrowly; to scrutinize.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To explore; to see; to view; inspect and examine secretly, as a country.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}