{
  "word": "aver",
  "etymologies": [
    {
      "description": [
        "From Middle English averren (“to corroborate (a statement); to cite (something) as corroboration or proof; (law) to prove (something) in court; to declare (something) under oath as true; to prove (a case) by a jury’s oaths”) [and other forms], from Old French averer (modern French avérer (“to reveal, uncover; to prove (to be), transpire”)), from Vulgar Latin *advērāre (“to make true; to prove to be true; to verify”), the present active infinitive of Vulgar Latin *advērō (“to make true; to prove to be true”), from Latin ad- (prefix forming factitive verbs meaning ‘to make (something) have the properties of [the adjective or noun to which it is attached]’) + vērus (“actual, real, true; genuine; proper, suitable; just, right”) (ultimately from Proto-Indo-European *weh₁- (“true”)) + -ō (suffix forming regular first-conjugation verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "aver (third-person singular simple present avers, present participle averring or (obsolete) avering, simple past and past participle averred or (obsolete) avered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To assert the truth of (something); to affirm (something) with confidence; to declare (something) in a positive manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, law) To justify or prove (an allegation or plea that one has made).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To avouch, prove, or verify the existence or happening of (something), or to offer to do so.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English aver, avere (“workhorse; any beast of burden (?); things which are owned, possessions, property, wealth; state of being rich, wealth; ownership, possession”) [and other forms], and then either:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "aver (plural avers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialectal, archaic) A beast of burden; chiefly a workhorse, but also a working ox or other animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England, Scotland, dialectal, archaic) An old, useless horse; a nag.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}