{
  "word": "extenuate",
  "etymologies": [
    {
      "description": [
        "From Middle English extenuat (“(medicine) made thin, emaciated”), from Latin extenuātus (“diminished, reduced, thinned”), the perfect passive participle of extenuō (“to diminish, reduce, thin”), from ex- (intensifying prefix) + tenuō (“to enfeeble, weaken, wear down; to lessen, reduce; to make thin”). Tenuō is derived from tenuis (“fine, slender, thin; feeble, weak”) (ultimately from Proto-Indo-European *tenh₂- (“to extend, stretch; thin”)) + -ō (suffix forming regular first-conjugation verbs)."
      ],
      "adjectives": [
        {
          "description": "extenuate (comparative more extenuate, superlative most extenuate) (obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person: emaciated, wasted, weakened; of the body or part of it: atrophied, shrunken, withered.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a quality or thing: lessened, weakened.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Reduced to poverty; impoverished.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin extenuātus (“diminished, reduced, thinned”): see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "extenuate (third-person singular simple present extenuates, present participle extenuating, simple past and past participle extenuated) (transitive, formal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make (something) less dense, or thinner; also, to lower the viscosity of (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(archaic)",
              "entries": [
                {
                  "meaning": "To make (someone or something) slender or thin; to emaciate, to waste.",
                  "examples": []
                },
                {
                  "meaning": "To underestimate or understate the importance of (something); to underrate.",
                  "examples": [
                    "to extenuate his faults    to extenuate their crimes"
                  ]
                },
                {
                  "meaning": "(specifically) To diminish or seek to diminish the extent or severity of (a crime, guilt, a mistake, or something else negative) by making apologies or excuses; to palliate.",
                  "examples": [
                    "to extenuate his faults    to extenuate their crimes"
                  ]
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "To beat or draw (a metal object, etc.) out so as to lessen the thickness.",
                  "examples": []
                },
                {
                  "meaning": "To reduce the quality or quantity of (something); to lessen or weaken the force of (something).",
                  "examples": [
                    "Synonym: mitigate",
                    "Antonym: aggravate"
                  ]
                },
                {
                  "meaning": "To degrade (someone); to detract from (someone's qualities, reputation, etc.); to depreciate, to disparage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}