{
  "word": "tawny",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Middle English tauni, tawne (“having a brownish-orange colour”) [and other forms], from Anglo-Norman taune, tawné, and Old French tané, tanné, tanney (“of a tan colour”), an adjective use of the past participle of taner (“to turn hide into leather, tan”), from tan (“pulped oak bark used to tan leather, tanbark”), ultimately from Proto-Celtic *tannos (“green oak”); further etymology uncertain, possibly from Proto-Indo-European *(s)dʰnwos, *(s)dʰonu (“fir”).",
        "The -aw- spelling (also -au- in Middle English) seems to have been due to the pronunciation of Old French tané.",
        "The verb is derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "tawny (comparative tawnier, superlative tawniest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a light brown to brownish orange colour.",
                  "examples": [
                    "Synonyms: fulvid, fulvous, olivaster, subfuscous, swart, swartish, swarty; see also Thesaurus:brownish"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "tawny (third-person singular simple present tawnies, present participle tawnying, simple past and past participle tawnied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (someone or something) to have a light brown to brownish orange colour; to tan, to tawn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become a light brown to brownish orange colour; to tan, to tawn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English tauni, tawne (“brownish-orange colour; cloth of this colour; sweet beverage of this colour”) [and other forms], from Anglo-Norman tawné, and Old French tané, tanné, tanney (“tan colour; cloth of this colour”), from tané (verb): see further at etymology 1.",
        "Sense 2.1 (“Eurasian bullfinch”) is due to the brown colour of the female."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tawny (countable and uncountable, plural tawnies or tawnys)",
          "definitionGroups": [
            {
              "group": "A light brown to brownish orange colour.",
              "entries": [
                {
                  "meaning": "(specifically, heraldry) Synonym of tenné (“a rarely-used tincture of orange or bright brown”)",
                  "examples": [
                    "Hyponym: dragon's head"
                  ]
                }
              ]
            },
            {
              "group": "Something of a light brown or brownish orange colour (particularly if it has the word tawny in its name).",
              "entries": [
                {
                  "meaning": "(Somerset) The common bullfinch or Eurasian bullfinch (Pyrrhula pyrrhula).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alcoholic beverages) In full tawny port: a sweet, fortified port wine which is blended and matured in wooden casks.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "A fabric of a light brown to brownish orange colour.",
                  "examples": []
                },
                {
                  "meaning": "(probably derogatory) A person with skin of a brown colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Tawny frogmouth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Tawny owl.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}