{
  "word": "satellite",
  "etymologies": [
    {
      "description": [
        "From Middle French satellite, from Latin satelles (“attendant”). Ultimately perhaps of Etruscan origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "satellite (plural satellites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A moon or other smaller body orbiting a larger one. [from 17th c.]",
                  "examples": [
                    "The Moon is a natural satellite of the Earth.",
                    "A spent upper stage is a derelict satellite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A man-made apparatus designed to be placed in orbit around a celestial body, generally to relay information, data etc. to Earth. [from 20th c.]",
                  "examples": [
                    "Many telecommunication satellites orbit at 36000km above the equator."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A country, state, office, building etc. which is under the jurisdiction, influence, or domination of another body. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) An attendant on an important person; a member of someone's retinue, often in a somewhat derogatory sense; a henchman. [from 16th c.]",
                  "examples": [
                    "[…] he would nevertheless have a better bargain of this tall satellite if they settled the debate betwixt them in the forest […]. Betwixt anxiety, therefore, vexation, and anger, Charles faced suddenly round on his pursuer […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, uncountable) Satellite TV; reception of television broadcasts via services that utilize man-made satellite technology. [from 20th c.]",
                  "examples": [
                    "Do you have satellite at your house?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A grammatical construct that takes various forms and may encode a path of movement, a change of state, or the grammatical aspect. Examples: \"a bird flew past\"; \"she turned on the light\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A very large array of tandemly repeating, non-coding DNA.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "satellite (third-person singular simple present satellites, present participle satelliting, simple past and past participle satellited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(broadcasting, transitive) To transmit by satellite.",
                  "examples": [
                    "It had to speed up its efforts to participate in the international satellite television market. In the summer of 1986 it began satelliting TV programs to Africa, and in early 1987, to Asia and twenty countries in Latin America  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}