{
  "word": "weevil",
  "etymologies": [
    {
      "description": [
        "From Middle English wevel, from Old English wifel (“beetle”), from Proto-West Germanic *wibil, from Proto-Germanic *wibilaz, from Proto-Indo-European *webʰel-, from *(h₁)webʰ- (“to wave, to weave”), said to be from the woven appearance of a weevil’s larval case, + *-el-, *-l̥- (diminutive or attributive suffix); see also wave and weave.",
        "Compare Old Saxon *wivil (“beetle”); Middle Low German wevel; Old High German wibil, wipil (modern German Wiebel (“beetle; chafer”)); Lithuanian vãbalas (“beetle; weevil”); Old Norse vifill, as in tordyfill (“dung beetle, scarab”) (whence Dutch tortwevel; Icelandic tordýfill, Norwegian tordivel, Old English tordwifel, Swedish tordyvel); dialectal Russian ве́блица (véblica, “intestinal worm”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "weevil (plural weevils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of many tens of thousands of species of herbivorous beetles, ranging in size from tiny to large, in the superfamily Curculionoidea, the most characteristic species having the head projecting in a distinctive snout with the mouthparts at the tip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of many tens of thousands of species of herbivorous beetles of various sizes, in the family Curculionidae within the superfamily Curculionoidea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of many similar, but more distantly related, beetles such as the biscuit weevil (Stegobium paniceum).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, derogatory) A loathsome person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}