{
  "word": "cappuccino",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian cappuccino (“cappuccino (coffee drink)”), from Viennese German Kapuziner (“Capuchin (member of an order of Roman Catholic friars)”) (due to the similarity of the dark brown colour of the beverage to that of the monastic habit; compare Franziskaner (“Franciscan”), a contemporary coffee drink with more milk and hence a lighter colour, similar to Franciscan monks’ light brown habits), and café noisette. Kapuziner was in turn borrowed from Italian cappuccino (“Capuchin”), from Italian cappuccio (“cowl, hood”) (from the hoods of Capuchin monks’ habits) + -ino (diminutive suffix); and cappuccio from cappa (“cowl, hood; cape, cloak; sleeveless coat”) (from Late Latin cappa (“cape; sleeveless coat”); further etymology uncertain, perhaps from Proto-Indo-European *káput (“head”)) + -uccio (“diminutive suffix”). Doublet of Capuchin.",
        "The plural form cappuccini is derived from Italian cappuccini."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cappuccino (countable and uncountable, plural cappuccinos or (less common) cappuccini)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) An Italian coffee-based beverage made from espresso to which milk that has been steamed and/or frothed is added; (countable) a cup of this beverage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, proscribed) Any of various similar drinks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, also attributively) A medium- to dark-brown colour like that of the coffee drink (sense 1) or the habit of a Capuchin monk.",
                  "examples": [
                    "cappuccino:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}