{
  "word": "brainstorm",
  "etymologies": [
    {
      "description": [
        "brain +‎ storm. In the sense of \"problem-solve\", devised as a method of group creative problem-solving by advertising executive Alex F. Osborn and his employees, who coined the term based on the image of using \"the brain to storm a problem\". In the sense of \"seizure, convulsion, brain activity\", from the unrelated idea that it is like a storm in the brain."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brainstorm (plural brainstorms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A sudden thought, particularly one that solves a long-standing problem.",
                  "examples": [
                    "Synonym: brainwave",
                    "I had been working on the problem for weeks, and then I had a brainstorm and saw that the solution was easy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A session of brainstorming, investigating a problem to try to find solutions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) An unexpected mental error.",
                  "examples": [
                    "A terrible fielding error from Tony Graffanino proved costly. [...] Aaron Rowand collected an RBI double to get them off the mark before Graffanino's brainstorm. Juan Uribe hit a roller to the second baseman, who let the potential inning-ending double-play ball roll under his glove, leaving runners at first and third bases."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of brain storm (“activity in the brain, such as a seizure or convulsion”)",
                  "examples": [
                    "electrical brainstorm"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brainstorm (third-person singular simple present brainstorms, present participle brainstorming, simple past and past participle brainstormed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To investigate something, or solve a problem using brainstorming.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To participate in a brainstorming session.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}