{
  "word": "thumb",
  "etymologies": [
    {
      "description": [
        "From Middle English thombe, thoume, thoumbe, from Old English þūma, from Proto-West Germanic *þūmō, from Proto-Germanic *þūmô from Proto-Indo-European *tūm- (“to grow”).",
        "See also West Frisian tomme, Dutch duim, Low German Duum, German Daumen, Danish tomme, Swedish tumme; also\nWelsh tyfu (“to grow”), Latin tumēre (“to swell”), Lithuanian tumėti (“to thicken, clot”), Ancient Greek τύμβος (túmbos, “burial mound”), Avestan 𐬀𐬨𐬏𐬙‎ (amūt, “strong”), Sanskrit तुम्र (túmra, “strong, thick”). The parasitic ‐b has existed since the late 13th century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thumb (plural thumbs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The short thick digit of the hand that for humans has the most mobility and can be made to oppose (moved to touch) all of the other fingers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graphical user interface) The part of a slider that may be moved linearly along the slider.",
                  "examples": [
                    "a scroll-bar thumb"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, Internet) A thumbnail picture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "thumb (third-person singular simple present thumbs, present participle thumbing, simple past and past participle thumbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch or cover with the thumb.",
                  "examples": [
                    "to thumb the touch-hole of a cannon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, with through) To turn the pages of (a book) in order to read it cursorily.",
                  "examples": [
                    "I thumbed through the book and decided not to bother reading it all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(travel) To hitchhike",
                  "examples": [
                    "So I started thumbin' back east, toward my hometown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To soil or wear with the thumb or the fingers; to soil, or wear out, by frequent handling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To manipulate (an object) with the thumb; especially, to pull back the hammer or open the cylinder of a revolver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fire (a single action revolver) quickly by pulling the hammer while keeping the trigger depressed.",
                  "examples": [
                    "To thumb a single-action revolver, hold down the trigger and use the thumb on the same hand to fire the gun by manipulating the hammer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}