{
  "word": "vaporous",
  "etymologies": [
    {
      "description": [
        "From Middle French vapoureus, or from its etymon Late Latin vapōrus, vapōrōsus (“full of steam”) + English -ous (suffix denoting the presence of a quality in any degree, typically in abundance). Vapōrōsus is derived from Latin vapor (“exhalation; smoke; steam, vapour”) (possibly related to Proto-Indo-European *kwep- (“to boil; to smoke, steam; aroma; strong odour”)) + -ōsus (suffix meaning ‘full of, overly, prone to’ forming adjectives from nouns). The English word is analysable as vapor, vapour +‎ -ous."
      ],
      "adjectives": [
        {
          "description": "vaporous (comparative more vaporous, superlative most vaporous)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to vapour; also, having the characteristics or consistency of vapour.",
                  "examples": [
                    "Synonyms: (obsolete) halitous, (obsolete) halituous, vaporiform, vaporlike, vapourlike, (obsolete) vaporose, vapory, vapoury; see also Thesaurus:gaseous",
                    "Antonym: nonvaporous"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Breathing out or giving off vapour.",
                  "examples": [
                    "Synonyms: (rare) vaporescent, (rare) vapourescent"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a place: filled with vapour; foggy, misty.",
                  "examples": [
                    "Synonyms: fumid, (rare) vapored, (rare) vapoured, (rare) vaporiferous, vaporsome"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a thing: covered or hidden by vapour, fog, or mist.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Lacking depth or substance; insubstantial, thoughtless, vague.",
                  "examples": [
                    "Synonyms: frothy, vain, vaporsome"
                  ]
                },
                {
                  "meaning": "Of clothes or fabric: thin and translucent; filmy, gauzy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}