{
  "word": "slow",
  "etymologies": [
    {
      "description": [
        "From Middle English slow, slaw, from Old English slāw (“sluggish, inert, slothful, late, tardy, torpid, slow”), from Proto-Germanic *slaiwaz (“blunt, dull, faint, weak, slack”), possibly from Proto-Indo-European *sleyH-u- (“bad”). Cognate with Scots slaw (“slow”), West Frisian sleau (“slow, dull, lazy”), Dutch sleeuw (“blunt, dull”), Low German slee (“dull, sluggish”), German schlehe, schleh (“dull, exhausted, faint”), Danish sløv (“dull, torpid, drowsy”), Swedish slö (“slack, lazy”), Icelandic sljór (“dim-witted, slow”)."
      ],
      "adjectives": [
        {
          "description": "slow (comparative slower, superlative slowest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Taking a long time to move or go a short distance, or to perform an action; not quick in motion; proceeding at a low speed.",
                  "examples": [
                    "a slow train;  a slow computer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not happening in a short time; spread over a comparatively long time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of reduced intellectual capacity; not quick to comprehend.",
                  "examples": [
                    "Experienced classroom teachers are well acquainted with the attention-seeker, the shy girl, the aggressive boy, the poor concentrator, the slow student  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not hasty; not tending to hurry; acting with deliberation or caution.",
                  "examples": [
                    "And even after the emotional cast comes off, we need to be slow about getting deeply involved in a relationship again"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a clock or the like) Behind in time; indicating a time earlier than the true time.",
                  "examples": [
                    "That clock is slow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lacking spirit; deficient in liveliness or briskness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a period of time) Not busy; lacking activity.",
                  "examples": [
                    "It was a slow news day, so the editor asked us to make our articles wordier.",
                    "I'm just sitting here with a desk of cards, enjoying a slow afternoon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "slow (comparative slower, superlative slowest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Slowly.",
                  "examples": [
                    "That clock is running slow.",
                    "I want to dance with you nice and slow"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "slow (plural slows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who is slow; a sluggard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A slow song.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slow (third-person singular simple present slows, present participle slowing, simple past and past participle slowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (something) run, move, etc. less quickly; to reduce the speed of.",
                  "examples": [
                    "slow the process"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep from going quickly; to hinder the progress of.",
                  "examples": [
                    "slow the traffic"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become slow; to slacken in speed; to decelerate.",
                  "examples": [
                    "After about a minute, the creek bed vomited the debris into a gently sloped meadow. Saugstad felt the snow slow and tried to keep her hands in front of her."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}