{
  "word": "receptive",
  "etymologies": [
    {
      "description": [
        "From Late Middle English receptive, receptyue (“capable of receiving something; acting as a receptacle”), borrowed from Medieval Latin receptivus (“capable of receiving something”), from Latin receptus (“retaken, having been retaken; received, having been received”) + -īvus (suffix added to the perfect passive participial stems of verbs, forming a deverbal adjective meaning ‘doing; related to doing’). Receptus is the perfect passive participle of recipiō (“to regain possession, take back; to recapture; to receive; to accept, undertake”), from re- (prefix meaning ‘back, backwards; again’) + capiō (“to capture, catch, take; to take hold, take possession; to take on; to contain, hold; to occupy; to possess; to receive, take in; to comprehend, understand; to captivate, charm”) (ultimately from Proto-Indo-European *kap-, *keh₂p- (“to hold; to seize”))."
      ],
      "adjectives": [
        {
          "description": "receptive (comparative more receptive, superlative most receptive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Capable of receiving something.",
                  "examples": [
                    "Antonyms: irreceptive, nonreceptive, unreceptive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ready to receive something, especially new concepts or ideas.",
                  "examples": [
                    "Synonyms: acceptive, susceptive",
                    "Antonym: unreceptive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Of a female flower or gynoecium: ready for reproduction; fertile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(neurology, psychology) Of, affecting, or pertaining to the understanding of language rather than its expression.",
                  "examples": [
                    "Antonym: expressive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Of a female animal (especially a mammal): prepared to mate; in heat, in oestrus.",
                  "examples": [
                    "Synonym: oestrual"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}