{
  "word": "swale",
  "etymologies": [
    {
      "description": [
        "Possibly from Middle English swale (“a shady place, a shadow”), perhaps of North Germanic origin; akin to Old Norse svalr (“cool, fresh”), Icelandic svalir (“a balcony running along a wall”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swale (plural swales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low tract of moist or marshy land.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long narrow and shallow trough between ridges on a beach, running parallel to the coastline.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shallow troughlike depression that's created to carry water during rainstorms or snow melts; a drainage ditch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bioswale, a shallow trough dug into the land on contour (horizontally with no slope), whose purpose is to allow water time to percolate into the soil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shallow, usually grassy depression sloping downward from a plains upland meadow or level vegetated ridgetop.",
                  "examples": [
                    "Jane climbed a few more paces behind him and then peeped over the ridge. Just beyond began a shallow swale that deepened and widened into a valley, and then swung to the left."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See sweal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swale (plural swales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal) A gutter in a candle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swale (third-person singular simple present swales, present participle swaling, simple past and past participle swaled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of sweal (melt and waste away, or singe)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}