{
  "word": "rattle",
  "etymologies": [
    {
      "description": [
        "Middle English [Term?], from Old English hratele, ultimately imitative. The noun (c. 1500) is from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rattle (countable and uncountable, plural rattles)",
          "definitionGroups": [
            {
              "group": "Object that rattles.",
              "entries": [
                {
                  "meaning": "Any of various plants of the genera Rhinanthus and Pedicularis, whose seeds produce a rattling noise in the wind. [from 10th c.]",
                  "examples": []
                },
                {
                  "meaning": "A baby’s toy designed to make sound when shaken, usually containing loose grains or pellets in a hollow container. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(music) A musical instrument that makes a rattling sound. [from 17th c.]",
                  "examples": [
                    "The rattles of Isis and the cymbals of Brasilea nearly enough resemble each other."
                  ]
                },
                {
                  "meaning": "(zoology) The set of rings at the end of a rattlesnake's tail which produce a rattling sound. [from 17th c.]",
                  "examples": [
                    "The rattle of the rattlesnake is composed of the hardened terminal scales, loosened in succession, but not cast off, and modified in form so as to make a series of loose, hollow joints."
                  ]
                }
              ]
            },
            {
              "group": "Rattling sound.",
              "entries": [
                {
                  "meaning": "(onomatopoeia) A rapid succession of percussive sounds, as made by loose objects shaking or vibrating against one another. [from 16th c.]",
                  "examples": [
                    "I wish they would fix the rattle under my dashboard."
                  ]
                },
                {
                  "meaning": "(now rare) Noisy, rapid talk; babble. [from 17th c.]",
                  "examples": [
                    "All this adoe about the golden age is but an empty rattle and frivolous conceipt."
                  ]
                },
                {
                  "meaning": "(uncountable, now rare) Trivial chatter; gossip. [from 17th c.]",
                  "examples": [
                    "“And pray where, Lady Honoria,” cried Mrs. Delvile, “do you contrive to pick up all this rattle?”"
                  ]
                },
                {
                  "meaning": "A noisy, senseless talker; a jabberer. [from 17th c.]",
                  "examples": [
                    "‘Sir James is a young Man of an amiable disposition, and excellent character;—a little too much of the Rattle perhaps, but a year or two will rectify that  […] .’"
                  ]
                },
                {
                  "meaning": "(obsolete) A scolding; a sharp rebuke. [17th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A rough noise produced in the throat by air passing through obstructed airways; croup; a death rattle. [from 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rattle (third-person singular simple present rattles, present participle rattling, simple past and past participle rattled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ergative) To create a rattling sound by shaking or striking.",
                  "examples": [
                    "to rattle a chain",
                    "Rattle the can of cat treats if you need to find Fluffy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative, informal) To scare, startle, unsettle, or unnerve.",
                  "examples": [
                    "That United were rattled, mentally as well as at times physically – legitimately so – was beyond question. Nick Powell clipped a crisp drive a foot over the bar, but otherwise Milton Keynes had the best of the remainder of the first half."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a rattling noise; to make noise by or from shaking.",
                  "examples": [
                    "I wish the dashboard in my car would quit rattling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To assail, annoy, or stun with a ratting noise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To scold; to rail at.",
                  "examples": [
                    "This came to the Bishop's Ear, who presently sent for the Curate, Rattled him to some Tune, with Menaces to the Highest Degree"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To drive or ride briskly, so as to make a clattering.",
                  "examples": [
                    "We rattled along for a couple of miles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a clatter with one's voice; to talk rapidly and idly; often with on or away.",
                  "examples": [
                    "She rattled on for an hour."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Arabic رَطْل‎ (raṭl), variant of classical رِطْل‎ (riṭl), ultimately from Ancient Greek λίτρα (lítra). Doublet of liter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rattle (plural rattles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical units of measure) Alternative form of rottol: a former Middle Eastern and North African unit of dry weight usually equal to 1–5 lb (0.5–2.5 kg).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}