{
  "word": "enfilade",
  "etymologies": [
    {
      "description": [
        "Borrowed from French enfilade."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "enfilade (plural enfilades)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A line or straight passage, or the position of that which lies in a straight line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Gunfire directed along the length of a target.",
                  "examples": [
                    "In minutes they had gained the top, fell prone, and began to pour deadly repeater-fire into the enemy below while their compatriots raked the top of the coulee with an enfilade."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A series of doors that provide a vista when open.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "enfilade (third-person singular simple present enfilades, present participle enfilading, simple past and past participle enfiladed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rake (something) with gunfire.",
                  "examples": [
                    "A great quantity of artillery was placed upon the eminence, so as to batter and enfilade the left of their intrenchments."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, transitive) To be directed toward (something) like enfilading gunfire.",
                  "examples": [
                    "Together they saw the market thicken, and in course of time thin away with the slow decline of the sun towards the upper end of town, its rays taking the street endways and enfilading the long thoroughfare from top to bottom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture, transitive) To arrange (rooms or other structures) in a row.",
                  "examples": [
                    "[…]  the house had been boldly planned with a ball-room, so that, instead of squeezing through a narrow passage to get to it (as at the Chiverses’) one marched solemnly down a vista of enfiladed drawing-rooms (the sea-green, the crimson and the bouton d’or), seeing from afar the many-candled lustres reflected in the polished parquetry  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}