{
  "word": "flay",
  "etymologies": [
    {
      "description": [
        "From Middle English flayen, flaien, fleien, from Old English *flīeġan (\"to cause to fly, put to flight, frighten\"; found only in compounds: āflīeġan), from Proto-Germanic *flaugijaną (“to let fly, cause to fly”), causative of Proto-Germanic *fleuganą (“to fly”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flay (plural flays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland) A fright; a scare.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Northern England, Scotland) Fear; a source of fear; a formidable matter; a fearsome or repellent-looking individual.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flay (third-person singular simple present flays, present participle flaying, simple past and past participle flayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To cause to fly; put to flight; drive off (by frightening).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To frighten; scare; terrify.",
                  "examples": [
                    "If they'd let me have my way, I could have flayed him into shape"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, UK dialectal, Northern England, Scotland) To be fear-stricken.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English flen, from Old English flēan, from Proto-West Germanic *flahan, from Proto-Germanic *flahaną."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "flay (third-person singular simple present flays, present participle flaying, simple past flayed, past participle flayed or (obsolete) flain)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strip the skin off; to skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lash or whip.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}