{
  "word": "elt",
  "etymologies": [
    {
      "description": [
        "From Middle English elten, a borrowing from Old Norse elta (“to chase, hunt, knead”), from Proto-Germanic *alatjaną (“to drive, force, move”), from Proto-Indo-European *h₁elh₂- (“to drive, move, go”). Cognate with Danish ælte (“to knead”), Swedish älta (“to dwell upon, brood, stir, knead”), Norwegian elte (“to knead”), Norwegian elta (“to pursue, plod”), Icelandic elta (“to chase”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "elt (third-person singular simple present elts, present participle elting, simple past and past participle elted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To injure (anything) by rough handling; handle roughly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To begrime; soil with mud; daub; smear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To work persistently or laboriously; be occupied in working (e.g. in the earth, rake among dirt, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To meddle; interfere.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To knead dough; stir dough previously kneaded to a proper consistency before baking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, UK dialectal, Northern England, Scotland) To become soft; become moist, as damp earth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "elt (plural elts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, computing) Abbreviation of element.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}