{
  "word": "edit",
  "etymologies": [
    {
      "description": [
        "Back-formation from editor, influenced by French éditer (“edit, publish”) and Latin editus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "edit (plural edits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A change to the text of a document.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A change in the text of a file, a website or the code of software.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An edited piece of media, especially video footage.",
                  "examples": [
                    "An early edit of the film included a romantic subplot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comedy) An interruption or change to an improvised scene.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) An alteration to the DNA sequence of a chromosome; an act of gene splicing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "edit (third-person singular simple present edits, present participle editing, simple past and past participle edited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To change a text, or a document.",
                  "examples": [
                    "Your speech is too long. You need to edit it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To alter a photograph or recording of sound or video.",
                  "examples": [
                    "We shot an hour-long interview then edited it down to 45 minutes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be the editor of a publication.",
                  "examples": [
                    "He edits the Chronicle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) To change the contents of a file, website, etc.",
                  "examples": [
                    "Wikipedia is an interactive encyclopedia which allows anybody to edit and improve articles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) To alter the DNA sequence of a chromosome; to perform gene splicing.",
                  "examples": [
                    "Today, the technology to edit genomes is limited in the number of changes that can be made at once, which is probably one reason why the Harvard team focused on only 14 genes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To assemble a film by cutting and splicing raw footage.",
                  "examples": [
                    "When the director approached Ms. Adair about his idea for “Boyhood,” shooting footage each of those 12 years, she immediately agreed to take part. The decision was made to edit the film progressively, cutting the scenes from each year after they were completed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comedy) To cut short or otherwise alter an improvised scene.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ergative) To lend itself to editing in a certain way.",
                  "examples": [
                    "The junior can offer to do the voxes, gaining experience and sparing the senior journalist the trouble. Always remember to think how the clips will edit together."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}