{
  "word": "willow",
  "etymologies": [
    {
      "description": [
        "From Middle English wilwe, welew, variant of wilghe, from Old English welig, from Proto-West Germanic *wilig, from Proto-Indo-European *welik- (compare (Arcadian) Ancient Greek ἑλίκη (helíkē), Hittite 𒌑𒂖𒆪 (welku, “grass”)), from *wel- (“twist, turn”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "willow (countable and uncountable, plural willows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various deciduous trees or shrubs in the genus Salix, in the willow family Salicaceae, found primarily on moist soils in cooler zones in the northern hemisphere.",
                  "examples": [
                    "[…]  and through the middle of this forest, from wall to wall, ran a winding line of brilliant green which marked the course of cottonwoods and willows."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The wood of these trees.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, colloquial) A cricket bat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, slang, 1800s) The baseball bat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rotating spiked drum used to open and clean cotton heads.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "willow (third-person singular simple present willows, present participle willowing, simple past and past participle willowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To open and cleanse (cotton, flax, wool, etc.) by means of a willow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form a shape or move in a way similar to the long, slender branches of a willow.",
                  "examples": [
                    "Willowing over the rough cobbles of the little pier stepped a thin, bent figure, adorned with a silver nannygoat’s beard and bobbling eyes interrupted by the rim of a pair of pince-nez."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}