{
  "word": "lanyard",
  "etymologies": [
    {
      "description": [
        "From Late Middle English lainer, lainere, lanyer (“strap or thong used to fasten armour, shields, clothing, etc.”) [and other forms] (with the ending modified in the 17th century under the influence of yard), from Old French laniere, lasniere (“thong, lash”) (modern French lanière (“lanyard, strap; (by extension) a strip”)), from lasne (“strap, thong; noose; snare”), a metathetic alteration of nasle, nasliere (“strap, thong”), influenced by lane (“wool”), las (“lace of a boot, shoe, etc.”), or laz (“snare, trap; pitfall”); nasliere is derived from Old Dutch *nastila (“headband; tie”), from Proto-West Germanic *nastilu (“strap; thread; tie”), from Proto-Indo-European *ned- (“to tie together”). The English word is cognate with Old High German nestila (“band, headband; strap”) (modern German Nestel (“lace; strap; string”)), Old Norse nesta (“brace; fastener, strap”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lanyard (plural lanyards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A short rope used for fastening rigging, as a handle, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A cord worn around the neck, shoulder, or wrist which is attached to a small object to be carried such as an identity card or security pass, key, knife, or whistle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A craft activity done by intricately braiding thin colored plastic lines to make patterns, or the product of such a craft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, military) A cord with a hook which is secured to an artillery piece, and pulled to fire the weapon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}