{
  "word": "grog",
  "etymologies": [
    {
      "description": [
        "An allusion to Admiral Edward Vernon (nicknamed “Old Grog” after the grogram coat he habitually wore), who in 1740 ordered his sailors' rum to be watered down."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grog (countable and uncountable, plural grogs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(original meaning) An alcoholic beverage made with rum and water, especially that once issued to sailors of the Royal Navy.",
                  "examples": [
                    "[…]  giving him a calebash, and the best part of a bottle of my rum, I desired him to run to the creek, and make me some grog, and this he did; but the poor fellow, never having made grog before, poured in all the spirits and but very little water, doubtless thinking, that the stronger it was the better; which beverage I swallowed to the bottom, without taking time to taste it, and I became instantly so much intoxicated that I could hardly keep my feet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, Australia, New Zealand) Any alcoholic beverage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Australia, New Zealand) A glass or serving of an alcoholic beverage.",
                  "examples": [
                    "Joe  […]  told them how he had been nailed up to be beaten, and they shouted another grog for him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An alcoholic beverage made with hot water or tea, sugar and rum, sometimes also with lemon or lime juice and spices, particularly cinnamon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ceramics) A type of pre-fired clay that has been ground and screened to a specific particle size.",
                  "examples": [
                    "Synonyms: chamotte, firesand"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grog (third-person singular simple present grogs, present participle grogging, simple past and past participle grogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ceramics) To grind and screen (clay) to a specific particle size.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}