{
  "word": "eccentric",
  "etymologies": [
    {
      "description": [
        "From Middle French excentrique, from Medieval Latin eccentricus, from Ancient Greek ἔκκεντρος (ékkentros, “not having the earth as the center of an orbit”), from ἐκ (ek, “out”) + κέντρον (kéntron, “point”). Equivalent to ex- +‎ -centric."
      ],
      "adjectives": [
        {
          "description": "eccentric (comparative more eccentric, superlative most eccentric)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not at or in the centre; away from the centre.",
                  "examples": [
                    "Strikingly, we see that party births tend systematically to be at policy positions that are significantly more eccentric than those of surviving parties, whatever decision rule these parties use."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not perfectly circular; elliptical.",
                  "examples": [
                    "As of 2008, Margaret had the most eccentric orbit of any moon in the solar system, though Nereid's mean eccentricity is greater."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a different center; not concentric.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Deviating from the norm; behaving unexpectedly or differently; unconventional and slightly strange.",
                  "examples": [
                    "He was a man of a most eccentric turn of mind, and great singularity of conduct."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physiology, of a motion) Against or in the opposite direction of contraction of a muscle (such as results from flexion of the lower arm (bending of the elbow joint) by an external force while contracting the triceps and other elbow extensor muscles to control that movement; opening of the jaw while flexing the masseter).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having different goals or motives.",
                  "examples": [
                    "[…]  for whatsoever affairs pass such a man's hands he crooketh them to his own ends, which must needs be often eccentric to those of his master or state:  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "eccentric (plural eccentrics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who does not behave like others.",
                  "examples": [
                    "A tiny, feisty woman who always spoke her mind, Charlotte was an eccentric in the wonderful way that some women from the last century were natural eccentrics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A kook; a person of bizarre habits or beliefs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A circle not having the same centre as another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A disk or wheel with its axis off centre, giving a reciprocating motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physiology) An exercise that goes against or in the opposite direction of contraction of a muscle.",
                  "examples": [
                    "Research tells us that eccentrics, heavy partials, and static exercise may require several days or weeks of recovery time."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}