{
  "word": "stun",
  "etymologies": [
    {
      "description": [
        "From Middle English stunien, stonien, stounien, from Old English stunian (“to crash, make a loud sound, resound, roar, strike with a loud sound, dash, impinge, knock, confound, astonish, stupefy”), from Proto-West Germanic *stunōn, from Proto-Germanic *stunōną, *stunjaną (“to sound, crash, bang, groan”), from Proto-Germanic *stenaną (“to moan, shout”), from Proto-Indo-European *(s)tona-, *(s)tena- (“to thunder, roar, groan”) (compare thunder). Cognate with Middle Low German stonen (“to groan”), Middle High German stunen, stunden (“to drive, push, knock, strike”), Swedish stöna (“to moan, groan”), Icelandic stynja (“to moan”). Related also to Dutch steunen (“to groan; support”), German stöhnen (“to groan, moan”), German staunen (“to be astonished, be amazed, marvel at”), Russian стонать (stonatʹ), стена́ть (stenátʹ, “to moan, groan”). See also Occitan estonar, Old French estoner, English astonish."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stun (countable and uncountable, plural stuns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The condition of being stunned.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which stuns; a shock; a stupefying blow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Newfoundland) A person who lacks intelligence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards, snooker, pool) The effect on the cue ball where the ball is hit without topspin, backspin or sidespin.",
                  "examples": [
                    "Williams will need a lot of stun to avoid going in the middle pocket"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stun (third-person singular simple present stuns, present participle stunning, simple past and past participle stunned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To incapacitate; especially by inducing disorientation or unconsciousness.",
                  "examples": [
                    "Bill tried to stun the snake by striking it on the head.",
                    "In many European countries cattle have to be stunned before slaughtering."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shock or surprise.",
                  "examples": [
                    "The celebrity was stunned to find herself confronted with unfounded allegiations on the front page of a newspaper.",
                    "He stood there stunned, looking at the beautiful, breath-taking sunrise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, billiards) To hit the cue ball so that it slides without topspin or backspin (and with or without sidespin) and continues at a natural angle after contact with the object ball",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}