{
  "word": "undertow",
  "etymologies": [
    {
      "description": [
        "From under- +‎ tow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "undertow (plural undertows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short-range flow of water returning seaward from the waves breaking on the shore.",
                  "examples": [
                    "A strong undertow may sweep a returning swimmer off their feet but it does not carry them far from the shore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A feeling that runs contrary to one's normal one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "undertow (third-person singular simple present undertows, present participle undertowing, simple past and past participle undertowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pull or tow under; drag beneath; pull down.",
                  "examples": [
                    "Off in a gallop the General wheeled vanishing, And sped his steed away into the blue, When Lineoln now alone let go his speech Which had before been undertowed by force, [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pull down by, or as by, an undertow.",
                  "examples": [
                    "A sense that the air, a sighting of muddy river, or that outcrop of rock so implacably bland in the light of midday, is undertowed by memory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To flow or behave as an undertow.",
                  "examples": [
                    "Everybody knows this and acts accordingly; but when you say it, it sounds bad and bold, and makes you uncomfortable to hear it, because the puritan blood is still undertowing in your veins."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}