{
  "word": "bung",
  "etymologies": [
    {
      "description": [
        "From Medieval Dutch bonge, bonne or bonghe (“stopper”), or perhaps from French bonde, which may itself be either of Germanic origin or from Proto-Celtic *bunda—either way probably from puncta (“hole”), the feminine singular form of Latin punctus, perfect passive participle of pungō (“pierce into, prick”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bung (plural bungs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stopper, alternative to a cork, often made of rubber, used to prevent fluid passing through the neck of a bottle, vat, a hole in a vessel etc.",
                  "examples": [
                    "With the heavy seas trying to broach the boat they baled — and eventually found someone had forgotten to put the bung in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cecum or anus, especially of a slaughter animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A bribe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The orifice in the bilge of a cask through which it is filled; bunghole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang) A sharper or pickpocket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) The landlord of a public house.",
                  "examples": [
                    "\"Well, sir, I haven't got one,\" said the landlord, \"or you should have it directly.\"  […]  \"Could you oblige me with such a thing as a postage stamp?\" \"No,\" said the Bung; \"don't keep 'em!\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bung (third-person singular simple present bungs, present participle bunging, simple past and past participle bunged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To plug, as with a bung.",
                  "examples": [
                    "It has not yet been ascertained, which is the precise time when it becomes indispensable to bung the cider. The best, I believe, that can be done, is to seize the critical moment which precedes the formation of a pellicle on the surface..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, transitive, informal) To put or throw something without care; to chuck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To batter, bruise; to cause to bulge or swell.",
                  "examples": [
                    "[T]he Chicken had been tapped, and bunged, and had received pepper, and had been made groggy, and had come up piping, and had endured a complication of similar strange inconveniences, until he had been gone into and finished."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pass a bribe to (someone).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Yagara bang (“dead”)."
      ],
      "adjectives": [
        {
          "description": "bung (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, slang) Broken, not in working order.",
                  "examples": [
                    "The evening we reached the glacier Bowers[Henry Robertson Bowers] wrote:",
                    "[…] My right eye has gone bung, and my left one is pretty dicky."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From bouget (“wallet, purse or bag”), from Middle English bogett, bouget, bowgette (“leather pouch”), from Old French bougette, diminutive of bouge (“leather bag, wallet”), from Late Latin bulga (“wallet, purse”), from Gaulish bolgā, from Proto-Celtic *bolgos (“sack, bag, stomach”), from Proto-Indo-European *bʰólǵʰ-os (“skin bag, bolster”), from *bʰelǵʰ- (“to swell”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bung (plural bungs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, UK, thieves' cant) A purse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}