{
  "word": "instrumental",
  "etymologies": [
    {
      "description": [
        "From Middle English instrumental, instrumentale, from Medieval Latin īnstrūmentālis."
      ],
      "adjectives": [
        {
          "description": "instrumental (comparative more instrumental, superlative most instrumental)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "essential or central; of great importance or relevance.",
                  "examples": [
                    "He was instrumental in conducting the business."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Serving as an instrument, medium, means, or agency.",
                  "examples": [
                    "Maxwell started back to his study, feeling that kind of satisfaction which a man feels when he has been even partly instrumental in finding an unemployed person a remunerative position."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Pertaining to, made by, or prepared for an instrument, especially a musical instrument (rather than the human voice).",
                  "examples": [
                    "instrumental music",
                    "An instrumental part"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Applied to a case expressing means or agency, generally indicated in English by by or with with the objective.",
                  "examples": [
                    "the instrumental case"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "instrumental (plural instrumentals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The instrumental case.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A composition written or performed without lyrics, sometimes using a lead instrument to replace vocals.",
                  "examples": [
                    "I recommend this album in the face of the fact that five of the eleven songs are the purest filler, dull instrumentals with a harmonica rifling over an indifferent rhythm section. The rest is magnificent  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}