{
  "word": "dissent",
  "etymologies": [
    {
      "description": [
        "From Middle English dissenten, from Latin dissentire (“to differ in sentiments, disagree, be at odds, contradict, quarrel”), from dis- + sentire (see sense)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dissent (countable and uncountable, plural dissents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Disagreement with the ideas, doctrines, decrees, etc. of a political party, government or religion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of disagreeing with, or deviating from, the views and opinions of those holding authority.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Anglo-American common law) A separate opinion filed in a case by judges who disagree with the outcome of the majority of the court in that case",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A violation that arises when disagreement with an official call is expressed in an inappropriate manner such as foul language, rude gestures, or failure to comply.",
                  "examples": [
                    "City had been woeful, their anger at their own inertia summed up when Samir Nasri received a booking for dissent, and they did not have a shot on target until the 66th minute."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dissent (third-person singular simple present dissents, present participle dissenting, simple past and past participle dissented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To disagree; to withhold assent. Construed with from (or, formerly, to).",
                  "examples": [
                    "Where a trustee refuses either to assent or dissent, the Court will itself exercise his authority."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To differ from, especially in opinion, beliefs, etc.",
                  "examples": [
                    "Some are so eristical and teasty, that they will not ... bear with any that dissent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be different; to have contrary characteristics.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}