{
  "word": "cement",
  "etymologies": [
    {
      "description": [
        "From Middle English syment, cyment, from Old French ciment, from Latin caementum (“quarry stone; stone chips for making mortar”), from caedō (“I cut, hew”). Doublet of cementum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cement (countable and uncountable, plural cements)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A powdered substance produced by firing (calcining) calcium carbonate (limestone) and clay that develops strong cohesive properties when mixed with water. The main ingredient of concrete.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The paste-like substance resulting from mixing such a powder with water, or the rock-like substance that forms when it dries.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Any material with strong adhesive and cohesive properties such as binding agents, glues, grout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A bond of union; that which unites firmly, as persons in friendship or in society.",
                  "examples": [
                    "the cement of our love"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The layer of bone investing the root and neck of a tooth; cementum.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cement (third-person singular simple present cements, present participle cementing, simple past and past participle cemented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To affix with cement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To overlay or coat with cement.",
                  "examples": [
                    "to cement a cellar floor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To unite firmly or closely.",
                  "examples": [
                    "Olympic Games. — Besides the ordinary confederacies that join independent states together, a singular federal bond is remarkable in the Olympic games, which for many ages cemented the Grecian commonwealths by a joint tie of recreation and religious ritual."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To make permanent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}