{
  "word": "unity",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman unité, unité, from Latin ūnitās, from ūnus (“one”) + noun of state suffix -itās, ultimately from Proto-Indo-European *óynos (“one, single”), hence distantly related to one and an. Displaced native Old English ānnes (literally “oneness”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "unity (countable and uncountable, plural unities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Oneness; the state or fact of being one undivided entity.",
                  "examples": [
                    "If any literary work is too long to be read at one sitting, we must be content to dispense with the immensely important effect derivable from unity of impression - for, if two sittings be required, the affairs of the world interfere, and everything like totality is at once destroyed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Agreement; harmony.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single undivided thing, seen as complete in itself.",
                  "examples": [
                    "If a single day has brought us two or more experiences suitable to initiate a dream, the dream will unite references to them both into a single whole; it obeys a compulsion to form a unity [translating Einheit] out of them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(drama) Any of the three classical rules of drama: unity of action (nothing should be admitted not directly relevant to the development of the plot), unity of place (the scenes should be set in the same place), and unity of time (all the events should be such as might happen within a single day).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The number 1 or any element of a set or field that behaves under a given operation as the number 1 behaves under multiplication.",
                  "examples": [
                    "the cube roots of unity"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The peculiar characteristics of an estate held by several in joint tenancy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Quakerism) The form of consensus in a Quaker meeting for business which signals that a decision has been reached. In order to achieve unity, everyone who does not agree with the decision must explicitly stand aside, possibly being recorded in the minutes as doing so.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}