{
  "word": "gush",
  "etymologies": [
    {
      "description": [
        "From Middle English guschen, gusshen, gosshien, perhaps from Middle Dutch guysen (“to flow out with a gurgling sound, gush”) or Old Norse gusa (“to gush”), ultimately imitative.",
        "Compare Old Norse geysa (“to gush”), German gießen (“to pour”), Old English ġēotan (\"to pour\"; > English yote). Related to gust."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gush (plural gushes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden rapid outflow.",
                  "examples": [
                    "There was a cartoon woman in an apron on the front. She stood with one hand on her hip while she used the other hand to pour a gush of drain-cleaner into something that was either an industrial sink or Orson Welles's bidet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gush (third-person singular simple present gushes, present participle gushing, simple past and past participle gushed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, also figurative) To flow forth suddenly, in great volume.",
                  "examples": [
                    "Water gushed out of the broken pipe.",
                    "After he was stabbed, blood came gushing out his throat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figurative) To send (something) flowing forth suddenly in great volume.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, especially of a woman) To ejaculate during orgasm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive, figurative) To make an excessive display of enthusiasm, praise, or sentiment.",
                  "examples": [
                    "All the complaints she'd bottled up came gushing out during their marriage counselling session."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}