{
  "word": "eye",
  "etymologies": [
    {
      "description": [
        "From Middle English eye, eie, yë, eighe, eyghe, yȝe, eyȝe, from Old English ēaġe (“eye”), from Proto-West Germanic *augā, from Proto-Germanic *augô (“eye”) (compare Scots ee, West Frisian each, Dutch oog, German Auge, Danish øje, Norwegian Bokmål øye, Norwegian Nynorsk auga, Swedish öga), from Proto-Indo-European *h₃okʷ-, *h₃ekʷ- (“eye; to see”).",
        "Other Indo-European cognates include Latin oculus (whence English oculus), Lithuanian akìs, Old Church Slavonic око (oko), Albanian sy, Ancient Greek ὄψ (óps, “(poetic) eye; face”) and ὄσσε (ósse, “eyes”), Armenian ակն (akn), Avestan 𐬀𐬱𐬌‎ (aši, “eyes”), Sanskrit अक्षि (ákṣi). Related to ogle.",
        "The uncommon plural form eyen is from Middle English eyen, from Old English ēaġan, nominative and accusative plural of ēaġe (“eye”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "eye (plural eyes or (obsolete or dialectal) eyen or (obsolete) eyne)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An organ through which animals see (perceive surroundings via light).",
                  "examples": [
                    "Synonyms: see Thesaurus:eye",
                    "Hyponym: ocellus"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The visual sense.",
                  "examples": [
                    "The car was quite pleasing to the eye, but impractical."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The iris of the eye, being of a specified colour.",
                  "examples": [
                    "Brown, blue, green, hazel eyes.",
                    "Natalie’s brown eyes looked into Jim’s blue eyes, and the girl and boy flirted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Attention, notice.",
                  "examples": [
                    "That dress caught her eye."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to notice what others might miss.",
                  "examples": [
                    "Synonym: perceptiveness",
                    "He has an eye for talent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A meaningful stare or look.",
                  "examples": [
                    "She was giving him the eye at the bar.",
                    "When the car cut her off, she gave him the eye."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A private eye: a privately hired detective or investigator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hole at the blunt end of a needle through which thread is passed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The oval hole of an axehead through which the axehandle is fitted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fitting consisting of a loop of metal or other material, suitable for receiving a hook or the passage of a cord or line.",
                  "examples": [
                    "Synonym: eyelet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The relatively clear and calm center of a hurricane or other cyclonic storm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mark on an animal, such as a peacock or butterfly, resembling a human eye.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The dark spot on a black-eyed pea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reproductive bud in a potato.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) The dark brown center of a black-eyed Susan flower.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loop forming part of anything, or a hole through anything, to receive a rope, hook, pin, shaft, etc.; for example, at the end of a tie bar in a bridge truss, through a crank, at the end of a rope, or through a millstone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which resembles the eye in relative importance or beauty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Tinge; shade of colour.",
                  "examples": [
                    "Red with an eye of blue makes a purple."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the holes in certain kinds of cheese.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The circle in the centre of a volute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) The enclosed counter (negative space) of the small letter e.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(game of Go) An empty point or group of points surrounded by one player's stones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) View or opinion.",
                  "examples": [
                    "This victory will make us great in the eyes of the world."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "eye (third-person singular simple present eyes, present participle eyeing or eying, simple past and past participle eyed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carefully or appraisingly observe (someone or something).",
                  "examples": [
                    "After eyeing the document for half an hour, she decided not to sign it.",
                    "They went out and eyed the new car one last time before deciding."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To appear; to look.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove the reproductive buds from (potatoes).",
                  "examples": [
                    "Once the potatoes have been rumbled they require 'eyeing' with a turning knife or hand peeler."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow (fish eggs) to develop so that the black eye spots are visible.",
                  "examples": [
                    "Eggs were collected from the Taylor Creek, Upper Truckee River, and Blackwood Creek traps and transported to this station to be eyed  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "eye (plural eyes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The name of the Latin-script letter I.",
                  "examples": [
                    "It said, in a whispering, buzzing voice, \"Gee-you-ess-ess-ay-dash-em-ee-ar-ar-wye-dash-em-eye-en-gee-oh-dash-pee-eye-pee-dash-pee-ee-ar-ar-wye-dash-pee-eye-en-gee-oh.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from rebracketing of a nye as an eye."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "eye (plural eyes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brood.",
                  "examples": [
                    "an eye of pheasants"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}