{
  "word": "lappet",
  "etymologies": [
    {
      "description": [
        "lap +‎ -et"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lappet (plural lappets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small decorative fold or flap, especially of lace or muslin, in a garment or headdress.",
                  "examples": [
                    "Oout of hiz boozom drawn foorth a lappet of his napkin, edged with a blu la[c]e, and marked with a trulooue, a hart & a D, for Damian: for he waz but a bachelar yet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) A wattle or flap-like structure on the face.",
                  "examples": [
                    "Some vultures have lappets of bare flesh on the sides of the head.",
                    "Tompot blennies are distinguished by a pair of lappets above the eyes and dark stripes along the body."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A head-dress made with lappets for lace pendants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, anatomy) Lobe (division of an organ).",
                  "examples": [
                    "In the tender lappet of the eare is supposed to rest the seat of remembrance, which we vse to touch when we mean to take one to beare witnesse of an arrest or other thing done,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lappet (third-person singular simple present lappets, present participle lappeting, simple past and past participle lappeted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To decorate with, or as if with, lappets.",
                  "examples": [
                    "I would fain merit your esteem, heedless of these pursy fellows from hulks and warehouses, with one ear lappetted by the pen behind it  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}