{
  "word": "piker",
  "etymologies": [
    {
      "description": [
        "From pike +‎ -er. In some senses, it has been linked etymologically to the word pikey as well as to Pike County in eastern Missouri [1]. In the latter instance the term originally denoted poor immigrants to California."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "piker (plural pikers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) A soldier armed with a pike, a pikeman.",
                  "examples": [
                    "Upstairs in a waiting room there were pikers whose tunics echoed Baudricourt′s gold lion shield painted up and down the rafters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who bets or gambles only with small amounts of money.",
                  "examples": [
                    "Bud swelled his chest and laid his hand on Jeff′s shoulder. “Just to show you I′m not a piker,” he cried recklessly, “I′ll bet you twenty-five dollars I can beat your Skeeter with my Smoky horse that I rode in here. Is it a go?”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stingy person; a cheapskate.",
                  "examples": [
                    "“And if you′ve got to be a piker,” said Dolly, “don′t be ashamed to be a piker. We′re not spending a hundred dollars because we can afford it, but because you dreamt a dream.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amateur.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A bullock living in the wild. (Also used attributively.) [from 19th c.]",
                  "examples": [
                    "‘There's always a few old piker bullocks find their way into this country. But mostly cattle don't come this far.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, slang) One who refuses to go out with friends, or leaves a party early; a spoilsport or \"chicken\". [from 20th c.]",
                  "examples": [
                    "Mate, don't be a piker! Come to Angie′s birthday party tonight!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, slang) One who pikes (quits or backs out of a promise).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated) A male freshman at Cornell University.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tramp; a vagrant.",
                  "examples": [
                    "Synonym: pike"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}