{
  "word": "lask",
  "etymologies": [
    {
      "description": [
        "From Middle English lasken (“to diminish, weaken (the blood or other body fluids, body tissues, etc.); to thin (the blood through bloodletting); to alleviate (pain, sickness); to grow weak; to shorten (one’s life)”) [and other forms], from Old Northern French *lasquer, Old French lascher, laschier (“to let go of, release; to loosen, relax”) (modern French lâcher (“to let go of, release; to loosen”)), from Vulgar Latin *lascāre, *lassicāre, from Latin *laxicāre, the frequentative of Latin laxāre, the present active infinitive of laxō (“to relax, weaken; to release, undo; to make wide, open”), from laxus (“free, loose, slack; roomy, spacious, wide”), ultimately from Proto-Indo-European *(s)leg-, *(s)leh₁g- (“faint; weak”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "lask (third-person singular simple present lasks, present participle lasking, simple past and past participle lasked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To have loose bowels; to suffer from diarrhoea.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English laske (“lax, weak; of the bowels: loose”), from Old Northern French *lasque, Old French laske, lasche (“not taut or tight, limp”) (modern French lâche (“loose, slack”)), from Old French lascher, laschier (“to let go of, release; to loosen, relax”): see further at etymology 1."
      ],
      "adjectives": [
        {
          "description": "lask (comparative more lask, superlative most lask)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Lax, weak; specifically of the bowels: affected by diarrhoea; loose.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the adjective: see etymology 2."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lask (countable and uncountable, plural lasks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, chiefly veterinary medicine) Originally of both persons and animals, now only of animals: looseness of the bowels; diarrhoea; (countable) a bout of this ailment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}