{
  "word": "annual",
  "etymologies": [
    {
      "description": [
        "First attested around 1382, borrowed from Late Latin annuālem, annuālis, related to Latin annālis, adjective form of annus (“year”). Used to categorize plants since 1710."
      ],
      "adjectives": [
        {
          "description": "annual (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Happening once every year.",
                  "examples": [
                    "an annual general meeting;  an annual publication"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, for, or relating to a whole year, often as a recurring cycle; determined or reckoned by the year; accumulating in the course of a year; performed, executed, or completed over the course of a year. See also circannual.",
                  "examples": [
                    "an annual salary;  average annual profits;  the annual course of the sun"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, of a plant) Having a life cycle that is completed in only one growing season; e.g. beans, corn, marigold. See Annual plant in Wikipedia. Compare biennial, perennial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Living or lasting just one season or year, as certain insects or insect colonies.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "annual (plural annuals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An annual publication; a book, periodical, journal, report, comic book, yearbook, etc., which is published serially once a year, which may or may not be in addition to regular weekly or monthly publication.",
                  "examples": [
                    "I read the magazine, but I usually don't purchase the annuals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) An annual plant; a plant with a life span of just one growing season; a plant which naturally germinates, flowers and dies in one year. Compare biennial, perennial.",
                  "examples": [
                    "I can't wait to plant my annuals in the spring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A medical checkup taking place once a year.",
                  "examples": [
                    "Some routine annuals take a half hour and cost about $30."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A pantomime taking place once a year.",
                  "examples": [
                    "Excellent work has been done by the Playgoers' Club in connection with its Christmas Pantomime Fund. Thousands of children who possibly otherwise would have little chance of witnessing one of the hardy annuals have been annually taken  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}