{
  "word": "remonstrate",
  "etymologies": [
    {
      "description": [
        "From (the participle stem of) Late Latin remōnstrō, from Latin re- + mōnstrō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "remonstrate (third-person singular simple present remonstrates, present participle remonstrating, simple past and past participle remonstrated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To object with in critical fashion; to express disapproval (with, against).",
                  "examples": [
                    "Whitshed, the Chief Justice, consistently with his action on a previous occasion (see volume vii.), angrily remonstrated with the jury, demanded of them their reasons for such a decision, and finally dissolved them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly historical) Specifically, to lodge an official objection (especially by means of a remonstrance) with a monarch or other ruling body.",
                  "examples": [
                    "In 1753-4, the Parlements of Aix, Bordeaux, Rennes and Rouen remonstrated in support of the exiled Paris institution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, often with an object consisting of direct speech or a clause beginning with that) To state or plead as an objection, formal protest, or expression of disapproval.",
                  "examples": [
                    "In a recent column in The New York Times, William Safire referred to Mr. Morris as Ed. This prompted Mr. Morris to write \"an open letter\" to Mr. Safire remonstrating that, in his case, such usage \"grates like sand in salad.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To point out; to show clearly; to make plain or manifest; hence, to prove; to demonstrate.",
                  "examples": [
                    "I will remonstrate to you the third dor."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}