{
  "word": "traffic",
  "etymologies": [
    {
      "description": [
        "From Middle French trafique, traffique (“traffic”), from Italian traffico (“traffic”) from trafficare (“to carry on trade”). Potentially from Vulgar Latin *trānsfrīcāre (“to rub across”); Klein instead suggests the Italian has ultimate origin in Arabic تَفْرِيق‎ (tafrīq, “distribution, dispersion”), reshaped to match the native prefix tra- (“trans-”).",
        "The adjective sense is possibly influenced by Tagalog trapik and follows a general trend in Philippine English to make nouns adjectives."
      ],
      "adjectives": [
        {
          "description": "traffic (comparative more traffic, superlative most traffic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Philippines) congested",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "traffic (usually uncountable, plural traffics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moving pedestrians or vehicles, or the flux or passage thereof.",
                  "examples": [
                    "The traffic is slow during rush hour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Commercial transportation or exchange of goods, or the movement of passengers or people.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Illegal trade or exchange of goods, often drugs.",
                  "examples": [
                    "Synonym: (more common) trafficking"
                  ]
                }
              ]
            },
            {
              "group": "Exchange or flux of information, messages or data, as in a computer or telephone network.",
              "entries": [
                {
                  "meaning": "(radio) In CB radio, formal written messages relayed on behalf of others.",
                  "examples": []
                },
                {
                  "meaning": "(advertising) The amount of attention paid to a particular printed page etc. in a publication.",
                  "examples": [
                    "Those fixed locations which are sold to advertisers become preferred according to the expected page traffic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Commodities of the market.",
                  "examples": [
                    "You'll see a draggled damsel / From Billingsgate her fishy traffic bear."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "traffic (third-person singular simple present traffics, present participle trafficking, simple past and past participle trafficked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass goods and commodities from one person to another for an equivalent in goods or money; to buy or sell goods.",
                  "examples": [
                    "Synonym: trade"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To trade meanly or mercenarily; to bargain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exchange in traffic; to effect by a bargain or for a consideration.",
                  "examples": [
                    "A Libyan longing took us, and we would have chosen, if we could, to bear a strand of grotesque beads, or a handful of brazen gauds, and traffic them for some sable maid with crisp locks, whom, uncoffling from the captive train beside the desert, we should make to do our general housework forever, through the right of lawful purchase."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}