{
  "word": "grade",
  "etymologies": [
    {
      "description": [
        "Borrowed from French grade (“a grade, degree”), from Latin gradus (“a step, pace, degree”), from Proto-Italic *graðus, from Proto-Indo-European *gʰradʰ-, *gʰredʰ- (“to walk, go”).",
        "Cognate with Gothic 𐌲𐍂𐌹𐌸𐍃 (griþs, “step, grade”), Bavarian Gritt (“step, stride”), Lithuanian grìdiju (“to go, wander”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grade (plural grades)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rating.",
                  "examples": [
                    "This fine-grade coin from 1837 is worth a good amount.",
                    "I gave him a good grade for effort."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US) Performance on a test or other evaluation(s), expressed by a number, letter, or other symbol; a score.",
                  "examples": [
                    "Synonym: mark",
                    "He got a good grade on the test.",
                    "You need a grade of at least 80% in first-year calculus to be admitted to the CS major program."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A degree or level of something; a position within a scale; a degree of quality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Degree (any of the three stages (positive, comparative, superlative) in the comparison of an adjective or an adverb).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slope (up or down) of a roadway or other passage",
                  "examples": [
                    "The grade of this hill is more than 5 percent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, education) A level of primary and secondary education.",
                  "examples": [
                    "Clancy is entering the fifth grade this year.",
                    "Clancy starts grade five this year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, education) A student of a particular grade (used with the grade level).",
                  "examples": [
                    "The grade fives are on a field trip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area that has been flattened by a grader (construction machine).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The level of the ground.",
                  "examples": [
                    "This material absorbs moisture and is probably not a good choice for use below grade."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A gradian.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) In a linear system of divisors on an n-dimensional variety, the number of free intersection points of n generic divisors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A harsh scraping or cutting; a grating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(systematics) A taxon united by a level of morphological or physiological complexity that is not a clade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The degree of malignity of a tumor expressed on a scale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ophthalmology, Philippines) An eyeglass prescription.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grade (third-person singular simple present grades, present participle grading, simple past and past participle graded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US) To assign scores to the components of an academic test, or to overall academic performance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To organize in grades.",
                  "examples": [
                    "a graded reader"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To flatten, level, or smooth a large surface, especially with a grader.",
                  "examples": [
                    "to grade land before building on it"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sewing) To remove or trim part of a seam allowance from a finished seam so as to reduce bulk and make the finished piece more even when turned right side out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To apply classifying labels to data (typically by a manual rather than automatic process).",
                  "examples": [
                    "Brain scans were graded on a five-point scale of atrophy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) To describe, modify or inflect so as to classify as to degree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass imperceptibly from one grade into another.",
                  "examples": [
                    "And there were circles even beyond these – […] humanity grading and drifting beyond the educated vision, until no earthly invitation can embrace it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, no longer current, intransitive) To pass from one school grade into the next.",
                  "examples": [
                    "I graded out of grade two and three and arrived in Miss Hanson's room."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}