{
  "word": "capitalism",
  "etymologies": [
    {
      "description": [
        "Borrowed from French capitalisme (“the condition of one who is rich”); equivalent to capital +‎ -ism. First used in English by novelist William Thackeray in 1854."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "capitalism (countable and uncountable, plural capitalisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) A socio-economic system based on private ownership of resources or capital.",
                  "examples": [
                    "The peasantry have long since disappeared, the independent shopkeeper is being destroyed, the small business-man is diminishing in numbers. But at the same time modern industry is so complicated that it cannot get along without great numbers of managers, salesmen, engineers, chemists and technicians of all kinds, drawing fairly large salaries. And these in turn call into being a professional class of doctors, lawyers, teachers, artists, etc., etc. The tendency of advanced capitalism has therefore been to enlarge the middle class and not to wipe it out as it once seemed likely to do."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics) An economic system based on private ownership of the means of production and their operation for profit.",
                  "examples": [
                    "What this war has demonstrated is that private capitalism—that is, an economic system in which land, factories, mines and transport are owned privately and operated solely for profit—does not work. It cannot deliver the goods. This fact had been known to millions of people for years past, but nothing ever came of it, because there was no real urge from below to alter the system, and those at the top had trained themselves to be impenetrably stupid on just this point. Argument and propaganda got one nowhere. The lords of property simply sat on their bottoms and proclaimed that all was for the best. Hitler's conquest of Europe, however, was a physical debunking of capitalism. War, for all its evil, is at any rate an unanswerable test of strength, like a try-your-grip machine. Great strength returns the penny, and there is no way of faking the result."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, economic liberalism) A socio-economic system based on private property rights, including the private ownership of resources or capital, with economic decisions made largely through the operation of a market unregulated by the state.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics, economic liberalism) An economic system based on the abstraction of resources into the form of privately owned capital, with economic decisions made largely through the operation of a market unregulated by the state.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}