{
  "word": "overgo",
  "etymologies": [
    {
      "description": [
        "From Middle English overgon, from Old English ofergān (“to pass over, beyond, across, traverse, cross, transgress, overstep, overrun, overcome, overspread, conquer, come upon, overtake, seize, attack, pass off, pass away, end, overreach”), equivalent to over- +‎ go. Cognate with Dutch overgaan, German übergehen, Swedish övergå."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "overgo (third-person singular simple present overgoes, present participle overgoing, simple past overwent, past participle overgone)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To cross, go over (a barrier etc.); to surmount. [from 8th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To pass (a figurative barrier); to transgress. [8th–19th c.]",
                  "examples": [
                    "How many an one in its vanities hath gloried and taken pride, / Till froward and arrogant thus he grew and did all bounds o'ergo!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, UK, dialectal) To pass by, pass away; often, to go unnoticed. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To spread across (something); to overrun. [from 10th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To go over, move over the top of, travel across the surface of; to traverse, travel through. [from 13th c.]",
                  "examples": [
                    "The fixed stars overgo Saturn, and so in them and all the rest, all is but one motion, and the nearer the earth the slower – a motion also whereof air and water do participate, though much interrupted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To go beyond; to exceed, surpass. [from 13th c.]",
                  "examples": [
                    "He seeks to persuade the queen not merely to emulate the Amazons' vigilant territoriality but to overgo them by emulating the Spaniards' rampant invasiveness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To get the better of; to overcome, overpower. [from 13th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To overtake, go faster than. [15th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To cover.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Blend of overlapping +‎ oligonucleotide."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "overgo (plural overgoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A sequence of overlapping oligonucleotides, used to design hybridization.",
                  "examples": [
                    "Mixtures of such specific \"overgo\" probes can be used to screen arrayed library filters by DNA-DNA hybridization [...]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}