{
  "word": "hele",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hele",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete form of heal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English helen, helien, from Old English helan (“to conceal, cover, hide”, strong verb) and helian (“to conceal, cover, hide”, weak verb), from Proto-West Germanic *helan, from Proto-Germanic *helaną (“to conceal, stash, receive stolen goods”) and Proto-Germanic *haljaną (“to hull, conceal”); both from Proto-Indo-European *ḱel- (“to hide”).",
        "Cognate with Scots heal (“to cover, hide, conceal”), Saterland Frisian hela (“to conceal”), Dutch helen (“to conceal”), German hehlen (“to deal in stolen or illegal goods”), Swedish häla (“hide”) and hälare (“fence, peddler of stolen goods”), as well as with helmet and Latin cēlō (“conceal”). Related to hole, hull."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hele (third-person singular simple present heles, present participle heling, simple past and past participle heled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, now chiefly dialectal or archaic) To hide, conceal, and keep secret, especially for a secret society (such as the masons).",
                  "examples": [
                    "Men could look up and understand something of the star-Spangled arch of blue, but the reversed arch or crypt beneath was to the eyes a flesh 'heled, concealed, and never revealed,'  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, now especially in the phrase \"hele in\") To cover or conceal (a seedling, plant, roots, etc).",
                  "examples": [
                    "At the time of earthing the potatoes by the double mould-plough, turnip seed is sown, and thus \"heled;\" the turnips arrive at maturity before the potatoes, and are pulled without damage to them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}