{
  "word": "twitter",
  "etymologies": [
    {
      "description": [
        "From Middle English twitren, twiteren, from Old English twiterian, from Proto-West Germanic *twitwiʀōn, from Proto-Germanic *twitwizōną (“to chirp; twitter”). Cognate with Low German twitteren (“to twitter”), German zwitzern, zwitschern (“to twitter”). Compare also Dutch kwetteren (“to twitter”), Danish kvidre (“to twitter”), Swedish kvittra (“to twitter”), dialectal Swedish tittra (“to twitter”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "twitter (countable and uncountable, plural twitters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sound of a succession of chirps as uttered by birds.",
                  "examples": [
                    "I often listen to the twitter of the birds in the park."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tremulous broken sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slight trembling of the nerves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unwanted flicker that occurs in interlaced displays when the image contains vertical detail that approaches the horizontal resolution of the video format.",
                  "examples": [
                    "Interline twitter occurs on interlaced displays at half the field-rate."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "twitter (third-person singular simple present twitters, present participle twittering, simple past and past participle twittered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To utter a succession of chirps.",
                  "examples": [
                    "The breezy call of incense-breathing Morn, / The swallow twittering from the straw-built shed,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) (of a person) To talk in an excited or nervous manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make the sound of a half-suppressed laugh; to titter; to giggle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have a slight trembling of the nerves; to be excited or agitated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To twit; to reproach or upbraid.",
                  "examples": [
                    "I have repented of it many’s the good time and oft. And if he was so good to forgive me a word spoken in haste or so, it doth not become such a one as you to twitter me. He was a husband to me, he was; and if ever I did make use of an ill word or so in a passion, I never called him rascal  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of Twitter",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}