{
  "word": "condition",
  "etymologies": [
    {
      "description": [
        "From Middle English condicioun, from Old French condicion (French condition), from Latin condicio. Unetymological change in spelling due to confusion with conditio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "condition (countable and uncountable, plural conditions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A logical clause or phrase that a conditional statement uses. The phrase can either be true or false.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A requirement or requisite.",
                  "examples": [
                    "Environmental protection is a condition for sustainability.",
                    "What other planets might have the right conditions for life?",
                    "The union had a dispute over sick time and other conditions of employment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A clause in a contract or agreement indicating that a certain contingency may modify the principal obligation in some way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The health status of a medical patient.",
                  "examples": [
                    "Synonym: fettle",
                    "My aunt couldn’t walk up the stairs in her condition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A certain abnormal state of health; a malady or sickness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or quality.",
                  "examples": [
                    "National reports on the condition of public education are dismal.",
                    "The condition of man can be classified as civilized or uncivilized."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular state of being.",
                  "examples": [
                    "Hypnosis is a peculiar condition of the nervous system.",
                    "Steps were taken to ameliorate the condition of slavery.",
                    "Security is defined as the condition of not being threatened.",
                    "Aging is a condition over which we are powerless."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The situation of a person or persons, particularly their social and/or economic class, rank.",
                  "examples": [
                    "A man of his condition has no place to make request."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "condition (third-person singular simple present conditions, present participle conditioning, simple past and past participle conditioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To subject to the process of acclimation.",
                  "examples": [
                    "I became conditioned to the absence of seasons in San Diego."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To subject to different conditions, especially as an exercise.",
                  "examples": [
                    "They were conditioning their shins in their karate class."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make dependent on a condition to be fulfilled; to make conditional on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place conditions or limitations upon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shape the behaviour of someone to do something.",
                  "examples": [
                    "The children were conditioned to speak up if they had any disagreements."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat (the hair) with hair conditioner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To contract; to stipulate; to agree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To test or assay, as silk (to ascertain the proportion of moisture it contains).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colleges, transitive) To put under conditions; to require to pass a new examination or to make up a specified study, as a condition of remaining in one's class or in college.",
                  "examples": [
                    "to condition a student who has failed in some branch of study"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To impose upon an object those relations or conditions without which knowledge and thought are alleged to be impossible.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}