{
  "word": "beardy",
  "etymologies": [
    {
      "description": [
        "From beard +‎ -y. Compare Saterland Frisian boartich (“bearded”), Dutch baardig (“bearded”), German bärtig (“bearded”)."
      ],
      "adjectives": [
        {
          "description": "beardy (comparative beardier or more beardy, superlative beardiest or most beardy)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bearded.",
                  "examples": [
                    "But his left foot was caught in that blame noose in the end of the rope, so only his beardy head went underwater and he was dragged along like that for a few wet yards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Manly, masculine.",
                  "examples": [
                    "The Doge is one of the popular barytone's most weighty performances, and we do not remember to have heard his voice more powerful, his acting more beardy and emphatic."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From beard +‎ -y."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "beardy (plural beardies)",
          "definitionGroups": [
            {
              "group": "(informal) A bearded person or animal:",
              "entries": [
                {
                  "meaning": "A bearded person; used to identify members of a group or class who can be identified by the wearing of beards.",
                  "examples": [
                    "His followers were known in Australia as ‘beardies.’"
                  ]
                },
                {
                  "meaning": "A bearded reedling.",
                  "examples": []
                },
                {
                  "meaning": "A bearded dragon.",
                  "examples": [
                    "But she always kept her distance whenever one of my beardies was out of its cage, as if Moose merely acted like a good-natured lap lizard to throw her off […] ."
                  ]
                },
                {
                  "meaning": "A bearded collie.",
                  "examples": [
                    "Beardies grow fast. They grow like a weed and can be as unsightly as one."
                  ]
                },
                {
                  "meaning": "Any of several kinds of fish; a loach.",
                  "examples": [
                    "Loaches (or beardies) often also thinned our preserves, and in this they were occasionally helped by small eels. Whenever beardies got within an enclosure containing only creepers and caddis worms, in a very short space of time the beardies alone were left, so rapacious are these small fishes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}