{
  "word": "lend",
  "etymologies": [
    {
      "description": [
        "From earlier len (with excrescent -d, as in sound, round, etc.), from Middle English lenen, lænen, from Old English lǣnan (“to lend; give, grant, lease”), from Proto-West Germanic *laihnijan, from Proto-Germanic *laihnijaną (“to loan”), from Proto-Germanic *laihną (“loan”), from Proto-Indo-European *leykʷ- (“to leave, leave over”).",
        "Cognate with Scots len, lend (“to lend”), West Frisian liene (“to lend, borrow, loan”), Dutch lenen (“to lend, borrow, loan”), Swedish låna (“to lend, loan”), Icelandic lána (“to lend, loan”), Icelandic léna (“to grant”), Latin linquō (“quit, leave, forlet”), Ancient Greek λείπω (leípō, “leave, release”). See also loan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lend",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly dialectal, with \"the\") Loan (permission to borrow (something)).",
                  "examples": [
                    "“But,” says Arthur, “I wouldn't be proud of your clothes, / For you've only the lend of them, as I suppose.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lend (third-person singular simple present lends, present participle lending, simple past and past participle lent)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow to be used by someone temporarily, on condition that it or its equivalent will be returned.",
                  "examples": [
                    "I will only lend you my car if you fill up the tank.",
                    "I lent her 10 euros to pay for the train tickets, and she paid me back the next day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a loan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To be suitable or applicable, to fit.",
                  "examples": [
                    "Poems do not lend themselves to translation easily.",
                    "The long history of the past does not lend itself to a simple black and white interpretation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To afford; to grant or furnish in general.",
                  "examples": [
                    "Cato, lend me for a while thy patience."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(proscribed) To borrow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lende (usually in plural as lendes, leendes, lyndes), from Old English lendenu, lendinu pl (“loins”), from Proto-Germanic *landijō, *landį̄ (“loin”), from Proto-Indo-European *lendʰ- (“loin, kidney”). Cognate with Scots lend, leynd (“the loins, flank, buttocks”), Dutch lendenen (“loins, reins”), German Lenden (“loins”), Swedish länder (“loins”), Icelandic lendar (“loins”), Latin lumbus (“loin”), Russian ля́двея (ljádveja, “thigh, haunch”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lend (plural lends or linder)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy, UK dialectal) The lumbar region; loin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, of a person or animal) The loins; flank; buttocks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}