{
  "word": "grit",
  "etymologies": [
    {
      "description": [
        "With early modern vowel shortening, from Middle English grete, griet, from Old English grēot, from Proto-Germanic *greutą."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grit (uncountable)",
          "definitionGroups": [
            {
              "group": "A collection of hard small materials, such as dirt, ground stone, debris from sandblasting or other such grinding, or swarf from metalworking.",
              "entries": [
                {
                  "meaning": "Sand or a sand–salt mixture spread on wet and, especially, icy roads and footpaths to improve traction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Inedible particles in food.",
                  "examples": [
                    "These cookies seem to have grit from nutshells in them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A measure of the relative coarseness of an abrasive material such as sandpaper, the smaller the number the coarser the abrasive.",
                  "examples": [
                    "I need a sheet of 100 grit sandpaper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A hard, coarse-grained siliceous sandstone; gritstone. Also, a finer sharp-grained sandstone, e.g., grindstone grit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Strength of mind; great courage or fearlessness; fortitude.",
                  "examples": [
                    "That kid with the cast on his arm has the grit to play dodgeball."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grit (third-person singular simple present grits, present participle gritting, simple past and past participle gritted or (nonstandard) grit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Apparently only in grit one's teeth: to clench, particularly in reaction to pain or anger.",
                  "examples": [
                    "We had no choice but to grit our teeth and get on with it.",
                    "He has a sleeping disorder and grits his teeth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover with grit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To give forth a grating sound, like sand under the feet; to grate; to grind.",
                  "examples": [
                    "The sanded |floor that grits beneath the tread."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English *gryt (“bran, chaff”), from Old English grytt, from Proto-West Germanic *gruti (“coarsely ground bits”), ablaut variant of Proto-Indo-European *gʰrewd-. See above. Doublet of goetta."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grit (plural grits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) Husked but unground oats.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) Coarsely ground corn or hominy used as porridge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}