{
  "word": "bishop",
  "etymologies": [
    {
      "description": [
        "From Middle English bischop, bishop, bisshop, biscop, from Old English bisċop (“bishop”), from British Latin *biscopo or Vulgar Latin (e)biscopus, from classical Latin episcopus (“overseer, supervisor”), from Ancient Greek ἐπίσκοπος (epískopos, “overseer”), from ἐπί (epí, “over”) + σκοπός (skopós, “watcher”), used in Greek and Latin both generally and as a title of civil officers. Cognate with all European terms for the position in various Christian churches; compare bisp."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bishop (plural bishops, feminine bishopess)",
          "definitionGroups": [
            {
              "group": "(Christianity) An overseer of congregations: either any such overseer, generally speaking, or (in Eastern Orthodoxy, Catholicism, Anglicanism, etc.) an official in the church hierarchy (actively or nominally) governing a diocese, supervising the church's priests, deacons, and property in its territory.",
              "entries": [
                {
                  "meaning": "(religion, nonstandard) A similar official or chief priest in another religion.",
                  "examples": [
                    "The Caliphaes of the Sarasins were kings and chiefe bishops in their religion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The holder of the Greek or Roman position of episcopus, supervisor over the public dole of grain, etc.",
                  "examples": [
                    "They gave away corn, not cash; and Cicero was made bishop, or overseer, of this public victualling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any watchman, inspector, or overlooker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chief of the Festival of Fools or St. Nicholas Day.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) The chess piece denoted ♗ or ♝ which moves along diagonal lines and developed from the shatranj alfil (\"elephant\") and was originally known as the aufil or archer in English.",
                  "examples": [
                    "The Bishoppes some name Alphins, some fooles, and some name them Princes; other some call them Archers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various African birds of the genus Euplectes; a kind of weaverbird closely related to the widowbirds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) A ladybug or ladybird, beetles of the family Coccinellidae.",
                  "examples": [
                    "‘Bishop, Bishop-Barnabee,",
                    "Tell me when my wedding shall be;",
                    "If it be to-morrow day,",
                    "Ope your wings and fly away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flowering plant of the genus Bifora.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sweet drink made from wine, usually with oranges, lemons, and sugar; mulled and spiced port.",
                  "examples": [
                    "Well roasted, with Sugar and Wine in a Cup,",
                    "They'll make a sweet Bishop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, archaic) A bustle.",
                  "examples": [
                    "If, by her bishop, or her 'grace' alone,",
                    "A genuine lady, or a church, is known."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal, archaic) A children's smock or pinafore.",
                  "examples": [
                    "Here; tak him, an wesh him; an' put him a clen bishop on."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bishop (third-person singular simple present bishops, present participle bishoping or bishopping, simple past and past participle bishoped or bishopped)",
          "definitionGroups": [
            {
              "group": "(Christianity) To act as a bishop, to perform the duties of a bishop, especially to confirm another's membership in the church.",
              "entries": [
                {
                  "meaning": "(by extension, jocularly, obsolete) To confirm (in its other senses).",
                  "examples": [
                    "Why sent they it by Felton to be bishoped at Paules?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) To make a bishop.",
                  "examples": [
                    "Thys hathe bene often tymes... sene in preachers before they were byshoppyd or benificed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, rare) To provide with bishops.",
                  "examples": [
                    "Italy would be well bishoped if her episcopacy... did not exceed fifty-nine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal) To permit food (especially milk) to burn while cooking (from bishops' role in the inquisition or as mentioned in the quotation below, of horses).",
                  "examples": [
                    "If the porage be burned to, or the meate ouer rosted, we say the bishop hath put his foote in the potte or the bishop hath played the cooke, because the bishops burn who they lust and whosoever displeaseth them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, of equestrianism) To make a horse seem younger, particularly by manipulation of its teeth.",
                  "examples": [
                    "This way of making a Horse look young is... called Bishoping."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Eponymous, from the surname Bishop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bishop (third-person singular simple present bishops, present participle bishoping or bishopping, simple past and past participle bishoped or bishopped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, colloquial, obsolete) To murder by drowning.",
                  "examples": [
                    "I Burked the papa, now I'll Bishop the son."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}