{
  "word": "continue",
  "etymologies": [
    {
      "description": [
        "From Middle English continuen, from Old French continuer, from Latin continuāre. Displaced native Old English þurhwunian."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) An option allowing the player to resume play after game over, when all lives have been lost, while retaining their progress.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "continue (third-person singular simple present continues, present participle continuing, simple past and past participle continued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To proceed with (doing an activity); to prolong (an activity).",
                  "examples": [
                    "Shall I continue speaking, or will you just interrupt me again?",
                    "Do you want me to continue to unload these?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make last; to prolong.",
                  "examples": [
                    "Can you account him wise or discreet that would willingly have his health, and yet will do nothing that should procure or continue it?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To retain (someone or something) in a given state, position, etc.",
                  "examples": [
                    "The schools were very much the brainchild of Bertin, and although the latter was ousted from the post of Controller-General by Choiseul in 1763, he was continued by the king as a fifth secretary of state […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative sense obsolete) To remain in a given place or condition; to remain in connection with; to abide; to stay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To resume.",
                  "examples": [
                    "When will the concert continue?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To adjourn, prorogue, put off.",
                  "examples": [
                    "This meeting has been continued to the thirteenth of July."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) To make a continuation bet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}