{
  "word": "conference",
  "etymologies": [
    {
      "description": [
        "From Middle French conférence, from Medieval Latin cōnferentia, from Latin cōnferēns."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "conference (plural conferences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of consulting together formally; serious conversation or discussion; interchange of views.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) A multilateral diplomatic negotiation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) A formal event where scientists present their research results in speeches, workshops, posters or by other means.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) An event organized by a for-profit or non-profit organization to discuss a pressing issue, such as a new product, market trend or government regulation, with a range of speakers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A group of sports teams that play each other on a regular basis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Philippines, sports) A constituent tournament of a sports league in a given season.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of comparing two or more things together; comparison.",
                  "examples": [
                    "helps and furtherances which  […]  the mutual conference of all men's collections and observations may afford"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Methodist Church) A stated meeting of preachers and others, invested with authority to take cognizance of ecclesiastical matters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A voluntary association of Congregational churches of a district; the district in which such churches are.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "conference (third-person singular simple present conferences, present participle conferencing, simple past and past participle conferenced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, education) To assess (a student) by one-on-one conversation, rather than an examination.",
                  "examples": [
                    "The students who were conferenced on paper 1 will get a written response to paper 2, and those who received a written response to paper 1 will be conferenced on paper 2."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}