{
  "word": "mistake",
  "etymologies": [
    {
      "description": [
        "From Middle English mistaken, from Old Norse mistaka (“to take in error, to miscarry”); equivalent to mis- +‎ take. Cognate with Icelandic mistaka (“to mistake”), Swedish missta (“to mistake”) (before apocope misstaga).",
        "The noun, which replaced earlier mistaking, is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mistake (plural mistakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An error; a blunder.",
                  "examples": [
                    "Synonyms: see Thesaurus:error",
                    "There were too many mistakes in the test, that unfortunately you failed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A pitch which was intended to be pitched in a hard-to-hit location, but instead ends up in an easy-to-hit place.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mistake (third-person singular simple present mistakes, present participle mistaking, simple past mistook, past participle mistaken)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To understand wrongly, taking one thing or person for another.",
                  "examples": [
                    "Sorry, I mistook you for my brother. You look very similar.",
                    "Don't mistake my kindness for weakness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To misunderstand (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To commit an unintentional error; to do or think something wrong.",
                  "examples": [
                    "No gentleman thinks it is safe or prudent to send a servant with a message, without repeating it more than once, and endeavouring to put it into terms brought down to the capacity of the bearer; yet, after all this care, it is frequent for servants to mistake, and sometimes occasion misunderstandings among friends  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) To take or choose wrongly.",
                  "examples": [
                    "The Spear with erring Haste mistook its way,",
                    "But plung’d in Eniopeus’ Bosom lay."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}