{
  "word": "skink",
  "etymologies": [
    {
      "description": [
        "Possibly from Middle Low German schink, schinke, schenke (“leg; shank; shin bone; ham”), from Old Saxon skinka, from Proto-West Germanic *skinkō (“shank; thigh; that which is bent”), from Proto-Germanic *skinkô, from Proto-Indo-European *(s)keng- (“to limp; to be crooked, slant”).",
        "The word is cognate with Danish skinke (“ham”), Middle Dutch schenke, schinke (“shin; hough; ham”), Icelandic skinka (“ham”), Norwegian skinke (“ham”), Old English ġesċincio, ġesċinco (“kidney fat”), Old High German skinka, skinko (“shank; shin bone”) (Middle High German schinke (“shank; shin bone; ham”), modern German Schinken (“ham; pork from the hindquarters”)), Old Saxon skinka (“ham”), Old Swedish skinke (modern Swedish skinka (“ham”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skink (plural skinks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Northern England) A shin of beef.",
                  "examples": [
                    "lean sirloin, skink and pot-roast"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Scotland, obsolete) A soup or pottage made from a boiled shin of beef.",
                  "examples": [
                    "For there are in the Flesh , Bones , Skinnes , organs , and the severall limbes of the living body : such spirits as are in the Flesh , Bone , and Skinke , beeing separated"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Scotland, by extension) Usually preceded by a descriptive word: a soup or pottage made using other ingredients.",
                  "examples": [
                    "Cullen skink"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle French scinc, from Latin scincus, from Ancient Greek σκίγγος (skíngos), σκίγκος (skínkos)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skink (plural skinks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lizard of the family Scincidae, having small or reduced limbs or none at all and long tails that are regenerated when shed; a sandfish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English skinken, skynken, skenken, from Middle Dutch scinken, scenken, schenken and/or Old Norse skenkja, both from Proto-Germanic *skankijaną. Cognate with German schenken (“to give as a present”), Dutch schenken (“to pour, give as a present”). See also the inherited doublet shink."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skink (plural skinks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A drink.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "skink (third-person singular simple present skinks, present participle skinking, simple past and past participle skinked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, Scotland) To serve (a drink).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland, Northern England, obsolete) To give (something) as a present.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}