{
  "word": "honeymoon",
  "etymologies": [
    {
      "description": [
        "From earlier hony moone, originally denoting the period of time following a wedding, equivalent to honey +‎ moon. The original reference was to affection waning like the moon, but later the sense became \"the first month, or moon after marriage\", which tends to be the sweetest.",
        "Compare Middle Low German suckermânt (“honeymoon”, literally “sugar-month”), German Low German Hönnigweken (“honeymoon”, literally “honey-weeks”). The German Honigmond (literally “honey-moon”) is a calque of the English term."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "honeymoon (plural honeymoons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The period of time immediately following a marriage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trip taken by a newly married couple during this period.",
                  "examples": [
                    "Synonym: wedding journey",
                    "We went to Greece for our honeymoon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of goodwill at the beginning of a new term or relationship (e.g. towards a newly elected politician or in respect of a new business arrangement).",
                  "examples": [
                    "Now that the honeymoon is over, it’s time for us to get down to the business at hand.",
                    "The honeymoon period came to a swift end when the legislation was introduced."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "honeymoon (third-person singular simple present honeymoons, present participle honeymooning, simple past and past participle honeymooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have a honeymoon (a trip taken by a couple after wedding).",
                  "examples": [
                    "My parents honeymooned at Niagara falls."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}