{
  "word": "jostle",
  "etymologies": [
    {
      "description": [
        "Originally justle (“to have sex with”), formed from Middle English jousten, from the Old French joster (“to joust”), from Latin iuxtā (“next to”), from iungō (“join, connect”), equivalent to joust +‎ -le."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jostle (plural jostles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of jostling someone or something; push, shove.",
                  "examples": [
                    "I had full hold of her Watch, but giving a great Jostle, as if somebody had thrust me against her, and in the Juncture giving the Watch a fair pull, I found it would not come, so I let it go that Moment, and cried out as if I had been killed, that somebody had trod upon my Foot  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The action of a jostling crowd.",
                  "examples": [
                    "For years to come, the average of lone women will be largely increased; and the demand, always great, for some means by which they many provide for themselves, in the rude jostle of the world, will become more urgent and imperative."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jostle (third-person singular simple present jostles, present participle jostling, simple past and past participle jostled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To bump into or brush against while in motion; to push aside.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move through by pushing and shoving.",
                  "examples": [
                    "Axia and Amory, acquaintances of an hour, jostled behind a waiter to a table at a point of vantage; there they took seats and watched."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be close to or in physical contact with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To contend or vie in order to acquire something.",
                  "examples": [
                    "[…]  Our statecraft, our learning",
                    "Delivered them bound to the Pit and alive to the burning",
                    "Whither they mirthfully hastened as jostling for honour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang) To pick or attempt to pick pockets.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}