{
  "word": "self",
  "etymologies": [
    {
      "description": [
        "From Middle English self, silf, sulf, from Old English self, seolf, sylf, from Proto-Germanic *selbaz. Cognates include Gothic 𐍃𐌹𐌻𐌱𐌰 (silba), German selbst and Dutch zelf."
      ],
      "adjectives": [
        {
          "description": "self",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having its own or a single nature or character throughout, as in colour, composition, etc., without addition or change; of the same kind; unmixed.",
                  "examples": [
                    "a self bow: one made from a single piece of wood",
                    "a self flower or plant: one which is wholly of one colour"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Same, identical.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Belonging to oneself; own.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(molecular biology, immunology) Of or relating to any molecule, cell, or tissue of an organism's own (belonging to the self), as opposed to a foreign (nonself) molecule, cell, or tissue (for example, infective, allogenic, or xenogenic).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "self (plural selves or selfs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One individual's personality, character, demeanor, or disposition.",
                  "examples": [
                    "one's true self; one's better self; one's former self"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The subject of one's own experience of phenomena: perception, emotions, thoughts.",
                  "examples": [
                    "Thanks to that penny he had just spent so recklessly [on a newspaper] he would pass a happy hour, taken, for once, out of his anxious, despondent, miserable self. It irritated him shrewdly to know that these moments of respite from carking care would not be shared with his poor wife, with careworn, troubled Ellen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An individual person as the object of the person's own reflective consciousness (plural selves).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Self-interest or personal advantage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Identity or personality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A seedling produced by self-pollination (plural selfs).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A flower having its colour uniform as opposed to variegated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(molecular biology, immunology) Any molecule, cell, or tissue of an organism's own (belonging to the self), as opposed to a foreign (nonself) molecule, cell, or tissue (for example, infective, allogenic, or xenogenic).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "self (third-person singular simple present selfs, present participle selfing, simple past and past participle selfed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) To fertilise by the same individual; to self-fertilise or self-pollinate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) To fertilise by the same strain; to inbreed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}