{
  "word": "lift",
  "etymologies": [
    {
      "description": [
        "From Middle English liften, lyften, from Old Norse lypta (“to lift, air”, literally “to raise in the air”), from Proto-Germanic *luftijaną (“to raise in the air”), related to *luftuz (“roof, air”), perhaps from Proto-Indo-European *lewp- (“to peel, break off, damage”) or from a root meaning roof (see *luftuz). Cognate with Danish and Norwegian Bokmål løfte (“to lift”), Norwegian Nynorsk and Swedish lyfta (“to lift”), German lüften (“to air, lift”), Old English lyft (“air”). See above. 1851 for the noun sense \"a mechanical device for vertical transport\".",
        "(To steal): For this sense Cleasby suggests perhaps a relation to the root of Gothic 𐌷𐌻𐌹𐍆𐍄𐌿𐍃 (hliftus) \"thief\", cognate with Latin cleptus and Greek κλέπτω (kléptō))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lift (countable and uncountable, plural lifts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of lifting or raising.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of transporting someone in a vehicle; a ride; a trip.",
                  "examples": [
                    "Synonym: ride"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand) Mechanical device for vertically transporting goods or people between floors in a building.",
                  "examples": [
                    "Synonym: (US, Canada, Australia) elevator",
                    "Take the lift to the fourth floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An upward force, such as the force that keeps aircraft aloft.",
                  "examples": [
                    "Synonym: uplift"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(measurement) The difference in elevation between the upper pool and lower pool of a waterway, separated by lock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical slang) A thief.",
                  "examples": [
                    "The lift came into the shop dressed like a country gentleman, but was careful not to have a cloak about him, so that the tradesman could see he had no opportunity to conceal any goods about his person."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance) The lifting of a dance partner into the air.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Permanent construction with a built-in platform that is lifted vertically.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) An improvement in mood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount or weight to be lifted.",
                  "examples": [
                    "What's the maximum lift of this crane?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The space or distance through which anything is lifted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rise; a degree of elevation.",
                  "examples": [
                    "the lift of a lock in canals"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A liftgate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A rope leading from the masthead to the extremity of a yard below, and used for raising or supporting the end of the yard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) One of the steps of a cone pulley.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shoemaking) A layer of leather in the heel of a shoe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horology) That portion of the vibration of a balance during which the impulse is given.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lift (third-person singular simple present lifts, present participle lifting, simple past lifted or (rare, regional, obsolete) lift, past participle lifted or (rare, regional, obsolete) lift or (obsolete) yleft)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To raise or rise.",
                  "examples": [
                    "The fog eventually lifted, leaving the streets clear.",
                    "You never lift a finger to help me!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To steal.",
                  "examples": [
                    "Kamal is out with twenty men to raise the Border side,And he has lifted the Colonel's mare that is the Colonel's pride."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To source directly without acknowledgement; to plagiarise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To arrest (a person).",
                  "examples": [
                    "Maybe the police lifted him and he's in Castlereagh [Interrogation Centre] because he'd been lifted three or four times previously and took to Castlereagh. They used to come in and raid the house and take him away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove (a ban, restriction, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To alleviate, to lighten (pressure, tension, stress, etc.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to cause to move upwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, intransitive) To lift weights; to weight-lift.",
                  "examples": [
                    "She lifts twice a week at the gym."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To try to raise something; to exert the strength for raising or bearing.",
                  "examples": [
                    "strained by lifting at a weight too heavy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To elevate or improve in rank, condition, etc.; often with up.",
                  "examples": [
                    "The Roman virtues lift up mortal man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To bear; to support.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To collect, as moneys due; to raise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) To transform (a function) into a corresponding function in a different context.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) To buy a security or other asset previously offered for sale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting, transitive) To take (hounds) off the existing scent and move them to another spot.",
                  "examples": [
                    "I lifted the hounds (hoping to catch the leading ones there) to the far side of Hallaton Thorns."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lifte, luft, lefte (“air, sky, heaven”), from Old English lyft (“atmosphere, air”), from Proto-West Germanic *luftu, from Proto-Germanic *luftuz (“roof, sky, air”), from Proto-Indo-European *lewp- (“to peel, break off, damage”).",
        "Cognate with Old High German luft (“air”) (German Luft), Dutch lucht (“air”), Old Norse lopt, loft (“upper room, sky, air”). More at loft."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lift (usually uncountable, plural lifts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, chiefly Scotland) Air.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, chiefly Scotland) The sky; the heavens; firmament; atmosphere.",
                  "examples": [
                    "No, no, Leddy! the sun maun be up in the lift whan I venture to her den."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}