{
  "word": "undertake",
  "etymologies": [
    {
      "description": [
        "From Middle English undertaken; equivalent to under- +‎ take (after undernim)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "undertake (plural undertakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, informal) The passing of slower traffic on the curbside rather than on the side closest to oncoming traffic.",
                  "examples": [
                    "Antonym: overtake"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "undertake (third-person singular simple present undertakes, present participle undertaking, simple past undertook, past participle undertaken)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take upon oneself; to start, to embark on (a specific task etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To commit oneself (to an obligation, activity etc.).",
                  "examples": [
                    "He undertook to exercise more in future."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, informal) To pass a slower moving vehicle on the curbside rather than on the side closest to oncoming traffic.",
                  "examples": [
                    "Antonym: overtake"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, intransitive) To pledge; to assert, assure; to dare say.",
                  "examples": [
                    "[…]  if those Persons who are curious in collecting either Minerals, or the Shells, Teeth, or other Parts of Animal Bodies that have been buried in the Earth, do but search the Hills after Rains, and the Sea-Shores after Storms, I dare undertake they will not lose their Labour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To take by trickery; to trap, to seize upon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To assume, as a character; to take on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To engage with; to attack, take on in a fight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To have knowledge of; to hear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To have or take charge of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}