{
  "word": "driver",
  "etymologies": [
    {
      "description": [
        "From Middle English drivere, dryvere, dryvare, equivalent to drive +‎ -er. Cognate with Saterland Frisian Drieuwer (“driver”), Dutch drijver (“driver”), German Low German Driever (“driver”), German Treiber (“driver”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "driver (plural drivers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who drives something, in any sense of the verb drive.",
                  "examples": [
                    "Luke North was working in the North East District when Harry Patterson the pony driver came by. It was 5.45 o'clock. Luke smelt danger in the air. He walked round the pony to speak with Harry  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that drives something, in any sense of the verb drive.",
                  "examples": [
                    "The character of work is a driver of social change, at the same time that any new forms of work are the result of broader social change."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who drives a motorized vehicle such as a car or a bus.",
                  "examples": [
                    "The requirement that every moving vehicle or combination of vehicles shall have a driver is deemed to be satisfied while the vehicle is using an automated driving system which complies with domestic technical regulations, and any applicable international legal instrument,  […]  and domestic legislation governing operation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who drives some other vehicle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, slang) A pilot (person who flies aircraft).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A device driver; a program that acts as an interface between an application and hardware, written specifically for the device it controls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A golf club used to drive the ball a great distance.",
                  "examples": [
                    "The brassey much resembled the driver, but the iron opened out quite a new field of practice;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) a kind of sail, smaller than a fore and aft spanker on a square-rigged ship, a driver is tied to the same spars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mallet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tamping iron.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cooper's hammer for driving on barrel hoops.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A screwdriver.",
                  "examples": [
                    "Among the driver and screw types available, you'll find several cross-slot varieties including the Reed & Prince  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}