{
  "word": "bastard",
  "etymologies": [
    {
      "description": [
        "From Middle English bastard, bastarde, from Anglo-Norman bastard, Old French bastart (“illegitimate child”), perhaps via Medieval Latin bastardus, of obscure origin.",
        "One possibility is that the term derives from Frankish *bāst (“marriage, relationship”) + Old French -ard, -art (pejorative suffix denoting a specific quality or condition). Frankish *bāst derives from a North Sea Germanic variety of Proto-Germanic *banstuz (“bond, connection, relationship, marriage with a second woman of lower status”), from Proto-Indo-European *bʰendʰ- (“to tie, bind”) and is related to West Frisian boaste (“marriage, matrimony”), Middle Dutch bast (“lust, heat”), and more distantly to English boose (“cow-stall”). The term probably originally referred to a child from a polygynous marriage of heathen Germanic custom — a practice not sanctioned by the Christian churches.",
        "Alternatively, Old French bastart may have originated from the Old French term fils de bast (“packsaddle son”), meaning a child conceived on an improvised bed (medieval saddles often doubled as beds while travelling). However chronology makes this difficult, as bastard is attested in Old French from 1089 (Middle Latin bastardus as early as 1010), yet Old French bast (modern French bât), though attested since 1130 with the meaning of \"beast of burden\", doesn't acquire the specific meaning of \"packsaddle\" until the 13c., making it too late to have given rise to the terms bastard and bastardus with this sense. The French Centre National de Ressources Textuelles et Lexicales supports the Germanic theory further above as being most likely."
      ],
      "adjectives": [
        {
          "description": "bastard (comparative more bastard, superlative most bastard)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or like a bastard (illegitimate human descendant).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or like a bastard (bad person).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or like a mongrel, bastardized creature/cross.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Of abnormal, irregular or otherwise inferior qualities (size, shape etc).",
              "entries": [
                {
                  "meaning": "Spurious, lacking authenticity: counterfeit, fake.",
                  "examples": []
                },
                {
                  "meaning": "(of a language) Imperfect; not spoken or written well or in the classical style; broken.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used in the vernacular name of a species to indicate that it is similar in some way to another species, often (but not always) one of another genus.",
                  "examples": [
                    "bastard gemsbok; bastard mahogany; bastard toadflax; bastard trumpeter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, vulgar) Very unpleasant.",
                  "examples": [
                    "I've got a bastard headache."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) Abbreviated, as the half title in a page preceding the full title page of a book.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater lighting) Consisting of one predominant color blended with small amounts of complementary color; used to replicate natural light because of their warmer appearance.",
                  "examples": [
                    "A bastard orange gel produces predominantly orange light with undertones of blue."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bastard (plural bastards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A person who was born out of wedlock, and hence often considered an illegitimate descendant.",
                  "examples": [
                    "Synonyms: love child, born in the vestry, illegitimate; see also Thesaurus:bastard"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mongrel (biological cross between different breeds, groups or varieties).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, offensive or derogatory, sometimes referring specifically to a man) A contemptible, inconsiderate, overly or arrogantly rude or spiteful person.",
                  "examples": [
                    "Synonyms: son of a bitch, arsehole, asshole; see also Thesaurus:git, Thesaurus:jerk",
                    "Some bastard stole my car while I was helping an injured person."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often humorous) A man, a fellow, a male friend.",
                  "examples": [
                    "lucky bastard",
                    "poor bastard",
                    "Get over here, you old bastard!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often preceded by 'poor') A person deserving of pity.",
                  "examples": [
                    "Poor bastard, I feel so sorry for him.",
                    "These poor bastards started out life probably in bad or broken homes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A child who does not know their father.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Something extremely difficult or unpleasant to deal with.",
                  "examples": [
                    "Life can be a real bastard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A variation that is not genuine; something irregular or inferior or of dubious origin, fake or counterfeit.",
                  "examples": [
                    "The architecture was a kind of bastard, suggesting Gothic but not being true Gothic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bastard file.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sweet wine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sword that is midway in length between a short-sword and a long sword; also bastard sword.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inferior quality of soft brown sugar, obtained from syrups that have been boiled several times.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large mould for straining sugar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A writing paper of a particular size.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bastard (third-person singular simple present bastards, present participle bastarding, simple past and past participle bastarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To bastardize.",
                  "examples": [
                    "After her husband's death she was matter of tragedy , having lived to see her brother beheaded , and her two sons deposed from the crown , bastarded in their blood"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}