{
  "word": "noodle",
  "etymologies": [
    {
      "description": [
        "Borrowed from Dutch noedel (“noodle”)), or from its etymon German Nudel (“piece of pasta, noodle”); further etymology uncertain, probably a variant of Knödel (“dumpling”), from Middle High German knödel (“dumpling; small knot”), and then either:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noodle (plural noodles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) A string or flat strip of pasta or other dough, usually cooked (at least initially) by boiling, and served in soup or in a dry form mixed with a sauce and other ingredients.",
                  "examples": [
                    "She slurped a long noodle up out of her soup."
                  ]
                }
              ]
            },
            {
              "group": "(by extension) An object which is long and thin like a noodle (sense 1).",
              "entries": [
                {
                  "meaning": "(informal) Short for pool noodle (“a long, slender tube or rod, extruded from buoyant foam and usually brightly coloured, used as an exercise tool or toy in swimming pools”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A dumpling cooked by boiling and served in soup; a knaidel or knödel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "The origin of the noun is uncertain; it is possibly a variant of noddle (“the head”). The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noodle (plural noodles) (informal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A person with poor judgment; a fool.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The brain; the head.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "noodle (third-person singular simple present noodles, present participle noodling, simple past and past participle noodled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To fool or trick (someone).",
                  "examples": [
                    "Synonym: dupe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Britain, dialectal, informal) To engage in frivolous behaviour; to fool around or waste time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Possibly either:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "noodle (third-person singular simple present noodles, present participle noodling, simple past and past participle noodled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, Shetland, singing) To hum or sing (a tune) at a low pitch or volume.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "The origin of the verb is uncertain; it is possibly derived:",
        "The word was probably also influenced by doodle (“to draw or scribble aimlessly”, verb).",
        "The noun is probably derived from the verb, though the verb is first attested later. The noun was probably also influenced by doodle (“small mindless sketch”, noun)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noodle (plural noodles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly jazz) An improvised passage of music played on an instrument; also, a series of ornamental notes played on an instrument; a trill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "noodle (third-person singular simple present noodles, present participle noodling, simple past and past participle noodled)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(chiefly jazz) To play (a musical instrument or passage of music) or to sing (a passage of music) in an improvisatory or lighthearted manner; also, to play (a series of ornamental notes) on an instrument.",
                  "examples": [
                    "Coordinate term: jazzify"
                  ]
                },
                {
                  "meaning": "(US, informal) To ponder or think about (something).",
                  "examples": [
                    "Synonym: mull over",
                    "“Noodle that thought around for a while,” said Dr. Johnson to his Biblical Interpretations class."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "(chiefly jazz) To play a musical instrument or to sing in an improvisatory or lighthearted manner; also, to play a series of ornamental notes on an instrument.",
                  "examples": [
                    "Coordinate term: jam",
                    "He has been noodling with that trumpet all afternoon, and every bit of it sounds awful."
                  ]
                },
                {
                  "meaning": "(US, informal)",
                  "examples": [
                    "He noodled over the problem for a day or two before making a decision."
                  ]
                },
                {
                  "meaning": "To ponder or think, especially in an unproductive or unsystematic manner; to muse.",
                  "examples": [
                    "He noodled over the problem for a day or two before making a decision."
                  ]
                },
                {
                  "meaning": "To attempt in an informal or uncertain manner; to fiddle.",
                  "examples": [
                    "If the machine is really broken, noodling with the knobs is not going to fix it."
                  ]
                },
                {
                  "meaning": "Often followed by about or around: to mess around, to play.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Uncertain; possibly:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "noodle (third-person singular simple present noodles, present participle noodling, simple past and past participle noodled) (Australia)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To search (mullock (“mining or ore processing waste”)) for opals.",
                  "examples": []
                },
                {
                  "meaning": "To obtain (an opal) by searching through mullock.",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) To clear extraneous material from (an opal).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To search mullock for opals; to fossick.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Unknown; perhaps related to guddle (“to catch (fish) with the hands”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "noodle (third-person singular simple present noodles, present participle noodling, simple past and past participle noodled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, fishing) To catch (fish (usually very large catfish), turtles, or other aquatic animals) with the hands; also, to catch (fish) using a gaff or fishing spear; to gaff.",
                  "examples": [
                    "(to catch with the hands): Synonym: guddle",
                    "Fred had several lacerations on his hands from noodling flathead in the river."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}