{
  "word": "patron",
  "etymologies": [
    {
      "description": [
        "From Middle English patroun, patrone, from Old French patron, from Latin patrōnus, derived from pater (“father”). Doublet of pattern."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "patron (plural patrons)",
          "definitionGroups": [
            {
              "group": "One who protects or supports; a defender or advocate.",
              "entries": [
                {
                  "meaning": "A guardian or intercessor; synonym of patron saint.",
                  "examples": [
                    "St. Joseph is the patron of many different places."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An influential, wealthy person who supported an artist, craftsman, a scholar or a noble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A customer, as of a certain store or restaurant.",
                  "examples": [
                    "This car park is for patrons only."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, Roman law) A protector of a dependent, especially a master who had freed a slave but still retained some paternal rights.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, ecclesiastical) One who has gift and disposition of a benefice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A padrone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or historical) A property owner, a landlord, a master. (Compare patroon.)",
                  "examples": [
                    "[...] would obtain permission from the West India Company to settle in certain areas in the New World and cultivate the land. Sometimes absentee patrons would give the colony to a group of interested persons and the patrons would finance ..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "patron (third-person singular simple present patrons, present participle patroning, simple past and past participle patroned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To be a patron of; to patronize; to favour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To treat as a patron.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}