{
  "word": "caucus",
  "etymologies": [
    {
      "description": [
        "Unknown. One possible source is Algonquin cawaassough or caucauasu (“counselor, elder, adviser”). A popular folk etymology attested in Great Leaders and National Issues of 1896 stated: \"In the early part of the eighteenth century a number of caulkers connected with the shipping business in the North End of Boston held a meeting for consultation. That meeting was the germ of the political caucuses which have formed so prominent a feature of our government ever since its organization.\" American Heritage Dictionary states the term is taken from the Caucus Club of Boston in the 1760s, possibly from Medieval Latin caucus (“drinking vessel”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "caucus (plural caucuses or caucusses) (US, Canada, Israel, South Africa, Zimbabwe, Pakistan, archaic in UK, not used in the European Union)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A usually preliminary meeting of party members to nominate candidates for public office or delegates to be sent a nominating convention, or to confer regarding policy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A grouping of all the members of a legislature from the same party.",
                  "examples": [
                    "Synonym: parliamentary group"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A political interest group by members of a legislative body.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "caucus (third-person singular simple present caucuses or caucusses, present participle caucusing or caucussing, simple past and past participle caucused or caucussed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive or transitive with with) To meet and participate in a caucus.",
                  "examples": [
                    "\"Senator Joseph I. Lieberman of Connecticut said yesterday that he will caucus with Senate Democrats in the new Congress, but he would not rule out switching to the Republican caucus if he starts to feel uncomfortable among Democrats.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring into or treat in a caucus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}