{
  "word": "weasel",
  "etymologies": [
    {
      "description": [
        "From Middle English wesele, from Old English weosule, from Proto-West Germanic *wisulā, from Proto-Germanic *wisulǭ. \nThe verb is from c. 1900, from the supposed cunningness of the weasel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "weasel (plural weasels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The least weasel, Mustela nivalis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the carnivorous mammals of the genus Mustela, having a slender body, a long tail and usually a light brown upper coat and light-coloured belly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The taxonomic family Mustelidae is also called the weasel family.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A devious or sneaky person or animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of yarn winder used for counting the yardage of handspun yarn. It most commonly has a wooden peg or dowel that pops up from the gearing mechanism after a certain number of yards have been wound onto the winder.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "weasel (third-person singular simple present weasels, present participle weaseling or weaselling, simple past and past participle weaseled or weaselled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To achieve by clever or devious means.",
                  "examples": [
                    "Prisoners are notorious for weaseling day passes to get out of lockup […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or reflexive) To gain something for oneself by clever or devious means.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in clever or devious behavior.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}