{
  "word": "manure",
  "etymologies": [
    {
      "description": [
        "From Middle English maynouren, manuren (“to supervise, toil”), borrowed from Anglo-Norman meinourer and Old French manovrer (whence also English maneuver), from Vulgar Latin *manuoperare (“work by hand”), from Latin manū (“by hand”) + operārī (“to work”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "manure (countable and uncountable, plural manures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Animal excrement, especially that of common domestic farm animals and when used as fertilizer. Generally speaking, from cows, horses, sheep, pigs and chickens.",
                  "examples": [
                    "I hate manure!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any fertilizing substance, whether of animal origin or not; fertiliser.",
                  "examples": [
                    "Malt dust consists chiefly of the infant radicle separated from the grain. I have never made any experiment upon this manure; but there is great reason to suppose it must contain saccharine matter; and this will account for its powerful effects."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) Rubbish; nonsense; bullshit.",
                  "examples": [
                    "“You know the police think I killed Marge, don't you?”“What a load of manure! I couldn't believe it when I read the paper.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "manure (third-person singular simple present manures, present participle manuring, simple past and past participle manured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cultivate by manual labor; to till; hence, to develop by culture.",
                  "examples": [
                    "Manure thyself then; to thyself be approved; / And with vain, outward things be no more moved."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To apply manure (as fertilizer or soil improver).",
                  "examples": [
                    "The farmer manured his fallow field."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}