{
  "word": "puncheon",
  "etymologies": [
    {
      "description": [
        "From Middle English punchoun, from Anglo-Norman ponchon, pounceon et al., and Middle French ponçon, poinchon et al., from Old French ponchon, from Latin pūnctiōnem (“act of piercing”). Doublet of punction. Related to Middle High German punze (“chisel; burin, graver”), ponze (“puncheon, standardized cask”), German Punze (“puncheon, punch, counter”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "puncheon (plural puncheons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A figured stamp, die, or punch, used by goldsmiths, cutlers, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short, upright piece of timber in framing; a short post; an intermediate stud.",
                  "examples": [
                    "he chose to regard [his father] with a lowering and suspicious mien, unless it were in the dead hours of the night, when he developed a morbid craving to be trotted back and forth and up and down the puncheon floor [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of roughly dressed timber with one face finished flat (by either hewing or sawing).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A split log or heavy slab of timber with the face smoothed, used especially for flooring but also for log cabin walls, piers, or plank roads.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A walkway or short, low footbridge over wet ground constructed with such timbers, made by laying one or more planks or dressed timbers over sills set directly on the ground; also called duck boards, bog boards, or bog bridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short low bridge of similar construction. Also called puncheon bridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of cask used to hold liquids, having a capacity varying from 72 to 120 gallons; a tercian.",
                  "examples": [
                    "Once in the Grenada islands, when I and above eight others were pulling a large boat with two puncheons of water in it, a surf struck us, and drove the boat and all in it about half a stone's throw, among some trees, and above the high water mark."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}