{
  "word": "mix",
  "etymologies": [
    {
      "description": [
        "From Middle English mixen (attested in past tense as mixed, myxyd), from Old English *mixian, miscian, from Proto-West Germanic *miskijan, from Proto-Germanic *miskijaną, from Proto-Indo-European *miḱ-sḱé-ti, from *meyǵ-, *meyḱ- (“to mix”).",
        "Cognate with Saterland Frisian miskje (“to mix, blend”), Middle Dutch mischen (“to mix”), Low German misken, mischen (“to mix”), Old High German miskian, miskēn (“to mix”) (German mischen), Welsh mysgu (“to mix”), Latin misceō (“mix”), Ancient Greek μίγνυμι (mígnumi, “to mix”), Old Church Slavonic мѣсити (měsiti, “to mix”), Lithuanian mišti and maišyti (“to mix”), Sanskrit मिश्र (miśra, “mixed”), Persian آمیختن‎ (âmixtan, “to mix”), Old English māsc (“mixture, mash”). More at mash."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "mix (third-person singular simple present mixes, present participle mixing, simple past and past participle mixed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stir together.",
                  "examples": [
                    "Mix the eggs and milk with the flour until the consistency is smooth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To combine (items from two or more sources normally kept separate).",
                  "examples": [
                    "to mix business with pleasure",
                    "Don't mix the meat recipes with the dairy recipes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To form by mingling; to produce by the stirring together of ingredients; to concoct from different parts.",
                  "examples": [
                    "Yellow and blue paint mix to make green."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To blend by the use of a mixer (machine).",
                  "examples": [
                    "Mix the egg whites until they are stiff."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To combine (several tracks).",
                  "examples": [
                    "I'll mix the rhythm tracks down to a single track."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To produce a finished version of (a recording).",
                  "examples": [
                    "I'm almost done mixing this song."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To unite with in company; to join; to associate.",
                  "examples": [
                    "The mention of the six knots of elderwood is curious, for that tree mixes largely in folk lore."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A merger of a nominal use of the verb and a borrowing from Anglo-Norman mixte, from Latin mixtus, past participle of misceō (“mix”). Nowadays regarded automatically as the nominal form of the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mix (plural mixes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The result of mixing two or more substances; a mixture.",
                  "examples": [
                    "Now add the raisins to the mix."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The result of combining items normally kept separate.",
                  "examples": [
                    "My recipe file was now a mix of meat and dairy.",
                    "The combination of classical music and hip hop is a surprisingly good mix."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The result of mixing several tracks.",
                  "examples": [
                    "The rhythm mix sounds muddy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The finished version of a recording.",
                  "examples": [
                    "I've almost finished the mix for this song."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, uncountable) A substance used to dilute or adulterate an illicit drug.",
                  "examples": [
                    "Synonym: cut"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}