{
  "word": "wing",
  "etymologies": [
    {
      "description": [
        "From Middle English winge, wenge, from Old Norse vængr (\"wing of a flying animal, wing of a building\"; compare vængi (“ship's cabin”)), from Proto-Germanic *wēingaz, *wēingô. Cognate with Danish vinge (“wing”), Swedish vinge (“wing”), Icelandic vængur (“wing”), from Proto-Indo-European *h₂weh₁- (“to blow”), thus related to wind.",
        "Replaced native Middle English fither (from Old English fiþre, from Proto-Germanic *fiþriją), which merged with Middle English fether (from Old English feþer, from Proto-Germanic *feþrō). More at feather."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wing (plural wings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An appendage of an animal's (bird, bat, insect) body that enables it to fly",
                  "examples": [
                    "The bird was flapping its wings"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fin at the side of a ray or similar fish",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Human arm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) Part of an aircraft that produces the lift for rising into the air.",
                  "examples": [
                    "I took my seat on the plane, overlooking the wing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the large pectoral fins of a flying fish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the broad, thin, anterior lobes of the foot of a pteropod, used as an organ in swimming.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Any membranaceous expansion, such as that along the sides of certain stems, or of a fruit of the kind called samara.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Either of the two side petals of a papilionaceous flower.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A side shoot of a tree or plant; a branch growing up by the side of another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Passage by flying; flight.",
                  "examples": [
                    "to take wing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Limb or instrument of flight; means of flight or of rapid motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of something that is lesser in size than the main body, such as an extension from the main building.",
                  "examples": [
                    "the west wing of the hospital",
                    "the wings of a corkscrew"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything that agitates the air as a wing does, or is put in winglike motion by the action of the air, such as a fan or vane for winnowing grain, the vane or sail of a windmill, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A protruding piece of material on a menstrual pad to hold it in place and prevent leakage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ornament worn on the shoulder; a small epaulet or shoulder knot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cosmetic effect where eyeliner curves outward and ends at a point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A faction of a political movement. Usually implies a position apart from the mainstream center position.",
                  "examples": []
                }
              ]
            },
            {
              "group": "An organizational grouping in a military aviation service:",
              "entries": [
                {
                  "meaning": "(Britain) A unit of command consisting of two or more squadrons and itself being a sub-unit of a group or station.",
                  "examples": []
                },
                {
                  "meaning": "(US) A larger formation of two or more groups, which in turn control two or more squadrons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A panel of a car which encloses the wheel area, especially the front wheels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A platform on either side of the bridge of a vessel, normally found in pairs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) That part of the hold or orlop of a vessel which is nearest the sides. In a fleet, one of the extremities when the ships are drawn up in line, or when forming the two sides of a triangle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A position in several field games on either side of the field.",
                  "examples": [
                    "Smith started the game in the centre of midfield, but moved to the wing after 30 minutes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A player occupying such a position, also called a winger",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography, informal, rare) A háček.",
                  "examples": [
                    "ˇ wing, wedge, hǎcek, inverted circumflex (Karel Čapek)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) One of the unseen areas on the side of the stage in a theatre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) The insignia of a qualified pilot or aircrew member.",
                  "examples": [
                    "Anyone and everyone with wings - press officers, operations specialists, even General Curtis LeMay, commander of the U.S. Air Force in Europe - was put on flight duty and took turns flying double shifts for \"Operation Vittles.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A portable shelter consisting of a fabric roof on a frame, like a tent without sides.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "On the enneagram, one of the two adjacent types to an enneatype that forms an individual's subtype of his or her enneatype.",
                  "examples": [
                    "Tom's a 4 on the enneagram, with a 3 wing."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wing (third-person singular simple present wings, present participle winging, simple past and past participle winged or (nonstandard) wung)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To injure slightly (as with a gunshot), especially in the wing or arm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a building) To add a wing (extra part) to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To act or speak extemporaneously; to improvise; to wing it.",
                  "examples": [
                    "I lost all my notes I'd made, so was partially winging the meeting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To throw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with wings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To transport with, or as if with, wings; to bear in flight, or speedily.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To traverse by flying.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}