{
  "word": "bombard",
  "etymologies": [
    {
      "description": [
        "From Middle English bombard, from Middle French bombarde (“a bombard, mortar, catapult\"; also \"a bassoon-like musical instrument”), from Latin bombus (“buzzing; booming”).",
        "The modern pronunciation is from modern French bombarde."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bombard (plural bombards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a medieval primitive cannon, used chiefly in sieges for throwing heavy stone balls.",
                  "examples": [
                    "They planted in divers places twelve great bombards, wherewith they threw huge stones into the air, which, falling down into the city, might break down the houses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) a bassoon-like medieval instrument",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) a large liquor container made of leather, in the form of a jug or a bottle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic, rare) A bombardment.",
                  "examples": [
                    "With mines and parallels contracts the space; Then bids the battering floats his labors crown And pour their bombard on the shuddering town"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A bombardon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French bombarder, from Middle French bombarde (“a bombard”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bombard (third-person singular simple present bombards, present participle bombarding, simple past and past participle bombarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To continuously attack something with bombs, artillery shells or other missiles or projectiles.",
                  "examples": [
                    "The enemy's stronghold was bombarded for 3 hours straight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To attack something or someone by directing objects at them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To continuously send or direct (at someone)",
                  "examples": [
                    "I was bombarded with WhatsApp messages after appearing on the news.",
                    "Please don't bombard me with questions right now, I'll answer them at the end of the statement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) To direct at a substance an intense stream of high-energy particles, usually sub-atomic or made of at most a few atoms.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}