{
  "word": "die",
  "etymologies": [
    {
      "description": [
        "From Middle English deyen, from Old English dīeġan and Old Norse deyja, both from Proto-Germanic *dawjaną (“to die”). Displaced Old English sweltan, whence Modern English swelt."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "die (third-person singular simple present dies, present participle dying, simple past and past participle died)",
          "definitionGroups": [
            {
              "group": "(intransitive) To stop living; to become dead; to undergo death.",
              "entries": [
                {
                  "meaning": "followed by of; general use:",
                  "examples": [
                    "He died of malaria."
                  ]
                },
                {
                  "meaning": "followed by from; general use, though somewhat more common in the context of medicine or the sciences:",
                  "examples": [
                    "He died from heart failure."
                  ]
                },
                {
                  "meaning": "followed by for; often expressing wider contextual motivations, though sometimes indicating direct causes:",
                  "examples": [
                    "He died for the one he loved."
                  ]
                },
                {
                  "meaning": "(now rare) followed by with as an indication of direct cause:",
                  "examples": [
                    "And there were some who died with fevers, which at some seasons of the year was very frequent in the land."
                  ]
                },
                {
                  "meaning": "(uncommon, nonstandard outside video games) followed by to as an indication of direct cause (like from):",
                  "examples": [
                    "I can't believe I just died to a turret!"
                  ]
                },
                {
                  "meaning": "(still current) followed by with as an indication of manner:",
                  "examples": [
                    "She died with dignity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To (stop living and) undergo (a specified death).",
                  "examples": [
                    "He died a hero's death.",
                    "They died a thousand deaths."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, slang) To lose a game.",
                  "examples": [
                    "Whenever my brother dies, he ragequits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To yearn intensely.",
                  "examples": [
                    "I'm dying for a packet of crisps.",
                    "I'm dying for a piss."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, uncommon, idiomatic) To be or become hated or utterly ignored or cut off, as if dead.",
                  "examples": [
                    "The day our sister eloped, she died to our mother."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To become spiritually dead; to lose hope.",
                  "examples": [
                    "He died a little inside each time she refused to speak to him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial, hyperbolic) To be mortified or shocked by a situation.",
                  "examples": [
                    "If anyone sees me wearing this ridiculous outfit, I'll die."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative, hyperbolic) To be so overcome with emotion or laughter as to be incapacitated.",
                  "examples": [
                    "When I found out my two favorite musicians would be recording an album together, I literally planned my own funeral arrangements and died."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a machine) To stop working; to break down or otherwise lose \"vitality\".",
                  "examples": [
                    "My car died in the middle of the freeway this morning.",
                    "Sorry I couldn't call you. My phone died.",
                    "My battery died and my charger was at home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a computer program) To abort, to terminate (as an error condition).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a legislative bill or resolution) To expire at the end of the session of a legislature without having been brought to a vote.",
                  "examples": [
                    "The proposed gas tax died after the powerful rural senator refused to let it out of committee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perish; to cease to exist; to become lost or extinct.",
                  "examples": [
                    "letting the secret die within his own breast"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sink; to faint; to pine; to languish, with weakness, discouragement, love, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often with \"to\") To become indifferent; to cease to be subject.",
                  "examples": [
                    "to die to pleasure or to sin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) To disappear gradually in another surface, as where mouldings are lost in a sloped or curved face.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To become vapid, flat, or spiritless, as liquor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a stand-up comedian or a joke) To fail to evoke laughter from the audience.",
                  "examples": [
                    "Then there was that time I died onstage in Montreal..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English dee, from Old French de (Modern French dé), from Latin datum, from datus (“given”), the past participle of dō (“to give”), from Proto-Indo-European *deh₃- (“to lay out, to spread out”). Doublet of datum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "die (plural dies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cubical part of a pedestal; a plinth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for cutting into a specified shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device used to cut an external screw thread. (Internal screw threads are cut with a tap.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mold for forming metal or plastic objects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An embossed device used in stamping coins and medals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(semiconductors, plural also dice) An oblong chip fractured from a semiconductor wafer engineered to perform as an independent device or integrated circuit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any small cubical or square body.",
                  "examples": []
                }
              ]
            }
          ]
        },
        {
          "description": "die (plural dice or (nonstandard) dies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An isohedral polyhedron, usually a cube, with numbers or symbols on each side and used in games of chance.",
                  "examples": [
                    "Most dice are six-sided.",
                    "I rolled the die and moved 2 spaces on the board."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which is, or might be, determined, by a throw of the die; hazard; chance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Variant spelling."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "die (plural dies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of dye",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "die (third-person singular simple present dies, present participle dying, simple past and past participle died)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of dye",
                  "examples": [
                    "Also no dyer shall die any cloth, except he die the cloth and the list with one colour, without tacking any bulrushes or such like thing upon the lists, upon pain to forfeit 40 s. for every cloth. And no person shall put to sale any cloth deceitfully dyed,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}