{
  "word": "rubbish",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English robous (“rubbish, building rubble”), further origin uncertain; possibly from Anglo-Norman rubous, rubouse, rubbouse (“refuse, waste material; building rubble”), and compare Anglo-Latin rebbussa, robousa, robusium, robusum, rubisum, rubusa, rubusium (although the Anglo-Norman and Anglo-Latin words may be derived from the English word instead of the other way around, as there are no known Old French cognates of the word). The English word may be related to rubble, though the connection is unclear. Possibly derived ultimately from Old Norse rubba (“to huddle, crowd together, heap up\", also possibly \"to rub, scrape”), from Proto-Germanic *rubbōną (“to rub, scrape”). Compare Swedish rubba (“to move, displace, dislodge, upset”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [
        {
          "description": "rubbish (comparative more rubbish or rubbisher, superlative most rubbish or rubbishest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia, New Zealand, Britain, colloquial) Exceedingly bad; awful.",
                  "examples": [
                    "Synonyms: abysmal, crappy, horrendous, shitty, terrible; see also Thesaurus:bad, Thesaurus:low-quality",
                    "This has been a rubbish day, and it’s about to get worse: my mother-in-law is coming to stay."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "rubbish (usually uncountable, plural rubbishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia, New Zealand, Britain) Refuse, waste, garbage, junk, trash.",
                  "examples": [
                    "Synonyms: see Thesaurus:trash",
                    "The rubbish is collected every Thursday in Gloucester, but on Wednesdays in Cheltenham."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, chiefly Australia, New Zealand, Britain) An item, or items, of low quality.",
                  "examples": [
                    "Much of what they sell is rubbish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, chiefly Australia, New Zealand, Britain) Nonsense.",
                  "examples": [
                    "Synonyms: see Thesaurus:nonsense",
                    "Everything the teacher said during that lesson was rubbish. How can she possibly think that a bass viol and a cello are the same thing?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Debris or ruins of buildings.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rubbish (third-person singular simple present rubbishes, present participle rubbishing, simple past and past participle rubbished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly Australia, Britain, India, New Zealand, colloquial) To criticize, to denigrate, to denounce, to disparage. [from c. 1950s (Australia, New Zealand)]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Hong Kong) To litter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}