{
  "word": "aberration",
  "etymologies": [
    {
      "description": [
        "A learned borrowing from Latin aberrātiō (“relief, diversion”), first attested in 1594, from aberrō (“wander away, go astray”), from ab (“away”) + errō (“wander”). Compare French aberration. Equivalent to aberrate +‎ -ion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "aberration (countable and uncountable, plural aberrations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of wandering; deviation from truth, moral rectitude; abnormal; divergence from the straight, correct, proper, normal, or from the natural state. [Late 16th century.]",
                  "examples": [
                    "the aberration of youth",
                    "aberrations from theory",
                    "aberration of character"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(optics) The convergence to different foci, by a lens or mirror, of rays of light emanating from one and the same point, or the deviation of such rays from a single focus; a defect in a focusing mechanism that prevents the intended focal point. [Mid 18th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(astronomy) A small periodical change of the apparent positions of the stars and other heavenly bodies, due to the combined effect of the motion of light and the motion of the observer. [Mid 18th century.]",
              "entries": [
                {
                  "meaning": "(astronomy, by extension) The tendency of light rays to preferentially strike the leading face of a moving object (the effect underlying the above phenomenon).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A partial alienation of reason. [Early 19th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mental disorder, especially one of a minor or temporary character. [Early 19th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, botany) Atypical development or structure; deviation from the normal type; an aberrant organ. [Mid 19th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A deviation of a tissue, organ or mental functions from what is considered to be within the normal range.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A defect in an image produced by an optical or electrostatic lens system.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}