{
  "word": "wisp",
  "etymologies": [
    {
      "description": [
        "From Middle English wispe, wyspe, wips, wipse, perhaps from an unrecorded Old English *wisp, *wips. Cognate with West Frisian wisp, Dutch wisp (“bundle of hay or straw”), Norwegian bokmål/Swedish/Bornholm Danish visp (“handful or bundle of grass, hay, etc.”). Akin also to Middle Dutch/Middle Low German wispel (“measure of grain”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wisp (countable and uncountable, plural wisps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small bundle, as of straw or other like substance; any slender, flexible structure or group.",
                  "examples": [
                    "A wisp of smoke rose from the candle for a few moments after he blew it out.",
                    "A wisp of hair escaped her barrette and whipped wildly in the wind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A whisk, or small broom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A will o' the wisp, or ignis fatuus.",
                  "examples": [
                    "the wisp that flickers where no foot can tread"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An immeasurable, indefinable essence of life; soul.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flock of snipe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A disease affecting the feet of cattle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wisp (third-person singular simple present wisps, present participle wisping, simple past and past participle wisped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To brush or dress, as with a wisp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect, obsolete) To rumple.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce a wisp, as of smoke.",
                  "examples": [
                    "To Temple, sitting in the cottonseed-hulls and the corn-cobs, the sound was no louder than the striking of a match: a short, minor sound shutting down the scene, the instant, with a profound finality, completely isolating it, and she sat there, her legs straight before her, her hands limp and palm-up on her lap, looking at Popeye's tight back and the ridges of his coat across his shoulders as he leaned out the door, the pistol behind him, against his flank, wisping thinly along his leg."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To emit in wisps.",
                  "examples": [
                    "It looked warm and rosy-bright inside, with a little chimney wisping smoke, little windows glowing."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}