{
  "word": "sign",
  "etymologies": [
    {
      "description": [
        "From Middle English signe, sygne, syng, seine, sine, syne, from Old English seġn (“sign; mark; token”) and Old French signe, seing (“sign; mark; signature”); both from Latin signum (“a mark; sign; token”); root uncertain. Doublet of signum. Partially displaced native token."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sign (countable and uncountable, plural signs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes also used uncountably) A perceptible (e.g. visible) indication.",
                  "examples": [
                    "Their angry expressions were a clear sign they didn't want to talk.",
                    "Those clouds show signs of raining soon.",
                    "Those clouds show little sign of raining soon.",
                    "Signs of disease are objective, whereas symptoms are subjective.",
                    "The sharp sign indicates that the pitch of the note is raised a half step.",
                    "I gave them a thumbs-up sign."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, Australia, uncountable) Physical evidence left by an animal.",
                  "examples": [
                    "The hunters found deer sign at the end of the trail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A clearly visible object, generally flat, bearing a short message in words or pictures.",
                  "examples": [
                    "The sign in the window advertised a room for rent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wonder; miracle; prodigy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) An astrological sign.",
                  "examples": [
                    "Your sign is Taurus? That's no surprise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Positive or negative polarity, as denoted by the + or - sign.",
                  "examples": [
                    "I got the magnitude right, but the sign was wrong."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specific gesture or motion used to communicate by those with speaking or hearing difficulties; now specifically, a linguistic unit in sign language equivalent to word in spoken languages.",
                  "examples": [
                    "In American Sign Language (ASL), for instance, the sign for 'catch' is formed with one hand (in the role of agent) moving across the body (an action) to grasp the forefinger of the other hand (the patient)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Sign language in general.",
                  "examples": [
                    "Sorry, I don't know sign very well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A semantic unit, something that conveys meaning or information (e.g. a word of written language); (linguistics, semiotics) a unit consisting of a signifier and a signified concept. (See sign (semiotics).)",
                  "examples": [
                    "A Noun substantive and a Noun adjective may be thus distinguished, that a substantive may have the sign a or the before it; as, puer, a boy, the boy; but an adjective cannot, as, bonus, good."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An omen.",
                  "examples": [
                    "\"It's a sign of the end of the world,\" the doom prophet said."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A property of the body that indicates a disease and, unlike a symptom, can be detected objectively by someone other than the patient.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A military emblem carried on a banner or standard.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English signen, seinen, seinien, partly from Old English seġnian (“to mark; sign”) and partly from Anglo-Norman seigner, seiner et al., Old French signer et al., and their source Latin signāre (“to mark, seal, indicate, signify”); all from Latin signum (“a mark, sign”); see Etymology 1, above. Compare sain."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sign (third-person singular simple present signs, present participle signing, simple past and past participle signed)",
          "definitionGroups": [
            {
              "group": "To make a mark",
              "entries": [
                {
                  "meaning": "(transitive, now rare) To seal (a document etc.) with an identifying seal or symbol. [from 13th c.]",
                  "examples": [
                    "The Queen signed her letter with the regal signet."
                  ]
                },
                {
                  "meaning": "(transitive) To mark, to put or leave a mark on. [from 14th c.]",
                  "examples": [
                    "Meantime revolving in his thoughtful mind / The scar, with which his manly knee was sign'd […]."
                  ]
                },
                {
                  "meaning": "(transitive) To validate or ratify (a document) by writing one's signature on it. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(transitive) More generally, to write one's signature on (something) as a means of identification etc. [from 15th c.]",
                  "examples": [
                    "I forgot to sign that letter to my aunt."
                  ]
                },
                {
                  "meaning": "(transitive or reflexive) To write (one's name) as a signature. [from 16th c.]",
                  "examples": [
                    "Just sign your name at the bottom there.",
                    "I received a letter from some woman who signs herself ‘Mrs Trellis’."
                  ]
                },
                {
                  "meaning": "(intransitive) To write one's signature. [from 17th c.]",
                  "examples": [
                    "Please sign on the dotted line."
                  ]
                },
                {
                  "meaning": "(intransitive) To finalise a contractual agreement to work for a given sports team, record label etc. [from 19th c.]",
                  "examples": [
                    "Agents say Wales back Gavin Henson has signed for Cardiff Blues."
                  ]
                },
                {
                  "meaning": "(transitive) To engage (a sports player, musician etc.) in a contract. [from 19th c.]",
                  "examples": [
                    "It was a great month. I managed to sign three major players."
                  ]
                }
              ]
            },
            {
              "group": "To make the sign of the cross",
              "entries": [
                {
                  "meaning": "(transitive) To bless (someone or something) with the sign of the cross; to mark with the sign of the cross. [from 14th c.]",
                  "examples": [
                    "At the baptismal ceremony the child was […] signed with the cross in holy water."
                  ]
                },
                {
                  "meaning": "(reflexive) To cross oneself. [from 15th c.]",
                  "examples": [
                    "Shaking a fist at him with one fierce arm, / Signing himself with the other because of Christ."
                  ]
                }
              ]
            },
            {
              "group": "To indicate",
              "entries": [
                {
                  "meaning": "(intransitive) To communicate using a gesture or signal. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To communicate or make known (a meaning, intention, etc.) by a sign.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To communicate using gestures to (someone). [from 16th c.]",
                  "examples": [
                    "He signed me that I should follow him through the doorway."
                  ]
                },
                {
                  "meaning": "(intransitive) To use sign language. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To furnish (a road etc.) with signs. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "To determine the sign of",
              "entries": [
                {
                  "meaning": "(transitive) To calculate or derive whether a quantity has a positive or negative sign.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}