{
  "word": "anatomy",
  "etymologies": [
    {
      "description": [
        "From French anatomie, from Latin anatomia, from Ancient Greek *ἀνατομία (*anatomía), from ἀνατομή (anatomḗ, “dissection”), from ἀνά (aná, “up”) + τέμνω (témnō, “I cut, incise”) (surface analysis ana- +‎ -tomy), literally “cut up”. Doublet of ottomy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "anatomy (countable and uncountable, plural anatomies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The art of studying the different parts of any organized body, to discover their situation, structure, and economy.",
                  "examples": [
                    "Synonym: dissection"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The science that deals with the form and structure of organic bodies; anatomical structure or organization.",
                  "examples": [
                    "Hyponyms: anthropotomy, phytotomy, zootomy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A treatise or book on anatomy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The act of dividing anything, corporeal or intellectual, for the purpose of examining its parts.",
                  "examples": [
                    "Synonym: analysis",
                    "the anatomy of a discourse",
                    "the anatomy of love",
                    "Burton's famous treatise, \"The Anatomy of Melancholy\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) The form of an individual.",
                  "examples": [
                    "I went to the Venice beach body-building competition and noticed the competitor from Athens, and let me tell you, that's what I call classic Greek anatomy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) The human body, especially in reference to the private parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A skeleton, or dead body.",
                  "examples": [
                    "So did the Ægyptians, who in the middest of their banquetings, and in the full of their greatest cheere, caused the anatomy of a dead man to be brought before them, as a memorandum and warning to their guests."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The physical or functional organization of an organism, or part of it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}