{
  "word": "baston",
  "etymologies": [
    {
      "description": [
        "From Middle English baston, from Old French baston. Doublet of baton."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "baston (plural bastons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) Obsolete form of baton.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A staff or cudgel.",
                  "examples": [
                    "[fight] performed by bastons, clubs and coulstaves"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An officer bearing a painted staff, who formerly was in attendance upon the king's court to take into custody persons committed by the court.",
                  "examples": [
                    "Item, whereas divers people, at the suit of the party commanded to the prison of the Fleet, by judgment given in courts of our Lord the King, be oftentimes suffered to go at large by the warden of the prison, sometime by mainprise or by bail, and sometimes without any mainprise with a baston of the Fleet, and to go from thence into the country about their merchandises and other their business, and be there long out of prison nights and days, without their assent at whose suit they be judged, and without their gree thereof made, whereby a man cannot come to his right and recovery against such prisoners, to the great mischief and undoing of many people; It is ordained and assented, That from henceforth no warden of the Fleet shall suffer any prisoner there being by judgment at the suit of the party, to go out of prison by mainprise, bail, nor by baston, without making gree to the said parties of that whereof they were judged, unless it be by writ or other commandment of the King, upon pain to lose his office, and the keeping of the said prison."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}