{
  "word": "knob",
  "etymologies": [
    {
      "description": [
        "From Middle English knobbe, from Middle Low German knobbe (“knob; knot in wood”), probably via Old Saxon from a variant of Proto-Germanic *knappô (“knob, lump”), one of several kn- words related to *knuttô (“knot”).",
        "Cognate with Dutch knob, knobbel (“knob”), German Knubbe, Knubbel (“knob”). See also knop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "knob (plural knobs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rounded protuberance, especially one arising from a flat surface; a fleshy lump or caruncle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rounded control switch that can be turned on its axis, designed to be operated by the fingers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ball-shaped part of a handle, lever, etc., designed to be grabbed by the hand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rounded ornament on the hilt of an edged weapon; a pommel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prominent, rounded bump along a mountain ridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) A prominent rounded hill.",
                  "examples": [
                    "We climbed to the top of Slate Hill, the highest knob in our town, and Ricky gave me a whole talk on how slate formed, how it was and was not shale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly in the plural) A woman's breast.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(vulgar, slang, chiefly UK) The penis; dick.",
              "entries": [
                {
                  "meaning": "The head of the penis; the glans.",
                  "examples": []
                },
                {
                  "meaning": "(by extension, derogatory) A contemptible person; dick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) The clitoris.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) A dollop, an amount just larger than a spoonful (usually referring to butter).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chunky branch-like piece, especially of a ginger rhizome.",
                  "examples": [
                    "Place whole, unpeeled knobs of ginger in a zipper-lock freezer bag for up to 3 months. Slice or break off what you need and return the rest to the freezer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bulb of the garlic plant consisting of multiple cloves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, US) A freshman at The Citadel, The Military College of South Carolina.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "knob (third-person singular simple present knobs, present participle knobbing, simple past and past participle knobbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang, vulgar, transitive, of a man) To have sex with.",
                  "examples": [
                    "Had Jack knobbed her as well? Molly wondered."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}