{
  "word": "supernatural",
  "etymologies": [
    {
      "description": [
        "From Middle English supernatural, supernatural, from Middle French supernaturel, from Latin supernātūrālis, from super (“above”) + nātūra (“nature; that which we are born with”), from nātus (“born”), perfect passive participle of nāscī (“to be born”) + adjective suffix -ālis."
      ],
      "adjectives": [
        {
          "description": "supernatural (comparative more supernatural, superlative most supernatural)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Above nature; beyond or added to nature, often so considered because it is given by a deity or some force beyond that which humans are born with.",
                  "examples": [
                    "In Roman Catholic theology, sanctifying grace is considered to be a supernatural addition to human nature.",
                    "Stephen King's first novel is about a girl named Carrie dealing with supernatural powers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not of the usual; not natural; altered by forces that are not understood fully if at all.",
                  "examples": [
                    "The house is haunted by supernatural forces."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "supernatural (plural supernaturals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A supernatural being",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Supernatural beings and events collectively (when used with definite article: \"the supernatural\")",
                  "examples": [
                    "Dr Johnson defended Shakespeare's use of the supernatural from the charge of implausibility on the grounds that, \"The reality of witchcraft … has in all ages and countries been credited by the common people, and in most by the learned.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}