{
  "word": "antecedence",
  "etymologies": [
    {
      "description": [
        "From Latin antecēdentia from Latin antecēdēns (“preceding”), from antecēdō (“go before”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "antecedence (countable and uncountable, plural antecedences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The relationship of preceding something in time or order.",
                  "examples": [
                    "Synonyms: precedence, priority; see also Thesaurus:anteriority",
                    "Antonyms: subsequence; see also Thesaurus:posteriority"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which precedes something or someone (e.g. prior events, origin, ancestry).",
                  "examples": [
                    "[…]  it is pleasantly notable  […]  with what desperate intensity, vigilance, and fierceness Madame watches over all his interests, and liabilities, and casualties great and small, leaping with her whole force into M. de Voltaire’s scale of the balance, careless of antecedences and consequences alike; flying with the spirit of an angry brood-hen, at the face of mastiffs in defense of any feather that is M. de Voltaire’s."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The length of time by which one event or time period precedes another.",
                  "examples": [
                    "The average antecedence of spring phenomena at Carlton House to their occurrence at Cumberland House is between a fortnight and three weeks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The relationship between a pronoun and its antecedent.",
                  "examples": [
                    "Sometimes this defect amounts to a blundering obliviousness of all antecedence. The following tearful reproof was given by a judge of the State of New York to a prisoner just convicted: “ […]  nature has endowed you with a good education and respectable family connections, instead of which you go around the country stealing ducks.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A geologic process that explains how and why antecedent rivers can cut through mountain systems instead of going around them.",
                  "examples": [
                    "Speculation as to how the Green River established its course across the Uinta Mountains led Powell to introduce such terms as “superposition” and “antecedence” to identify processes by which streams are able to establish and maintain courses across mountain barriers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy, obsolete) An apparent motion of a planet toward the west.",
                  "examples": [
                    "Synonym: retrogradation"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}