{
  "word": "holocaust",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English holocaust (“burnt offering”) [and other forms], from Anglo-Norman holocauste, Old French holocauste, olocauste (modern French holocaust), from Late Latin holocaustum, from Ancient Greek ὁλόκαυστον (holókauston), the neuter form of ὁλόκαυστος (holókaustos, “wholly burnt”), from ὅλος (hólos, “entire, whole”) (ultimately from Proto-Indo-European *solh₂- (“whole”)) + καυστός (kaustós, “burnt”) (from καίω (kaíō, “to burn, burn up”); further etymology uncertain, possibly from Proto-Indo-European *keh₂w-).",
        "The verb is derived from the noun. As regards verb sense 3 (“to subject (a group of people) to a holocaust”), compare the use of genocide as a verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "holocaust (plural holocausts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) An offering or sacrifice to a deity that is completely burned to ashes. [from 13th c.]",
                  "examples": [
                    "Hypernym: burnt offering",
                    "Coordinate term: moirocaust"
                  ]
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(religion, also figuratively) A complete or large offering or sacrifice.",
                  "examples": [
                    "Synonym: hecatomb"
                  ]
                },
                {
                  "meaning": "Complete destruction by fire; also, the thing so destroyed.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": [
                    "a nuclear holocaust"
                  ]
                },
                {
                  "meaning": "Extensive destruction of a group of animals or (especially) people; a large-scale massacre or slaughter.",
                  "examples": [
                    "a nuclear holocaust"
                  ]
                },
                {
                  "meaning": "Alternative letter-case form of Holocaust (“the systematic mass murder (democide or genocide) of Jews (and, more broadly, of disabled people, homosexuals, Romanis, Slavs, and others) perpetrated by Nazi Germany shortly before and during World War II”); hence, the state-sponsored mass murder of a particular group of people in society. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "holocaust (third-person singular simple present holocausts, present participle holocausting, simple past and past participle holocausted) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion, also figuratively) To sacrifice (chiefly an animal) to be completely burned.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To destroy (something) completely, especially by fire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To subject (a group of people) to a holocaust (mass annihilation); to destroy en masse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}