{
  "word": "nihilism",
  "etymologies": [
    {
      "description": [
        "Probably borrowed from French nihilisme, German Nihilismus, or Late Latin nihilismus + English -ism (suffix forming the name of a school of thought, system, or theory); the French, German, and Latin words are derived from Latin nihil (“indefinite nothing”), from nihilum (“nothing”), from ne- (prefix negating the principal meaning) + hīlum (“a trifle; not in the least”). The English word is cognate with Italian nichilismo, Spanish nihilismo, Russian нигили́зм (nigilízm, “philosophical doctrine grounded on negation of one or more meaningful aspects of life; emptiness; lack of education and cultural refinement”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nihilism (countable and uncountable, plural nihilisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually uncountable) The view that all endeavours are devoid of objective meaning.",
                  "examples": [
                    "Synonym: existential nihilism"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually uncountable) The rejection of, or opposition to, religious beliefs, (inherent or objective) moral principles, legal rules, etc., often due to the view that life is meaningless (sense 1).",
                  "examples": [
                    "Synonym: moral nihilism"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually uncountable, politics) The rejection of non-proven or non-rationalized assertions in the social and political spheres of society.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, psychiatry) A delusion that oneself or the world, or parts thereof, have ceased to exist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, Russia, politics, historical) Alternative letter-case form of Nihilism (“a Russian movement of the 1860s that rejected all authority and promoted the use of violence for political change”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, philosophy) A doctrine grounded on the negation of one or more meaningful aspects of life; in particular, the view that nothing in the world actually exists.",
                  "examples": [
                    "Antonym: antinihilism"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something that is regarded as meaningless.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}