{
  "word": "ply",
  "etymologies": [
    {
      "description": [
        "From Middle English pleit, plit, plite (“a fold, pleat, wrinkle; braid, strand in a braided cord, ply”), from Anglo-Norman pli, plei, pleit, and Middle French pli, ploy, ply (“a fold, pleat; joint in armour; situation, state”) (modern French pli (“a fold, pleat”)), from plier, ployer (“to bend, fold”), from Latin plicāre, present active infinitive of plicō (“to bend, fold, roll up”), from Proto-Indo-European *pleḱ- (“to fold, plait, weave”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ply (countable and uncountable, plural ply or plies or plys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A layer of material.",
                  "examples": [
                    "two-ply toilet paper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strand that, twisted together with other strands, makes up rope or yarn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Short for plywood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(artificial intelligence, combinatorial game theory) In two-player sequential games, a \"half-turn\" or a move made by one of the players.",
                  "examples": [
                    "He proposed to build Deep Purple, a super-computer capable of 24-ply look-ahead for chess."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly Scotland) A condition, a state.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English plīen, pli, plie (“to bend, fold, mould, shape; to be flexible; to be submissive, humble oneself; to compel someone to submit”), from Anglo-Norman plier, plaier, pleier, ploier, and Middle French plier, ployer (“to bend, fold; to be submissive; to compel someone to submit”) (modern French plier, ployer), from Old French ploiier, pleier (“to fold”), from Latin plicāre (“to fold”); see further at etymology 1. The word is cognate with Catalan plegar (“to bend, fold”), Italian piegare (“to bend, fold, fold up”), Old Occitan plegar, plejar, pleyar (“to fold”) (modern Occitan plegar), Spanish plegar (“to fold”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "ply (third-person singular simple present plies, present participle plying, simple past and past participle plied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To bend; to fold; to mould; (figuratively) to adapt, to modify; to change (a person's) mind, to cause (a person) to submit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bend, to flex; to be bent by something, to give way or yield (to a force, etc.).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From apply; compare Middle English plīen, pli, plie, pleie (“to place (something) around, on, or over, to cover; to apply, use; to strive”), short for aplīen, applīen (“to combine, join; to attach; to assemble; to use, be of use; to allot; to apply; to inflict; to go; to ply, steer; to comply, submit”), from Old French applier, aplier, aploier (“to bend; to apply”), from Latin applicāre, present active infinitive of applicō (“to apply; to attach, join; to add”), from ad- (“prefix meaning ‘to, towards’”) + plicō (“to bend, fold, roll up”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ply",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bent; a direction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ply (third-person singular simple present plies, present participle plying, simple past and past participle plied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work at (something) diligently.",
                  "examples": [
                    "He plied his trade as carpenter for forty-three years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wield or use (a tool, a weapon, etc.) steadily or vigorously.",
                  "examples": [
                    "He plied his ax with bloody results."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To press upon; to urge persistently.",
                  "examples": [
                    "to ply someone with questions or solicitations"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To persist in offering something to, especially for the purpose of inducement or persuasion.",
                  "examples": [
                    "to ply someone with drink"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, transport) To travel over (a route) regularly.",
                  "examples": [
                    "to ply the seven seas",
                    "The steamer plies between several ports on the coast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To work diligently.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical, obsolete) To manoeuvre a sailing vessel so that the direction of the wind changes from one side of the vessel to the other; to work to windward, to beat, to tack.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}