{
  "word": "after",
  "etymologies": [
    {
      "description": [
        "From Middle English after, from Old English æfter, from Proto-West Germanic *aftar, from Proto-Germanic *after, *aftiri, from Proto-Indo-European *h₂epotero- (“further behind, further away”), from *h₂epo (“off, away”).",
        "Cognate with Scots efter (“after”), North Frisian efter (“after, behind”), West Frisian after, achter, efter (“behind; after”), Low German/Dutch achter (“behind”), German after- (“after-”), Swedish/Norwegian/Danish efter (“after”), Norwegian etter (“after”), Icelandic eftir (“after”), aftur (“back, again”).",
        "The Irish usage to indicate recent completion of an activity is a calque of the Irish collocation Táim tar éis... (“I have just...”, literally “I am after...”)."
      ],
      "adjectives": [
        {
          "description": "after",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Later; second (of two); next, following, subsequent",
                  "examples": [
                    "I did verily believe in my own mind, that I couldn't fight in that way at all; but my after experience convinced me that this was all a notion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, where the frame of reference is within the ship) At or towards the stern of a ship.",
                  "examples": [
                    "The after gun is mounted aft.",
                    "The after gun is abaft the forward gun."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "after (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Behind; later in time; following.",
                  "examples": [
                    "I left the room, and the dog bounded after.",
                    "They lived happily ever after.",
                    "I might come next month, or the month after."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [
        {
          "description": "after",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Subsequently to; following in time; later than.",
                  "examples": [
                    "We had a few beers after the game.",
                    "The time is quarter after eight.",
                    "The Cold War began shortly after WWII.",
                    "After you with the salt/paper.",
                    "I told her to shut the door after her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Behind.",
                  "examples": [
                    "He will leave a trail of destruction after him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In pursuit of, seeking.",
                  "examples": [
                    "He's after a job; run after him; inquire after her health."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In allusion to, in imitation of; following or referencing.",
                  "examples": [
                    "We named him after his grandfather; a painting after Leonardo da Vinci."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Next in importance or rank.",
                  "examples": [
                    "The princess is next in line to the throne after the prince."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "As a result of.",
                  "examples": [
                    "After your bad behaviour, you will be punished."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In spite of.",
                  "examples": [
                    "After all that has happened, he is still my friend.",
                    "I can't believe that, after all our advice against gambling, you walked into that casino!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, usually preceded by a form of be, followed by an -ing form of a verb) Used to indicate recent completion of an activity",
                  "examples": [
                    "I was after finishing my dinner when there was a knock on the door."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) According to an author or text.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Denoting the aim or object; concerning; in relation to.",
                  "examples": [
                    "to look after workmen; to enquire after a friend; to thirst after righteousness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) According to the direction and influence of; in proportion to; befitting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}