{
  "word": "blanket",
  "etymologies": [
    {
      "description": [
        "From Middle English blanket, blonket, blaunket, from Old Northern French blanket, blancet (“white horse\", also \"white woollen cloth or flannel; a type of jacket”, literally “that which is white”) (whence Modern French blanchet), diminutive of blanc (“white”), of Germanic origin, likely a calque of Old English hwītel (“cloak, mantle”), from Old English hwīt (“white”) + -el (diminutive suffix). Compare also Old English blanca (“white horse”), Old Norse hvítill (“a white bed-cover, sheet”).",
        "More at blank. Compare also blunket, plunket. Displaced native Middle English whytel, from Old English hwītel (whence Modern English whittle (“blanket, cloak, shawl”))."
      ],
      "adjectives": [
        {
          "description": "blanket (not comparable) (only attributive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "General; covering or encompassing everything.",
                  "examples": [
                    "Synonyms: all-encompassing, exhaustive; see also Thesaurus:comprehensive"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "blanket (plural blankets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heavy, loosely woven fabric, usually large and woollen, used for warmth while sleeping or resting.",
                  "examples": [
                    "The baby was cold, so his mother put a blanket over him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A layer of anything.",
                  "examples": [
                    "The city woke under a thick blanket of fog."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thick rubber mat used in the offset printing process to transfer ink from the plate to the paper being printed.",
                  "examples": [
                    "A press operator must carefully wash the blanket whenever changing a plate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A streak or layer of blubber in whales.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blanket (third-person singular simple present blankets, present participle blanketing, simple past and past participle blanketed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with, or as if with, a blanket.",
                  "examples": [
                    "A fresh layer of snow blanketed the area."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To traverse or complete thoroughly.",
                  "examples": [
                    "The salesman blanketed the entire neighborhood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To toss in a blanket by way of punishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take the wind out of the sails of (another vessel) by sailing to windward of it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To nullify the impact of (someone or something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a radio signal: to override or block out another radio signal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}