{
  "word": "king",
  "etymologies": [
    {
      "description": [
        "From Middle English king, kyng, from Old English cyng, cyning (“king”), from Proto-West Germanic *kuning, from Proto-Germanic *kuningaz, *kunungaz (“king”), equivalent to kin +‎ -ing. Doublet of cyning.",
        "Cognate with Scots keeng (“king”), North Frisian köning (“king”), West Frisian kening (“king”), Dutch koning (“king”), Low German Koning, Köning (“king”), German König (“king”), Danish konge (“king”), Norwegian konge, Swedish konung, kung (“king”), Icelandic konungur, kóngur (“king”), Polish ksiądz (“priest”), Russian князь (knjazʹ, “prince”), Old Church Slavonic кънѧѕь (kŭnędzĭ), Romanian chinez, Finnish kuningas (“king”), Estonian kuningas, Ingrian kunigas, Karelian kuninkas, Livvi kuńingas, Ludian kuńingas, Veps kuningaz, Võro kuning and Votic kunikaz. Eclipsed non-native Middle English roy (“king”) (Early Modern English roy), borrowed from Old French roi, rei, rai (“king”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "king (plural kings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male monarch; a man who heads a monarchy. If it is an absolute monarchy, then he is the supreme ruler of his nation.",
                  "examples": [
                    "Henry VIII was the king of England from 1509 to 1547."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A powerful or majorly influential person.",
                  "examples": [
                    "Howard Stern styled himself as the \"king of all media\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable or uncountable) Something that has a preeminent position.",
                  "examples": [
                    "In times of financial panic, cash is king."
                  ]
                }
              ]
            },
            {
              "group": "A component of certain games.",
              "entries": [
                {
                  "meaning": "(chess) The principal chess piece, that players seek to threaten with unavoidable capture to result in a victory by checkmate. It is often the tallest piece, with a symbolic crown with a cross at the top.",
                  "examples": []
                },
                {
                  "meaning": "(card games) A playing card with the letter \"K\" and the image of a king on it, the thirteenth card in a given suit.",
                  "examples": []
                },
                {
                  "meaning": "A checker (a piece of checkers/draughts) that reached the farthest row forward, thus becoming crowned (either by turning it upside-down, or by stacking another checker on it) and gaining more freedom of movement.",
                  "examples": []
                },
                {
                  "meaning": "The central pin or skittle in bowling games.",
                  "examples": [
                    "In knockemdowns and bowls ten pins are used, the centre one being called the king, and the ball has to be grounded before it reaches the frame."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang) A king skin.",
                  "examples": [
                    "Oi mate, have you got kings?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male dragonfly; a drake.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A king-sized bed.",
                  "examples": [
                    "Try asking for a king-size bed next time because kings are usually firmer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The monarch with the most power and authority in a monarchy, regardless of sex.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A vertex in a directed graph which can reach every other vertex via a path with a length of at most 2.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "king (third-person singular simple present kings, present participle kinging, simple past and past participle kinged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To crown king, to make (a person) king.",
                  "examples": [
                    "The kinging of Macbeth is the business of the first part of the play  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To rule over as king.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perform the duties of a king.",
                  "examples": [
                    "He had to do all his kinging after supper, which left him no time for roystering with the nobility and certain others."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To assume or pretend preeminence (over); to lord it over.",
                  "examples": [
                    "The seating arrangement of the temple was the Almanach de Gotha of Congregation Emanu-el. Old Ben Reitman, patriarch among the Jewish settlers of Winnebago, who had come over an immigrant youth, and who now owned hundreds of rich farm acres, besides houses, mills and banks, kinged it from the front seat of the center section."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To promote a piece of draughts/checkers that has traversed the board to the opposite side, that piece subsequently being permitted to move backwards as well as forwards.",
                  "examples": [
                    "If the machine does this, it will lose only one point, and as it is not looking far enough ahead, it cannot see that it has not prevented its opponent from kinging but only postponed the evil day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dress and perform as a drag king.",
                  "examples": [
                    "Through the ex-centric diaspora, kinging in postcolonial Australia has become a site of critical hybridity where diasporic female masculinities have emerged through the contestations of \"home\" and \"host\" cultures."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "king (plural kings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of qing (“Chinese musical instrument”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}