{
  "word": "firmament",
  "etymologies": [
    {
      "description": [
        "From Middle English firmament, furmament (“heaven; sky”), from Old French firmament (“firmament”), or from its etymon Latin firmāmentum (“support; sky”), from\nfirmāre (“to strengthen”) + -mentum (suffix indicating an instrument or medium, or the result of an action). Firmāre is the present active infinitive of firmō (“to make firm, strengthen”), from firmus (“firm, strong, stable”), ultimately from Proto-Indo-European *dʰer- (“to hold; to support”).",
        "The Latin word was used in the Vulgate version of the Bible to translate the\nAncient Greek στερέωμα (steréōma, “foundation, framework; firmament”) in the Septuagint (Greek Old Testament), which in turn was used to translate the Hebrew רָקִיעַ‎ (rāqī́aʿ, “celestial dome, vault of heaven”), from the root ר־ק־ע‎ (r-q-`); in Classical Syriac the similar root ܪ-ܩ-ܥ‎ (r-q-ʿ) (related to compacting) gave rise to ܪܩܝܥܐ‎ (rəqīʿā, “compact; firm; firmament, heavens, sky; celestial sphere”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "firmament (countable and uncountable, plural firmaments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually uncountable, literary, poetic, also figuratively) The vault of the heavens, where the clouds, sun, moon, and stars can be seen; the heavens, the sky.",
                  "examples": [
                    "Synonyms: (Britain, dialectal) lift, (poetic, archaic) welkin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The field or sphere of an activity or interest.",
                  "examples": [
                    "the international fashion firmament"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, astronomy, historical) In the geocentric Ptolemaic system, the eighth celestial sphere which carried the fixed stars; (countable, by extension) any celestial sphere.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete except biblical) The abode of God and the angels; heaven.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) A piece of jewellery worn in a headdress with numerous gems resembling stars in the sky.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete, also figuratively) A basis or foundation; a support.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) The act or process of making firm or strengthening.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}