{
  "word": "property",
  "etymologies": [
    {
      "description": [
        "From Middle English propertee, properte, propirte, proprete, borrowed from Anglo-Norman and Old French propreté, proprieté (“propriety, fitness, property”), from Latin proprietas (“a peculiarity, one's peculiar nature or quality, right or fact of possession, property”), from proprius (“special, particular, one's own”). Equivalent to proper +‎ -ty. Doublet of propriety."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "property (countable and uncountable, plural properties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is owned.",
                  "examples": [
                    "Leave those books alone! They are my property.",
                    "Important types of property include real property (land), personal property (other physical possessions), and intellectual property (rights over artistic creations, inventions, etc.)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of real estate, such as a parcel of land.",
                  "examples": [
                    "There is a large house on the property.",
                    "Synonyms: land, parcel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) Real estate; the business of selling houses.",
                  "examples": [
                    "He works in property as a housing consultant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The exclusive right of possessing, enjoying and disposing of a thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attribute or abstract quality associated with an individual, object or concept.",
                  "examples": [
                    "Charm is his most endearing property."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attribute or abstract quality which is characteristic of a class of objects.",
                  "examples": [
                    "Matter can have many properties, including color, mass and density."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An editable or read-only parameter associated with an application, component or class.",
                  "examples": [
                    "You need to set the debugging property to \"verbose\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural, theater) A prop, an object used in a dramatic production.",
                  "examples": [
                    "Costumes and scenery are distinguished from property properly speaking.",
                    "Synonym: prop"
                  ]
                }
              ]
            },
            {
              "group": "(US) A script, book, screenplay, or the like that is on the market or has been bought for commercial production as a stage play, movie, or the like.",
              "entries": [
                {
                  "meaning": "(US, by extension, rare) A produced stage play, movie, or the like.",
                  "examples": [
                    "Is the property in which you are playing currently on Broadway – is it a musical?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Propriety; correctness.",
                  "examples": [
                    "it is well knowne that I have the property to keepe counsaile"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "property (third-person singular simple present properties, present participle propertying, simple past and past participle propertied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To invest with properties, or qualities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To make a property of; to appropriate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}