{
  "word": "calabash",
  "etymologies": [
    {
      "description": [
        "From French calebasse, from Spanish calabaza (“gourd; pumpkin”), possibly from Arabic قَرْعَةٌ يَابِسَةٌ‎ (qarʕatun yābisatun, “dry gourd”) or directly from its etymon Persian خربزه‎ (xarboze, “melon”), possibly ultimately from Sanskrit त्रपुस (trapusa, “colocynth fruit”) (compare Persian تربزه‎ (tarboze, “watermelon”)). The English word is cognate with Catalan carabassa (“pumpkin; orange colour”), Galician cabaza (“gourd, pumpkin, squash; calabash (container)”), Occitan calebasso, carabasso, carbasso, Portuguese cabaça (“gourd; calabash (container)”), Sicilian caravazza (and caramazza)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "calabash (plural calabashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tree (known as the calabash tree; Crescentia cujete) native to Central and South America, the West Indies, and southern Florida, bearing large, round fruit used to make containers (sense 3); the fruit of this tree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bottle gourd (calabash vine, Lagenaria siceraria), believed to have originated in Africa, which is grown for its fruit that are used as a vegetable and to make containers (sense 3); the fruit of this plant.",
                  "examples": [
                    "Synonyms: (India) dudhi, (India) lauki"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A container made from the mature, dried shell of the fruit of one of the above plants; also, a similarly shaped container made from some other material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A calabash and its contents; as much as fills such a container.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical instrument, most commonly a drum or rattle, made from a calabash fruit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}