{
  "word": "merit",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English merit, merite (“quality of person’s character or conduct deserving of reward or punishment; such reward or punishment; excellence, worthiness; benefit; right to be rewarded for spiritual service; retribution at doomsday; virtue through which Jesus Christ brings about salvation; virtue possessed by a holy person; power of a pagan deity”), from Anglo-Norman merit, merite, Old French merite (“moral worth, reward; merit”) (modern French mérite), from Latin meritum (“that which one deserves, deserts; benefit, reward, merit; service; kindness; importance, value, worth; blame, demerit, fault; grounds, reason”), neuter of meritus (“deserved, earned, obtained; due, proper, right; deserving, meritorious”), perfect passive participle of mereō (“to deserve, earn, obtain, merit; to earn a living”), from Proto-Indo-European *(s)mer- (“to allot, assign”). The English word is probably cognate with Ancient Greek μέρος (méros, “component, part; portion, share; destiny, fate, lot”) and cognate with Old Occitan merit.",
        "The verb is derived from Middle French meriter, Old French meriter (“to deserve, merit”) (modern French mériter), from merite: see further above. The word is cognate with Italian meritare (“to deserve, merit; to be worth; to earn”), Latin meritāre (“to earn regularly; to serve as a soldier”), Spanish meritar (“to deserve, merit; to earn”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "merit (countable and uncountable, plural merits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A claim to commendation or a reward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A mark or token of approbation or to recognize excellence.",
                  "examples": [
                    "Antonym: demerit",
                    "For her good performance in the examination, her teacher gave her ten merits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Something deserving or worthy of positive recognition or reward.",
                  "examples": [
                    "Synonyms: excellence, value, worth",
                    "Antonym: demerit",
                    "His reward for his merit was a check for $50."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, Buddhism, Jainism) The sum of all the good deeds that a person does which determines the quality of the person's next state of existence and contributes to the person's growth towards enlightenment.",
                  "examples": [
                    "to acquire or make merit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, law) Usually in the plural form the merits: the substantive rightness or wrongness of a legal argument, a lawsuit, etc., as opposed to technical matters such as the admissibility of evidence or points of legal procedure; (by extension) the overall good or bad quality, or rightness or wrongness, of some other thing.",
                  "examples": [
                    "Even though the plaintiff was ordered by the judge to pay some costs for not having followed the correct procedure, she won the case on the merits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) The quality or state of deserving retribution, whether reward or punishment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "merit (third-person singular simple present merits, present participle meriting, simple past and past participle merited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deserve, to earn.",
                  "examples": [
                    "Her performance merited wild applause."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be deserving or worthy.",
                  "examples": [
                    "They were punished as they merited."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, rare) To reward.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}