{
  "word": "academy",
  "etymologies": [
    {
      "description": [
        "From French académie, from Latin acadēmīa, from Ancient Greek Ἀκαδημία (Akadēmía), a grove of trees and gymnasium outside of Athens where Plato taught; from the name of the supposed former owner of that estate, the Attic hero Akademos. Doublet of academia and Akademeia; compare academe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "academy (plural academies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(classical studies, usually capitalized) The garden where Plato taught. [First attested around 1350 to 1470.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(classical studies, usually capitalized) Plato's philosophical system based on skepticism; Plato's followers. [First attested in the mid 16th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An institution for the study of higher learning; a college or a university; typically a private school. [First attested in the mid 16th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A school or place of training in which some special art is taught. [First attested in the late 16th century.]",
                  "examples": [
                    "the military academy at West Point; a riding academy; the Academy of Music.; a music academy; a language academy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A society of learned people united for the advancement of the arts and sciences, and literature, or some particular art or science. [First attested in the early 17th century.]",
                  "examples": [
                    "the French Academy; the American Academy of Arts and Sciences; academies of literature and philology."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The knowledge disseminated in an Academy. [Attested from the early 17th century until the mid 18th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with the, without reference to any specific academy) Academia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A body of established opinion in a particular field, regarded as authoritative.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, education) A school directly funded by central government, independent of local control.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}