{
  "word": "compensate",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin compensatus, past participle of compensare (“to weight together one thing against another, balance, make good, later also shorten, spare”), from com- (“together”) + pensare (“to weight”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "compensate (third-person singular simple present compensates, present participle compensating, simple past and past participle compensated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To do (something good) after (something bad) happens",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pay or reward someone in exchange for work done or some other consideration.",
                  "examples": [
                    "It is hard work, but they will compensate you well for it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make up for; to do something in place of something else; to correct, satisfy; to reach an agreement such that the scales are literally or (metaphorically) balanced; to equalize or make even.",
                  "examples": [
                    "His loud voice cannot compensate for a lack of personality.",
                    "To compensate me for his tree landing on my shed, my neighbor paved my driveway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To adjust or adapt to a change, often a harm or deprivation.",
                  "examples": [
                    "I don't like driving that old car because it always steers a little to the left so I'm forever compensating for that when I drive it. Trust me, it gets annoying real fast.",
                    "To compensate for his broken leg, Gary uses crutches."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}