{
  "word": "crush",
  "etymologies": [
    {
      "description": [
        "From Middle English cruschen (“to crush, smash, squeeze, squash”), from Old French croissir (“to crush”), from Late Latin *crusciō (“to brush”), from Frankish *krostjan (“to crush, squeeze, squash”) , from Proto-Germanic *kreustaną (“to crush, grind, strike, smash”).",
        "Akin to Gothic 𐌺𐍂𐌹𐌿𐍃𐍄𐌰𐌽 (kriustan, “to gnash”), Old Swedish krusa (“to crush”), Middle Low German krossen (“to break”), Swedish krysta (“to squeeze”), Danish kryste (“to squash”), Icelandic kreista (“to squeeze, squash”), Faroese kroysta (“to squeeze”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crush (countable and uncountable, plural crushes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A violent collision or compression; a crash; destruction; ruin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Violent pressure, as of a moving crowd.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A violent crowding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A crowd that produces uncomfortable pressure.",
                  "examples": [
                    "a crush at a reception"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A group or gang.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A crowd control barrier.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drink made by squeezing the juice out of fruit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(informal) An infatuation with somebody one is not dating.",
              "entries": [
                {
                  "meaning": "(informal, by extension) The human object of such infatuation or affection.",
                  "examples": [
                    "It had taken nine years from the evening that Truman first showed up with a pie plate at her mother's door, but his dogged perseverance eventually won him the hand of his boyhood Sunday school crush."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A standing stock or cage with movable sides used to restrain livestock for safe handling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A party or festive function.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) The process of crushing cane to remove the raw sugar, or the season when this process takes place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, uncountable) The situation where certain colors are so similar as to be hard to distinguish, either as a deliberate effect or as a limitation of a display.",
                  "examples": [
                    "black crush; white crush"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, sexuality) A paraphilia involving arousal from seeing things destroyed by crushing.",
                  "examples": [
                    "Just as they say that marijuana leads to harder drugs, Gallegly is claiming that crush is a \"gateway fetish\"—a term I've never heard before. He claims that if someone starts with bugs they'll end up escalating to human babies in no time."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crush (third-person singular simple present crushes, present participle crushing, simple past and past participle crushed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To press between two hard objects; to squeeze so as to alter the natural shape or integrity, or to force together into a mass.",
                  "examples": [
                    "to crush grapes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reduce to fine particles by pounding or grinding.",
                  "examples": [
                    "Synonym: comminute",
                    "to crush quartz"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To overwhelm by pressure or weight.",
                  "examples": [
                    "After the corruption scandal, the opposition crushed the ruling party in the elections"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, colloquial) To do impressively well at (sports events; performances; interviews; etc.).",
                  "examples": [
                    "They had a gig recently at Madison Square—totally crushed it!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To oppress or grievously burden.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To overcome completely; to subdue totally.",
                  "examples": [
                    "The sultan's black guard crushed every resistance bloodily."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be or become broken down or in, or pressed into a smaller volume or area, by external weight or force.",
                  "examples": [
                    "an eggshell crushes easily"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To feel infatuation or unrequited love.",
                  "examples": [
                    "She's crushing on him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, television) To give a compressed or foreshortened appearance to.",
                  "examples": [
                    "He frames his subject in distant close-ups (we feel the distance, due mostly to the crushed perspective brought about by the telephoto lens)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, television) To make certain colors so similar as to be hard to distinguish, either as a deliberate effect or as a limitation of a display.",
                  "examples": [
                    "My old TV set crushes the blacks when the brightness is lowered."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}