{
  "word": "episteme",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek ἐπιστήμη (epistḗmē, “knowledge”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "episteme (plural epistemes or epistemai)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) Scientific knowledge; a principled system of understanding; sometimes contrasted with empiricism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically Ancient Greek philosophy) know-how; compare techne.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically Foucaultian philosophy) The fundamental body of ideas and collective presuppositions that defines the nature and sets the bounds of what is accepted as true knowledge in a given epistemic epoch.",
                  "examples": [
                    "{1} An 'episteme' is the “underground” grid or network which allows thought to organize itself. Each historical period has its own episteme. It limits the totality of experience, knowledge and truth, and governs each science in one period.",
                    "{2} Classical representation no longer needs a subject like royalty. It can only be made visible by its invisibility — by appearing in the mirror of representation. The true subject is never to be found in the table — or painting — as a historical subject of life, labour and language. The classical episteme did not isolate a specific domain proper to man.Axiom: In the classical episteme the subject is bound to escape its own representation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}