{
  "word": "fifth",
  "etymologies": [
    {
      "description": [
        "From Middle English fifthe, fifte, fift, from Old English fīfta (“fifth”), from Proto-Germanic *fimftô (“fifth”) or *femftô, equivalent to five +‎ -th. Cognate with Scots fift, fyft (“fifth”), North Frisian fyfde (“fifth”), West Frisian fyfde (“fifth”), Dutch vijfde (“fifth”), Low German fifte, föfte, füfte (“fifth”), German fünfte (“fifth”), Danish femte (“fifth”), Swedish femte (“fifth”), Icelandic fimmta (“fifth”)."
      ],
      "adjectives": [
        {
          "description": "fifth (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ordinal form of the number five.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "fifth (plural fifths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The person or thing in the fifth position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of five equal parts of a whole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fifth gear of an engine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quantity of liquor equal to one-fifth of a gallon, or, more commonly, 750 milliliters (that is, three quarters of a liter).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The musical interval between one note and another seven semitones higher (the fifth note in the major/minor scale)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fifth voice in a polyphonic melody.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fifth (third-person singular simple present fifths, present participle fifthing, simple past and past participle fifthed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To sing in the fifth voice in a polyphonic melody.",
                  "examples": [
                    "Another extension of strict organum is 'fifthing'. Fifthing is a note-against- note method of creating a two-part texture by improvising a second voice over the given tune, starting and ending each musical phrase at the octave and proceeding mainly in fifths above the tune at others times."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To support something fifth, after four others have already done so.",
                  "examples": [
                    "Though seconding (or fifthing) the praise for “BoJack Horseman” and “In Treatment,” I think I’ll use the majority of my space to discuss “You’re the Worst.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nonstandard) To divide by five.",
                  "examples": [
                    "3/5 has been through fifthing. 2/3 has been through thirding. Therefore, 3/5 now needs thirding and 2/3 needs fifthing"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}