{
  "word": "drub",
  "etymologies": [
    {
      "description": [
        "From Middle English *drob, drof, from Old English *drōb, drōf (“turbid; dreggy; dirty”), from Proto-Germanic *drōbuz (“turbid”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drub (usually uncountable, plural drubs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal, Northern England) Carbonaceous shale; small coal; slate, dross, or rubbish in coal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "1625, of uncertain origin. Perhaps from Arabic ضَرَبَ‎ (ḍaraba, “to beat, to hit”) , or perhaps originally from a dialectal word (Kent) drab, variant of drop, dryp, drib (“to beat”), from Middle English drepen (preterit drop, drap, drape (“struck, killed”)) from Old English drepan (“to strike”), from Proto-Germanic *drepaną (“to beat, bump, strike, slay”), from Proto-Indo-European *dʰreb⁽ʰ⁾- (“to strike, crush, kill”). Linguist Guus Kroonen suggests that it reflects the Proto-Germanic iterative *drubbōną as found in Norwegian drubba (“to fall over”). Akin to Old Frisian drop (“a blow, beat”), Old High German treffan (“to hit”), Old Norse drepa (“to strike, slay, kill”). Compare also dub. More at drape."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "drub (third-person singular simple present drubs, present participle drubbing, simple past and past participle drubbed) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To beat (someone or something) with a stick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To defeat someone soundly; to annihilate or crush.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To forcefully teach something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To criticize harshly; to excoriate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}