{
  "word": "dragon",
  "etymologies": [
    {
      "description": [
        "From Middle English dragoun, borrowed from Old French dragon, from Latin dracō, dracōnem, from Ancient Greek δράκων (drákōn, “a serpent of huge size, a python, a dragon”), probably from δέρκομαι (dérkomai, “I see clearly”). Doublet of Draco, dragoon, and drake."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dragon (plural dragons)",
          "definitionGroups": [
            {
              "group": "A legendary serpentine or reptilian creature.",
              "entries": [
                {
                  "meaning": "In Western mythology, a gigantic beast, typically reptilian with leathery bat-like wings, lion-like claws, scaly skin and a serpent-like body, often a monster with fiery breath.",
                  "examples": [
                    "But as every well-brought-up prince was expected to kill a dragon, and rescue a princess, the dragons grew fewer and fewer till it was often quite hard for a princess to find a dragon to be rescued from."
                  ]
                },
                {
                  "meaning": "In Eastern mythology, a large, snake-like monster with the eyes of a hare, the horns of a stag and the claws of a tiger, usually beneficent.",
                  "examples": [
                    "These tapestries were magnificently figured with golden dragons; and as the serpentine bodies gleamed and shimmered in the increasing radiance, each dragon, I thought, intertwined its glittering coils more closely with those of another."
                  ]
                }
              ]
            },
            {
              "group": "An animal of various species that resemble a dragon in appearance:",
              "entries": [
                {
                  "meaning": "(obsolete) A very large snake; a python.",
                  "examples": []
                },
                {
                  "meaning": "Any of various agamid lizards of the genera Draco, Physignathus or Pogona.",
                  "examples": []
                },
                {
                  "meaning": "A Komodo dragon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy, with definite article, often capitalized) The constellation Draco.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A fierce and unpleasant woman; a harridan.",
                  "examples": [
                    "She’s a bit of a dragon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with definite article, often capitalized) The (historical) Chinese empire or the People's Republic of China.",
                  "examples": [
                    "Napoleon already warned of the awakening of the Dragon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something very formidable or dangerous.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of playing-tile (red dragon, green dragon, white dragon) in the game of mahjong.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A luminous exhalation from marshy ground, seeming to move through the air like a winged serpent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) A short musket hooked to a swivel attached to a soldier's belt; so called from a representation of a dragon's head at the muzzle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, rare) A background process similar to a daemon.",
                  "examples": [
                    "Daemons and Dragons. The print spooler is an example of a DAEMON, a program that executes in the background and provides a service  […]  Strictly speaking, a dragon is a daemon that is not invoked explicitly but is always there, waiting in the background  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A variety of carrier pigeon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Derived from drag queen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dragon (plural dragons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A transvestite man, or more broadly a male-to-female transgender person.",
                  "examples": [
                    "Ballard felt her phone vibrate in her hand and turned away from the nurse. She saw a return text from Mendez. She read his answer out loud to Jenkins. “‘Ramona Ramone, dragon. Real name Ramón Gutierrez. Had him in here a couple weeks back. Priors longer than his pre-op dick.’ Nice way of putting it.” “Considering his own dimensions,” Jenkins said. Drag queens, cross-dressers, and transgenders were all generally referred to as dragons in vice. No distinctions were made. It wasn’t nice but it was accepted."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}