{
  "word": "thought",
  "etymologies": [
    {
      "description": [
        "From Middle English thought, ithoȝt, from Old English þōht, ġeþōht, from Proto-West Germanic *þą̄ht, from Proto-Germanic *þanhtaz, *gaþanhtą (“thought”), from Proto-Indo-European *teng- (“to think”). Cognate with Scots thocht (“thought”), Saterland Frisian Toacht (“thought”), West Frisian dacht (“attention, regard, thought”), Dutch gedachte (“thought”), German Andacht (“reverence, devotion, prayer”), Icelandic þóttur (“thought”). Related to thank."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thought (countable and uncountable, plural thoughts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable)  Representation created in the mind without the use of one's faculties of vision, sound, smell, touch, or taste; an instance of thinking.",
                  "examples": [
                    "The greatest weapon against stress is our ability to choose one thought over another."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The operation by which mental activity arise or are manipulated; the process of thinking; the agency by which thinking is accomplished.",
                  "examples": [
                    "Without freedom of thought there can be no such thing as wisdom, and no such thing as public liberty without freedom of speech."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A way of thinking (associated with a group, nation or region).",
                  "examples": [
                    "Traditional eastern thought differs markedly from that of the west."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, now dialectal) Anxiety, distress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The careful consideration of multiple factors; deliberation.",
                  "examples": [
                    "Synonyms: see Thesaurus:consideration",
                    "After much thought, I have decided to stay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very small amount, distance, etc.; a whit or jot.",
                  "examples": [
                    "'Bide the night at Heriotside,' says he. 'It's a thought out of your way, but it's a comfortable bit.'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "thought",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense and past participle of think",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}