{
  "word": "servitude",
  "etymologies": [
    {
      "description": [
        "From Middle French servitude, from Latin servitūdō, from Latin servus (“slave”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "servitude (countable and uncountable, plural servitudes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being a slave; slavery; being forced to work for others or do their bidding without one's consent or against one's will, either in perpetuity or for a period of time over which one has little or no control.",
                  "examples": [
                    "In spite of the importance of this route it remained until a few years ago very insecure. Overhung almost its entire length by the inaccessible fastnesses of Lololand, the passing caravans dared journey only with convoy, and even then were frequently overwhelmed by raiders from the hills, who carried off both trader and goods into the mountains, the former to lifelong servitude."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A qualified beneficial interest severed or fragmented from the ownership of an inferior property and attached to a superior property or to some person other than the owner; the most common form is an easement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Service rendered in the army or navy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Servants collectively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The act of serving (food or drink, etc.); service.",
                  "examples": [
                    "The usual routine of confections and pastry follows, after which a galore of fruits of all kinds, with a chassè of excellent Mocha, the immediate servitude of which, after good dining, is, I think, universally acknowledged to be a great exhiliration[sic]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}