{
  "word": "nudge",
  "etymologies": [
    {
      "description": [
        "Circa 17th century, perhaps of North Germanic origin, related to Norwegian nugge, nyggje (“to push, rub, shove”),  Icelandic nugga (“to rub, massage”), from the root of Proto-Germanic *hnōjaną (“to smooth, join together”), from Proto-Indo-European *kneh₂- (compare Ancient Greek κνάω (knáō, “to scratch, scrape”), source of English acnestis).",
        "Compare also Scots nodge (“to push, poke, nudge”), knidge (“to push, squeeze”), gnidge (“to rub, press, squeeze, bruise”), and knudge (“to squeeze, press down with the knuckles”), Middle Low German nucke, nücke, gnücke (“a sudden push, shock, impetus”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nudge (plural nudges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gentle push.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A feature of instant messaging software used to get the attention of another user, as by shaking the conversation window or playing a sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The rotation by one step of a fruit machine reel of the player's choice.",
                  "examples": [
                    "Since the machine was showing two lemons and a cherry, I decided to try a nudge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(behavioral economics) The use of positive reinforcement and indirect suggestions as ways to influence.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nudge (third-person singular simple present nudges, present participle nudging, simple past and past participle nudged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To push against gently, especially in order to gain attention or give a signal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To near or come close to something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move slightly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}