{
  "word": "contend",
  "etymologies": [
    {
      "description": [
        "From Middle English contenden, borrowed from Old French contendre, from Latin contendere (“to stretch out, extend, strive after, contend”), from com- (“together”) + tendere (“to stretch”); see tend, and compare attend, extend, intend, subtend."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "contend (third-person singular simple present contends, present participle contending, simple past and past participle contended)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be in opposition; to contest; to dispute; to vie; to quarrel; to fight.",
                  "examples": [
                    "the armies of Syria and Lebanon lack the capability to contend with the Israeli army, as demonstrated during the course of the First Lebanon War."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To struggle or exert oneself to obtain or retain possession of, or to defend.",
                  "examples": [
                    "You sit above, and see vain men below / Contend for what you only can bestow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be in debate; to engage in discussion; to dispute; to argue.",
                  "examples": [
                    "many of those things he so fiercely contended about , were either falle or trivial"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To believe (something is reasonable) and argue (for it); to advocate.",
                  "examples": [
                    "In this paper the author contends that no useful results can be obtained if this method is used."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "contend with: To try to cope with a difficulty or problem.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}