{
  "word": "kite",
  "etymologies": [
    {
      "description": [
        "The noun is from Middle English kyte, kīte, kete (“a kite endemic to Europe, especially the red kite (Milvus milvus)”), from Old English cȳta (“kite; bittern”), from Proto-West Germanic *kūtijō, diminutive of Proto-Germanic *kūts (“bird of prey”), from Proto-Indo-European *gū- (“to cry, screech”). The English word is cognate with Scots kyt, kyte (“kite; bird of prey”), Middle High German kiuzelīn, kützlīn (“owling”) (modern German Kauz (“owl”)). Possibly a doublet of coot.",
        "Sense 3 (“lightweight toy”) is from the fact that it hovers in the air like the bird.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kite (plural kites)",
          "definitionGroups": [
            {
              "group": "A bird of prey of the family Accipitridae.",
              "entries": [
                {
                  "meaning": "Any bird of the subfamily Milvinae, with long wings and weak legs, feeding mostly on carrion and spending long periods soaring; specifically, the red kite (Milvus milvus) and the black kite (Milvus migrans).",
                  "examples": [
                    "Synonym: glede"
                  ]
                },
                {
                  "meaning": "A bird of the genus Elanus, having thin pointed wings, that preys on rodents and hunts by hovering; also, any bird of related genera in the subfamily Elaninae.",
                  "examples": []
                },
                {
                  "meaning": "Some species in the subfamily Perninae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A rapacious person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lightweight toy or other device, traditionally flat and shaped like a triangle with a segment of a circle attached to its base or like a quadrilateral (see sense 9), carried on the wind and tethered and controlled from the ground by one or more lines.",
                  "examples": [
                    "On windy spring days, we would fly kites."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tethered object which deflects its position in a medium by obtaining lift and drag in reaction with its relative motion in the medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) A planetary configuration wherein one planet of a grand trine is in opposition to an additional fourth planet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(banking, slang) A blank cheque; a fraudulent cheque, such as one issued even though there are insufficient funds to honour it, or one that has been altered without authorization.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, slang) An accommodation bill (“a bill of exchange endorsed by a reputable third party acting as a guarantor, as a favour and without compensation”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling, slang) A rider who is good at climbs but less good at descents.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A polygon resembling the shape of a traditional toy kite (sense 3): a quadrilateral having two pairs of edges of equal length, the edges of each pair touching each other at one end.",
                  "examples": [
                    "Four-sided figures without parallel sides include trapezoids and kites."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military aviation, slang) An aeroplane or aircraft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sailing, dated) In a square-rigged ship: originally a sail positioned above a topsail; later a lightweight sail set above the topgallants, such as a studding sail or a jib topsail.",
                  "examples": [
                    "This is the first attested use of the word in this sense."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sailing, slang) A spinnaker (“supplementary sail to a mainsail”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialectal) The brill (Scophthalmus rhombus), a type of flatfish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, prison slang) A (usually concealed) letter or oral message, especially one passed illegally into, within, or out of a prison.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "kite (third-person singular simple present kites, present participle kiting, simple past and past participle kited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (something) to move upwards rapidly like a toy kite; also (chiefly US, figuratively) to cause (something, such as costs) to increase rapidly.",
                  "examples": [
                    "Rising interest rates have kited the cost of housing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To tamper with a document or record by increasing the quantity of something beyond its proper amount so that the difference may be unlawfully retained; in particular, to alter a medical prescription for this purpose by increasing the number of pills or other items.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, video games) To keep ahead of (an enemy) in order to attack repeatedly from a distance, without exposing oneself to danger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To (cause to) glide in the manner of a kite (“bird”).",
                  "examples": [
                    "Synonym: soar",
                    "The wind kited us toward shore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, rare) To manipulate like a toy kite; also, usually preceded by an inflection of go: to fly a toy kite.",
                  "examples": [
                    "Want to go kite with me this weekend?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, banking, slang) To write or present (a cheque) on an account with insufficient funds, either to defraud or expecting that funds will become available by the time the cheque clears.",
                  "examples": [
                    "He was convicted of kiting checks and sentenced to two years in prison."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, US, slang, by extension) To steal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel by kite, as when kitesurfing.",
                  "examples": [
                    "We spent the afternoon kiting around the bay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To move rapidly; to rush.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, engineering, nautical) To deflect sideways in the water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, prison slang) To pass a (usually concealed) letter or oral message, especially illegally into, within, or out of a prison.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; possibly:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kite (plural kites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England, Scotland, dialectal) The stomach; the belly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Coptic ⲕⲓⲧⲉ (kite), from Demotic qt, from Egyptian qdt."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kite (plural kite)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Egyptology) A measure of weight equivalent to 1⁄10 deben (about 0.32 ounces or 9.1 grams).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}