{
  "word": "cootie",
  "etymologies": [
    {
      "description": [
        "Probably from Malay kutu (“flea, louse”) (and/or Tagalog/Maori). First attested in English in 1917 as British army slang during World War I."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cootie (plural cooties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, British Army military slang) A louse (Pediculus humanus).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, colloquial) A louse (Pediculus humanus).",
                  "examples": [
                    "\"Tell Rilla I'm glad her war-baby is turning out so well, and tell Susan that I'm fighting a good fight against both Huns and cooties.\"",
                    "\"Mrs. Dr. dear,\" whispered Susan solemnly, \"what are cooties?\"",
                    "Mrs. Blythe whispered back and then said in reply to Susan's horrified ejaculations, \"It's always like that in the trenches, Susan.\"",
                    "Susan shook her head and went away in grim silence to re-open a parcel she had sewed up for Jem and slip in a fine tooth comb."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, Australia, colloquial, childish, usually in the plural) Any germ or contaminant, real or imagined, especially from the opposite gender (for pre-pubescent children).",
                  "examples": [
                    "I’m not drinking from his glass until I wash the cooties off it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A nest-building female American coot (counterpart to cooter).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, slang) A sideswiper, a type of telegraph key.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}