{
  "word": "magistery",
  "etymologies": [
    {
      "description": [
        "From Middle English magisteri, magistery (“academic degree of Master”), from Latin magisterium (“office of a chief, director, president, or superintendent; teaching office or authority of the Roman Catholic Church; authoritative statement”) (compare Late Latin magisterium (“philosopher’s stone”)), from magister (“master (title for a person in authority or one having a licence from a university to teach liberal arts and philosophy); teacher”) (ultimately from Proto-Indo-European *méǵh₂s (“big, great”) + *-teros (contrastive or oppositional suffix forming adjectives)) + -ium (suffix forming abstract nouns, sometimes denoting groups and offices). Doublet of magisterium."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "magistery (countable and uncountable, plural magisteries)",
          "definitionGroups": [
            {
              "group": "(chiefly historical)",
              "entries": [
                {
                  "meaning": "(countable, alchemy, also figuratively)",
                  "examples": []
                },
                {
                  "meaning": "A pure quality with the power to cure or to turn one substance into another; also, a substance such as a philosopher's stone able to turn one substance into another.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) The product of such a transformation.",
                  "examples": []
                },
                {
                  "meaning": "(countable, chemistry)",
                  "examples": [
                    "magistery of bismuth (BiONO₃·H₂O)"
                  ]
                },
                {
                  "meaning": "A fine substance deposited by precipitation, formerly applied to certain white precipitates from metallic solutions.",
                  "examples": [
                    "magistery of bismuth (BiONO₃·H₂O)"
                  ]
                },
                {
                  "meaning": "(obsolete) A concentrated extract of a substance.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "(countable) An art or a skill.",
                  "examples": []
                },
                {
                  "meaning": "(countable) Synonym of magistracy (“the dignity or office of a magistrate; the collective body of magistrates”)",
                  "examples": []
                },
                {
                  "meaning": "(countable, pharmacology, veterinary medicine) A medicine prepared for a specific use.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) The quality possessed by a master; authority, mastership, mastery; also, the exercise of authority.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, Roman Catholicism) Synonym of magisterium (“the teaching authority or office of the Roman Catholic Church”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}