{
  "word": "prank",
  "etymologies": [
    {
      "description": [
        "Origin uncertain. Perhaps from Middle English pranken (“to adorn, arrange one's attire”), probably from Middle Dutch pronken, proncken (“to flaunt, make a show, arrange one's attire”), related to German prangen (“to make a show, be resplendent”), Dutch prangen (“to squeeze, press”), Danish pragt (“pomp, splendor”), all from Proto-Germanic *pranganą, *prangijaną, *prag- (“to press, squeeze, thring”), from Proto-Indo-European *brAngh- (“to press, squeeze”).  Or, perhaps ultimately related to Proto-Germanic *brahtaz, similar to Dutch pracht (“splendor”), Swedish prakt (“glory, pomp”) (loaned from Low German).",
        "Cognate with Middle Low German prunken (“to flaunt”), German prunken (“to flaunt”), Danish prunke (“to make a show, prank”).  Sense of \"mischievous act\" from earlier verbal sense of \"to be crafty or subtle, set in order, adjust\". See also prink, prance, prong."
      ],
      "adjectives": [
        {
          "description": "prank",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Full of gambols or tricks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "prank (plural pranks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A practical joke or mischievous trick.",
                  "examples": [
                    "He pulled a gruesome prank on his sister."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An evil deed; a malicious trick, an act of cruel deception.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "prank (third-person singular simple present pranks, present participle pranking, simple past pranked, past participle pranked or (archaic) prankt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To perform a practical joke on; to trick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To call someone's phone and promptly hang up",
                  "examples": [
                    "Hey man, prank me when you wanna get picked up.",
                    "I don't have your number in my phone; can you prank me?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To adorn in a showy manner; to dress or equip ostentatiously.",
                  "examples": [
                    "And there a Seaſon atween June and May,",
                    "Half prankt with Spring, with Summer half imbrown'd,",
                    "A liſtleſs Climate made, where, Sooth to ſay,",
                    "No living Wight could work, ne cared even for Play."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make an ostentatious show.",
                  "examples": [
                    "White houses prank where once were huts."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}