{
  "word": "doughnut",
  "etymologies": [
    {
      "description": [
        "From dough +‎ nut, 1809 because originally small, nut-sized balls of fried dough, or, more likely, from nut in the earlier sense of \"small rounded cake or cookie\", with the toroidal shape becoming common in the twentieth century. First attested in Knickerbocker’s History of New York, by Washington Irving, 1809."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "doughnut (plural doughnuts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deep-fried piece of dough or batter, commonly of a toroidal (a ring doughnut) shape, often mixed with various sweeteners and flavourings; or flattened sphere (a filled doughnut) shape filled with jam, custard or cream.",
                  "examples": [
                    "The soldiers, drawn up in hollow square—how apt is this word hollow, when applied to men who have fasted, in view of promised doughnuts!—received the procession, which consisted of music, then the ladies, then the doughnuts."
                  ]
                }
              ]
            },
            {
              "group": "Anything in the shape of a torus.",
              "entries": [
                {
                  "meaning": "(attributive) A circular life raft.",
                  "examples": [
                    "He put on the life jacket and began paddling around. A doughnut life raft popped up out of the ocean in front of him."
                  ]
                },
                {
                  "meaning": "(physics) A toroidal vacuum chamber.",
                  "examples": [
                    "In about 1951, the same company sealed into their vacuum doughnuts the regenerative peelers so that X-ray beams or electron beams could be obtained with the sealed off commercial tubes used in  […]"
                  ]
                },
                {
                  "meaning": "(Canada, US) A peel-out or skid mark in the shape of a circle; a 360-degree skid.",
                  "examples": []
                },
                {
                  "meaning": "A spare car tyre, usually stored in the boot, that is smaller than a full-sized tyre and is only intended for temporary use.",
                  "examples": []
                },
                {
                  "meaning": "A kind of tyre for an airplane.",
                  "examples": [
                    "The advantage of the doughnuts was that they spread the weight of the aeroplane over a much larger area of ground, causing less damage to grass, and making them less prone to bogging down in wet conditions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A vulva; (by extension) a woman's virginity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, colloquial) A foolish or stupid person.",
                  "examples": [
                    "You fucking doughnut, of course you don't microwave a salad!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}