{
  "word": "ermine",
  "etymologies": [
    {
      "description": [
        "From Middle English ermine, ermin, ermyn, from Old French ermin, ermine, hermine.",
        "There are two main theories for the origin of Old French ermine. Germanic origin is suggested via Old Dutch *harmino (“stoat skin”), from *harmo (“stoat, weasel”) (compare Dutch hermelijn and dialectal herm), from Proto-Germanic *harmǭ, *harmô (compare Old English hearma, Old High German harmo (harmin (adjective), obsolete German Harm), from Proto-Indo-European *ḱormō (compare Romansch carmun, obsolete Lithuanian šarmuõ). Romance sources identify the animal with the corresponding word for Armenian, possibly from Medieval Latin mūs Armenius (“Armenian mouse”) or a posterior compound."
      ],
      "adjectives": [
        {
          "description": "ermine (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) In blazon, of the colour ermine (white with black spots).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "ermine (countable and uncountable, plural ermines or ermine)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A weasel found in northern latitudes (Mustela erminea in Eurasia, Alaska, and the Arctic, Mustela haidarum in Haida Gwaii, Mustela richardsonii in the rest of North America); its dark brown fur turns white in winter, apart from the black tip of the tail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The white fur of this animal, traditionally seen as a symbol of purity and used for judges' robes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, figuratively) The office of a judge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A white field with black spots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various moths, especially in the family Yponomeutidae",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ermine (third-person singular simple present ermines, present participle ermining, simple past and past participle ermined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To clothe with ermine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}