{
  "word": "martyr",
  "etymologies": [
    {
      "description": [
        "From Middle English martir, from Old English martyr, itself a borrowing from Ecclesiastical Latin martyr, from Ancient Greek μάρτυρ (mártur), later form of μάρτυς (mártus, “witness”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "martyr (plural martyrs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who willingly accepts being put to death for adhering openly to one's religious beliefs; notably, saints canonized after martyrdom.",
                  "examples": [
                    "Saint Stephen was the first Christian martyr."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) One who sacrifices their life, station, or something of great personal value, for the sake of principle or to sustain a cause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with a prepositional phrase of cause) One who suffers greatly and/or constantly, even involuntarily.",
                  "examples": [
                    "Stan is a martyr to arthritis, Chris a martyr to Stan's endless moaning about it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "martyr (third-person singular simple present martyrs, present participle martyring, simple past and past participle martyred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make someone into a martyr by putting them to death for adhering to, or acting in accordance with, some belief, especially religious; to sacrifice on account of faith or profession.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To persecute.",
                  "examples": [
                    "Some religious and other minorities were martyred until extinction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To torment; to torture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}