{
  "word": "young",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English yong, yonge, from Old English ġeong, from Proto-West Germanic *jung, from Proto-Germanic *jungaz, from Proto-Indo-European *h₂yuh₁n̥ḱós, from *h₂yuh₁en- (“young”)."
      ],
      "adjectives": [
        {
          "description": "young (comparative younger, superlative youngest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the early part of growth or life; born not long ago.",
                  "examples": [
                    "Bliss was it in that dawn to be alive,But to be young was very heaven!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "At an early stage of existence or development; having recently come into existence.",
                  "examples": [
                    "the age of space travel is still young;   a young business"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Not) advanced in age; (far towards or) at a specified stage of existence or age.",
                  "examples": [
                    "And thou, our Mother, twice two centuries young,",
                    "Bend with bright shafts of truth thy bow fresh-strung."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Junior (of two related people with the same name).",
                  "examples": [
                    "The young Mr. Chester must be in the wrong, and the old Mr. Chester must be in the right."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a decade of life) Early.",
                  "examples": [
                    "[…]  Miss Hessy is as pretty a girl as eye can see, in her young twenties and a bit of a fortune to boot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Youthful; having the look or qualities of a young person.",
                  "examples": [
                    "My grandmother is a very active woman and is quite young for her age."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or belonging to the early part of life.",
                  "examples": [
                    "The cynical world soon shattered my young dreams."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Having little experience; inexperienced; unpracticed; ignorant; weak.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "young (plural young)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often as if a plural noun) Offspring, especially the immature offspring of animals.",
                  "examples": [
                    "There is a logic in this behavior: a mother will not come into breeding condition again unless her young is ready to be weaned or has died, so killing a baby may hasten  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "young (third-person singular simple present youngs, present participle younging, simple past and past participle younged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal or demography) To become or seem to become younger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal or demography) To cause to appear younger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) To exhibit younging.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}