{
  "word": "life",
  "etymologies": [
    {
      "description": [
        "From Middle English lyf, from Old English līf, from Proto-West Germanic *līb, from Proto-Germanic *lībą (“life, body”), from *lībaną (“to remain, stay, be left”), from Proto-Indo-European *leyp- (“to stick, glue”).",
        "Cognate with Scots life, leif (“life”), North Frisian liff (“life, limb, person, livelihood”), West Frisian liif (“belly, abdomen”), Dutch lijf (“body”), Low German lif (“body; life, life-force; waist”), German Leib (“body; womb”) and Leben (“life”), Danish, Norwegian and Swedish liv (“life; waist”), Icelandic líf (“life”). Related to belive."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "life (usually uncountable, plural lives)",
          "definitionGroups": [
            {
              "group": "(uncountable) The state of organisms preceding their death, characterized by biological processes such as metabolism and reproduction and distinguishing them from inanimate objects; the state of being alive and living.",
              "entries": [
                {
                  "meaning": "(biology) The status possessed by any of a number of entities, including animals, plants, fungi, bacteria, and sometimes viruses, which have the properties of replication and metabolism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The animating principle or force that keeps an inorganic thing or concept metaphorically alive (dynamic, relevant, etc) and makes it a \"living document\", \"living constitution\", etc.",
                  "examples": [
                    "The life of the law has not been logic; it has been experience."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lifeforms, generally or collectively.",
                  "examples": [
                    "It's life, but not as we know it.   She discovered plant life on the planet.   The rover discovered signs of life on the alien world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A living individual; the fact of a particular individual being alive. (Chiefly when indicating individuals were lost (died) or saved.)",
                  "examples": [
                    "Many lives were lost during the war.   Her quick thinking saved many dogs' lives."
                  ]
                }
              ]
            },
            {
              "group": "Existence.",
              "entries": [
                {
                  "meaning": "A worthwhile existence.",
                  "examples": [
                    "He gets up early in the morning, works all day long — even on weekends — and hardly sees his family. That's no life!  His life was ruined by drugs."
                  ]
                },
                {
                  "meaning": "A particular aspect of existence.",
                  "examples": [
                    "He struggled to balance his family life, social life and work life.   sex life, political life"
                  ]
                },
                {
                  "meaning": "(informal) Social life.",
                  "examples": [
                    "Get a life."
                  ]
                },
                {
                  "meaning": "Something which is inherently part of a person's existence, such as job, family, a loved one, etc.",
                  "examples": [
                    "She's my love, my life.   Running the bakery is her life."
                  ]
                }
              ]
            },
            {
              "group": "A period of time during which something has existence.",
              "entries": [
                {
                  "meaning": "The period during which one (a person, an animal, a plant; a civilization, species; a star; etc) is alive.",
                  "examples": [
                    "“My Continental prominence is improving,” I commented dryly.Von Lindowe cut at a furze bush with his silver-mounted rattan.“Quite so,” he said as dryly, his hand at his mustache. “I may say if your intentions were known your life would not be worth a curse.”"
                  ]
                },
                {
                  "meaning": "The span of time during which an object operates.",
                  "examples": [
                    "This light bulb is designed to have a life of 2,000 hours."
                  ]
                },
                {
                  "meaning": "The period of time during which an object is recognizable.",
                  "examples": [
                    "The life of this milk carton may be thousands of years in this landfill."
                  ]
                },
                {
                  "meaning": "A particular phase or period of existence.",
                  "examples": []
                },
                {
                  "meaning": "A period extending from a when a (positive or negative) office, punishment, etc is conferred on someone until that person dies (or, sometimes, reaches retirement age).",
                  "examples": []
                },
                {
                  "meaning": "(colloquial) A life sentence; a period of imprisonment that lasts until the convict's death (or, sometimes, parole).",
                  "examples": []
                }
              ]
            },
            {
              "group": "Animation; spirit; vivacity.",
              "entries": [
                {
                  "meaning": "The most lively component or participant.",
                  "examples": [
                    "\"Don't I know that it is you who is the life of this house. Two delightful children!\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A biography.",
                  "examples": [
                    "His life of the founder is finished, except for the title."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Nature, reality, and the forms that exist in it.",
                  "examples": []
                }
              ]
            },
            {
              "group": "An opportunity for existence.",
              "entries": [
                {
                  "meaning": "(video games) One of the player's chances to play, lost when the player's character dies or when certain mistakes are made.",
                  "examples": [
                    "Scoring 1000 points is rewarded with an extra life."
                  ]
                },
                {
                  "meaning": "(baseball, softball, cricket) A chance for the batter (or batting team) to bat again, given as a result of an misplay by a member of the fielding team. [from 1860s–1930s or later]",
                  "examples": [
                    "Borda sent a hot liner to G. Kugler, who made a nifty pick-up, but threw wild at first, giving the batter a life."
                  ]
                },
                {
                  "meaning": "One of a player's chances to play in various children's playground games, lost when a mistake is made, for example being struck by the ball in dodgeball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, insurance) The life insurance industry.",
                  "examples": [
                    "I work in life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A life assured under a life assurance policy (equivalent to the policy itself for a single life contract).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "life (third-person singular simple present lifes, present participle lifing, simple past and past participle lifed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) To replace components whose operational lifetime has expired.",
                  "examples": [
                    "Now, the aim of the design is to extract more cycles from the component under study, at each new engine generation requirements are driving a reduction in the margin for the error, as parts cannot stand any drop in properties. Thus, the lifing procedures are refined by means of new models or additional specific testing for limiting features to increase the life of the components;  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}