{
  "word": "manhood",
  "etymologies": [
    {
      "description": [
        "From Middle English manhode, also manhede (> English manhead), equivalent to man +‎ -hood. Cognate with Middle Low German manheit (“manhood”), German Mannheit (“manhood”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "manhood (countable and uncountable, plural manhoods)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or condition of being a human being.",
                  "examples": [
                    "Synonym: humanity",
                    "He feared the speedy decline of all manhood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or condition of being a man.",
                  "examples": [
                    "Feel awfully about Scott... It was a terrible thing for him to love youth so much that he jumped straight from youth to senility without going through manhood. The minute he felt youth going he was frightened again and thought there was nothing between youth and age."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "All of the men of a given place, area, or any human subgroup (ethnicity, nation, race, religion, family, work crew or ship's crew, etc.) regarded collectively.",
                  "examples": [
                    "Synonym: mankind (exclusively and universally: only synonymous in cases for which women are excluded, and when the meaning of manhood is universal or worldwide)",
                    "Antonyms: womanhood, womankind",
                    "During the Second World War, Russia lost a great percentage of its young manhood, giving rise to a great wave of widowhood in the country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The idealized nature of a man: all of the characteristics traditionally and ideally ascribed to manliness regarded collectively.",
                  "examples": [
                    "Synonyms: manfulness, manliness, mannishness",
                    "Antonyms: womanhood, womanishness, womanliness",
                    "My goodness, James certainly is a prime example of manhood, isn't he?",
                    "Traditionally, men sought to enhance the manhood of their young sons, so that they would become manly men, but in general, men no longer do so."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The self-concept of a man being with respect to his possession of the various qualities traditionally and ideally ascribed to manliness; a man's sense or view of himself as being more or less manly.",
                  "examples": [
                    "Antonym: womanhood",
                    "The failure of William's business seems to have been quite damaging to his manhood.",
                    "I feel that when you boss me around, you insult my manhood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) The male genitalia, especially the penis.",
                  "examples": [
                    "Hypernym: (slang) junk",
                    "Antonym: womanhood",
                    "She spied on him in the shower and glimpsed his manhood."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}