{
  "word": "clinical",
  "etymologies": [
    {
      "description": [
        "clinic +‎ -al"
      ],
      "adjectives": [
        {
          "description": "clinical (comparative more clinical, superlative most clinical)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Dealing with the practical management of patients, in practice at the point of care; as contrasted with other health care venues (see clinical medicine for more explanation).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to a clinic, such as a medical clinic or law clinic.",
                  "examples": [
                    "Medicine is now more often practiced in a clinical setting than in the home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cool and emotionless; in a professional way, as contrasted with an impetuous or unprofessional way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Objective; analytical.",
                  "examples": [
                    "We took a clinical approach to resolving conflicts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Precise.",
                  "examples": [
                    "Remarkably United’s 10 men almost salvaged an improbable draw during a late, spirited challenge. They showed great competitive courage in that period and there were chances for Robin van Persie, Ángel Di María and Marouane Fellaini to punish City for defending too deeply and not being more clinical with their opportunities at the other end."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Of or relating to a bed, especially a deathbed.",
                  "examples": [
                    "a clinical convert: one who turns to religion on their death-bed",
                    "clinical baptism"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "clinical (plural clinicals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) A medical student's session spent in a real-world nursing environment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}