{
  "word": "achievement",
  "etymologies": [
    {
      "description": [
        "From Middle French achevement (compare Modern French achèvement), from Old French achevement, from the verb achever, achiever (“to finish”); equivalent to achieve +‎ -ment. The heraldic sense may be influenced by hatchment."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "achievement (countable and uncountable, plural achievements)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of achieving or performing; a successful performance; accomplishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A great or heroic deed or feat; something accomplished by valor or boldness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) An escutcheon or ensign armorial; a full display or depiction of all the heraldic components to which the bearer of a coat of arms is entitled; (now especially) a funeral shield: the hatchment.",
                  "examples": [
                    "The narrow Gothic windows were filled, not with glass that admitted the light, but with glass painted with the achievements of the family  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) An award for completing a particular task or meeting an objective in a video game.",
                  "examples": [
                    "Finishing the game does not give you a 100% score until you have unlocked all of the achievements.",
                    "Synonym: trophy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, semantics) The lexical aspect (aktionsart) of verbs or predicates that change in an instant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology) The successful completion of a socially defined goal or task, highlighting individual or group accomplishment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}