{
  "word": "annoy",
  "etymologies": [
    {
      "description": [
        "From Middle English anoyen, a borrowing from Anglo-Norman anuier, Old French enuier (“to molest, harm, tire”), from Late Latin inodiō (“cause aversion, make hateful”, verb), from the phrase in odiō (“hated”), from Latin odium (“hatred”). Doublet of ennui. Displaced native Old English dreċċan and gremman."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "annoy (plural annoys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary, archaic) A feeling of discomfort or vexation caused by what one dislikes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary, archaic) That which causes such a feeling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "annoy (third-person singular simple present annoys, present participle annoying, simple past and past participle annoyed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disturb or irritate, especially by continued or repeated acts; to bother with unpleasant deeds.",
                  "examples": [
                    "Yet let me flap this bug with gilded wings, / This painted child of dirt that stinks and stings; / Whose buzz the witty and the fair annoys, / Yet wit ne'er tastes, and beauty ne'r enjoys."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To do something to upset or anger someone; to be troublesome.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To molest; to harm; to injure.",
                  "examples": [
                    "to annoy an army by impeding its march, or by a cannonade"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}