{
  "word": "alpha",
  "etymologies": [
    {
      "description": [
        "From the Ancient Greek ἄλφα (álpha), the first letter of the Greek alphabet, from the Phoenician 𐤀‎ (ʾ, “aleph”). Doublet of alif."
      ],
      "adjectives": [
        {
          "description": "alpha (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Designates the first in an order of precedence.",
                  "examples": [
                    "I am the alpha male."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of person, object or action) Exhibiting characteristics of the alpha male/female archetype.",
                  "examples": [
                    "And thank you. Seriously. I'll call you later.You better. I'm feeling pretty alpha now.Yes, you are."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) Designates some bright star, usually the brightest star, of a constellation.",
                  "examples": [
                    "When interstellar travel becomes feasible, I plan to visit Alpha Centauri."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "alpha (countable and uncountable, plural alphas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The name of the first letter of the Greek alphabet (Α,  α), followed by beta. In the Latin alphabet it is the predecessor to A.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Latin alpha: the Latin letter Ɑ (minuscule: ɑ).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) The name of the symbols Α and α used in science and mathematics, often interchangeable with the symbols when used as a prefix.",
                  "examples": [
                    "I will attempt to make an alpha particle (\"α-particle\") with the Large Hadron Collider."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) The return of a given asset or portfolio adjusted for systematic risk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, especially a male, who is dominant, successful and attractive; (see alpha male).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, abbreviation) Short for alphabet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(software engineering) The first versions of a program, usually only available to the developer, and only tested by the developer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) Angle of attack.",
                  "examples": [
                    "Coordinate terms: beta, gamma, theta"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer graphics) The level of translucency of a color, as determined by the alpha channel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics) The significance level of a statistical test; the alpha level.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fandom slang) In omegaverse fiction, a person of a dominant secondary sex driven by biology, magic, or other means to bond with an omega, with males of this type often having canine-like genitalia.",
                  "examples": [
                    "Sometimes the alphas and omegas are rare, sometimes they are only males, sometimes they have altered sex organs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}