{
  "word": "trowel",
  "etymologies": [
    {
      "description": [
        "From Middle English trowell, trouel, truel, from Middle French truelle, from Late Latin truella, from Classical Latin trulla, the diminutive of trua (“ladle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trowel (plural trowels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mason’s tool, used in spreading and dressing mortar, and breaking bricks to shape them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gardener’s tool, shaped like a scoop, used in taking up plants, stirring soil etc.",
                  "examples": [
                    "I need to dig a hole for these begonias; would you pass me that trowel?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool used for smoothing a mold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trowel (third-person singular simple present trowels, present participle troweling or trowelling, simple past and past participle troweled or trowelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply (a substance) with a trowel.",
                  "examples": [
                    "He troweled the coarse mix with a twist, leaving a pattern of arcs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pass over with a trowel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, figurative) To apply something heavily or unsubtly.",
                  "examples": [
                    "The whole Planet of the Apes set-up has been ripe for metaphor – from slavery and Afro-American revolution to European conquest of the Americas, even the war on terror. But mercifully, there's no big subtext being troweled on here."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}