{
  "word": "projection",
  "etymologies": [
    {
      "description": [
        "From either the Middle French projection or its etymon, the Classical Latin prōiectiō (stem: prōiectiōn-), from prōiciō. Compare the Modern French projection, the German Projektion, and the Italian proiezione."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "projection (countable and uncountable, plural projections)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something which projects, protrudes, juts out, sticks out, or stands out.",
                  "examples": [
                    "The face of the cliff had many projections that were big enough for birds to nest on."
                  ]
                }
              ]
            },
            {
              "group": "The action of projecting or throwing or propelling something.",
              "entries": [
                {
                  "meaning": "(archaic) The throwing of materials into a crucible, hence the transmutation of metals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The crisis or decisive point of any process, especially a culinary process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The display of an image by devices such as movie projector, video projector, overhead projector or slide projector.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A forecast or prognosis obtained by extrapolation",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) A belief or assumption that others have similar thoughts and experiences to one's own. This includes making accusations that would more fittingly apply to the accuser.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) The image that a translucent object casts onto another object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartography) Any of several systems of intersecting lines that allow the curved surface of the earth to be represented on a flat surface. The set of mathematics used to calculate coordinate positions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) An image of an object on a surface of fewer dimensions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linear algebra) An idempotent linear transformation which maps vectors from a vector space onto a subspace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A transformation which extracts a fragment of a mathematical object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(category theory) A morphism from a categorical product to one of its (two) components.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The preservation of the properties of lexical items while generating the phrase structure of a sentence. See Projection principle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}