{
  "word": "flaw",
  "etymologies": [
    {
      "description": [
        "From Middle English flawe, flay (“a flake of fire or snow, spark, splinter”), probably from Old Norse flaga (“a flag or slab of stone, flake”), from Proto-Germanic *flagō (“a layer of soil”), from Proto-Indo-European *plāk- (“broad, flat”).",
        "Cognate with Icelandic flaga (“flake”), Swedish flaga (“flake, scale”), Danish flage (“flake”), Middle Low German vlage (“a layer of soil”), Old English flōh (“a frament, piece”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flaw (plural flaws)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A flake, fragment, or shiver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A thin cake, as of ice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A crack or breach, a gap or fissure; a defect of continuity or cohesion.",
                  "examples": [
                    "There is a flaw in that knife.",
                    "That vase has a flaw."
                  ]
                }
              ]
            },
            {
              "group": "A defect, fault, or imperfection, especially one that is hidden.",
              "entries": [
                {
                  "meaning": "(in particular) An inclusion, stain, or other defect of a diamond or other gemstone.",
                  "examples": []
                },
                {
                  "meaning": "(law) A defect or error in a contract or other document which may make the document invalid or ineffective.",
                  "examples": [
                    "a flaw in a will, in a deed, or in a statute"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flaw (third-person singular simple present flaws, present participle flawing, simple past and past participle flawed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To add a flaw to, to make imperfect or defective.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become imperfect or defective; to crack or break.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably Middle Dutch vlāghe or Middle Low German vlāge.  Or, of North Germanic origin, from Swedish flaga (“gust of wind”), from Old Norse flaga; all from Proto-Germanic *flagōn-.  See modern Dutch vlaag (“gust of wind”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flaw (plural flaws)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden burst or gust of wind of short duration; windflaw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A storm of short duration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden burst of noise and disorder",
                  "examples": [
                    "Synonyms: tumult, uproar, quarrel"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}