{
  "word": "tertiate",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin tertiāt-, the perfect passive participial stem of Latin tertiō, from tertius (“third”)."
      ],
      "adjectives": [
        {
          "description": "tertiate (comparative more tertiate, superlative most tertiate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having 2:3 proportion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having three parts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tertiate (plural tertiates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The third year of training in various Christian religious orders (especially the Jesuits).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is in their tertiate training.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The third classification of animals in some ranked taxonomic systems, such as that proposed by Linnaeus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tertiate (third-person singular simple present tertiates, present participle tertiating, simple past and past participle tertiated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reduce by one third; especially, kill one third of (a group of people).",
                  "examples": [
                    "Seven spills of paper of precisely equal length were given round, and after an interval collected. Had any of them been dimidiated, tertiated or even decimated, the proposed election was void."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To increase by half as much again; especially to increase the price in this way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, obsolete) To do or perform three times or for the third time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To divide into three parts, especially to divide into thirds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) To examine, as the thickness of the metal at the muzzle of a gun; or, in general, to examine the thickness of, as ordnance, in order to ascertain its strength.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}