{
  "word": "beard",
  "etymologies": [
    {
      "description": [
        "From Middle English berd, bard, bærd, from Old English beard, from Proto-West Germanic *bard, from Proto-Germanic *bardaz (compare West Frisian burd, Dutch baard, German Bart). Cognate further to Latin barba, Lithuanian barzda, Russian борода́ (borodá): the word may date to Proto-Indo-European as *bʰardʰeh₂, *bʰh₂erdʰeh₂. Doublet of barb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "beard (plural beards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Facial hair on the chin, cheeks, jaw and neck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cluster of small feathers at the base of the beak in some birds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The appendages to the jaw in some cetaceans, and to the mouth or jaws of some fishes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The byssus of certain shellfish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The gills of some bivalves, such as the oyster.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In insects, the hairs of the labial palpi of moths and butterflies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Long or stiff hairs on a plant; the awn.",
                  "examples": [
                    "the beard of grain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A barb or sharp point of an arrow or other instrument, projecting backward to prevent the head from being easily drawn out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The curved underside of an axehead, extending from the lower end of the cutting edge to the axehandle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That part of the underside of a horse's lower jaw which is above the chin, and bears the curb of a bridle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) That part of a type which is between the shoulder of the shank and the face.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT, slang) A fake customer or companion, especially a woman who accompanies a gay man, or a man who accompanies a lesbian, in order to give the impression that the person being accompanied is heterosexual.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "beard (third-person singular simple present beards, present participle bearding, simple past and past participle bearded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To grow hair on the chin and jaw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To boldly and bravely oppose or confront, often to the chagrin of the one being bearded.",
                  "examples": [
                    "Robin Hood is always shown as bearding the Sheriff of Nottingham."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take by the beard; to seize, pluck, or pull the beard of (a man), in anger or contempt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deprive (an oyster or similar shellfish) of the gills.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, beekeeping) Of bees, to accumulate together in a beard-like shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT, slang, transitive, intransitive) Of a gay man or woman: to accompany a gay person of the opposite sex in order to give the impression that they are heterosexual.",
                  "examples": [
                    "Lesbians and homosexual men bearding one another (i.e. providing each other with the public appearance of being heterosexual);  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}