{
  "word": "slide",
  "etymologies": [
    {
      "description": [
        "From Middle English sliden, from Old English slīdan (“to slide”), from Proto-West Germanic *slīdan, from Proto-Germanic *slīdaną (“to slide, glide”), from Proto-Indo-European *sléydʰ-e-ti, from *sleydʰ- (“slippery”). Cognate with Old High German slītan (“to slide”) (whence German schlittern), Middle Low German slīden (“to slide”), Middle Dutch slīden (“to slide”) (whence Dutch slijderen, frequentative of now obsolete slijden), Vedic Sanskrit स्रेधति (srédhati, “to err, blunder”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slide (plural slides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An item of play equipment that children can climb up and then slide down again.",
                  "examples": [
                    "The long, red slide was great fun for the kids."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A surface of ice, snow, butter, etc. on which someone can slide for amusement or as a practical joke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The falling of large amounts of rubble, earth and stones down the slope of a hill or mountain; avalanche.",
                  "examples": [
                    "The slide closed the highway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inclined plane on which heavy bodies slide by the force of gravity, especially one constructed on a mountainside for conveying logs by sliding them down.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanism consisting of a part which slides on or against a guide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of sliding; smooth, even passage or progress.",
                  "examples": [
                    "a slide on the ice"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lever that can be moved in two directions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A valve that works by sliding, such as in a trombone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) A transparent plate bearing an image to be projected to a screen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, computing) A page of a computer presentation package such as PowerPoint.",
                  "examples": [
                    "I still need to prepare some slides for my presentation tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) A flat, usually rectangular piece of glass or similar material on which a prepared sample may be viewed through a microscope Generally referred to as a microscope slide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The act of dropping down and skidding into a base",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, guitar) A hand-held device made of smooth, hard material, used in the practice of slide guitar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(traditional Irish music and dance) A lively dance from County Kerry, in 12/8 time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A small dislocation in beds of rock along a line of fissure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A grace consisting of two or more small notes moving by conjoint degrees, and leading to a principal note either above or below.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) A sound which, by a gradual change in the position of the vocal organs, passes imperceptibly into another sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A clasp or brooch for a belt, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pocket in one's pants (trousers).",
                  "examples": [
                    "with ten dollars in his slide"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(footwear) A shoe that is backless and open-toed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(speech therapy) A voluntary stutter used as a technique to control stuttering in one's speech.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar slang) A promiscuous woman, slut.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slide (third-person singular simple present slides, present participle sliding, simple past slid, past participle slid or (archaic) slidden)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ergative) To (cause to) move in continuous contact with a surface.",
                  "examples": [
                    "He slid the boat across the grass.",
                    "The safe slid slowly.",
                    "Snow slides down the side of a mountain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move on a low-friction surface.",
                  "examples": [
                    "The car slid on the ice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, baseball) To drop down and skid into a base.",
                  "examples": [
                    "Jones slid into second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lose one’s balance on a slippery surface.",
                  "examples": [
                    "Synonym: slip",
                    "He slid while going around the corner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pass or put imperceptibly; to slip.",
                  "examples": [
                    "to alter the meaning of a question by sliding in a word",
                    "Schoolchildren sometimes slide each other notes during class."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To subtly direct a facial expression at (someone).",
                  "examples": [
                    "He slid me a dirty look."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To pass inadvertently.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass along smoothly or unobservedly; to move gently onward without friction or hindrance.",
                  "examples": [
                    "A ship or boat slides through the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, finance) To decrease in amount or value.",
                  "examples": [
                    "Synonym: slip",
                    "The stock market slid yesterday after major stocks released weak quarterly results."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To smoothly pass from one note to another by bending the pitch upwards or downwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional) To ride down snowy hills upon a toboggan or similar object for recreation.",
                  "examples": [
                    "Synonyms: toboggan, sled"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To go; to move from one place or to another.",
                  "examples": [
                    "\"Gotta slide, this is my stop [on the train].\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) To kick so that the ball slides along the ground with little or no turning.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}