{
  "word": "stanch",
  "etymologies": [
    {
      "description": [
        "From Middle English stanch, a variant of staunch, staunche (“(adjective) in good condition or repair; solidly made, firm; watertight; of a person or wound: not bleeding; certain; intact; (adverb) firmly, soundly”) [and other forms]; see further at staunch."
      ],
      "adjectives": [
        {
          "description": "stanch (comparative stancher, superlative stanchest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Archaic spelling of staunch.",
                  "examples": [
                    "a stanch ship    a stanch churchman"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "stanch (comparative more stanch, superlative most stanch)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Possibly strictly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stanch, stanche [and other forms], a variant of Middle English staunchen, staunche (“to stop the flow of blood, diarrhoea, or other bodily fluids; to alleviate, ease; to appease, assuage, satisfy; to cure; to overcome; to put an end to; to repress, suppress; of a river or stream: to stop flowing; of waters, wind, or weather: to become calm, subside; to extinguish or put out (a fire)”) [and other forms], from Anglo-Norman estauncher, estaunchier, estanger, Old French estancher, estanchier (“to stop the flow of a liquid (blood, water, etc.); to make (something) watertight; to quench (thirst)”) (modern French étancher (“to stop the flow of a liquid; to make watertight; to quench (thirst); (figuratively) to assuage, quench, satiate”) [and other forms], possibly from one of the following:",
        "Sense 1.2 (“to make (a building or other structure) watertight or weatherproof”) is derived from French étancher (“to stop water from flowing, make watertight”), from Old French estanchier (verb): see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "stanch (third-person singular simple present stanches, present participle stanching, simple past and past participle stanched) (especially American spelling)",
          "definitionGroups": [
            {
              "group": "(transitive, archaic except poetic) To stop the flow of (water or some other liquid).",
              "entries": [
                {
                  "meaning": "To stop the flow of (blood); to stop (a wound) from bleeding.",
                  "examples": [
                    "A small amount of cotton can be stuffed into the nose to stanch the flow of blood if necessary."
                  ]
                },
                {
                  "meaning": "To make (a building or other structure) watertight or weatherproof.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive) To check or stop, or deter, (an action).",
              "entries": [
                {
                  "meaning": "To stop the progression of (an illness); also, to alleviate (pain); often followed by of: to relieve (someone's) pain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To extinguish or put out (a fire, anger, etc.); also, to quench or satisfy (desire, hunger, thirst, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, also reflexive) Of bleeding: to stop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, also reflexive, obsolete) Of an occurrence or other thing: to come to an end; to cease; also, of persons: to stop acting violently.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See staunch (etymology 3)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stanch (plural stanches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of staunch (“that which stanches; act of stanching”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old French estanche (“pond; tank”), from estanc (“pond”) (modern French étang (“pond; lagoon”)), from estanchier (verb): see further at etymology 2."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stanch (plural stanches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A floodgate by which water is accumulated, for floating a boat over a shallow part of a stream by its release; also, a dam or lock in a river.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}