{
  "word": "slug",
  "etymologies": [
    {
      "description": [
        "Originally referred to a slow, lazy person, from Middle English slugge (“lazy person\", also \"slowth, slothfulness”), probably of either Old English or Old Norse origin; compare Norn slug (“lazy, slothful, sluggish”), dialectal Norwegian slugg (“a large, heavy body”), sluggje (“heavy, slow person”), Danish slog (“rascal, rogue”); perhaps ultimately from Proto-Indo-European *sliǵ-ōn, from *sley- (“smooth; slick; sticky; slimy”) or otherwise from the root of Old Norse slókr (“lazy person, oaf”), whence Icelandic slókur (“laziness”). Compare also Dutch slak (“snail, slug”). Doublet of slotch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slug (plural slugs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of many terrestrial pulmonate gastropod mollusks, having no (or only a rudimentary) shell. [from early 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A slow, lazy person; a sluggard. [from early 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bullet or other projectile fired from a firearm; in modern usage, generally refers to a shotgun slug. [from 1620s]",
                  "examples": [
                    "[…]  all our Ammunition was spent. Those of us who had Money made Slugs of it; their next Shift was to take the middle Screws out of their Guns, and charge their Pieces with them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A solid block or piece of roughly shaped metal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A counterfeit coin, especially one used to steal from vending machines. [from 1880s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shot of a drink, usually alcoholic. [from 1750s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) A title, name or header, a catchline, a short phrase or title to indicate the content of a newspaper or magazine story for editing use. [from 1920s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, rare) The imperial (English) unit of mass that accelerates by 1 foot per second squared (1 ft/s²) when a force of one pound-force (lbf) is exerted on it.",
                  "examples": [
                    "Synonym: geepound"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A discrete mass of a material that moves as a unit, usually through another material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A motile pseudoplasmodium formed by amoebae working together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) An accessory to a diesel-electric locomotive, used to increase adhesive weight and allow full power to be applied at a lower speed. It has trucks with traction motors, but lacks a prime mover, being powered by electricity from the mother locomotive, and may or may not have a control cab.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television editing) A black screen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(letterpress typography) A piece of type metal imprinted by a linotype machine; also a black mark placed in the margin to indicate an error; also said in application to typewriters; type slug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional) A stranger picked up as a passenger to enable legal use of high occupancy vehicle lanes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, District of Columbia) A hitchhiking commuter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(web design) The last part of a clean URL, the displayed resource name, similar to a filename.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A hindrance, an obstruction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ship that sails slowly.",
                  "examples": [
                    "His rendezvous for his fleet, and for all sluggs to come to, should be between Calais and Dover."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slug (third-person singular simple present slugs, present participle slugging, simple past and past participle slugged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To drink quickly; to gulp; to down.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take part in casual carpooling; to form ad hoc, informal carpools for commuting, essentially a variation of ride-share commuting and hitchhiking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a bullet) To become reduced in diameter, or changed in shape, by passing from a larger to a smaller part of the bore of the barrel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To move slowly or sluggishly; to lie idle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To load with a slug or slugs.",
                  "examples": [
                    "to slug a gun"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make sluggish.",
                  "examples": [
                    "So little do we fear , you slug you"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Perhaps somehow from Proto-Germanic *slagiz (“a blow, strike”). If so, then ultimately cognate with German Schlag (“blow, hit”) and Dutch slag (“blow, strike”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slug (plural slugs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hard blow, usually with the fist. [from 1830s]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slug (third-person singular simple present slugs, present participle slugging, simple past and past participle slugged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit very hard, usually with the fist.",
                  "examples": [
                    "He insulted my mother, so I slugged him.",
                    "The fighter slugged his opponent into unconsciousness."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}