{
  "word": "spiff",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spiff (countable and uncountable, plural spiffs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Attractiveness or charm in dress, appearance, or manner.",
                  "examples": [
                    "Without a diploma, he relies on spiff alone to climb the corporate ladder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, archaic, slang) A well-dressed man; a swell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, commerce, slang) A bonus or other remuneration, given for reaching a sales goal or promoting the goods of a particular manufacturer. Originally from textile retailing, a percentage given for selling off surplus or out-of-fashion stock, of which the sales person could offer part as a discount to a customer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, colloquial, Jamaica) Alternative form of spliff (“hand-rolled marijuana cigarette”)",
                  "examples": [
                    "She rolled a spiff for us as she spoke, sifting the ganja between her fingers  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spiff (third-person singular simple present spiffs, present participle spiffing, simple past and past participle spiffed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) (usually with up or out) To make spiffy (attractive, polished, or up-to-date)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, commerce, slang) To reward (a salesperson) with a spiff or bonus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, commerce, slang) To attach a spiff or bonus to the selling of (a product)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To throw; to heave.",
                  "examples": [
                    "I spiffed the turf over the edge and it went straight through the window and hit the officer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}