{
  "word": "starch",
  "etymologies": [
    {
      "description": [
        "From Middle English starche, sterche, from Old English *stierċe (“stiffness, rigidity, strength”), from Proto-West Germanic *starkī (“stiffness, rigidity, fortitude, strength”), ultimately from Proto-Indo-European *sterg- (“stiff, rigid”). Cognate with dialectal Dutch sterk (“strong”), Middle Low German sterke (“strength”), German Stärke (“strength\", also \"starch”), Swedish stärkelse (“starch”), Icelandic sterkja (“starch”). Related to English stark (“stiff, strong, vigorous, powerful”)."
      ],
      "adjectives": [
        {
          "description": "starch (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Stiff; precise; rigid.",
                  "examples": [
                    "misrepresenting Sobriety as a Starch and Formal, and Vertue as a Laborious and Slavish thing"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "starch (countable and uncountable, plural starches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A widely diffused vegetable substance, found especially in seeds, bulbs and tubers, as extracted (e.g. from potatoes, corn, rice, etc.) in the form of a white, glistening, granular or powdery substance, without taste or smell, and giving a very peculiar creaking sound when rubbed between the fingers. It is used as a food, in the production of commercial grape sugar, for stiffening linen in laundries, in making paste, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nutrition, countable) Carbohydrates, as with grain and potato based foods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A stiff, formal manner; formality.",
                  "examples": [
                    "this Professor is to give the society their stiffening, and infuse into their manners that beautiful political starch, which may qualify them for Levées, Conferences, Visits"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Fortitude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any of various starch-like substances used as a laundry stiffener",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "starch (third-person singular simple present starches, present participle starching, simple past and past participle starched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To apply or treat with laundry starch, to create a hard, smooth surface.",
                  "examples": [
                    "She starched her blouses."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}