{
  "word": "sardine",
  "etymologies": [
    {
      "description": [
        "Borrowed from French sardine (compare Spanish sardina, Italian sardina), Latin sardina; from Ancient Greek σαρδίνη (sardínē)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sardine (plural sardines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any one of several species of small herring which are commonly preserved in olive oil or in tins for food, especially the pilchard, or European sardine Sardina pilchardus (syn. Clupea pilchardus). The California sardine Sardinops sagax (syn. Clupea sagax) is similar. The American sardines of the Atlantic coast are mostly the young of the Atlantic herring and of the menhaden.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) carnelian",
                  "examples": [
                    "And he that sat was to look upon like a jasper and a sardine stone: and there was a rainbow round about the throne, in sight like unto an emerald."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Someone packed or crammed into a small space.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sardine (third-person singular simple present sardines, present participle sardining, simple past and past participle sardined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to fish for sardines",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to pack or cram together tightly.",
                  "examples": [
                    "Would it be unbearably elitist to suggest that they would be more enjoyable still if the director removed a row or two of chairs, instead of sardining as many listeners as possible into the intimate music room?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}