{
  "word": "swatch",
  "etymologies": [
    {
      "description": [
        "From earlier Northern England dialectal swache (“the counterfoil or counterstock of a tally”) (1512); further etymology unknown. Cognate with Scots swach, swatch. Compare English swath, swathe. Compare also Old English swæcc (“taste; flavour; odour; fragrance”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swatch (plural swatches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece, pattern, or sample, generally of cloth or a similar material.",
                  "examples": [
                    "He held a swatch of the wallpaper up to see if the colors would match the room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A selection of such samples bound together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A clump or portion of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A demonstration, an example, a proof.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England, obsolete) A tag or other small object attached to another item as a means of identifying its owner; a tally; specifically the counterfoil of a tally.",
                  "examples": [
                    "ITEM that the said Clerkis of the Brevements entre all the Taillis of the Furniunturs in the Jornall Booke in the Countynghous every day furthwith after the Brede be delyveret to the Pantre and then the Stoke [i.e., main part] of the Taill to by delyveret to the Baker and the Swache to the Pantler. [...] ITEM that the said Clerkis of the Brevements entre all the Taills of the Brasyantors in the Jornall Booke in the Countynghous at every tyme furthwith after the Bere be delyveret into the Buttry and then the Stoke of the Taill to be delyveret to the Brewar and the Swatche to the Butler."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swatch (third-person singular simple present swatches, present participle swatching, simple past and past participle swatched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To create a swatch, especially a sample of knitted fabric.",
                  "examples": [
                    "Swatching is important in knitting to obtain the correct gauge."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unknown; originally used chiefly in the East of England."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swatch (plural swatches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A channel or passage of water between sandbanks, or between a sandbank and a seashore.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}