{
  "word": "bicycle",
  "etymologies": [
    {
      "description": [
        "Borrowed from French bicycle (modern bicyclette), from bi- (“bi-”) + cycle (“cycle”). First attested in English in 1868, and in French in 1847.",
        "(promiscuous woman): From double meaning of ride (\"to transport oneself upon\" vs. \"to mount someone to have sex with them\"). A communal bicycle would have many riders."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bicycle (plural bicycles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vehicle that has two wheels, one behind the other, a steering handle, and a saddle seat or seats and is usually propelled by the action of a rider’s feet upon pedals.",
                  "examples": [
                    "Synonyms: (clipping) bike, pushbike, (historical) velocipede; see also Thesaurus:bicycle",
                    "Hypernym: cycle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A traveling block used on a cable in skidding logs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The best possible hand in lowball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Australia, New Zealand) A motorbike.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar slang, usually in compounds specifying a context) A slut; a promiscuous woman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) A stabilizing technique in which one foot is pushed down while the other is pulled up.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bicycle (third-person singular simple present bicycles, present participle bicycling, simple past and past participle bicycled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To travel or exercise using a bicycle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, historical, transitive) To physically ship (a recorded programme) to another broadcasting entity.",
                  "examples": [
                    "“Bicycling” defeated the possibility of topicality, a prime production habit of the network-trained production executives staffing the new entity."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}