{
  "word": "promote",
  "etymologies": [
    {
      "description": [
        "From Latin prōmōtus, perfect passive participle of prōmoveō (“move forward, advance”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "promote (third-person singular simple present promotes, present participle promoting, simple past and past participle promoted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise (someone) to a more important, responsible, or remunerative job or rank.",
                  "examples": [
                    "He promoted his clerk to office manager."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To advocate or urge on behalf of (something or someone); to attempt to popularize or sell by means of advertising or publicity.",
                  "examples": [
                    "They promoted the abolition of daylight saving time.",
                    "They promoted the new film with giant billboards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To encourage, urge or incite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, usually in passive form) To elevate to a higher league.",
                  "examples": [
                    "At the end of the season, three teams are promoted to the Premier League."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chemistry) To increase the activity of (a catalyst) by changing its surface structure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chess) To exchange (a pawn) for a queen or other piece when it reaches the eighth rank.",
                  "examples": [
                    "Having crossed the chessboard, his pawn was promoted to a queen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Singapore) To move on to a subsequent stage of education.",
                  "examples": [
                    "At the end of Primary 6 students can promote directly to the secondary section of SIS."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}