{
  "word": "lank",
  "etymologies": [
    {
      "description": [
        "From Middle English lank, from Old English hlanc, from Proto-West Germanic *hlank, from Proto-Germanic *hlankaz (“lank, thin”), from Proto-Indo-European *kleng- (“to bend, turn, wind, twist”); compare German lenken (“to turn”), Gelenk (“joint”), Old High German hlanca (“hip, side, flank”), and English link (of a chain)."
      ],
      "adjectives": [
        {
          "description": "lank (comparative lanker, superlative lankest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Slender or thin; not well filled out; not plump; shrunken; lean.",
                  "examples": [
                    "[…]  who would not chuse  […]  to have rather a lank purse than an empty brain  […] ?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Meagre, paltry, scant in quantity.",
                  "examples": [
                    "We should think him a very imprudent Husbandman, that to save a little seed at present, would sow so thin, as to spoil his crop. And the same folly ’twill be in us, if by the sparingness and niggardize of our Almes, we make our selves a lank Harvest hereafter, and lose the reward God hath provided for the liberal Almes-giver."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of hair) Straight and flat; thin and limp. (Often associated with being greasy.)",
                  "examples": [
                    "The Inhabitants most simple, and treated them with great affection. Of Colour more inclined to white, of Body strong and comly, lank Hair, and long Beards, their Cloaths of very fine Mats  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Languid; drooping, slack.",
                  "examples": [
                    "The water-nymphs, that in the bottom played,",
                    "Held up their pearled wrists, and took her in,",
                    "Bearing her straight to aged Nereus’ hall;",
                    "Who, piteous of her woes, reared her lank head,",
                    "And gave her to his daughters to imbathe  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "lank (third-person singular simple present lanks, present participle lanking, simple past and past participle lanked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, intransitive) To become lank.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}