{
  "word": "spin",
  "etymologies": [
    {
      "description": [
        "From Middle English spinnen, from Old English spinnan, from Proto-Germanic *spinnaną, from Proto-Indo-European *(s)penh₁-. Compare Low German spinnen, Dutch spinnen, German spinnen, Danish spinde, Swedish spinna."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spin (countable and uncountable, plural spins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rapid circular motion.",
                  "examples": [
                    "The car went into a spin.",
                    "The skaters demonstrated their spins.",
                    "He put some spin on the cue ball."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A quantum angular momentum associated with subatomic particles, which also creates a magnetic moment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A favourable comment or interpretation intended to bias opinion on an otherwise unpleasant situation.",
                  "examples": [
                    "Try to put a positive spin on the disappointing sales figures.",
                    "The politician was mocked in the press for his reliance on spin rather than facts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) Rotation of the ball as it flies through the air; sideways movement of the ball as it bounces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A condition of flight where a stalled aircraft is simultaneously pitching, yawing, and rolling in a spinning motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanical engineering) An abnormal condition in journal bearings where the bearing seizes to the rotating shaft and rotates inside the journal, destroying both the shaft and the journal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief trip by vehicle, especially one made for pleasure.",
                  "examples": [
                    "I'm off out for a spin in my new sports car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bundle of spun material; a mass of strands and filaments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single play of a record by a radio station.",
                  "examples": [
                    "Although the Loveless title showed the smallest increase in airplay in the top 10, its number of detections outpaced the nearest bulleted title by more than 350 spins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, prison slang) A search of a prisoner's cell for forbidden articles.",
                  "examples": [
                    "Mr Weedon explains that this is a cell search - known by prisoners as a spin - and for obvious reasons it has to be carried out without any warning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) An unmarried woman; a spinster.",
                  "examples": [
                    "Some years ago, when I was a slim young spin, I came out to India to live with my brother Tom  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The use of an exercise bicycle, especially as part of a gym class.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spin (third-person singular simple present spins, present participle spinning, simple past and past participle spun or (rare) span or (nonstandard) spinned)",
          "definitionGroups": [
            {
              "group": "(ergative) To rotate, revolve, gyrate (usually quickly); to partially or completely rotate to face another direction.",
              "entries": [
                {
                  "meaning": "(aviation, of an aircraft) To enter, or remain in, a spin (abnormal stalled flight mode).",
                  "examples": []
                },
                {
                  "meaning": "(aviation, of a pilot) To cause one's aircraft to enter or remain in a spin (abnormal stalled flight mode).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make yarn by twisting and winding fibers together.",
                  "examples": [
                    "They spin the cotton into thread."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To present, describe, or interpret, or to introduce a bias or slant, so as to give something a favorable or advantageous appearance.",
                  "examples": [
                    "Synonyms: whitewash, sugarcoat, put lipstick on, gild, blandish, dress up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, of a bowler) To make the ball move sideways when it bounces on the pitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, of a ball) To move sideways when bouncing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) To form into thin strips or ribbons, as with sugar",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form (a web, a cocoon, silk, etc.) from threads produced by the extrusion of a viscid, transparent liquid, which hardens on coming into contact with the air; said of the spider, the silkworm, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shape, as malleable sheet metal, into a hollow form, by bending or buckling it by pressing against it with a smooth hand tool or roller while the metal revolves, as in a lathe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move swiftly.",
                  "examples": [
                    "to spin along the road in a carriage, on a bicycle, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To stream or issue in a thread or a small current or jet.",
                  "examples": [
                    "Blood spins from a vein."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, programming, intransitive) To wait in a loop until some condition becomes true.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To play (vinyl records, etc.) as a disc jockey.",
                  "examples": [
                    "However, for the past six years he has been spinning his novel blend of progressive house and trance music and is finally on the brink of becoming the next luminary DJ."
                  ]
                }
              ]
            },
            {
              "group": "(cycling, intransitive)",
              "entries": [
                {
                  "meaning": "To use an exercise bicycle, especially as part of a gym class.",
                  "examples": []
                },
                {
                  "meaning": "To ride a bicycle at a fast cadence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, law enforcement, slang, transitive) To search rapidly.",
                  "examples": [
                    "But then again, unless someone struck lucky in those first few hours, there weren't even enough detectives to spin a drum [house]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spin (plural spins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Short for spinnaker.",
                  "examples": [
                    "“Frank!” Joe yelled. “Run the spin halyard to the cabin-top winch and pass me the free end!”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening of special interest."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spin (plural spins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, used among autistic people) Special interest of an autistic person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}