{
  "word": "cost",
  "etymologies": [
    {
      "description": [
        "From Middle English costen, from Old French coster, couster (“to cost”), from Medieval Latin cōstō, from Latin cōnstō (“stand together”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "cost (third-person singular simple present costs, present participle costing, simple past and past participle cost or costed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ditransitive) To incur a charge of; to require payment of a (specified) price.",
                  "examples": [
                    "This shirt cost $50, while this was cheaper at only $30.",
                    "It will cost you a lot of money to take a trip around the world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ditransitive) To cause something to be lost; to cause the expenditure or relinquishment of.",
                  "examples": [
                    "Trying to rescue the man from the burning building cost them their lives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To require to be borne or suffered; to cause.",
                  "examples": [
                    "LUKE: \"That little droid is going to cost me a lot of trouble.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To calculate or estimate a price.",
                  "examples": [
                    "I'd cost the repair work at a few thousand."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English cost, coust, from costen (“to cost”), from the same source as above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cost (countable and uncountable, plural costs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Amount of money, time, etc. that is required or used.",
                  "examples": [
                    "The total cost of the new complex was an estimated $1.5 million.",
                    "We have to cut costs if we want to avoid bankruptcy.",
                    "The average cost of a new house is twice as much as it was 20 years ago."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A negative consequence or loss that occurs or is required to occur.",
                  "examples": [
                    "Spending all your time working may earn you a lot of money at the cost of your health.",
                    "The army won the battle decisively, but at a cost of many lives."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English cost, from Old English cost (“option, choice, possibility, manner, way, condition”), from Old Norse kostr (“choice, opportunity, chance, condition, state, quality”), from  Proto-Germanic *kustuz (“choice, trial”) (or Proto-Germanic *kustiz (“choice, trial”)), from Proto-Indo-European *ǵéwstus (“to enjoy, taste”).",
        "Cognate with Icelandic kostur, German dialectal Kust (“taste, flavour”), Dutch kust (“choice, choosing”), North Frisian kest (“choice, estimation, virtue”), West Frisian kêst (“article of law, statute”), Old English cyst (“free-will, choice, election, the best of anything, the choicest, picked host, moral excellence, virtue, goodness, generosity, munificence”), Latin gustus (“taste”). Related to choose. Doublet of gusto."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cost (plural costs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Manner; way; means; available course; contrivance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Quality; condition; property; value; worth; a wont or habit; disposition; nature; kind; characteristic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English coste, from Old French coste, from Latin costa. Doublet of coast and cuesta."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cost (plural costs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A rib; a side.",
                  "examples": [
                    "betwixt the costs of a ship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A cottise.",
                  "examples": [
                    "Coordinate terms: bendlet, garter, riband"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}