{
  "word": "tanker",
  "etymologies": [
    {
      "description": [
        "tank +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tanker (plural tankers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A tank ship, a vessel used to transport large quantities of liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive, US) A tank truck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive, UK) A fuel tanker, petrol tanker, road tanker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, usually military) An aircraft carrying a large supply of jet fuel or avgas for aerial refueling of other aircraft, plus equipment allowing the in-air transfer of fuel.",
                  "examples": [
                    "Without the KC-46 tankers orbiting in friendly airspace, our fighters would've run out of fuel long before reaching the combat zone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, firefighting) An aircraft built or modified to carry water and/or fire retardant for dropping on wildfires.",
                  "examples": [
                    "While our ground teams cut firebreaks in the brush, the tankers kept the fire in the mountains at bay with frequent drops of water and retardant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A tank car.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) Member of a tank crew, or of an armoured unit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing slang) A longboard.",
                  "examples": [
                    "I swung the tanker around just in time to take off with the lip."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tanker (third-person singular simple present tankers, present participle tankering, simple past and past participle tankered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To transport (oil, etc.) in a tanker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) To carry more fuel than necessary for a flight, in order to avoid having to refuel at a destination where fuel is more expensive or in short supply.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}