{
  "word": "redshirt",
  "etymologies": [
    {
      "description": [
        "red +‎ shirt. Derived from the red jersey commonly worn by a player meeting this definition in practice scrimmages against the regulars."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "redshirt (plural redshirts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, collegiate sports) An athlete who spends a year not participating in official athletic activities, but does not lose his or her eligibility to participate in following years.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "redshirt (third-person singular simple present redshirts, present participle redshirting, simple past and past participle redshirted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, collegiate sports) To place an athlete in a status wherein the athlete will spend a year not participating in official athletic activities, but will not lose his or her eligibility to participate in following years.",
                  "examples": [
                    "The university decided to redshirt the freshman linebacker to give him an extra year to build up his bulk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, collegiate sports) To take on a status wherein one will spend a year not participating in official athletic activities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) To hold a child out of kindergarten for one year in the hope that the child will do better academically and socially.",
                  "examples": [
                    "Parents who redshirt their 5-year-olds instead of enrolling them in kindergarten are a concern to some Nebraska educators who are trying to reverse the trend of holding children back until age 6 to start school."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "red +‎ shirt. From the tendency of red-shirted ensigns in the Star Trek: The Original Series television program to die prematurely."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "redshirt (plural redshirts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fiction, science fiction) An unimportant character introduced only to be killed in order to underscore the peril to the important characters; an expendable character.",
                  "examples": [
                    "Sensing danger, Captain Kirk decided to beam down to the surface with Spock, McCoy, and a couple of redshirts."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "red +‎ shirt. From the red shirts worn by such people when on duty."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "redshirt (plural redshirts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US navy) A person responsible for loading and unloading weapons, artillery, and equipment from aircraft.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "redshirt (plural redshirts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of Red Shirt (“member of the UDD”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}