{
  "word": "superego",
  "etymologies": [
    {
      "description": [
        "super +‎ ego, from earlier form super-ego, calqued after German Über-Ich, from über- (“super-”) + Ich (“ego”), from the pronoun ich (“I”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "superego (plural superegos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychoanalysis) The part of the mind that acts as a self-critical conscience, reflecting social standards that have been learnt.",
                  "examples": [
                    "Still, it would be an error to believe that psychoanalytic theory makes no contribution to describing and assessing different types of ethical conduct. The crucial notion in this connection is the relative rigidity or flexibility of the superego. The childish, immature, or neurotic superego is rigid; it is characterized by slavish adherence to rules which, moreover, may not be clearly understood. The mature or normal super- ego, on the other hand, is flexible; it can evaluate the situation at hand and modify the rules accordingly. Thus, in an early, classic paper, Strachey suggested that the basic aim of psycho- analytic treatment is to make such \"mutative interpretations\" as would help to render the patient's \"rigid superego\" more \"flexible\".8 Like the psychoanalytic theory of the superego, on which it is based, this view suffers from the limitation of being silent on what sort of rigidity is considered bad or undesirable and what sort of flexibility is considered good or desirable. In short, Freud and other psychoanalysts have persistently dallied with normative systems without ever committing them- selves on normative standards."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}