{
  "word": "next",
  "etymologies": [
    {
      "description": [
        "From Middle English nexte, nexste, nixte, from Old English nīehsta, nīehste, etc., inflected forms of nīehst (“nearest, next”), superlative form of nēah (“nigh, near”), corresponding to Proto-Germanic *nēhwist (“nearest, closest”); equivalent to nigh +‎ -est. Cognate with Saterland Frisian naist (“next”), Dutch naast (“next”), German nächst (“next”), Danish næste (“next”), Swedish näst (“next”), Icelandic næst (“next”), Persian نزد‎ (nazd, “near, with”)."
      ],
      "adjectives": [
        {
          "description": "next (not comparable)",
          "definitionGroups": [
            {
              "group": "Nearest in place or position, having nothing similar intervening; adjoining.",
              "entries": [
                {
                  "meaning": "(obsolete) Most direct, or shortest or nearest in distance or time.",
                  "examples": [
                    "The road to resolution, lies by doubt:",
                    "\"The next way home's the farthest way about.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Nearest in order, succession, or rank; immediately following (or sometimes preceding) in order.",
                  "examples": [
                    "Please turn to the next page.",
                    "On Wednesday next, I'm going to Spain.",
                    "the next chapter; the next week; the Sunday next before Easter",
                    "The man was driven by his love for money and his desire to become the next Bill Gates."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly law) Nearest in relationship. (See also next of kin.)",
                  "examples": [
                    "next friend"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "next (not comparable)",
          "definitionGroups": [
            {
              "group": "In a time, place, rank or sequence closest or following.",
              "entries": [
                {
                  "meaning": "(conjunctive) So as to follow in time or sequence something previously mentioned.",
                  "examples": [
                    "First we removed all the handles; next, we stripped off the old paint."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "On the first subsequent occasion.",
                  "examples": [
                    "Financial panic, earthquakes, oil spills, riots. What comes next?",
                    "When we next meet, you'll be married."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "next (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The one that follows after this one.",
                  "examples": [
                    "Next, please, don't hold up the queue!",
                    "One moment she was there, the next she wasn't.",
                    "The week after next"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [
        {
          "description": "next",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or poetic) On the side of; nearest or adjacent to; next to.",
                  "examples": [
                    "1660,  James Howell,  Lexicon Tetraglotton, an English-French-Italian-Spanish Dictionary: […] By the Labours, and Lucubrations of James Howell‎[1], page 117:D is so dainty a letter, that she admits no other consonant next her but R: […]",
                    "1900, The Iliad, edited, with apparatus criticus, prolegomena, notes, and appendices, translated by Walter Leaf (London, Macmillan), notes on line 558 of book 2:",
                    "The fact that the line cannot be original is patent from the fact that Aias in the rest of the Iliad is not encamped next the Athenians  […] .",
                    "1986,  University of Wales Board of Celtic Studies,  Bwletin Y Bwrdd Gwybodau Celtaidd - Volume 33‎[2], page 413:Photographs indicate that the southern terminals of the ditch system next the west gate may be in echelon, whilst those marginal to the east gate may be slightly inturned."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}