{
  "word": "laugh",
  "etymologies": [
    {
      "description": [
        "From Middle English laughen, laghen, from (Anglian) Old English hlæhhan, hlehhan, (West Saxon) hliehhan, from Proto-West Germanic *hlahhjan, from Proto-Germanic *hlahjaną."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "laugh (plural laughs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An expression of mirth particular to the human species; the sound heard in laughing; laughter.",
                  "examples": [
                    "And the loud laugh that spoke the vacant mind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that provokes mirth or scorn.",
                  "examples": [
                    "“And this rug,” he says, stomping on an old rag carpet. “How much do you suppose that cost?” ¶ It was my first guess, so I said fifty dollars. ¶ “That’s a laugh,” he said. “I paid two thousand for that rug.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, New Zealand) A fun person.",
                  "examples": [
                    "Outhwaite is a good laugh, yes, she knows how to smile: but deep down, she really is strong and stern."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "laugh (third-person singular simple present laughs, present participle laughing, simple past and past participle laughed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To show mirth, satisfaction, or derision, by peculiar movement of the muscles of the face, particularly of the mouth, causing a lighting up of the face and eyes, and usually accompanied by the emission of explosive or chuckling sounds from the chest and throat; to indulge in laughter.",
                  "examples": [
                    "The roars of laughter which greeted his proclamation were of two qualities; some men laughing because they knew all about cuckoo-clocks, and other men laughing because they had concluded that the eccentric Jake had been victimised by some wise child of civilisation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively, obsolete) To be or appear cheerful, pleasant, mirthful, lively, or brilliant; to sparkle; to sport.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, followed by \"at\") To make an object of laughter or ridicule; to make fun of; to deride; to mock.",
                  "examples": [
                    "On the corner is a banker with a motorcar / The little children laugh at him behind his back"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To affect or influence by means of laughter or ridicule.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To express by, or utter with, laughter.",
                  "examples": [
                    "Fairfax addressed her as \"my lady,\" she laughed her musical laugh, and glanced up at a picture of Gerald with eyes full of exultation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}