{
  "word": "pathology",
  "etymologies": [
    {
      "description": [
        "From French pathologie, from Ancient Greek πάθος (páthos, “disease”) and -λογία (-logía, “study of”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pathology (usually uncountable, plural pathologies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "The study of the nature of disease and its causes, processes, development, and consequences; now usually and especially in the clinical and academic medicine subsenses defined below.",
              "entries": [
                {
                  "meaning": "(clinical medicine) The clinical biomedical specialty that provides microscopy and other laboratory services to clinicians (e.g., cytology, histology, cytopathology, histopathology, cytometry).",
                  "examples": [
                    "The surgeon sent a specimen of the cyst to the hospital's pathology department for staining and analysis to determine its histologic subtype."
                  ]
                },
                {
                  "meaning": "(academic medicine) The academic biomedical specialty that advances the aspects of the biomedical sciences that allow for those clinical applications and their advancements over time.",
                  "examples": [
                    "Those three pioneering pathologists went on to become leaders in building the pathology departments at several universities."
                  ]
                },
                {
                  "meaning": "(biology, life sciences) Any of several interrelated scientific disciplines that advance the aspects of the life sciences that allow for such technological applications and their advancements over time.",
                  "examples": [
                    "the plant pathology and vertebrate pathology programs of the university's biology department"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pathosis: any deviation from a healthy or normal structure or function; abnormality; illness or malformation.",
                  "examples": [
                    "Some sort of renal pathology was suspected, but imaging and even biopsy found no discernible pathology, glomerular or otherwise.",
                    "Some sort of mental and social pathology seemed to sweep over the discourse later that autumn.",
                    "Synonyms: abnormality, disease, illness, pathosis"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}