{
  "word": "layer",
  "etymologies": [
    {
      "description": [
        "Appears at first glance to be from Middle English leyer, leyare (“a layer of stones or bricks”), equivalent to lay +‎ -er. In which case, ultimately identical to the other word below that is also spelt layer.",
        "However, this word layer (referring to a thickness of a material covering a surface) has long been argued to be from a respelling of an obsolete sense of the word lair that was once used by farmers, which had to do with soil. The connecting sense between the usual meaning of lair and the specialised farming meaning was: an area where cows typically rest, the ground being fertilised by their waste. Related to lie, ledger."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "layer (plural layers)",
          "definitionGroups": [
            {
              "group": "A single thickness of some material covering a surface.",
              "entries": [
                {
                  "meaning": "An item of clothing worn under or over another.",
                  "examples": [
                    "It's cold now but it will warm up this afternoon. Make sure you wear layers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A (usually) horizontal deposit; a stratum.",
                  "examples": [
                    "I find seven-layer cake a bit too rich."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the items in a hierarchy.",
                  "examples": [
                    "mired in layers of deceit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer graphics, by analogy to a stack of transparencies) one in a stack of (initially transparent) drawing surfaces that comprise an image; used to keep elements of an image separate so that they can be modified independently from one another.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "layer (third-person singular simple present layers, present participle layering, simple past and past participle layered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To cut or divide into layers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To arrange in layers.",
                  "examples": [
                    "Layer the ribbons on top of one another to make an attractive pattern."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "lay +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "layer (plural layers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who lays anything, such as tiles or a wager.",
                  "examples": [
                    "If fortune ever favoured any venturesome layer of bets, Tom Elliot was certainly the one that day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mature female bird, insect, etc. that is able to lay eggs.",
                  "examples": [
                    "When dealing with an infestation of headlice, the first step is to eliminate the layers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hen kept to lay eggs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shoot of a plant, laid underground for growth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}