{
  "word": "snowball",
  "etymologies": [
    {
      "description": [
        "From Middle English snoweball, snoweballe, snaweballe, snayballe, equivalent to snow +‎ ball. Cognate with Scots snawbaw, German Schneeball, Luxembourgish Schnéiball, Dutch sneeuwbal, Afrikaans sneeubal, Limburgish snieëbal, West Frisian sniebal, Saterland Frisian Sneebaal, Sneebal, Swedish snöboll, Elfdalian sniųoboll, Danish snebold, Norwegian Bokmål snøball, Norwegian Nynorsk snøball and Icelandic snjóbolti."
      ],
      "adjectives": [
        {
          "description": "snowball (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of something with rapid growth, often uncontrolled. Compare snowball effect.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "snowball (plural snowballs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ball of snow, usually one made in the hand and thrown for amusement in a snowball fight; also a larger ball of snow made by rolling a snowball around in snow that sticks to it and increases its diameter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cocktail made from lemonade and advocaat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something that snowballs (grows rapidly out of control).",
                  "examples": [
                    "Representatives of the small airlines that felt betrayed by Brown's policy started a political snowball rolling, resulting in the Airmail Act of 1934..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sex act involving passing ejaculated semen from one person's mouth to another's.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A type of ice dessert.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of cake.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "snowball (third-person singular simple present snowballs, present participle snowballing, simple past and past participle snowballed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rapidly grow out of proportion or control.",
                  "examples": [
                    "The high unemployment rates quickly snowballed into a major budget problem for the government."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To play at throwing snowballs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pelt with snowballs; to throw snowballs at.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To receive ejaculated semen in one's mouth, and to then pass it back and forth between one’s mouth and another person’s mouth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}