{
  "word": "junket",
  "etymologies": [
    {
      "description": [
        "From Middle English jonket (“basket made of rushes; food, probably made of sour milk or cream; banquet, feast.”), from Medieval Latin iuncta, possibly from Latin iuncus (“rush, reed”) and therefore a possible doublet of jonquil.",
        "Meaning shifted to \"feast or banquet\" by 1520s, probably via the notion of a picnic basket. This in turn led to the sense of \"pleasure-trip\" (1814), and then to specifically to \"trip made ostensibly for business but which entails merrymaking or entertainment\" by 1886 in American English."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "junket (plural junkets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A basket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of cream cheese, originally made in a rush basket; later, a food made of sweetened curds or rennet.",
                  "examples": [
                    "I love your meads, and I love your flowers, / And I love your junkets mainly [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A delicacy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A feast or banquet.",
                  "examples": [
                    "Conversation is the natural Junket of the Mind ; and most Men have an Appetite to it, once in the day at least [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pleasure-trip; a journey made for feasting or enjoyment, now especially a trip made ostensibly for business but which entails merrymaking or entertainment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A press junket.",
                  "examples": [
                    "An entertainment reporter who is a member of the Hollywood Foreign Press Association said Freeman made comments about her skirt and her legs during two different junkets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) A gaming room for which the capacity and limits change daily, often rented out to private vendors who run tour groups through them and give a portion of the proceeds to the main casino.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "junket (third-person singular simple present junkets, present participle junketing or junketting, simple past and past participle junketed or junketted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To attend a junket; to feast.",
                  "examples": [
                    "Be careful that you wast not, or spoil your Ladies, or Mistresses goods, neither sit you up junketing a nights, after your Master and Mistress be abed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go on a junket; to travel.",
                  "examples": [
                    "Together they made trips to town or junketed over the country in search of furniture and dishes of which Miss Sally had heard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To regale or entertain with a feast.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}