{
  "word": "feral",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French féral, from fer + -al, or borrowed from a Late Latin fērālis."
      ],
      "adjectives": [
        {
          "description": "feral (comparative more feral, superlative most feral)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wild, untamed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of an animal, being wild but descended from domestic or captive animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Contemptible, unruly, misbehaved.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Internet slang. Engrossed by a certain thought or behavior.",
                  "examples": [
                    "I went absolutely feral over Harry Potter lore."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "feral (plural ferals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A domesticated animal that has returned to the wild; an animal, particularly a domesticated animal, living independently of humans.",
                  "examples": [
                    "Traffic, abuse, inhumane traps, and accidental poisoning are other hazards ferals must face. […] In England one gamekeeper claimed to have killed over three hundred ferals, while another brought home pelts to his wife so that she could design rugs from cat skins as a source of secondary income."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, colloquial) A contemptible young person, a lout, a person who behaves wildly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, colloquial) A person who has isolated themselves from the outside world; one living an alternative lifestyle.",
                  "examples": [
                    "The intolerance which was directed towards us during the early years has now shifted to ‘the ferals’ who embrace a new version of nonconformist behaviour that even some of us in their parent′s generation — the Aquarian settlers — don′t like. The ferals are the scapegoats for the drug problems here, and are highly visible since many of them have nowhere to live."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(furry subculture) A character in furry art or literature which has the physical characteristics (body) of a regular animal (typically quadripedal), that may or may not be able to communicate with humans or anthros (contrasts anthro)",
                  "examples": [
                    "The story is about a group of ferals which have to explore the ruins of society after the humans die out."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin fērālis (“funereal”), from Proto-Italic *fēz-ālis, from Proto-Indo-European *dʰéh₁s (“god, sacred place”)."
      ],
      "adjectives": [
        {
          "description": "feral (comparative more feral, superlative most feral)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Deadly, fatal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to the dead, funereal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}