{
  "word": "particle",
  "etymologies": [
    {
      "description": [
        "From Middle French particule, and its source, Latin particula (“small part, particle”), diminutive of pars (“part, piece”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "particle (plural particles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very small piece of matter, a fragment; especially, the smallest possible part of something. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) Any of various physical objects making up the constituent parts of an atom; an elementary particle or subatomic particle. [from 19th c.]",
                  "examples": [
                    "What, he asked himself, does quantum theory have to say about the familiar properties of particles such as position?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A part of speech that has no inherent lexical definition but must be associated with another word to impart meaning, often a grammatical category: for example, the English word to in a full infinitive phrase (to eat) or O in a vocative phrase (O Canada), or as a discourse marker (mmm).",
                  "examples": [
                    "In English there is no grammatical device to differentiate predicational judgments from nonpredicational descriptions. This distinction does cast a shadow on the grammatical sphere to some extent, but recognition of it must generally be made in semantic terms. It is maintained here that in Japanese, on the other hand, the distinction is grammatically realized through the use of the two particles wa and ga."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A part of speech which cannot be inflected.",
                  "examples": [
                    "322. The parts of speech which are neither declined nor conjugated, are called by the general name of particles. 323. They are adverbs, prepositions, conjunctions, and interjections."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) In the Roman Catholic church, a crumb of consecrated bread; also the smaller breads used in the communion of the laity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A little bit.",
                  "examples": [
                    "1952,  E.B. White,  Charlotte's Web, page 89:",
                    "\"That doesn't make a particle of difference\", replied Charlotte. \"Not a particle.\" People believe almost anything they see in print.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}