{
  "word": "motion",
  "etymologies": [
    {
      "description": [
        "From Middle English mocioun, mocion, from Anglo-Norman motion, Middle French motion, and their etymon Latin motio (“movement, motion”), related to movēre, from Proto-Indo-European *mew- (“to move”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "motion (countable and uncountable, plural motions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A state of progression from one place to another.",
                  "examples": [
                    "Synonym: movement",
                    "Antonym: rest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A change of position with respect to time.",
                  "examples": [
                    "This is the great wheel to which the clock owes its motion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A change from one place to another.",
                  "examples": [
                    "Synonyms: move, movement",
                    "Antonym: rest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A parliamentary action to propose something.  A similar procedure in any official or business meeting.",
                  "examples": [
                    "The motion to amend is now open for discussion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An entertainment or show, especially a puppet show.",
                  "examples": [
                    "when God gave him reason, he gave him freedom to choose, for reason is but choosing; he had bin else a meer artificiall Adam, such an Adam as he is in the motions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) from κίνησις (kinesis); any change. Traditionally of four types: generation and corruption, alteration, augmentation and diminution, and change of place.",
                  "examples": [
                    "\"I say, it is no uneven jot, to pass from the more faint and obscure examples of Spermatical life to the more considerable effects of general Motion in Minerals, Metalls, and sundry Meteors, whose easie and rude shapes may have no need of any Principle of Life, or Spermatical form distinct from the Rest or Motion of the particles of the Matter.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Movement of the mind, desires, or passions; mental act, or impulse to any action; internal activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A formal request, oral or written, made to a judge or court of law to obtain an official court ruling or order for a legal action to be taken by, or on behalf of, the movant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) A movement of the bowels; the product of such movement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Change of pitch in successive sounds, whether in the same part or in groups of parts. (Conjunct motion is that by single degrees of the scale. Contrary motion is when parts move in opposite directions. Disjunct motion is motion by skips. Oblique motion is when one part is stationary while another moves. Similar or direct motion is when parts move in the same direction.)",
                  "examples": [
                    "The independent motions of different parts sounding together constitute counterpoint."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A puppet, or puppet show.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanical engineering) A piece of moving mechanism, such as on a steam locomotive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "motion (third-person singular simple present motions, present participle motioning, simple past and past participle motioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To gesture indicating a desired movement.",
                  "examples": [
                    "He motioned for me to come closer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(proscribed) To introduce a motion in parliamentary procedure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a proposal; to offer plans.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}