{
  "word": "tympanum",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin tympanum (“a drum, timbrel, tambourine; the eardrum”). Doublet of timbre and timpani."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tympanum (plural tympanums or tympana)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A drum.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(anatomy, zootomy) Any of various anatomic structures in various animals with analogy to a drum head:",
              "entries": [
                {
                  "meaning": "(anatomy, zootomy) The eardrum (tympanic membrane, membrana tympanica).",
                  "examples": []
                },
                {
                  "meaning": "(anatomy, zootomy) The main portion of the middle ear: the tympanic cavity (cavitas tympani).",
                  "examples": []
                },
                {
                  "meaning": "(zootomy, entomology) A thin tense membrane covering the hearing organ on the leg or body of some insects, sometimes adapted (as in cicadas) for producing sound.",
                  "examples": []
                },
                {
                  "meaning": "(zootomy) A membranous resonator in a sound-producing organ in frogs and toads.",
                  "examples": []
                },
                {
                  "meaning": "(zootomy) (in certain birds) The labyrinth at the bottom of the windpipe.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(architecture) A vertical recessed triangular space between the sides of a pediment, typically decorated",
              "entries": [
                {
                  "meaning": "The recessed triangular space within an arch, and above a lintel or a subordinate arch, spanning the opening below the arch",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A drum-shaped wheel with spirally curved partitions by which water is raised to the axis when the wheel revolves with the lower part of the circumference submerged; used for raising water, as for irrigation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}