{
  "word": "panda",
  "etymologies": [
    {
      "description": [
        "Borrowed from French panda, of unclear ultimate origin but probably from the second element of nigálya-pónya, a local name for the red panda recorded in Nepal and Sikkim by Brian Houghton Hodgson (1800 or 1801 – 1894), an ethnologist, naturalist and the British Resident of Nepal, possibly from Nepali निँगाले (nĩgāle, “relating to a certain species of bamboo”) (the adjectival form of निँगालो (nĩgālo), a variant of निङालो (niṅālo, “Drepanostachyum intermedium, a species of bamboo”)) + a regional Tibetan name for the animal (compare regional Tibetan ཕོ་ཉ (pho nya, “messenger”)).",
        "Attributive uses of sense 2 (“giant panda”) generally refer to that animal’s distinctive black and white coat colour."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "panda (plural pandas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare without a qualifying word) The red panda (Ailurus fulgens), a small raccoon-like animal of northeast Asia with reddish fur and a long, ringed tail. [from 19th c.]",
                  "examples": [
                    "Synonyms: (obsolete) bear cat, (obsolete) cat bear, lesser panda, (archaic) wah"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, also attributively) Short for giant panda (“Ailuropoda melanoleuca”). [from 19th c.]",
                  "examples": [
                    "Synonyms: mottled bear, (Canada, US) panda bear"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, law enforcement, colloquial) Short for panda car (“a black-and-white police car”). [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Borrowed from Hindi पंडा (paṇḍā) and Punjabi ਪਾਂਡਾ (pāṇḍā), both from Sanskrit पण्डित (paṇḍita, “learned, wise; learned man, pundit, scholar, teacher; Hindu Brahmin who has memorized a substantial proportion of the Vedas”). Doublet of pundit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "panda (plural pandas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Hinduism) A brahmin who acts as the hereditary superintendent of a particular ghat or temple, and is regarded as knowledgeable in matters of genealogy and ritual. [from 19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}