{
  "word": "pall",
  "etymologies": [
    {
      "description": [
        "From Middle English pal, palle, from Old English pæl, pæll, from Old French paile and Latin pallium (“cloak; covering”) (and thus a doublet of pallium), probably from palla (“piece of cloth worn as apparel”) (possibly from Proto-Indo-European *pel- (“to cover, wrap; hide, skin; cloth”)) + -ium (suffix forming abstract nouns)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pall (plural palls)",
          "definitionGroups": [
            {
              "group": "Senses relating to cloth.",
              "entries": [
                {
                  "meaning": "(archaic, poetic) Fine cloth, especially purple cloth used for robes.",
                  "examples": []
                },
                {
                  "meaning": "A heavy cloth laid over a coffin or tomb; a shroud laid over a corpse.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A piece of cardboard, covered with linen and embroidered on one side, used to cover the chalice during the Eucharist.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity, obsolete) A cloth used for various purposes on the altar in a church, such as a corporal (“cloth on which elements of the Eucharist are placed”) or frontal (“drapery covering the front of an altar”).",
                  "examples": []
                }
              ]
            },
            {
              "group": "Senses relating to clothing.",
              "entries": [
                {
                  "meaning": "(archaic) An outer garment; a cloak, mantle, or robe.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) Something that covers or surrounds like a cloak; in particular, a cloud of dust, smoke, etc., or a feeling of fear, gloom, or suspicion.",
                  "examples": [
                    "The early election results cast a pall over what was supposed to be a celebration.",
                    "A pall came over the crowd when the fourth goal was scored."
                  ]
                },
                {
                  "meaning": "(Christianity) Especially in Roman Catholicism: a pallium (“liturgical vestment worn over the chasuble”).",
                  "examples": []
                },
                {
                  "meaning": "(heraldry) A charge representing an archbishop's pallium, having the form of the letter Y charged with crosses.",
                  "examples": [
                    "Synonyms: cross-pall, pairle",
                    "The flag of South Africa has a green pall"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From the noun pall (“cloth”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pall (third-person singular simple present palls, present participle palling, simple past and past participle palled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cloak or cover with, or as if with, a pall.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Formed by aphesis from appal, appall (“(obsolete) to make pale; to weaken; to become weak; to lose flavour or become stale”), possibly under the influence of the figurative meaning of the unrelated noun pall.",
        "Alternatively, the word may be derived from Middle English pallen (“to diminish, impair, weaken; to become faint; to lose spirit”), formed by aphesis from apallen (“to become or make faint or tired; to become indifferent; to fade or cause to fade away; to dim, weaken; to become stale; to be frightened; to frighten; to become pale”), from Old French apalir (“to become or cause to become pale”), possibly from Latin pallidus (“pale, pallid; pale with fright, frightened; mouldy, musty”), from palleō (“to be pale, turn pale; to be anxious or fearful; to fade or change colour”) (ultimately from Proto-Indo-European *pel-, *pelH- (“grey; pale”)) + -idus (suffix meaning ‘tending to’ forming adjectives)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pall (third-person singular simple present palls, present participle palling, simple past and past participle palled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make vapid or insipid; to make lifeless or spiritless; to dull, to weaken.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become dull, insipid, tasteless, or vapid; to lose life, spirit, strength, or taste.",
                  "examples": [
                    "The liquor palls."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From the verb pall (“to make vapid”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pall (plural palls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A feeling of nausea caused by disgust or overindulgence.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}