{
  "word": "afford",
  "etymologies": [
    {
      "description": [
        "From Middle English afforthen, aforthen, avorthien, from earlier iforthen, iforthien, ȝeforthien, from Old English forþian, ġeforþian (“to further, accomplish, afford”), from Proto-Germanic *furþōną, from Proto-Germanic *furþą (“forth, forward”), equivalent to a- +‎ forth. Cognate with Old Norse forða (“to forward oneself, save oneself, escape danger”), Icelandic forða (“to save, rescue”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "afford (third-person singular simple present affords, present participle affording, simple past and past participle afforded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To incur, stand, or bear without serious detriment, as an act which might under other circumstances be injurious; (usually after an expression of ability, as could, able, difficult) to be able or rich enough.",
                  "examples": [
                    "I think we can afford the extra hour it will take.  We can only afford to buy a small car at the moment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To offer, provide, or supply, as in selling, granting or expending, with profit, or without too great a loss.",
                  "examples": [
                    "Alfred affords his goods cheaper than Bantock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) To give forth; to supply, yield, or produce as the natural result, fruit, or issue.",
                  "examples": [
                    "Grapes afford wine.  Olives afford oil.  The earth affords fruit.  The sea affords an abundant supply of fish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give, grant, or confer, with a remoter reference to its being the natural result; to provide; to furnish.",
                  "examples": [
                    "A good life affords consolation in old age."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}