{
  "word": "shred",
  "etymologies": [
    {
      "description": [
        "From Middle English shrede, shred (“fragment, piece, scrap; piece cut off from something; strip of material; ornamental strip hanging from the edge of a garment; thread; band or thread woven in a garment; element, streak; plant (?)”) [and other forms], from Late Old English sċrēad, sċrēade (“piece cut off from something; a paring; a shred”), from Proto-Germanic *skraudō (“a piece, shred; a crack; a cut”), ultimately from Proto-Indo-European *(s)ker- (“to cut off”). Doublet of escrow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shred (plural shreds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fragment of something; a particle; a piece; also, a very small amount.",
                  "examples": [
                    "Synonyms: ounce; see also Thesaurus:modicum",
                    "There isn’t a shred of evidence to support his claims."
                  ]
                }
              ]
            },
            {
              "group": "A long, narrow piece (especially of fabric) cut or torn off; a strip; specifically, a piece of cloth or clothing.",
              "entries": [
                {
                  "meaning": "(by extension) A thin strand or wisp, as of a cloud, mist, etc.",
                  "examples": []
                },
                {
                  "meaning": "(cooking) A thin strip of fruit peel, a vegetable, etc., cut so that it curls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A piece of gold or silver lace or thread.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A shard or sherd (“a piece of broken glass or pottery”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A tailor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Middle English shreden, shred (“to chop, cut up; to cut, hack; to wound with a knife; to cut off a part of (something); to prune, trim”) [and other forms], from Old English sċrēadian (“to cut up, shred; to cut off; to prune, trim”), from Proto-West Germanic *skraudōn, related to Proto-West Germanic *skraudan (“to cut up; to shred”), from Proto-Germanic *skraudaną (“to cut up; to shred”), ultimately from Proto-Indo-European *(s)ker- (“to cut off”).",
        "The adjective is derived from the past participle form of the verb."
      ],
      "adjectives": [
        {
          "description": "shred (comparative more shred, superlative most shred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of shredded (“cut or torn into narrow strips or small pieces”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "shred (third-person singular simple present shreds, present participle shredding, simple past shredded, past participle shredded or shred)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To cut or tear (something) into long, narrow pieces or strips.",
                  "examples": []
                },
                {
                  "meaning": "(specifically)",
                  "examples": []
                },
                {
                  "meaning": "To destroy (a document) by cutting or tearing into strips or small pieces that cannot easily be read, especially using a shredder.",
                  "examples": []
                },
                {
                  "meaning": "(cooking) To cut (fruit peel, a vegetable, etc.) into thin strips that curl.",
                  "examples": []
                },
                {
                  "meaning": "To separate (something) into small portions.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively, chiefly slang)",
                  "examples": []
                },
                {
                  "meaning": "To reduce (something) by a large percentage; to slash.",
                  "examples": []
                },
                {
                  "meaning": "(music) Chiefly in rock and heavy metal: to play (a musical instrument (especially a guitar) or a piece of music) very fast.",
                  "examples": []
                },
                {
                  "meaning": "(snowboarding, surfing) To cut through (snow, water, etc.) swiftly with one's snowboard, surfboard, etc.; (by extension) to move or ride along (a road, track, etc.) aggressively and rapidly.",
                  "examples": []
                },
                {
                  "meaning": "(originally US) To convincingly defeat (someone); to thrash, to trounce.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To cut or sever (something) into two parts.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To chop or cut (something) into pieces.",
                  "examples": []
                },
                {
                  "meaning": "To cut, lop, or strip (branches, etc.) off; also, to cut (a piece) from something.",
                  "examples": []
                },
                {
                  "meaning": "To prune or trim (a tree, a vineyard, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To become separated into small portions.",
                  "examples": []
                },
                {
                  "meaning": "(bodybuilding) To reduce body weight due to fat and water before a competition.",
                  "examples": []
                },
                {
                  "meaning": "(snowboarding, surfing, etc.) To travel swiftly using a snowboard, surfboard, or vehicle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}