{
  "word": "mortality",
  "etymologies": [
    {
      "description": [
        "From Old French mortalite, from Latin mortālitās, from mortālis (“relating to death”), from mors (“death”); equivalent to mortal +‎ -ity."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mortality (countable and uncountable, plural mortalities)",
          "definitionGroups": [
            {
              "group": "The state or quality of being mortal.",
              "entries": [
                {
                  "meaning": "The state of being susceptible to death.",
                  "examples": [
                    "Antonym: immortality"
                  ]
                },
                {
                  "meaning": "(archaic) The quality of being punishable by death.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) The quality of causing death.",
                  "examples": [
                    "Synonyms: deadliness, lethality"
                  ]
                }
              ]
            },
            {
              "group": "The number of deaths; and, usually and especially, the number of deaths per time unit (usually per year), expressed as a rate.",
              "entries": [
                {
                  "meaning": "Deaths resulting from an event (such as a war, epidemic or disaster).",
                  "examples": [
                    "[…]  the Mortality was so great in the Yard or Alley, that there was no Body left to give Notice to the Buriers or Sextons, that there were any dead Bodies there to be bury’d."
                  ]
                },
                {
                  "meaning": "(biology, ecology, demography, insurance) The number of deaths per given unit of population over a given period of time.",
                  "examples": [
                    "Synonyms: death rate, mortality rate, casualty rate",
                    "Coordinate terms: case fatality rate, infection fatality rate, lethality"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Death.",
                  "examples": [
                    "Learn to bear your Husband’s Death like a reasonable Woman. ’Tis not the fashion, now-a-days so much as to affect Sorrow upon these Occasions. No Woman would ever marry, if she had not the Chance of Mortality for a Release."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, archaic) Mortals collectively.",
                  "examples": [
                    "Synonyms: humankind, humanity, mankind"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}