{
  "word": "glutton",
  "etymologies": [
    {
      "description": [
        "Middle English, from Old French gloton, gluton, from Latin gluto, glutonis (“glutton”).",
        "Application of the term to the wolverine was due to the belief that the animal was inordinately voracious, and to the German designation of it as the Vielfraß, which was analyzed as viel (“much”) + fressen (“eat”) although it actually derives from Old Norse."
      ],
      "adjectives": [
        {
          "description": "glutton (comparative more glutton, superlative most glutton)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Gluttonous; greedy; gormandizing.",
                  "examples": [
                    "A glutton monastery in former ages makes a hungry ministry in our days."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "glutton (plural gluttons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who eats voraciously, obsessively, or to excess; a gormandizer.",
                  "examples": [
                    "Such a glutton would eat until his belly hurts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) One who consumes voraciously, obsessively, or to excess",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The wolverine, Gulo gulo.",
                  "examples": [
                    "[A] civil establishment  […]  is the animal called a glutton, which falling from a tree (in which it generally conceals itself) upon some noble animal, immediately begins to tear it, and suck its blood  […] ."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "glutton (third-person singular simple present gluttons, present participle gluttoning, simple past and past participle gluttoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To glut; to satisfy (especially an appetite) by filling to capacity.",
                  "examples": [
                    "Glutton'd at last, return at home to pine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To glut; to eat voraciously.",
                  "examples": [
                    "Whereon in Egypt gluttoning they fed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}