{
  "word": "pin",
  "etymologies": [
    {
      "description": [
        "From Middle English pinne, from Old English pinn (“pin, peg, bolt”), from Proto-Germanic *pinnaz, *pinnō, *pint- (“protruding point, peak, peg, pin, nail”), from Proto-Indo-European *bend- (“protruding object, pointed peg, nail, edge”). Related to pen (“enclosure”).",
        "Cognate with Dutch pin (“peg, pin”), Low German pin, pinne (“pin, point, nail, peg”), German Pinn, Pinne (“pin, tack, peg”), Bavarian Pfonzer, Pfunzer (“sharpened point”), Danish pind (“pin, pointed stick”), Norwegian pinn (“stick”), Swedish pinne (“peg, rod, stick”), Icelandic pinni (“pin”). More at pintle.",
        "No relation to classical Latin pinna (“fin, flipper, wing-like appendage, wing, feather”), which was extended to mean \"ridge, peak, point\" (compare pinnacle), and often confused with Latin penna (“wing, feather”). More at feather and pen (Etymology 3)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pin (plural pins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A needle without an eye (usually) made of drawn-out steel wire with one end sharpened and the other flattened or rounded into a head, used for fastening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small nail with a head and a sharp point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cylinder often of wood or metal used to fasten or as a bearing between two parts.",
                  "examples": [
                    "Pull the pin out of the grenade before throwing it at the enemy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(wrestling, professional wrestling) The victory condition of holding the opponent's shoulders on the wrestling mat for a prescribed period of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slender object specially designed for use in a specific game or sport, such as skittles or bowling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, in the plural) A leg.",
                  "examples": [
                    "I'm not so good on my pins these days."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electricity) Any of the individual connecting elements of a multipole electrical connector.",
                  "examples": [
                    "The UK standard connector for domestic mains electricity has three pins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of jewellery that is attached to clothing with a pin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A simple accessory that can be attached to clothing with a pin or fastener, often round and bearing a design, logo or message, and used for decoration, identification or to show political affiliation, etc.",
                  "examples": [
                    "Synonyms: lapel pin, badge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) Either a scenario in which moving a lesser piece to escape from attack would expose a more valuable piece to being taken instead, or one where moving a piece is impossible as it would place the king in check.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) The flagstick: the flag-bearing pole which marks the location of a hole",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) The spot at the exact centre of the house (the target area)",
                  "examples": [
                    "The shot landed right on the pin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archery) The spot at the exact centre of the target, originally a literal pin that fastened the target in place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A mood, a state of being.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of a row of pegs in the side of an ancient drinking cup to mark how much each person should drink.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, obsolete) Caligo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing of small value; a trifle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A peg in musical instruments for increasing or relaxing the tension of the strings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A short shaft, sometimes forming a bolt, a part of which serves as a journal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tenon of a dovetail joint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, brewing) A size of brewery cask, equal to half a firkin, or eighth of a barrel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A pinball machine.",
                  "examples": [
                    "I spent most of my time in the arcade playing pins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(locksmithing) A small cylindrical object which blocks the rotation of a pin-tumbler lock when the incorrect key is inserted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pin (third-person singular simple present pins, present participle pinning, simple past and past participle pinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often followed by a preposition such as \"to\" or \"on\") To fasten or attach (something) with a pin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, usually passive) To cause (a piece) to be in a pin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(wrestling) To pin down (someone).",
                  "examples": [
                    "He pinned his opponent on the mat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To enclose; to confine; to pen; to pound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, graphical user interface, transitive) To attach (an icon, application, message etc.) to another item so that it persists.",
                  "examples": [
                    "Antonym: unpin",
                    "to pin a folder to the taskbar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming, transitive) To fix (an array in memory, a security certificate, etc.) so that it cannot be modified.",
                  "examples": [
                    "Antonym: unpin",
                    "When marshaling data, the interop marshaler can copy or pin the data being marshaled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause an analog gauge to reach the stop pin at the high end of the range.",
                  "examples": [
                    "Synonym: peg"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pin (third-person singular simple present pins, present participle pinning, simple past and past participle pinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of peen",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}