{
  "word": "hummel",
  "etymologies": [
    {
      "description": [
        "Probably from Middle English hamelen (“to maim, mutilate; to cut short”), from Old English hamelian (“to hamstring, mutilate”), from Proto-Germanic *hamalōną, *hamlōną (“to mutilate”), from Proto-Indo-European *kem- (“hornless; mutilated”). Cognate with Dutch hamel (“wether”), English hamble, Low German hommel, hummel (“an animal lacking horns”), humlich, dialectal hommlich (“lacking horns”), Bavarian humlet (“lacking horns”), German hammeln, hämmeln (“to geld”), Icelandic hamla (“to maim, mutilate”).",
        "OxfordDictionaries.com suggests that the “ear of grain with its awns removed” sense preceded the “animal without antlers or horns” sense."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hummel (plural hummels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England, Scotland, also attributive) A stag that has failed to grow antlers; a cow that has not developed horns. [from late 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also attributive) Especially in hummel corn: grain that lacks awns (beards or bristles), or has had its awns removed (barley, oats, etc.).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hummel (third-person singular simple present hummels, present participle hummelling, simple past and past participle hummelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Of an animal: to remove the horns; to poll.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To separate (barley, oats, etc.) from the awns.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}