{
  "word": "bright",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Middle English bright (“giving off much light; of colour or light: brilliant, intense; brightly lit; gleaming, shining; glorious, resplendent; of a person: beautiful, fair, rosy; wonderful; clear; of eyesight: keen; (figuratively) free from sin; enlightened”) [and other forms], from Old English bryht, breht (Northumbrian), a metathetic variant of byrht (Anglian), beorht (West Saxon), berht (“bright, clear”) [and other forms] from Proto-West Germanic *berht, from Proto-Germanic *berhtaz (“bright, shining”), ultimately from Proto-Indo-European *bʰerHǵ- (“to shine, to gleam, whiten”).",
        "The noun is derived from Middle English bright (“brightness, brilliance; daylight; light”), from bright (adjective): see above.",
        "The English word is cognate with Albanian bardhë (“white”), Dutch brecht (in personal names), Icelandic bjartur (“bright”), Lithuanian brekšta (“to dawn”), Middle Irish brafad (“blink of an eye”), Norwegian bjart (“bright, clear, shining”), Persian برازیدن‎ (barâzidan, “to beautify; to befit”), Northern Luri بڵێز‎ (bełız, “blaze”) Russian бре́зжить (brézžitʹ, “to dawn; to flicker faintly, glimmer; (figuratively) of a hope, thought, etc.: to begin to manifest, emerge”), Sanskrit भ्राजते (bhrājate), Scots bricht (“bright”), Welsh berth (“beautiful, fair, fine”) (obsolete)."
      ],
      "adjectives": [
        {
          "description": "bright (comparative brighter, superlative brightest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Emitting much light; visually dazzling; luminous, lucent, radiant.",
                  "examples": [
                    "The sky was remarkably bright and blue on that beautiful summer day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of light: brilliant, intense.",
                  "examples": [
                    "Could you please dim the light? It’s far too bright."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of an object, surface, etc.: reflecting much light; having a high lustre; gleaming, shiny.",
                  "examples": [
                    "Synonyms: lustrous; see also Thesaurus:shiny",
                    "Antonym: dull"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a place: not dark; well-lit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of climate or weather: not cloudy or gloomy; fair; also, of a period of time, the sky, etc.: characterized by much sunshine and good weather.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Clearly apparent; conspicuous.",
                  "examples": []
                },
                {
                  "meaning": "Of a colour: not muted or pale; bold, brilliant, vivid.",
                  "examples": []
                },
                {
                  "meaning": "Of an object, surface, etc.: having vivid colour(s); colourful.",
                  "examples": [
                    "The orange and blue walls of the sitting room were much brighter than the dull grey walls of the kitchen."
                  ]
                },
                {
                  "meaning": "Of a musical instrument, sound, or a voice: clearly audible; clear, resounding, and often high-pitched.",
                  "examples": []
                },
                {
                  "meaning": "Of a room or other place: having acoustic qualities that tend to cause much echoing or reverberation of sound, particularly at high frequencies.",
                  "examples": []
                },
                {
                  "meaning": "Of a scent or taste: not bland or mild; bold, sharp, strong.",
                  "examples": []
                },
                {
                  "meaning": "Of a substance: clear, transparent; also, pure, unadulterated; (specifically) of wine: free of suspended particles; not cloudy; fine.",
                  "examples": []
                },
                {
                  "meaning": "Glorious; illustrious.",
                  "examples": []
                },
                {
                  "meaning": "In good spirits; happy, optimistic.",
                  "examples": [
                    "Synonyms: see Thesaurus:happy",
                    "Antonyms: see Thesaurus:sad",
                    "I woke up today feeling so bright that I decided to have a little dance."
                  ]
                },
                {
                  "meaning": "Of the face or eyes, or a smile: showing happiness or hopefulness; cheerful, lively.",
                  "examples": []
                },
                {
                  "meaning": "Of a person: lively, vivacious.",
                  "examples": []
                },
                {
                  "meaning": "Of a period of history or time: happy, prosperous, successful.",
                  "examples": [
                    "She has a bright future ahead."
                  ]
                },
                {
                  "meaning": "Of an opportunity or outlook: having a reasonable chance of success; favourable, good.",
                  "examples": [
                    "If he trains hard, his chances of winning the competition are bright."
                  ]
                },
                {
                  "meaning": "Of conversation, writing, etc.: imaginative or sparkling with wit; clever, witty.",
                  "examples": []
                },
                {
                  "meaning": "Having a clear, quick intellect; intelligent.",
                  "examples": [
                    "Synonyms: see Thesaurus:intelligent",
                    "Antonyms: see Thesaurus:stupid",
                    "She’s very bright. She was able to solve the problem without my help."
                  ]
                },
                {
                  "meaning": "(archaic)",
                  "examples": []
                },
                {
                  "meaning": "Of the eyes: able to see clearly; of eyesight: keen, sharp.",
                  "examples": []
                },
                {
                  "meaning": "Manifest to the mind as light is to the eyes; clear, evident, plain.",
                  "examples": []
                },
                {
                  "meaning": "(music) Of a rhythm or tempo: lively, upbeat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metallurgy) Of a metal object or surface: lacking any protective coating or surface treatment for the prevention of corrosion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bright (plural brights)",
          "definitionGroups": [
            {
              "group": "(archaic or literary)",
              "entries": [
                {
                  "meaning": "Brightness, glow.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) Glory, splendour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) Something (especially a product intended for sale) that has vivid colours or a lustrous appearance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person with a naturalistic worldview with no mystical or supernatural elements.",
                  "examples": [
                    "Synonyms: humanist, nonsupernaturalist",
                    "Antonyms: super, supernaturalist",
                    "Hyponym: atheist"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(painting) An artist's brush used in acrylic and oil painting with a long ferrule and a flat, somewhat tapering bristle head.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English brighte (“brightly; (figuratively) brilliantly, lustrously; of colour: boldly, vividly; clearly, distinctly; of voice: loudly”) [and other forms], from Old English breohte, beorhte (West Saxon) [and other forms], ultimately from Proto-Germanic *berhtaz (“bright, shining”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "bright (comparative more bright, superlative most bright)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often literary) In a bright manner; brightly, glowingly, luminously, lustrously.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Referring to colour: with bold or vivid colours; brightly, boldly, vividly.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) Referring to sight, sound, understanding, etc.: clearly, distinctly; brightly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English brighten (“to illuminate; to become light, dawn; (figuratively) to cleanse, purify; to clarify, explain”) [and other forms], from Old English beorhtian (“to brighten, shine; to sound clearly or loudly”) [and other forms], probably from beorht (“bright, clear”, adjective) (see further at etymology 1) + -ian (suffix forming verbs from adjectives and nouns). Later uses of the word are probably also derived from the adjective."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bright (third-person singular simple present brights, present participle brighting, simple past and past participle brighted) (chiefly Britain, dialectal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Often followed by up: to cast light on (someone or something); to brighten, to illuminate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) Often followed by up: to cause (someone or something) to be bright (in various senses); to brighten; specifically, to make (someone or something) energetic, or happy and optimistic.",
                  "examples": [
                    "Synonyms: (to cause to be bright) embrighten, (to make energetic) enliven, delight, gladden, (to make happy) please"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, also figuratively) Often followed by up: to become bright (in various senses); to brighten.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}