{
  "word": "field",
  "etymologies": [
    {
      "description": [
        "From Middle English feeld, feld, from Old English feld, from Proto-Germanic *felþuz, *felþaz, *felþą (“field”), ultimately from Proto-Indo-European *pleh₂- (“field, plain”) or *pleth₂- (“flat”) (with schwebeablaut).",
        "Cognate with Scots feld, feild (“field”), North Frisian fjild (“field”), West Frisian fjild (“field”), Dutch veld (“field”), German Feld (“field”), Swedish fält (“field”). Related also to Old English folde (“earth, land, territory”), Old English folm (“palm of the hand”). More at fold."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "field (plural fields)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "A land area free of woodland, cities, and towns; an area of open country.",
              "entries": [
                {
                  "meaning": "(usually in the plural) The open country near or belonging to a town or city.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wide, open space that is used to grow crops or to hold farm animals, usually enclosed by a fence, hedge or other barrier.",
                  "examples": [
                    "There were some cows grazing in a field.",
                    "A crop circle was made in a corn field."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A region containing a particular mineral.",
                  "examples": [
                    "an oil field; a gold field"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An airfield, airport or air base; especially, one with unpaved runways.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A place where competitive matches are carried out.",
              "entries": [
                {
                  "meaning": "A place where a battle is fought; a battlefield.",
                  "examples": []
                },
                {
                  "meaning": "An area reserved for playing a game or race with one’s physical force.",
                  "examples": [
                    "soccer field",
                    "Substitutes are only allowed onto the field after their boots are checked."
                  ]
                },
                {
                  "meaning": "(baseball, obsolete) The team in a match that throws the ball and tries to catch it when it is hit by the other team (the bat).",
                  "examples": []
                },
                {
                  "meaning": "(baseball) The outfield.",
                  "examples": []
                },
                {
                  "meaning": "A place where competitive matches are carried out with figures, or playing area in a board game or a computer game.",
                  "examples": []
                },
                {
                  "meaning": "A competitive situation, circumstances in which one faces conflicting moves of rivals.",
                  "examples": []
                },
                {
                  "meaning": "(metonymically) All of the competitors in any outdoor contest or trial, or all except the favourites in the betting.",
                  "examples": [
                    "This racehorse is the strongest in a weak field."
                  ]
                }
              ]
            },
            {
              "group": "Any of various figurative meanings, often dead metaphors.",
              "entries": [
                {
                  "meaning": "(physics) A physical phenomenon (such as force, potential or fluid velocity) that pervades a region; a mathematical model of such a phenomenon that associates each point and time with a scalar, vector or tensor quantity.",
                  "examples": [
                    "magnetic field; gravitational field; scalar field"
                  ]
                },
                {
                  "meaning": "Any of certain structures serving cognition.",
                  "examples": [
                    "field of view"
                  ]
                },
                {
                  "meaning": "The extent of a given perception.",
                  "examples": [
                    "field of view"
                  ]
                },
                {
                  "meaning": "A realm of practical, direct or natural operation, contrasted with an office, classroom, or laboratory.",
                  "examples": [
                    "The design needs to be field-tested before we commit to manufacture.",
                    "Field work traditionally distinguishes true archaeologists from armchair archaeologists.",
                    "He needs some time in the field before his judgment can be trusted."
                  ]
                },
                {
                  "meaning": "A domain of study, knowledge or practice.",
                  "examples": [
                    "He was an expert in the field of Chinese history."
                  ]
                },
                {
                  "meaning": "An unrestricted or favourable opportunity for action, operation, or achievement.",
                  "examples": []
                },
                {
                  "meaning": "(algebra) A commutative ring satisfying the field axioms.",
                  "examples": [
                    "The set of rational numbers, \n  \n    \n      \n        \n          Q\n        \n      \n    \n    {\\displaystyle \\mathbb {Q} }\n  \n, is the prototypical field."
                  ]
                },
                {
                  "meaning": "A physical or virtual location for the input of information in the form of symbols.",
                  "examples": [
                    "The form has fields for each element of the customer's home address and shipping address."
                  ]
                },
                {
                  "meaning": "(heraldry) The background of the shield.",
                  "examples": []
                },
                {
                  "meaning": "(vexillology) The background of the flag.",
                  "examples": []
                },
                {
                  "meaning": "The part of a coin left unoccupied by the main device.",
                  "examples": []
                },
                {
                  "meaning": "A section of a form which is supposed to be filled with data.",
                  "examples": [
                    "The form has fields for each element of the customer's home address and shipping address."
                  ]
                },
                {
                  "meaning": "A component of a database in which a single unit of information is stored.",
                  "examples": []
                },
                {
                  "meaning": "(computing, object-oriented programming) An area of memory or storage reserved for a particular value, subject to virtual access controls.",
                  "examples": []
                },
                {
                  "meaning": "(electronics, film, animation) Part (usually one half) of a frame in an interlaced signal",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) Archaic form of fielder.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "field (third-person singular simple present fields, present participle fielding, simple past and past participle fielded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports) To intercept or catch (a ball) and play it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, baseball, softball, cricket, and other batting sports) To be the team catching and throwing the ball, as opposed to hitting it.",
                  "examples": [
                    "The blue team are fielding first, while the reds are batting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports) To place (a team, its players, etc.) in a game.",
                  "examples": [
                    "The away team fielded two new players and the second-choice goalkeeper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To answer; to address.",
                  "examples": [
                    "She will field questions immediately after her presentation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To defeat.",
                  "examples": [
                    "They fielded a fearsome army."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To execute research (in the field).",
                  "examples": [
                    "He fielded the marketing survey about the upcoming product."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To deploy in the field.",
                  "examples": [
                    "to field a new land-mine detector"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}