{
  "word": "objective",
  "etymologies": [
    {
      "description": [
        "Borrowed from French objectif, from Latin objectivus."
      ],
      "adjectives": [
        {
          "description": "objective (comparative more objective, superlative most objective)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to a material object, actual existence or reality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not influenced by the emotions or prejudices.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Based on observed facts; without subjective assessment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Of, or relating to a noun or pronoun used as the object of a verb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, grammar) Of, or relating to verbal conjugation that indicates the object (patient) of an action. (In linguistic descriptions of Tundra Nenets, among others.)",
                  "examples": [
                    "The general finite stem is the verbal stem which serves as the basis of inflection in the indicative present and past in the subjective conjugation and the objective conjugation with the singular and dual object."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "objective (plural objectives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A material object that physically exists.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A goal that is striven for.",
                  "examples": [
                    "Objectives are the stepping stones which guide you to achieving your goals. They must be verifiable in some way, whether thatʼs statistically – ‘the more I do this, the better I get at itʼ – or by some other achievable concept such as getting the job or relationship that you want. Itʼs crucial that your objectives lead you logically towards your goal and are quantifiable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The objective case.",
                  "examples": [
                    "Synonyms: object case, objective case"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) a noun or pronoun in the objective case.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lens or lenses of a camera, microscope, or other optical device closest to the object being examined.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}