{
  "word": "patch",
  "etymologies": [
    {
      "description": [
        "From Middle English patche, pacche, of uncertain origin. Perhaps an alteration of earlier Middle English placche (“patch, spot, piece of cloth”), from Old English *plæċċ, *pleċċ (“a spot, mark, patch”), from Proto-West Germanic *plakkju, from Proto-Germanic *plakjō (“spot, stain”). For the loss of l compare pat from Middle English platten. Germanic cognates would then include Middle English plecke, dialectal English pleck (“plot of ground, patch”), West Frisian plak (“place, spot”), Low German Plakk, Plakke (“spot, piece, patch”), Dutch plek (“spot, place, stain, patch”), Dutch plak (“piece, slab”), Swedish plagg (“garment”), Faroese plagg (“cloth, rag”).",
        "Or, possibly a variant of Old French pieche, dialectal variant of piece (“piece”). Compare also Old Occitan petaç (“patch”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "patch (plural patches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of cloth, or other suitable material, sewed or otherwise fixed upon a garment to repair or strengthen it, especially upon an old garment to cover a hole.",
                  "examples": [
                    "His sleeves had patches on the elbows where different fabric had been sewn on to replace material that had worn away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small piece of anything used to repair damage or a breach; as, a patch on a kettle, a roof, etc.",
                  "examples": [
                    "I can't afford to replace the roof, which is what it really needs. I'll have the roofer apply a patch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of any size, used to repair something for a temporary period only, or that it is temporary because it is not meant to last long or will be removed as soon as a proper repair can be made, which will happen in the near future.",
                  "examples": [
                    "Before you can fix a dam, you have to apply a patch to the hole so that everything can dry off.",
                    "\"This patch should hold until you reach the city,\" the mechanic said as he patted the car's hood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, usually contrasting but always somehow different or distinct, part of something else (location, time, size)",
                  "examples": [
                    "The world economy had a rough patch in the 1930s.",
                    "To me, a normal cow is white with black patches, but Sarah's from Texas and most of the cows there have solid brown, black, or red coats.",
                    "Doesn't that patch of clouds looks like a bunny?",
                    "When ice skating, be sure to stay away from reeds: there are always thin patches of ice there, and you could fall through."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically) A small area, a small plot of land or piece of ground.",
                  "examples": [
                    "Scattered patches of trees or growing corn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A local region of professional responsibility.",
                  "examples": [
                    "[…]  formed a contact with a man, who was the secretary of the tenants' association of a small housing estate in the social worker's patch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A small piece of black silk stuck on the face or neck to heighten beauty by contrast, worn by ladies in the 17th and 18th centuries; an imitation beauty mark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A piece of material used to cover a wound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An adhesive piece of material, impregnated with a drug, which is worn on the skin, the drug being slowly absorbed over a period of time.",
                  "examples": [
                    "Many people use a nicotine patch to wean themselves off of nicotine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A cover worn over a damaged eye, an eyepatch.",
                  "examples": [
                    "He had scratched his cornea so badly that his doctor told him to wear a patch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A block on the muzzle of a gun, to do away with the effect of dispart, in sighting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A patch file, a file that describes changes to be made to a computer file or files, usually changes made to a computer program that fix a programming bug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) A small piece of material that is manually passed through a gun barrel to clean it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) A piece of greased cloth or leather used as wrapping for a rifle ball, to make it fit the bore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often patch cable, patch cord, etc.; see also patch panel) A cable connecting two pieces of electrical equipment.",
                  "examples": [
                    "soundboard patch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A sound setting for a musical synthesizer (originally selected by means of a patch cable).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) An overlay used to obtain a stronger impression.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "patch (third-person singular simple present patches, present participle patching, simple past and past participle patched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mend by sewing on a piece or pieces of cloth, leather, or the like",
                  "examples": [
                    "My coat needs patching."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mend with pieces; to repair by fastening pieces on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make out of pieces or patches, like a quilt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To join or unite the pieces of; to patch the skirt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To employ a temporary, removable electronic connection, as one between two components in a communications system.",
                  "examples": [
                    "[the control panel of hovercraft The Logos has lit up after being jumped by The Hammer]Sparky: She lives again.Crew member of The Hammer via radio: You want us to patch an uplink to reload the software, Sparky?Sparky: Yeah, that'd be swell. And can you clean the windshield while you're at it?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(generally with the particle \"up\") To repair or arrange in a hasty or clumsy manner",
                  "examples": [
                    "The truce between the two countries has been patched up."
                  ]
                }
              ]
            },
            {
              "group": "(computing) To make the changes a patch describes; to apply a patch to the files in question. Hence:",
              "entries": [
                {
                  "meaning": "To fix or improve a computer program without a complete upgrade.",
                  "examples": []
                },
                {
                  "meaning": "To make a quick and possibly temporary change to a program.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To connect two pieces of electrical equipment using a cable.",
                  "examples": [
                    "I'll need to patch the preamp output to the mixer."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Perhaps borrowed from Italian pazzo or paggio; the form influenced by folk etymological association with patch (Etymology 1)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "patch (plural patches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A paltry fellow; a rogue; a ninny; a fool.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}