{
  "word": "amaze",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English *amasen, amase (“to bewilder, perplex”) (attested chiefly in the past participle form, and thus often difficult to distinguish from amased (adjective)), from Old English āmasian (“to confuse, astonish”), from ā- (perfective prefix) + *masian (“to confound, confuse, perplex; to amaze”) (possibly ultimately from Proto-Indo-European *(s)meh₂- (“to beckon, signal”)). The English word is analysable as a- (intensifying prefix) +‎ maze (“(archaic) to astonish, amaze, bewilder; to daze, stupefy”).",
        "The noun is derived from Late Middle English amase, from the verb: see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "amaze (countable and uncountable, plural amazes)",
          "definitionGroups": [
            {
              "group": "(archaic)",
              "entries": [
                {
                  "meaning": "(except poetic, uncountable) Amazement, astonishment; (countable) an instance of this. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) Fear, terror. [from 16th c.]",
                  "examples": [
                    "Synonym: (obsolete) amazement"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) Stupefaction of the mind; bewilderment; (countable) an instance of this. [15th–19th]",
                  "examples": [
                    "Synonym: (obsolete) amazement"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "amaze (third-person singular simple present amazes, present participle amazing, simple past and past participle amazed)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To fill (someone) with surprise and wonder; to astonish, to astound, to surprise. [from 16th c.]",
                  "examples": [
                    "He was amazed when he found that the girl was a robot."
                  ]
                },
                {
                  "meaning": "(obsolete) To stun or stupefy (someone). [Old English–18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, also reflexive) To bewilder or perplex (someone or oneself). [16th–17th]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, poetic) To fill (someone) with panic; to panic, to terrify. [16th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To experience amazement; to be astounded. [from 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}