{
  "word": "emporium",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin emporium (“trading station; business district in a city; market town”), from Ancient Greek ἐμπόριον (empórion, “factory, trading station; market”), from ἔμπορος (émporos, “merchant, trader; traveller”) + -ιον (-ion, suffix forming nouns). ἔμπορος is derived from ἐμ- (em-) (variant of ἐν- (en-, prefix meaning ‘in; within’)) + πόρος (póros, “journey; passageway”) (ultimately from Proto-Indo-European *per- (“to go through; to carry forth”)), modelled after ἐν πόρῳ (en pórōi, “at sea; en route”).",
        "Sense 4 (“the brain”) alludes to the organ as the place where many nerves or nerve impulses meet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "emporium (plural emporiums or emporia)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) A city or region which is a major trading centre; also, a place within a city for commerce and trading; a marketplace.",
                  "examples": [
                    "Ning-po, which is situated a short distance westward of Chusan, is the principal emporium of Che-keang province."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) A shop that offers a wide variety of goods for sale; a department store; (with a descriptive word) a shop specializing in particular goods.",
                  "examples": [
                    "With a name like “The Wine and Spirits Emporium”, no wonder the prices are so high."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A business set up to enable foreign traders to engage in commerce in a country; a factory (now the more common term).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, obsolete) The brain.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}