{
  "word": "people",
  "etymologies": [
    {
      "description": [
        "From Middle English puple, peple, peeple, from Anglo-Norman people, from Old French pueple, peuple, pople, from Latin populus (“a people, nation”), from Old Latin populus, from earlier poplus, from even earlier poplos, from Proto-Italic *poplos (“army”) of unknown origin. Gradually ousted native English lede and, partially, folk.",
        "Originally a singular noun (e.g. The people is hungry, and weary, and thirsty, in the wilderness –2 Samuel 17:29, King James Version, spelling modernized), the plural aspect of people is probably due to influence from Middle English lede, leed, a plural since Old English times; see lēode."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "people (countable and uncountable, plural peoples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used as plural of person; a body of human beings considered generally or collectively; a group of two or more persons.",
                  "examples": [
                    "Synonyms: (slang) peeps, lede, leod",
                    "There were so many people at the restaurant last night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Persons forming or belonging to a particular group, such as a nation, class, ethnic group, country, family, etc.",
                  "examples": [
                    "Synonyms: collective, community, congregation, folk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of persons regarded as being employees, followers, companions or subjects of a ruler.",
                  "examples": [
                    "Synonyms: fans, groupies, supporters"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's colleagues or employees.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person's ancestors, relatives or family.",
                  "examples": [
                    "Synonyms: kin, kith, folks",
                    "My people lived through the Black Plague and the Thirty Years War."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The mass of a community as distinguished from a special class (elite); the commonalty; the populace; the vulgar; the common crowd; the citizens.",
                  "examples": [
                    "Synonyms: populace, commoners, citizenry"
                  ]
                }
              ]
            }
          ]
        },
        {
          "description": "people",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "plural of person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "people (third-person singular simple present peoples, present participle peopling, simple past and past participle peopled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stock with people or inhabitants; to fill as with people; to populate.",
                  "examples": [
                    "He would not be alone, who all things can; / But peopled Heav'n with Angels, Earth with Man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become populous or populated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To inhabit; to occupy; to populate.",
                  "examples": [
                    "[…]  / As thick and numberless / As the gay motes that people the Sun Beams, /  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, informal) To interact with people; to socialize.",
                  "examples": [
                    "My head tilted as Calvin said, \"Don't worry about him. He just doesn't people well.",
                    "The fuck? I people. Sometimes. With people I know."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}