{
  "word": "couch",
  "etymologies": [
    {
      "description": [
        "From Middle English couche, cowche, from Old French couche, from the verb (see below). Doublet of cwtch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "couch (plural couches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, Australia, Ireland) An item of furniture, often upholstered, for the comfortable seating of more than one person; a sofa.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bed, a resting-place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The den of an otter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, painting and gilding) A preliminary layer, as of colour or size.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(brewing) A mass of steeped barley spread upon a floor to germinate, in malting; or the floor occupied by the barley.",
                  "examples": [
                    "a couch of malt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metonymically, usually as \"the couch\") Psychotherapy.",
                  "examples": [
                    "He spent years on the couch going over his traumatic childhood."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English couchen, from Old French (se) couchier, (se) colchier (“go to bed, lay down”), from Latin collocāre (“set in place”), from com- (“together, with”) + locāre. Doublet of collocate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "couch (third-person singular simple present couches, present participle couching, simple past and past participle couched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lie down; to recline (upon a couch or other place of repose).",
                  "examples": [
                    "Synonyms: lie down, recline"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bend the body, as in reverence, pain, labor, etc.; to stoop; to crouch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lay something upon a bed or other resting place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To arrange or dispose as if in a bed.",
                  "examples": [
                    "[T]he Sea and the Land make one Globe, and the waters couch themſelves, as cloſe as may be, to the Center of this Globe in a Spherical convexity; ſo that if all the Mountains and Hills were ſcal'd, and the Earth made even, the Waters would not overflow its ſmooth ſurface;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lay or deposit in a bed or layer; to bed.",
                  "examples": [
                    "It is, at this Day, in uſe, in Gaza, to couch Pot-Sheards or Veſſels of Earth, in their Walls, to gather the Wind from the top, and to paſſe it downe in Spouts into Roomes. It is a Device for Freſhneſſe, in great Heats;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lower (a spear or lance) to the position of attack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ophthalmology, transitive) In the treatment of a cataract in the eye, to displace the opaque lens with a sharp object such as a needle. The technique is regarded as largely obsolete.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(paper-making, transitive) To transfer (for example, sheets of partly dried pulp) from the wire mould to a felt blanket for further drying.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sewing, transitive) To attach a thread onto fabric with small stitches in order to add texture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To phrase in a particular style; to use specific wording for.",
                  "examples": [
                    "Synonyms: explain, express, phrase, term",
                    "He couched it as a request, but it was an order."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To lie down for concealment; to conceal, to hide; to be concealed; to be included or involved darkly or secretly.",
                  "examples": [
                    "[…]  Or who, regardless of the powers of calumny that keep their state as ministers of vengeance around the throne of ancient Prejudice, explores anew the half-hidden, half-revealed wonders, that yet couch beneath the words of the Scripture?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From quitch, from Old English cwice."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "couch (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Couch grass, a species of persistent grass, Elymus repens, usually considered a weed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}