{
  "word": "office",
  "etymologies": [
    {
      "description": [
        "From Middle English office, from Old French office, from Latin officium (“personal, official, or moral duty; official position; function; ceremony, esp. last rites”), contracted from opificium (“construction: the act of building or the thing built”), from opifex (“doer of work, craftsman”) + -ium (“-y: forming actions”), from op- (“base of opus: work”) + -i- (“connective”) + -fex (“combining form of facere: to do, to make”).",
        "Use in reference to office software is a genericization of various proprietary program suites, such as Microsoft Office."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "office (plural offices)",
          "definitionGroups": [
            {
              "group": "(religion) A ceremonial duty or service, particularly:",
              "entries": [
                {
                  "meaning": "(Christianity) The authorized form of ceremonial worship of a church.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) Any special liturgy, as the Office for the Dead or of the Virgin.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A daily service without the eucharist.",
                  "examples": []
                },
                {
                  "meaning": "(Catholicism) The daily service of the breviary, the liturgy for each canonical hour, including psalms, collects, and lessons.",
                  "examples": [
                    "In the Latin rite, all bishops, priests, and transitional deacons are obliged to recite the Divine Office daily."
                  ]
                },
                {
                  "meaning": "(Protestant) Various prayers used with modification as a morning or evening service.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) Last rites.",
                  "examples": [
                    "To show their loue in this last office doneTo a dead friend."
                  ]
                },
                {
                  "meaning": "(Christianity, obsolete) Mass, (particularly) the introit sung at its beginning.",
                  "examples": [
                    "The office, or Introite, (as they call it)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A position of responsibility.",
                  "examples": [
                    "When the office of Secretary of State is vacant, its duties fall upon an official within the department."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Official position, particularly high employment within government; tenure in such a position.",
                  "examples": [
                    "She held office as secretary of state until she left office to run for office."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A duty, particularly owing to one's position or station; a charge, trust, or role; (obsolete, rare) moral duty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Function: anything typically done by or expected of something.",
                  "examples": [
                    "These ‘Pacific boom-lateens’... are believed to derive from a kind of sprit-sail... in which the upper sprit performs the office of a more or less aft-raking mast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now usually in plural) A service, a kindness.",
                  "examples": [
                    "The secretary prevailed at the negotiations through the good offices of the Freedonian ambassador."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, slang) Inside information.",
                  "examples": [
                    "Giving the office—is when you suffer any person, who may stand behind your chair, to look over your hand."
                  ]
                }
              ]
            },
            {
              "group": "A room, set of rooms, or building used for non-manual work, particularly:",
              "entries": [
                {
                  "meaning": "A room, set of rooms, or building used for administration and bookkeeping.",
                  "examples": []
                },
                {
                  "meaning": "A room, set of rooms, or building used for selling services or tickets to the public.",
                  "examples": [
                    "There will be some of the family waiting for you at the coach-office."
                  ]
                },
                {
                  "meaning": "(chiefly US, medicine) A room, set of rooms, or building used for consultation and diagnosis, but not surgery or other major procedures.",
                  "examples": [
                    "This one was made out at a private office—Office is American for Surgery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The staff of such places.",
                  "examples": [
                    "The whole office was there... well, except you, of course."
                  ]
                }
              ]
            },
            {
              "group": "(figuratively, in large organizations) The administrative departments housed in such places, particularly:",
              "entries": [
                {
                  "meaning": "(UK, Australia, usually capitalized, with clarifying modifier) A ministry or other department of government.",
                  "examples": [
                    "The secretary of state's British colleague heads the Foreign and Commonwealth Office."
                  ]
                },
                {
                  "meaning": "(Catholicism, usually capitalized) Short for Holy Office: the court of final appeal in cases of heresy.",
                  "examples": [
                    "A Biscayner is capable to be a Cavalier of any of the three habits without any scrutiny to be made of the Office, whether he be, limpio de la sangre de los Moros, that is cleare of the bloud of the Moores or no."
                  ]
                },
                {
                  "meaning": "A particular place of business of a larger white-collar business.",
                  "examples": [
                    "He worked as the receptionist at the Akron office."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now in the plural, dated) The parts of a house or estate devoted to manual work and storage, as the kitchen, scullery, laundry, stables, etc., particularly (euphemistic, dated) a house or estate's facilities for urination and defecation: outhouses or lavatories.",
                  "examples": [
                    "As for the Offices, let them stand at some Distance from the House, with some low covered Galleries, to pass from them to the Palace it self."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK law, historical) Clipping of inquest of office: an inquest undertaken on occasions when the Crown claimed the right of possession to land or property.",
                  "examples": [
                    "If they find the treason or felony... of the party accused... the king is thereupon, by virtue of this office found, intitled to have his forfeitures."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A piece of land used for hunting; the area of land overseen by a gamekeeper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, slang, obsolete) A hangout: a place where one is normally found.",
                  "examples": [
                    "His Office, any Man's ordinary Haunt, or Plying-place, be it Tavern, Ale-house, Gaming-house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK military slang, dated) A plane's cockpit, particularly an observer's cockpit.",
                  "examples": [
                    "I withdraw into ‘the office’, otherwise the observer's cockpit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A collection of business software typically including a word processor and spreadsheet and slideshow programs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An official or group of officials; (figuratively) a personification of officeholders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A bodily function, (particularly) urination and defecation; an act of urination or defecation.",
                  "examples": [
                    "Washing themselves, as they doe also after the offices of Nature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The performance of a duty; an instance of performing a duty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "office (third-person singular simple present offices, present participle officing, simple past and past participle officed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To provide (someone) with an office.",
                  "examples": [
                    "Is he officed in Congressional Relations or is he officed in SCA?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have an office.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}