{
  "word": "sharpie",
  "etymologies": [
    {
      "description": [
        "From sharp +‎ -ie (“diminutive suffix”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sharpie (plural sharpies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An alert person.",
                  "examples": [
                    "Eunice Marshall asked in a bored tone, \"Are you, by any chance, selling magazines?\"Daisy grinned childishly, enjoying Eunice's mistake. \"You're quite a sharpie, aren't you, ma'am? You figured me out a whole lot faster than most people do.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, regional) A knowledgeable fisherman.",
                  "examples": [
                    "Eventually DeBlasio became a sharpie.",
                    "In New York and New Jersey coastal fishing parlance a “sharpie” is one who fishes seven days a week all summer long, selling his fish to the market to make a living. Sharpies supposedly have fishing down to a science, to such a degree that they only go to particular places, at particular times, using particular fishing methods, and come back with a boatload of fish while everyone else wonders in amazement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A swindler.",
                  "examples": [
                    "Three booths down a couple of sharpies were selling each other pieces of Twentieth Century Fox, using double arm gestures instead of money."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A long, narrow fishing boat used in shallow waters.",
                  "examples": [
                    "He brought this pair of sharpies, the Lucia and the Ella, to Beaufort by schooner and began to use them for fishing, oyster dredging, and even as a passenger ferry and party boat.",
                    "The sharpie is a flat-bottomed, shallow-draft vessel of moderate size, comparable to a sloop or schooner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(birdwatching) Clipping of sharp-shinned hawk.",
                  "examples": [
                    "It is harder to gauge the shorter tail of sharpies, but on sitting birds the tail shape is a more useful character than it is on flying birds. Sharpies of all ages and sexes almost always show a notched tail when they are sitting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A member of a violent, fashionably dressed youth gang of the 1960s and 1970s.",
                  "examples": [
                    "Synonym: sharp"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Sharpie or other brand of felt-tipped marker pen.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}