{
  "word": "staunch",
  "etymologies": [
    {
      "description": [
        "From Middle English staunch, staunche (“(adjective) in good condition or repair; solidly made, firm; watertight; of a person or wound: not bleeding; certain; intact; (adverb) firmly, soundly”) [and other forms], from Anglo-Norman estaunche, Old French estanche (“firm; watertight”) (modern French étanche (“airtight; watertight”)), a variant of estanc (“a pond”), from estanchier (“to stop the flow of a liquid (blood, water, etc.); to make (something) watertight; to quench (thirst)”) (modern French étancher), possibly from one of the following:"
      ],
      "adjectives": [
        {
          "description": "staunch (comparative stauncher, superlative staunchest)",
          "definitionGroups": [
            {
              "group": "Not permitting water or some other liquid to escape or penetrate; watertight.",
              "entries": [
                {
                  "meaning": "(by extension) Impermeable to air or other gases; airtight.",
                  "examples": [
                    "Synonym: hermetically sealed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Strongly built; also, in good or strong condition.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Staying true to one's aims or principles; firm, resolute, unswerving.",
                  "examples": [
                    "Synonyms: constant, determined, persistent, steadfast, unwavering, unyielding",
                    "Without our staunch front line the enemy would have split the regiment."
                  ]
                },
                {
                  "meaning": "Dependable, loyal, reliable, trustworthy.",
                  "examples": [
                    "He’s been a staunch supporter of mine through every election."
                  ]
                },
                {
                  "meaning": "(chiefly hunting) Of a hunting dog: that can be depended on to pick up the scent of, or to mark, game.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Cautious, restrained.",
                  "examples": [
                    "Synonym: guarded"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English staunchen, staunche (“to stop the flow of blood, diarrhoea, or other bodily fluids; to alleviate, ease; to appease, assuage, satisfy; to cure; to overcome; to put an end to; to repress, suppress; of a river or stream: to stop flowing; of waters, wind, or weather: to become calm, subside; to extinguish or put out (a fire)”) [and other forms], from Anglo-Norman estauncher, estaunchier, estanger, Old French estancher, estanchier (verb) [and other forms]; see further at etymology 1 and at stanch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "staunch (third-person singular simple present staunches, present participle staunching, simple past and past participle staunched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of stanch",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Either:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "staunch (plural staunches)",
          "definitionGroups": [
            {
              "group": "(obsolete) That which stanches or checks a flow.",
              "entries": [
                {
                  "meaning": "(specifically, archaic) A plant or substance which stops the flow of blood; a styptic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An act of stanching or stopping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) Synonym of afterdamp (“suffocating gases present in a coal mine after an explosion caused by firedamp”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See stanch (etymology 4)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "staunch (plural staunches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of stanch (“a floodgate by which water is accumulated, for floating a boat over a shallow part of a stream by its release; also, a dam or lock in a river”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}