{
  "word": "assoil",
  "etymologies": [
    {
      "description": [
        "From Middle English assoilen (“to absolve (someone) of sin; to release (someone) from bonds of sin, hell, or purgatory; to absolve (a sin); to free (a country or someone) from an ecclesiastical offence or excommunication; to free (someone) from a criminal charge or sentence; to release (someone) from an obligation; to discharge (someone) from office; to exempt (someone) from service; to release (someone) from medical treatment; to answer (a question); to explain or solve (a problem, riddle, etc.); to fulfil (a promise); to disprove or refute (an argument)”) [and other forms], from Anglo-Norman as(s)oiler, as(s)oilier, and Old French as(s)oille [and other forms], the present subjunctive, and as(s)oil, the present indicative, of as(s)oldre, as(s)oudre (“to absolve from blame”) (modern French absoudre), from Latin absoluere, the present active infinitive of absoluō, a variant of absolvō (“to detach, loosen, untie; to liberate; (figuratively) to complete, finish; to pay off; (law) to declare innocent, absolve, acquit”), from ab- (prefix meaning ‘away, away from, from’) + solvō (“to loosen, undo, untie; to free up; to acquit; to exempt; to release”) (from sē- (“prefix meaning ‘apart; aside; away’”) + luō (“to wash; to cleanse; to purge”) (ultimately from Proto-Indo-European *lewh₃- (“to wash”))). Doublet of absolve and assoilzie."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "assoil (third-person singular simple present assoils, present participle assoiling, simple past and past participle assoiled) (transitive)",
          "definitionGroups": [
            {
              "group": "(archaic)",
              "entries": [
                {
                  "meaning": "To absolve or release (someone) from blame or sin; to forgive, to pardon.",
                  "examples": [
                    "Synonym: (Scotland) assoilze"
                  ]
                },
                {
                  "meaning": "To atone or expiate for (something).",
                  "examples": []
                },
                {
                  "meaning": "(law) Followed by from or of: to acquit (someone) from a criminal charge; to find (someone) not guilty; to clear.",
                  "examples": [
                    "Synonym: (Scotland, law) assoilze"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or obsolete) Followed by from or of: to release or set free (someone) from a liability, an obligation, etc.; to discharge.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "To clear up or resolve (a difficulty, doubt, problem, etc.); to absolve, to solve.",
                  "examples": [
                    "Synonyms: (obsolete) soil, (obsolete) soyle"
                  ]
                },
                {
                  "meaning": "To refute (an argument, an objection, etc.).",
                  "examples": []
                },
                {
                  "meaning": "(rare) To discharge (a liability, an obligation, etc.).",
                  "examples": []
                },
                {
                  "meaning": "(rare) To get rid of, put off, or remove (something).",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) To absolve or release (someone) from excommunication or some other religious offence.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from a- (intensifying prefix) or ad- (prefix meaning ‘to, toward’, or indicating an addition or tendency) +‎ soil (“to make dirty”), perhaps influenced by assoil (etymology 1)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "assoil (third-person singular simple present assoils, present participle assoiling, simple past and past participle assoiled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic or obsolete) To make (something) dirty or soiled; to soil; to stain; to sully.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}