{
  "word": "saddle",
  "etymologies": [
    {
      "description": [
        "From Middle English sadel, from Old English sadol, from Proto-West Germanic *sadul, from Proto-Germanic *sadulaz (“saddle”). Further etymology uncertain, perhaps from Proto-Indo-European *sod-dʰlo-, from *sed- (“to sit”) + *-dʰlom (a variant of *-trom (suffix forming nouns denoting instruments or tools)), though the Oxford English Dictionary says this “presents formal difficulties”."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "saddle (plural saddles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "A seat for a rider, typically made of leather and raised in the front and rear, placed on the back of a horse or other animal, and secured by a strap around the animal's body.",
              "entries": [
                {
                  "meaning": "A similar implement used to secure goods to animals; a packsaddle.",
                  "examples": []
                },
                {
                  "meaning": "Synonym of harness saddle (“the part of a harness which supports the weight of poles or shafts attaching a vehicle to a horse or other animal”)",
                  "examples": []
                },
                {
                  "meaning": "A cushion used as a seat in a cart or other vehicle.",
                  "examples": []
                },
                {
                  "meaning": "The immovable seat of a bicycle, motorcycle, or similar vehicle.",
                  "examples": []
                },
                {
                  "meaning": "(by extension)",
                  "examples": [
                    "saddle:"
                  ]
                },
                {
                  "meaning": "Chiefly preceded by the: horse-riding as an activity or occupation.",
                  "examples": []
                },
                {
                  "meaning": "Synonym of saddle brown (“a medium brown colour, like that of saddle leather”)",
                  "examples": [
                    "saddle:"
                  ]
                }
              ]
            },
            {
              "group": "Something resembling a saddle (sense 1) in appearance or shape.",
              "entries": [
                {
                  "meaning": "A low point, in the shape of a saddle, between two hills.",
                  "examples": []
                },
                {
                  "meaning": "A cut of meat that includes both loins and part of the backbone.",
                  "examples": []
                },
                {
                  "meaning": "(construction)",
                  "examples": []
                },
                {
                  "meaning": "A small sloped or tapered structure that helps channel surface water to drains.",
                  "examples": []
                },
                {
                  "meaning": "The raised floorboard in a doorway.",
                  "examples": []
                },
                {
                  "meaning": "(dentistry) The part of a denture which holds the artificial teeth.",
                  "examples": []
                },
                {
                  "meaning": "(engineering) An equipment part, such as a flange, which is hollowed out to fit upon a convex surface and serve as a means of attachment or support.",
                  "examples": []
                },
                {
                  "meaning": "(geology) An anticline (“fold with strata sloping downwards on each side”); specifically, a depression located along the axial trend of such a fold.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Australia, mining) Synonym of saddle reef (“a saddle-shaped bedded mineral (usually gold-bearing quartz) vein occurring along the crest of an anticline or (less common) a syncline (an inverted saddle)”)",
                  "examples": []
                },
                {
                  "meaning": "(geometry) Synonym of saddle point (“a point in the range of a smooth function, every neighbourhood of which contains points on each side of its tangent plane”)",
                  "examples": []
                },
                {
                  "meaning": "(lutherie)",
                  "examples": []
                },
                {
                  "meaning": "The part of a guitar which supports the strings and, in an acoustic guitar, transfers their vibrations through the bridge to the soundboard.",
                  "examples": []
                },
                {
                  "meaning": "A small object (traditionally made of ebony) at the bottom of a string instrument such as a cello, viola, or violin below the tailpiece on which the tailgut (“cord securing the tailpiece to the instrument”) rests.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) A block of wood with concave depressions at the top and bottom, usually fastened to one spar and shaped to receive the end of another.",
                  "examples": []
                },
                {
                  "meaning": "(zoology)",
                  "examples": []
                },
                {
                  "meaning": "The clitellum of an earthworm (family Lumbricidae).",
                  "examples": []
                },
                {
                  "meaning": "The lower part of the back of a domestic fowl, especially a male bird, bearing the saddle feathers or saddle hackles.",
                  "examples": []
                },
                {
                  "meaning": "In full saddle marking or saddle patch: a saddle-like marking on an animal, such as one on the back of an adult harp seal or saddleback seal (Pagophilus groenlandicus), or any of numerous such markings on a boa constrictor (Boa constrictor).",
                  "examples": []
                },
                {
                  "meaning": "(originally and chiefly Canada, US)",
                  "examples": []
                },
                {
                  "meaning": "A piece of leather stitched across the instep of a shoe, usually having a different colour from the rest of the shoe.",
                  "examples": []
                },
                {
                  "meaning": "Synonym of saddle oxford or saddle shoe (“a shoe, resembling an oxford, which has a saddle (sense 11.1)”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English sadelen (“to put a saddle on (an animal), to saddle”) [and other forms], from Old English sadolian, sadelian, sadilian (“to saddle”), from Proto-Germanic *sadulōną (“to saddle”), from *sadulaz (“a saddle”, noun) (see further at etymology 1) + *-ōną (suffix forming denominative verbs from nouns)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "saddle (third-person singular simple present saddles, present participle saddling, simple past and past participle saddled)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To put a saddle (noun sense 1) on (an animal).",
                  "examples": []
                },
                {
                  "meaning": "To put (something) on to another thing like a saddle on an animal.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": [
                    "He has been saddled with the task of collecting evidence of the theft.",
                    "They went shopping and left me saddled with two children to look after."
                  ]
                },
                {
                  "meaning": "To enter (a trained horse) into a race.",
                  "examples": []
                },
                {
                  "meaning": "(often passive) Chiefly followed by with: to burden or encumber (someone) with some problem or responsibility.",
                  "examples": [
                    "He has been saddled with the task of collecting evidence of the theft.",
                    "They went shopping and left me saddled with two children to look after."
                  ]
                },
                {
                  "meaning": "Chiefly followed by on or upon: to place (a burden or responsibility) or thrust (a problem) on someone.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To control or restrain (someone or something), as if using a saddle; to bridle, to harness, to rein in.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, rare) To get (someone) to do a burdensome task.",
                  "examples": []
                },
                {
                  "meaning": "(woodworking) To cut a saddle-shaped notch in (a log or other piece of wood) so it can fit together with other such logs or pieces; also, to fit (logs or other pieces of wood) together with this method.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To put something on to (another thing) like a saddle on an animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive, chiefly Canada, US) Often followed by up.",
              "entries": [
                {
                  "meaning": "To put a saddle on an animal.",
                  "examples": []
                },
                {
                  "meaning": "Of a person: to get into a saddle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}