{
  "word": "crib",
  "etymologies": [
    {
      "description": [
        "From Middle English crib, cribbe, from Old English crib, cryb, cribb, crybb (“couch, bed; manger, stall”), from Proto-West Germanic *kribbjā, from Proto-Germanic *kribjǭ (“crib, wickerwork”), from Proto-Indo-European *grebʰ-, *gerbʰ- (“bunch, bundle, tuft, clump”), from *ger- (“to turn, twist”).",
        "Cognate with Saterland Frisian Kräbbe, Krääb, Krääf (“crib”), West Frisian krêbe (“crib”), Dutch krib (“crib, manger”), German Krippe (“rack, crib”), Danish krybbe (“crib”), Icelandic krubba (“crib”). Doublet of crèche. The sense of ‘stealing, taking notes, plagiarize’ seems to have developed out of the verb.",
        "The criminal sense may derive from the 'basket' sense, circa the mid 18th century, in that a poacher could conceal poachings in such a basket (see the 1772 Samuel Foote quotation).  The cheating sense probably derives from the criminal sense."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crib (countable and uncountable, plural cribs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A baby’s bed with high, often slatted, often moveable sides, suitable for a child who has outgrown a cradle or bassinet.",
                  "examples": [
                    "Synonym: cot (British and Southern Hemisphere)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A bed for a child older than a baby.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A small sleeping berth in a packet ship or other small vessel",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wicker basket.",
                  "examples": [
                    "Coordinate term: Moses basket"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A manger, a feeding trough for animals elevated off the earth or floor, especially one for fodder such as hay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The baby Jesus and the manger in a creche or nativity scene, consisting of statues of Mary, Joseph and various other characters such as the magi.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bin for drying or storing grain, as with a corn crib.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small room or covered structure, especially one of rough construction, used for storage or penning animals.",
                  "examples": [
                    "Where no oxen are, the crib is clean: but much increase is by the strength of the ox."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A confined space, as with a cage or office-cubicle",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A job, a position; (Britain) an appointment.",
                  "examples": [
                    "but if I have lost my crib and get nothing in exchange I shall feel what a soft Johnny I have been."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hovel, a roughly constructed building best suited to the shelter of animals but used for human habitation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, sometimes African-American Vernacular) One’s residence, house or dwelling place, or usual place of resort.",
                  "examples": [
                    "Why, you would not be boosing till lightman's in a square crib like mine, as if you were in a flash panny?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A boxy structure traditionally built of heavy wooden timbers, to support an existing structure from below, as with a mineshaft or a building being raised off its foundation in preparation for being moved; see cribbing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) A collection of quotes or references for use in speaking, for assembling a written document, or as an aid to a project of some sort; a crib sheet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A minor theft, extortion or embezzlement, with or without criminal intent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cribbage) The card game cribbage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cribbage) The cards discarded by players and used by the dealer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cryptography) A known piece of information corresponding to a section of encrypted text, that is then used to work out the remaining sections.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(southern New Zealand) A small holiday home, often near a beach and of simple construction.",
                  "examples": [
                    "Synonym: bach (northern New Zealand)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly Australia, New Zealand) A snack or packed lunch, especially as taken to work to eat during a break.",
                  "examples": [
                    "He ate a thick square of banana cake from his crib and stared into the fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) A small raft made of timber.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, obsolete, thieves' cant) The stomach.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A literal translation, usually of a work originally in Latin or Ancient Greek.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A cheat sheet or past test used by students; crib sheet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crib (third-person singular simple present cribs, present participle cribbing, simple past and past participle cribbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place or confine in a crib.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shut up or confine in a narrow habitation; to cage; to cramp.",
                  "examples": [
                    "if only the vital energy be not cribbed or cramped"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To collect one or more passages and/or references for use in a speech, written document or as an aid for some task; to create a crib sheet.",
                  "examples": [
                    "I cribbed the recipe from the Food Network site, but made a few changes of my own."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To plagiarize; to copy; to cheat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To install timber supports, as with cribbing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To steal or embezzle, to cheat out of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) To complain, to grumble",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To crowd together, or to be confined, as if in a crib or in narrow accommodations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a horse) To seize the manger or other solid object with the teeth and draw in wind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}