{
  "word": "wag",
  "etymologies": [
    {
      "description": [
        "From Middle English waggen, probably from Old English wagian (“to wag, wave, shake”) with reinforcement from Old Norse vaga (“to wag, waddle”); both from Proto-Germanic *wagōną (“to wag”). Related to English way.",
        "The verb may be regarded as an iterative or emphatic form of waw (verb), which is often nearly synonymous; it was used, e.g., of a loose tooth. Parallel formations from the same root are the Old Norse vagga feminine, cradle (Swedish vagga, Danish vugge), Swedish vagga (“to rock a cradle”), Dutch wagen (“to move”), early modern German waggen (dialectal German wacken) to waver, totter. Compare waggle, verb"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wag (plural wags)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An oscillating movement.",
                  "examples": [
                    "The wag of my dog's tail expresses happiness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A witty person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wag (third-person singular simple present wags, present participle wagging, simple past and past participle wagged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To swing from side to side, such as of an animal's tail, or someone's head, to express disagreement or disbelief.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, slang) To play truant from school.",
                  "examples": [
                    "They had \"wagged it\" from school, as they termed it, which..meant truancy in all its forms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be in action or motion; to move; progress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To go; to depart.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}