{
  "word": "besague",
  "etymologies": [
    {
      "description": [
        "From Middle English besague, besagu, besagew, from Old French besague, whence also English besagew (“rondel, armor protecting the armpit”), related to Latin bisacuta (Italian bisacuto (“double-edged”)) and besogium. Applied, in the Middle Ages, to a variety of medieval weapons or tools with two blades, edges, or faces, especially a double-bladed axe or war-hammer, but also to iron-headed cornuted staffs, clubs, or maces, spades, hoes, mattocks, and even knives."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "besague (plural besagues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of double-bladed axe.",
                  "examples": [
                    "These were clearly different from the besague (an axe with two edges) described in the Glossaries of Meyrick and Carpentier, in v. Besogium."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of martel or war-hammer, with its head(s) shaped like a pick, mattock, or beak.",
                  "examples": [
                    "Under Henry IV. appeared a large martel, or hammer, called the Besague, apparently intended more for throwing than combat. In the reign of Edward IV. are found garnished spears, having a head called a coronal, a vamplate, or ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plate (as of armor) that protects an otherwise-exposed area, such as the armpit (alternative form of besagew), the elbow, or the hand",
                  "examples": [
                    "The points or laces for attaching the besagues are clearly shown. In brasses the attachment is generally shown as a diamond-headed nut, but the attachment by points or laces just as the elbow caps are seen attached in various effigies ..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}