{
  "word": "bangtail",
  "etymologies": [
    {
      "description": [
        "From bang +‎ tail. The primary meaning refers to the sense bang (“fringe of hair cut across the forehead”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bangtail (plural bangtails)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tail of a horse or cow, allowed to grow out and then trimmed horizontally so as to form a tassel; a horse or cow having such a tail.",
                  "examples": [
                    "Two lean, ewe-necked, clipt chestnuts, tucked up in the ribs, with hard work and bad feeding, but with such flowing bang-tails as at once stamped them in the eyes of our friends as “ out-and-out ” thorough-breds—were led up and down by John. […] The bang-tails, no doubt, supposing themselves out for their usual “airing,” put themselves in the regular side-long position, and struck at once into a sort of hectic canter ; a particular movement, peculiar to Brighton bang-tails, and adapted to the most innocent equestrian."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A racehorse.",
                  "examples": [
                    "“Eddie!” whinnied Daley, the distraught worshipper of the bang-tails. “Eddie! Phar Lap is dead!”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A prostitute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marketing) An envelope with a perforated flap on which promotional material is printed; the flap on such an envelope.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bangtail (third-person singular simple present bangtails, present participle bangtailing, simple past and past participle bangtailed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shear off the hair horizontally at the end of a cow or horse's tail.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}