{
  "word": "frown",
  "etymologies": [
    {
      "description": [
        "From Middle English frown, froun (“a threatening appearance; lowering of the clouds”), from frounen (“to frown”). See below."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "frown (plural frowns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wrinkling of the forehead with the eyebrows brought together, typically indicating displeasure, severity, or concentration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) A downturn of the corners of the mouth, typically expressing sadness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English frounen (“to frown as an expression of disapproval, displeasure, shame, fear, or jealousy”), from Old French frognier (“to frown or scowl”), from Gaulish *frognā (“nostril”), from Proto-Celtic *srognā."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "frown (third-person singular simple present frowns, present participle frowning, simple past and past participle frowned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have a frown on one's face.",
                  "examples": [
                    "She frowned when I told her the news."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To manifest displeasure or disapprobation; to look with disfavour or threateningly.",
                  "examples": [
                    "Noisy gossip in the library is frowned upon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To repress or repel by expressing displeasure or disapproval; to rebuke with a look.",
                  "examples": [
                    "Let us frown the impudent fellow into silence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To communicate by frowning.",
                  "examples": [
                    "Frank frowned his displeasure with my proposal."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}