{
  "word": "chew",
  "etymologies": [
    {
      "description": [
        "From Middle English chewen, from Old English ċēowan, from Proto-West Germanic *keuwan, from Proto-Germanic *kewwaną, from Proto-Indo-European *ǵyewh₁-. Cognate with West Frisian kôgje, Low German käwwen, Dutch kauwen, German kauen); also Latin gingīva (“gums”), Tocharian B śuwaṃ (“to eat”), Polish żuć (“to chew”), Persian جویدن‎ (javidan), Pashto ژول‎ (žovạl, “to bite, gnaw”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chew (countable and uncountable, plural chews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of chewing; mastication with the mouth.",
                  "examples": [
                    "I popped the gum into my mouth and gave it a chew."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Level of chewiness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small sweet, such as a taffy, that is eaten by chewing.",
                  "examples": [
                    "Phillip purchased a bag of licorice chews at the drugstore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, uncountable) Chewing tobacco.",
                  "examples": [
                    "The school had banned chew and smokes from the school grounds, even for adults."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable or uncountable) A plug or wad of chewing tobacco; chaw or a chaw.",
                  "examples": [
                    "The ballplayers sat on the bench watching the rain, glumly working their chews.",
                    "The first time he chewed tobacco, he swallowed his chew and got extremely sick."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, informal) The condition of something being torn or ground up mechanically.",
                  "examples": [
                    "Avoiding Tape Chew. In the early days of the ADAT, the \"V\" blocks (two arms that thread the tape around the front of the head) could sometimes get out of alignment and \"chew\" the outside track  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chew (third-person singular simple present chews, present participle chewing, simple past chewed, past participle chewed or (rare) chewn)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To crush with the teeth by repeated closing and opening of the jaws; done to food to soften it and break it down by the action of saliva before it is swallowed.",
                  "examples": [
                    "Make sure to chew thoroughly, and don't talk with your mouth full!",
                    "The steak was tough to chew as it had been cooked too long."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To grind, tear, or otherwise degrade or demolish something with teeth or as with teeth.",
                  "examples": [
                    "He keeps his feed in steel drums to prevent the mice from chewing holes in the feed-sacks.",
                    "The harsh desert wind and sand had chewed the stump into ragged strips of wood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To think about something; to ponder; to chew over.",
                  "examples": [
                    "The professor stood at the blackboard, chalk in hand, and chewed the question the student had asked."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}