{
  "word": "brick",
  "etymologies": [
    {
      "description": [
        "From late Middle English brik, bryke, bricke, from Middle Low German and Middle Dutch bricke (\"cracked or broken brick; tile-stone\"; modern Dutch brik), ultimately related to Proto-West Germanic *brekan (“to break”), whence also Old French briche and French brique (“brick”). Compare also German Low German Brickje (“small board, tray”). Related to break."
      ],
      "adjectives": [
        {
          "description": "brick (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, African-American Vernacular, New York, New England, of weather) Extremely cold.",
                  "examples": [
                    "And while the tropics are definitely the place to be when it's brick outside, rocking a snorkel on the beach only works when you're snorkeling."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "brick (countable and uncountable, plural bricks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A hardened rectangular block of mud, clay etc., used for building.",
                  "examples": [
                    "This wall is made of bricks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Such hardened mud, clay, etc. considered collectively, as a building material.",
                  "examples": [
                    "This house is made of brick."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something shaped like a brick.",
                  "examples": [
                    "a plastic explosive brick"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A helpful and reliable person.",
                  "examples": [
                    "Thanks for helping me wash the car. You're a brick."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball, slang) A shot which misses, particularly one which bounces directly out of the basket because of a too-flat trajectory, as if the ball were a heavier object.",
                  "examples": [
                    "We can't win if we keep throwing up bricks from three-point land."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A power brick; an external power supply consisting of a small box with an integral male power plug and an attached electric cord terminating in another power plug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing slang, figurative) An electronic device, especially a heavy box-shaped one, that has become non-functional or obsolete.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, naval, slang) A projectile.",
                  "examples": [
                    "I was on deck watching the firing, and looking at the direction in which our guns were pointing, it was obvious that it was not going to be Centurion who was going to receive our bricks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) A carton of 500 rimfire cartridges, which forms the approximate size and shape of a brick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) A community card (usually the turn or the river) which does not improve a player's hand.",
                  "examples": [
                    "The two of clubs was a complete brick on the river."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The colour brick red.",
                  "examples": [
                    "brick:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A kilogram of cocaine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brick (third-person singular simple present bricks, present participle bricking, simple past and past participle bricked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To build, line, or form with bricks.",
                  "examples": [
                    "The shaft was next bricked between the decks until the top scaffold was supported by the brickwork and [made] to share the weight with the prids."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make into bricks.",
                  "examples": [
                    "The plant, which is here described, for bricking fine ores and flue dust, was designed and the plans produced in the engineering department of the Selby smelter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To hit someone or something with a brick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing slang) To make an electronic device nonfunctional and usually beyond repair, essentially making it no more useful than a brick.",
                  "examples": [
                    "My VCR was bricked during the lightning storm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To blunder; to screw up.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}