{
  "word": "sheep",
  "etymologies": [
    {
      "description": [
        "From Middle English schep, schepe, from Anglian Old English sċēp, a variant of sċēap, from Proto-West Germanic *skāp, from Proto-Germanic *skēpą (compare West Frisian skiep, North Frisian schäip, Dutch schaap, German Schaf), beside *keppô (compare Old Norse kjappi (“buck”), dialectal German Kippe (“newborn calf”)), of unknown origin. Perhaps from the same Scythian word (compare Ossetian цӕу (cæw, “goat”), Persian چپش‎ (čapiš, “yearling goat”)) which was borrowed into Albanian as cjap, sqap (“buck”) and into Slavic (compare Polish cap). After Kroonen, *skēpą is instead from the root of Proto-Germanic *skabaną (“to scratch”) via Kluge's law."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sheep (countable and uncountable, plural sheep or (nonstandard, mostly humorous) sheeps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A woolly ruminant of the genus Ovis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, strictly) The domestic Ovies aries, the most well known species of Ovis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A timid, shy person who is easily led by others.",
                  "examples": [
                    "Synonyms: lamb, ovine; see also Thesaurus:shy person"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, chiefly Christianity, chiefly plural) A religious adherent, a member of a congregation or religious community (compare flock).",
                  "examples": [
                    "And fools like me, who cross the sea and come to foreign lands / Ask the sheep, for their beliefs do you kill on God's command?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Sheepskin leather.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, speech recognition) A person who is easily understood by a speech recognition system; contrasted with goat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sheep",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly humorous) plural of shoop",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}