{
  "word": "blinker",
  "etymologies": [
    {
      "description": [
        "blink +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blinker (plural blinkers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, US, automotive)  Anything that blinks, such as the turn signal of an automobile.",
                  "examples": [
                    "Synonyms: (Britain, Australia, New Zealand) indicator, (chiefly US) turn signal, directional, directional signal, direction indicator, trafficator, turn indicator"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Eye shields attached to a hood for horses, to prevent them from seeing backwards and partially sideways.",
                  "examples": [
                    "Synonyms: blinder, winker"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Whatever obstructs sight or discernment.",
                  "examples": [
                    "This floor let not the vulgar tread, Who worship only what they dread: Nor bigots who but one way see, Through blinkers of authority"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) The eyelid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A black eye.",
                  "examples": [
                    "The next morning, Jimmy came home with a fat lip and a black eye. Flory rushed over to tend to him. “Ain't nothin'. Just a blinker... had a fight with a guy.  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cellular automata) In Conway's Game of Life, an arrangement of three cells in a row that switches between horizontal and vertical orientations in each generation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blinker (third-person singular simple present blinkers, present participle blinkering, simple past and past participle blinkered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put blinkers on.",
                  "examples": [
                    "The farmer stopped to blinker his horse before riding into an area of heavy traffic."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}