{
  "word": "resonance",
  "etymologies": [
    {
      "description": [
        "From Old French resonance (French résonance), from Latin resonantia (“echo”), from resonō (“I resound”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "resonance (countable and uncountable, plural resonances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The quality of being resonant.",
                  "examples": [
                    "Synonym: resound"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A resonant sound, echo, or reverberation, such as that produced by blowing over the top of a bottle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The sound produced by a hollow body part such as the chest cavity upon auscultation, especially that produced while the patient is speaking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something that evokes an association, or a strong emotion; something that strikes a chord.",
                  "examples": [
                    "emotional resonance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) The increase in the amplitude of an oscillation of a system under the influence of a periodic force whose frequency is close to that of the system's natural frequency.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nuclear physics) A short-lived subatomic particle or state of atomic excitation that results from the collision of atomic particles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An increase in the strength or duration of a musical tone produced by sympathetic vibration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) The property of a compound that can be visualized as having two structures differing only in the distribution of electrons.",
                  "examples": [
                    "Synonym: mesomerism"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A influence of the gravitational forces of one orbiting object on the orbit of another, causing periodic perturbations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) The condition where the inductive and capacitive reactances have equal magnitude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology) A quality of human relationship with the world.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}