{
  "word": "consequence",
  "etymologies": [
    {
      "description": [
        "From Middle English consequence, from Old French consequence , from Latin consequentia. While analysable as con- +‎ sequence, its adjective form has a different origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "consequence (plural consequences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which follows something on which it depends; that which is produced by a cause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A result of actions, especially if such a result is unwanted or unpleasant.",
                  "examples": [
                    "I'm warning you. If you don't get me the report on time, there will be consequences."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A proposition collected from the agreement of other previous propositions; any conclusion which results from reason or argument; inference.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chain of causes and effects; consecution.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Importance with respect to what comes after.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The power to influence or produce an effect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially when preceded by \"of\") Importance, value, or influence.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "consequence (third-person singular simple present consequences, present participle consequencing, simple past and past participle consequenced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To threaten or punish (a child, etc.) with specific consequences for misbehaviour.",
                  "examples": [
                    "The goal of consequencing is to teach the child a lesson that leads to positive choices and behaviors. The goal of punishment is to inflict pain and seek revenge. Angry parenting is punitive and ineffectual."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}