{
  "word": "hydra",
  "etymologies": [
    {
      "description": [
        "After the Hydra, from Greek mythology, which grew two new heads every time one of its heads was cut off. The first sense alludes to the budding method of asexual reproduction that the hydra practices, similar to growing new heads. The second sense refers to how the creature could not be killed by a swift, decisive solution (in contrast to a Gordian knot)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hydra (plural hydras or hydrae or hydræ)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several small freshwater polyps of the genus Hydra and related genera, having a naked cylindrical body and an oral opening surrounded by tentacles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fantasy) A dragon-like creature with many heads and the ability to regrow them when maimed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A complex, multifarious problem or situation that cannot be solved easily and rapidly.",
                  "examples": [
                    "Because the statute is so vaguely worded, award decisions are habitually based on case law, the growing mountain of which is a hydra of rulings that point in so many directions that almost any decision can be defended or overturned on appeal, depending on how smart your lawyer is and which precedent he selects to argue your case."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}