{
  "word": "publican",
  "etymologies": [
    {
      "description": [
        "Probably from public house (“(Britain) bar or tavern, often also selling food and sometimes lodging, pub”) or public (“open to all members of a community”) +‎ -an (suffix forming agent nouns), apparently originally used humorously."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "publican (plural publicans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) The landlord (manager or owner) of a public house (“a bar or tavern, often also selling food and sometimes lodging; a pub”).",
                  "examples": [
                    "Synonyms: (obsolete) ale-draper, alekeep, alekeeper, (Britain) licensed victualler, (Britain) licensee, (Britain, obsolete slang) bung, taverner, tavernkeep, tavernkeeper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, by extension) The manager or owner of a hotel.",
                  "examples": [
                    "Synonym: hotelier"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English publican [and other forms], from Anglo-Norman publican, pupplican, Middle French publicain, and Old French publican, publicain, pupplican (“tax collector”) (modern French publicain), and from their etymon Latin pūblicānus (“tax collector”), from pūblicum (“state revenue”) + -ānus (suffix meaning ‘of or pertaining to’, usually indicating relationships of origin, position, or possession). Pūblicum is a noun use of the neuter form of pūblicus (“of or belonging to the people, state, or community; general, public”), ultimately from Proto-Italic *poplos (“army”), further etymology unknown.",
        "Sense 3.2 (“person excommunicated from the church; person who does not follow a Christian religion”) refers to Matthew 18:17 of the Bible: see the King James Version quotation under sense 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "publican (plural publicans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Rome, historical) A tax collector, especially one working in Judea and Galilee during New Testament times (1st century C.E.) who was generally regarded as sinful for extorting more tax than was due, and as a traitor for serving the Roman Empire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, archaic) Any person who collects customs duties, taxes, tolls, or other forms of public revenue.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively, archaic)",
              "entries": [
                {
                  "meaning": "One regarded as extorting money from others by charging high prices.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A person excommunicated from the church; an excommunicant or excommunicate; also, a person who does not follow a Christian religion; a heathen, a pagan.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}