{
  "word": "placard",
  "etymologies": [
    {
      "description": [
        "From Middle English placard (“official document”), from Middle French placard, placart, plaquart (“a placard, a writing pasted on a wall”), from the Old French verb plaquer, plaquier (“to stick or paste, roughcast”), from Middle Dutch placken, plecken (“to glue or fasten, plaster, patch”), ultimately from Proto-Germanic *plaggą (“a piece of cloth, patch”), equivalent to plaque +‎ -ard.",
        "Related to Middle Low German placken (“to smear with lime or clay, plaster”), Saterland Frisian Plak, Plakke (“a hit, smack, slap”), German Placken (“a spot, patch”), Icelandic plagg (“a document”), Hebrew פלקט‎ (“'plakat' a large sheet of paper, typically with a photo or writing, posted on the wall”), English play. Compare also Modern Dutch plakkaat (“placard”), Saterland Frisian Plakoat (“a placard, poster”). More at play."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "placard (plural placards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sheet of paper or cardboard with a written or printed announcement on one side for display in a public place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A public proclamation; a manifesto or edict issued by authority.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Permission given by authority; a license.",
                  "examples": [
                    "to give a placard to do something"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An extra plate on the lower part of the breastplate or backplate of armour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A kind of stomacher, often adorned with jewels, worn in the fifteenth century and later.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The woodwork and frame of the door of a closet etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "placard (third-person singular simple present placards, present participle placarding, simple past and past participle placarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To affix a placard to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To announce with placards.",
                  "examples": [
                    "to placard a sale"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}