{
  "word": "gallop",
  "etymologies": [
    {
      "description": [
        "From Middle English galopen (“to gallop”), from Old French galoper (compare modern French galoper), from Frankish *wala hlaupan (“to run well”), from *wala (“well”) + *hlaupan (“to run”), from Proto-Germanic *hlaupaną (“to run, leap, spring”), from Proto-Indo-European *klaup-, *klaub- (“to spring, stumble”). Possibly also derived from a deverbal of Frankish *walhlaup (“battle run”) from *wal (“battlefield”) from a Proto-Germanic word meaning \"dead, victim, slain\" from Proto-Indo-European *wel- (“death in battle, killed in battle”) + *hlaup (“course, track”) from *hlaupan (“to run”).",
        "More at well, leap, valkyrie. See also the doublet wallop, coming from the same source through an Old Northern French variant."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gallop (plural gallops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fastest gait of a horse, a two-beat stride during which all four legs are off the ground simultaneously.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or instance of going or running rapidly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cardiology) An abnormal rhythm of the heart, made up of three or four sounds, like a horse's gallop.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gallop (third-person singular simple present gallops, present participle galloping, simple past and past participle galloped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a horse, etc) To run at a gallop.",
                  "examples": [
                    "The horse galloped past the finishing line."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To ride at a galloping pace.",
                  "examples": [
                    "Gallop lively down the western hill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to gallop.",
                  "examples": [
                    "to gallop a horse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make electrical or other utility lines sway and/or move up and down violently, usually due to a combination of high winds and ice accrual on the lines.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To run very fast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, intransitive) To go rapidly or carelessly, as in making a hasty examination.",
                  "examples": [
                    "Such superficial ideas he may collect in galloping over it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of an infection, especially pneumonia) To progress rapidly through the body.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}