{
  "word": "pork",
  "etymologies": [
    {
      "description": [
        "From Middle English pork, porc, via Anglo-Norman, from Old French porc (“swine, hog, pig; pork”), from Latin porcus (“domestic hog, pig”).",
        "Cognate with Old English fearh (“piglet”). Doublet of farrow.",
        "Used in English since the 14th century, and as a term of abuse since the 17th century.",
        "US politics sense is related to pork barrel.\nThe verb is from the Black American form of poke."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pork (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The meat of a pig; swineflesh.",
                  "examples": [
                    "Synonyms: pigmeat, swineflesh, the other white meat",
                    "The cafeteria serves pork on Tuesdays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US politics, slang, derogatory) Funding proposed or requested by a member of Congress for special interests or their constituency as opposed to the good of the country as a whole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(MLE, slang, collective) law enforcement, those who side with criminal prosecution",
                  "examples": [
                    "Synonyms: bacon, pigs, swine; see also Thesaurus:police",
                    "Meronym: porky (“one member of law enforcement, policeman”)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A shag; a fuck; an act of coitus.",
                  "examples": [
                    "porking",
                    ""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pork (third-person singular simple present porks, present participle porking, simple past and past participle porked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, vulgar, usually of a male) To have sex with (someone).",
                  "examples": [
                    "Synonyms: see Thesaurus:copulate with"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}