{
  "word": "gabion",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian gabbione, augmentative of gabbia (“cage”), itself from Latin cavea."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gabion (plural gabions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, military) A cylindrical basket or cage of wicker which was filled with earth or stones and used in fortifications and other engineering work (a precursor to the sandbag).",
                  "examples": [
                    "When our artillery came before the walls of the town, the English within the walls killed some of our men, and several pioneers who were making gabions. And seeing they were so wounded that there was no hope of curing them, their comrades stripped them, and put them still living inside the gabions, which served to fill them up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A woven wire mesh unit, sometimes rectangular, made from a continuous mesh panel and filled with stones sometimes coated with polyvinyl chloride.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(civil engineering) A porous metal cylinder filled with stones and used in a variety of civil engineering contexts, especially in the construction of retaining walls, the reinforcing of steep slopes, or in the prevention of erosion in river banks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A knickknack, objet d'art, curiosity, collectable.",
                  "examples": [
                    "Reliquiae Trotcosienses: Or, the Gabions of the Late Jonathan Oldbuck Esq. of Monkbarns — title of unfinished novel by Walter Scott."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}