{
  "word": "shank",
  "etymologies": [
    {
      "description": [
        "From Middle English schanke, from Old English sċanca (“leg”), from Proto-West Germanic *skankō, from Proto-Germanic *skankô (compare West Frisian skonk, Low German Schanke, German Schenkel (“shank, leg”), Norwegian skank), from *skankaz (compare Old Norse skakkr (“wry, crooked”)), from Proto-Indo-European *(s)keng- (compare Middle Irish scingim (“I spring”), Ancient Greek σκάζω (skázō, “to limp”)."
      ],
      "adjectives": [
        {
          "description": "shank (comparative shanker, superlative shankest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Bad.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "shank (plural shanks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of the leg between the knee and the ankle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Meat from that part of an animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology, colloquial) A redshank or greenshank, various species of Old World wading birds in the genus Tringa having distinctly colored legs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A straight, narrow part of an object, such as a key or an anchor; shaft; stem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The handle of a pair of shears, connecting the ride to the neck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The center part of a fishhook between the eye and the hook, the 'hook' being the curved part that bends toward the point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A protruding part of an object, by which it is or can be attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The metal part on a curb bit that falls below the mouthpiece, which length controls the severity of the leverage action of the bit, and to which the reins of the bridle are attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A poorly played golf shot in which the ball is struck by the part of the club head that connects to the shaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An improvised stabbing weapon.",
                  "examples": [
                    "Synonym: (slang) shiv"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loop forming an eye to a button.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The space between two channels of the Doric triglyph[18th century].",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metalworking) A large ladle for molten metal, fitted with long bars for handling it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) The body of a type; between the shoulder and the foot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shoemaking) The part of the sole beneath the instep connecting the broader front part with the heel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Flat-nosed pliers, used by opticians for nipping off the edges of pieces of glass to make them round.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The end or remainder, particularly of a period of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The main part or beginning of a period of time.",
                  "examples": [
                    "the shank of the morning"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shank (third-person singular simple present shanks, present participle shanking, simple past and past participle shanked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, Ulster) To travel on foot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To stab, especially with an improvised blade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To remove another's trousers, especially in jest; to depants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, golf) To misstrike the ball with the part of the club head that connects to the shaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly tennis, soccer, gridiron football) To hit or kick the ball in an unintended direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fall off, as a leaf, flower, or capsule, on account of disease affecting the supporting footstalk; usually followed by off.",
                  "examples": [
                    "the gerrnens of these swelled, and on four out of the six I have now got fine pods, above 1% inch in length, with the seeds externally visible; whereas the flower stalks of the many other flowers all shanked off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sewing) To provide (a button) with a shank (loop forming an eye).",
                  "examples": [
                    "The system is suitable for shanking all kind of sewn buttons (jackets, coats, blouses, shirts, trousers)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shoemaking) To apply the shank to a shoe, during the process of manufacturing it.",
                  "examples": [
                    "I take those metal shanks, slide the backs of them in glue and make them lie down on the shoe-bottoms,  […]  Last week they ran a contest to see which shankers shanked fastest. I'm not embarrassed to say I beat them all."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}