{
  "word": "robot",
  "etymologies": [
    {
      "description": [
        "From German Robot, from a West Slavonic language, ultimately related to Etymology 2, below."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "robot (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical) A system of serfdom used in Central Europe, under which a tenant's rent was paid in forced labour. [from 19th c.]",
                  "examples": [
                    "“I say again, down with the robot!—he is a dog who yields it!”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Czech robot, from robota (“drudgery, servitude”). Coined in the 1920 science-fiction play R.U.R. (Rossum's Universal Robots) by Karel Čapek after having been suggested to him by his brother Josef, and taken into English without change."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "robot (plural robots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly science fiction) An intelligent mechanical being designed to look like a human or other creature, and usually made from metal. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine built to carry out some complex task or group of tasks by physically moving, especially one which can be programmed. [from 20th c.]",
                  "examples": [
                    "We have a robot in the house that does the vacuuming.",
                    "Synonyms: see Thesaurus:robot",
                    "Hypernym: automaton",
                    "Hyponym: android"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A person who does not seem to have any emotions. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(South Africa) A traffic light (from earlier robot policeman). [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surveying) A theodolite which follows the movements of a prism and can be used by a one-man crew.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance) A style of dance popular in disco in which the dancer imitates the stiff movements of a stereotypical android robot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Referencing the origin of the name of the 4chan imageboard /r9k/ (created in 2008), so-called because it implements the ROBOT9000 algorithm by Randall Munroe to prevent the reposting of content.",
        "Possibly overlapping with the sense of robot (“a person who does not seem to have any emotions”), alluding to autism, due to the prevalence of personal stories describing awkward or embarrassing situations on the board."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "robot (plural robots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang) A habitual poster on the /r9k/ board on 4chan; a member of the /r9k/ community.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}