{
  "word": "miserable",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French miserable, from Old French, from Latin miserabilis."
      ],
      "adjectives": [
        {
          "description": "miserable (comparative miserabler or more miserable, superlative miserablest or most miserable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a state of misery: very sad, ill, or poor.",
                  "examples": [
                    "Thanks to that penny he had just spent so recklessly [on a newspaper] he would pass a happy hour, taken, for once, out of his anxious, despondent, miserable self. It irritated him shrewdly to know that these moments of respite from carking care would not be shared with his poor wife, with careworn, troubled Ellen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Very bad (at something); unskilled, incompetent; hopeless.",
                  "examples": [
                    "He's good at some sports, like tennis, but he's just miserable at football."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of the weather, extremely unpleasant due to being cold, wet, overcast, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wretched; worthless; mean; contemptible.",
                  "examples": [
                    "a miserable sinner"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Causing unhappiness or misery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Avaricious; niggardly; miserly.",
                  "examples": [
                    "the liberal-hearted man is by the opinion of the prodigal miserable, and by the judgment of the miserable lavish"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "miserable (plural miserables)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A miserable person; a wretch.",
                  "examples": [
                    "Dona Carmen repaired to the balcony to chat and jest with, and at, these miserables, who stopped before the door to rest in their progress. All pretended poverty while literally groaning under the weight of their riches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, in the plural, with definite article) A state of misery or melancholy.",
                  "examples": [
                    "By 3:00 P.M. both DeeDee and Sandra's pants were thoroughly soaked, and this unhappy circumstance gave DeeDee a bad case of the miserables."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}