{
  "word": "spine",
  "etymologies": [
    {
      "description": [
        "From late Middle English spyne, from Old French espine (French épine) or its source, Latin spīna (“a thorn; a prickle, spine; the backbone”). Doublet of spina."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spine (plural spines)",
          "definitionGroups": [
            {
              "group": "(anatomy, zootomy) A series of bones situated at the back from the head to the pelvis of a human, or from the head to the tail of an animal, enclosing the spinal cord and providing support for the thorax and abdomen.",
              "entries": [
                {
                  "meaning": "(figurative) Courage or assertiveness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something resembling a backbone, such as a ridge, or a long, central structure from which other structures radiate.",
                  "examples": [
                    "Hyponyms: anterior superior iliac spine, dendritic spine, neural spine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The narrow, bound edge of a book that encloses the inner edges of the pages, facing outwards when the book is on a shelf and typically bearing the title and the author's and publisher's name.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zootomy, botany) A pointed, fairly rigid protuberance or needlelike structure on an animal, shell, or plant.",
                  "examples": [
                    "Synonyms: needle, prickle, (on animals, flexible) quill, spicule, (rigid) spike, (on plants) thorn, (obsolete) virgula"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The heartwood of trees.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(neuroscience) Ellipsis of dendritic spine..",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A linear payscale operated by some large organizations that allows flexibility for local and specific conditions.",
                  "examples": [
                    "Synonym: pay spine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A tall mass of viscous lava extruded from a volcano.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The stiffness of an arrow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}