{
  "word": "handling",
  "etymologies": [
    {
      "description": [
        "From Middle English handlinge, hondlunge, from Old English handlung (“handling”), equivalent to handle +‎ -ing. Cognate with Dutch handeling (“trade, operation, action”), German Handlung (“act, action”), Swedish handling (“act, deed, action”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "handling (countable and uncountable, plural handlings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A touching, controlling, managing, using, take care of, etc., with the hand or hands, or as with the hands.",
                  "examples": [
                    "[…]  at San Francisco it is warehoused and reshipped to Liverpool, or other foreign market; and in exchange for this wheat, comes back the merchandise which has to pass through all these shipments, reshipments, warehousings, handlings, &c."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The mechanism for handling or manipulating something.",
                  "examples": [
                    "In mortal terror of people forcing an entrance at such an hour, and in such a manner as to leave no doubt of their purpose, I would have turned to fly when first I heard the noise, only that I feared by any quick motion to catch their attention, as I also ran the danger of doing by opening the door, which was all but closed, and to whose handlings I was unaccustomed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) The mode of using the pencil or brush; style of touch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A criminal offence, the trade in stolen goods.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From handle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "handling",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "present participle of handle",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}