{
  "word": "vocal",
  "etymologies": [
    {
      "description": [
        "Late Middle English vocal, borrowed from Latin vōcālis (“uttering a voice, sounding, speaking”), from vōx (“a voice, sound, tone”) +‎ -ālis (“-al”, adjectival suffix). Doublet of vowel and vocalis. Compare Old French vocal."
      ],
      "adjectives": [
        {
          "description": "vocal (comparative more vocal, superlative most vocal)",
          "definitionGroups": [
            {
              "group": "Of, pertaining to, or resembling the human voice or speech.",
              "entries": [
                {
                  "meaning": "(anatomy) Used in the production of speech sounds.",
                  "examples": [
                    "vocal apparatus"
                  ]
                },
                {
                  "meaning": "(music) Relating to, composed or arranged for, or sung by the human voice.",
                  "examples": []
                },
                {
                  "meaning": "(phonetics) Consisting of, or characterized by, voice, or tone produced in the larynx, which may be modified, either by resonance, as in the case of the vowels, or by obstructive action, as in certain consonants, such as v, l, etc., or by both, as in the nasals m, n, ng.",
                  "examples": [
                    "Synonyms: sonant, intonated, voiced"
                  ]
                },
                {
                  "meaning": "(phonetics) Synonym of vocalic.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Uttered or modulated by the voice; expressed in words.",
              "entries": [
                {
                  "meaning": "Expressing opinions or feelings freely, loudly, or insistently.",
                  "examples": [
                    "The protesters were very vocal in their message to the mayor.",
                    "Synonyms: outspoken, loud, audible",
                    "Antonyms: inaudible, quiet, silent"
                  ]
                },
                {
                  "meaning": "Having or exercising the power of producing voice, speech, or sound.",
                  "examples": [
                    "Synonym: spoken"
                  ]
                },
                {
                  "meaning": "Synonym of expressive.",
                  "examples": []
                },
                {
                  "meaning": "Full of voices.",
                  "examples": [
                    "Synonym: resounding"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "vocal (plural vocals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) A vocal sound; specifically, a purely vocal element of speech, unmodified except by resonance; a vowel or a diphthong; a tonic element; a tonic.",
                  "examples": [
                    "Coordinate terms: subvocal, nonvocal"
                  ]
                }
              ]
            },
            {
              "group": "(music) A part of a piece of music that is sung.",
              "entries": [
                {
                  "meaning": "(acting) A musical performance involving singing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Catholicism) A man in the Roman Catholic Church who has a right to vote in certain elections.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}