{
  "word": "squelch",
  "etymologies": [
    {
      "description": [
        "Unknown. Perhaps a blend of squash +‎ quell +‎ quench. Compare also English squolsh, English squoosh."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squelch (countable and uncountable, plural squelches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A squelching sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(radio technology) The suppression of the unwanted hiss or static between received transmissions by adjusting the gain of the receiver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, dated) A heavy blow or fall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, music) A kind of electronic beat or sound mainly used in acid house and related music genres.",
                  "examples": [
                    "Through a process of experimentation the 'acid squelch' sound came forth, which was recorded and passed on to DJ Ron Hardy to play at his Warehouse club."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "squelch (third-person singular simple present squelches, present participle squelching, simple past and past participle squelched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US) To halt, stop, eliminate, stamp out, or put down, often suddenly or by force.",
                  "examples": [
                    "Synonym: quash",
                    "Even the king's announcement could not squelch the rumors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, radio technology) To suppress the unwanted hiss or static between received transmissions by adjusting a threshold level for signal strength.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Britain) To make a sucking, splashing noise as when walking on muddy ground.",
                  "examples": [
                    "The mud squelched underfoot; it had been raining all night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Britain) To walk or step through a substance such as mud.",
                  "examples": [
                    "The mud was thick and sticky underfoot, but we squelched through it nonetheless."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}