{
  "word": "podium",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin podium, from Ancient Greek πόδιον (pódion, “base”), from diminutive of πούς (poús, “foot”). Doublet of pew."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "podium (plural podiums or podia)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A platform on which to stand, as when conducting an orchestra or preaching at a pulpit; any low platform or dais.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes proscribed) A stand used to hold notes when speaking publicly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports and other competitions) A steepled platform upon which the three competitors with the best results may stand when being handed their medals or prize.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A result amongst the best three at a competition.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A low wall, serving as a foundation, a substructure, or a terrace wall.",
              "entries": [
                {
                  "meaning": "The dwarf wall surrounding the arena of an amphitheatre, from the top of which the seats began.",
                  "examples": []
                },
                {
                  "meaning": "The masonry under the stylobate of a temple, sometimes a mere foundation, sometimes containing chambers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lower portion of a high-rise building, typically of several storeys tall and acts as a foundation to the tower(s) above it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, anatomy) A foot or footstalk.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "podium (third-person singular simple present podiums, present participle podiuming, simple past and past participle podiumed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, colloquial) To finish in the top three at an event or competition.",
                  "examples": [
                    "The swimmer podiumed three times at the Olympics."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}