{
  "word": "particular",
  "etymologies": [
    {
      "description": [
        "From Middle English particuler, from Anglo-Norman particuler, Middle French particuler, particulier, from Late Latin particularis (“partial; separate, individual”), from Latin particula (“(small) part”).  Equivalent to particle +‎ -ar. Compare particle."
      ],
      "adjectives": [
        {
          "description": "particular (comparative more particular, superlative most particular) (also non-comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Pertaining only to a part of something; partial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specific; discrete; concrete.",
                  "examples": [
                    "Synonyms: see Thesaurus:specific",
                    "Antonym: general",
                    "I couldn't find the particular model you asked for, but I hope this one will do.",
                    "We knew it was named after John Smith, but nobody knows which particular John Smith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specialised; characteristic of a specific person or thing.",
                  "examples": [
                    "Synonyms: optimized, specialistic",
                    "I don't appreciate your particular brand of cynicism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Known only to an individual person or group; confidential.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Distinguished in some way; special (often in negative constructions).",
                  "examples": [
                    "My five favorite places are, in no particular order, New York, Chicago, Paris, San Francisco and London.",
                    "I didn't have any particular interest in the book.",
                    "He brought no particular news.",
                    "She was the particular belle of the party."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Of a person, concerned with, or attentive to, details; fastidious.",
                  "examples": [
                    "Synonyms: minute, precise, fastidious; see also Thesaurus:fastidious",
                    "He is very particular about his food and if it isn't cooked to perfection he will send it back.",
                    "These women are more particular about their appearance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Concerned with, or attentive to, details; minute; circumstantial; precise.",
                  "examples": [
                    "Synonyms: see Thesaurus:meticulous",
                    "a full and particular account of an accident"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Containing a part only; limited.",
                  "examples": [
                    "a particular estate, or one precedent to an estate in remainder"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Holding a particular estate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) Forming a part of a genus; relatively limited in extension; affirmed or denied of a part of a subject.",
                  "examples": [
                    "a particular proposition, opposed to \"universal\", e.g. (particular affirmative) \"Some men are wise\"; (particular negative) \"Some men are not wise\"."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "particular (plural particulars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small individual part of something larger; a detail, a point. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A person's own individual case. [16th–19th c.]",
                  "examples": [
                    "temporal blessings, whether such as concern the public […] or such as concern our particular"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now philosophy, chiefly in plural) A particular case; an individual thing as opposed to a whole class. (Opposed to generals, universals.) [from 17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}