{
  "word": "scream",
  "etymologies": [
    {
      "description": [
        "From Middle English scremen, scræmen, probably from a fusion of Middle Dutch scremen (“to yell; shout”) and Old Norse skræma (“to terrify; scare”); compare Dutch schremen (“to shout; yell; cry”), Swedish skrämma (“to spook; frighten”), Danish skræmme (“to scare”), West Frisian skrieme (“to weep”). Compare also Swedish skräna (“to yell; shout; howl”), Dutch schreien (“to cry; weep”), German schreien (“to scream”). Related to shriek, skrike."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scream (plural screams)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loud, emphatic, exclamation of extreme emotion, especially horror, fear, excitement, or anger; it may comprise a word or a sustained, high-pitched vowel sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loud vocalisation of many animals, especially in response to pain or fear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A form of singing associated with the metal and screamo styles of music. It is a loud, rough, distorted version of the voice; rather than the normal voice of the singer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Used as an intensifier.",
                  "examples": [
                    "We had a real scream of a time at the beach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printers' slang) An exclamation mark.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scream (third-person singular simple present screams, present participle screaming, simple past and past participle screamed or (nonstandard) screamt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, also figuratively) To cry out with a shrill voice; to utter a sudden, shout outcry, or shrill, loud cry, as in fright or extreme pain; to screech, to shriek.",
                  "examples": [
                    "Synonyms: see Thesaurus:shout"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive, figuratively)",
              "entries": [
                {
                  "meaning": "To move quickly; to race.",
                  "examples": [
                    "Synonyms: speed, zoom; see also Thesaurus:move quickly, Thesaurus:rush",
                    "He almost hit a pole, the way he came screaming down the hill."
                  ]
                },
                {
                  "meaning": "(informal) To be very indicative of; clearly having the characteristics of.",
                  "examples": [
                    "Do you know what screams \"I’m obnoxious\"? People who feel the need to comment on every little thing they notice."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}