{
  "word": "reception",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French reception, from Latin receptiō (“the act of receiving; reception”), from recipiō (“receive”), from re- (“back”) + capiō (“I hold”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reception (countable and uncountable, plural receptions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of receiving.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, electronics) The act or ability to receive radio or similar signals.",
                  "examples": [
                    "We have poor TV reception in the valley.",
                    "The new system provides exceptional quality of the reception signal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A social engagement, usually to formally welcome someone.",
                  "examples": [
                    "After the wedding we proceeded to the reception."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reaction; the treatment received on first talking to a person, arriving at a place, etc.",
                  "examples": [
                    "The ambassador's jokes met a cold reception."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The desk of a hotel or office where guests are received.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, education) The school year, or part thereof, between preschool and Year 1, when children are introduced to formal education.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The conscious adoption or transplantation of legal phenomena from a different culture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) The act of catching a pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Reading viewed as the active process of receiving a text in any medium (written, spoken, signed, multimodal, nonverbal), consisting of several steps, such as ideation, comprehension, reconstruction, interpretation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}