{
  "word": "necessary",
  "etymologies": [
    {
      "description": [
        "From Middle English necessarye, from Old French necessaire, from Latin necessārius (“unavoidable, inevitable, required”), variant of necesse (“unavoidable, inevitable”), probably from ne or non cessum, from the perfect passive participle of cēdō (“yield; avoid, withdraw”); see cede.",
        "Older use as a noun in reference to an outhouse or lavatory under the influence of English and Latin necessārium, a medieval term for the place for monks’ “unavoidable” business, usually located behind or attached to monastic dormitories."
      ],
      "adjectives": [
        {
          "description": "necessary (comparative necessarier or more necessary, superlative necessariest or most necessary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Required, essential, whether logically inescapable or needed in order to achieve a desired result or avoid some penalty.",
                  "examples": [
                    "Although I wished to think that all was false, it was yet necessary that I, who thus thought, must in some sense exist.",
                    "It is absolutely necessary that you call and confirm your appointment.",
                    "Synonyms: see Thesaurus:requisite",
                    "Antonym: unnecessary"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unavoidable, inevitable.",
                  "examples": [
                    "If it is absolutely necessary to use public computers, you should plan ahead and forward your e-mail to a temporary, disposable account.",
                    "Synonyms: inevitable, natural",
                    "Antonyms: evitable, incidental, impossible"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Determined, involuntary: acting from compulsion rather than free will.",
                  "examples": [
                    "But that a necessary being should give birth to a being with any amount, however limited, of moral freedom, is infinitely less conceivable than that parents of the insect or fish type should give birth to a perfect mammal."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "necessary (plural necessaries or necessarys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, archaic, euphemistic, usually with the definite article) A place to do the \"necessary\" business of urination and defecation: an outhouse or lavatory.",
                  "examples": [
                    "Synonyms: see Thesaurus:bathroom"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Necessity.",
                  "examples": [
                    "[…]  loss of that whole dominion of New England, and consequently of their Majesties' other American Plantations, endangered not only by the want of provisions, but by the many ships, vessels, seamen and other necessarys in New England, ..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}