{
  "word": "exchange",
  "etymologies": [
    {
      "description": [
        "From Middle English eschaunge, borrowed from Anglo-Norman eschaunge, from Old French eschange (whence modern French échange), from the verb eschanger, from Vulgar Latin *excambiāre, present active infinitive of *excambiō (from Latin ex with Late Latin cambiō). Spelling later changed on the basis of ex- in English."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "exchange (countable and uncountable, plural exchanges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of exchanging or trading.",
                  "examples": [
                    "All in all, it was an even exchange.",
                    "an exchange of cattle for grain",
                    "I'll help you out this time, depending on what can you give me in exchange."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place for conducting trading.",
                  "examples": [
                    "The stock exchange is open for trading.",
                    "The old corn exchange has been converted into a music venue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A telephone exchange.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telephony, US) The fourth through sixth digits of a ten-digit phone number (the first three before the introduction of area codes).",
                  "examples": [
                    "The 555 exchange is reserved for use by the phone company, which is why it's often used in films.",
                    "NPA-NXX-1234 is standard format, where NPA is the area code and NXX is the exchange."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conversation.",
                  "examples": [
                    "After a lengthy exchange with the manager, we were no wiser."
                  ]
                }
              ]
            },
            {
              "group": "(chess) The loss of one piece and associated capture of another.",
              "entries": [
                {
                  "meaning": "(usually with \"the\") The loss of a minor piece (typically a bishop or knight) and associated capture of the more advantageous rook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The thing given or received in return; especially, a publication exchanged for another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biochemistry) The transfer of substances or elements like gas, amino-acids, ions etc. sometimes through a surface like a membrane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) The difference between the values of money in different places.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, England & Wales, Northern Ireland) Clipping of exchange of contracts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English eschaungen, from Anglo-Norman eschaungier, Old French eschanger, from the Old French verb eschangier, eschanger (whence modern French échanger), from Vulgar Latin *excambiāre, present active infinitive of *excambiō (from Latin ex with Late Latin cambiō). Gradually displaced native Old English wrixlan, wixlan (“to change, exchange, reciprocate”) and its descendants, wrixle being one of them."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "exchange (third-person singular simple present exchanges, present participle exchanging, simple past and past participle exchanged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To trade or barter.",
                  "examples": [
                    "I'll gladly exchange my place for yours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To replace with, as a substitute.",
                  "examples": [
                    "I'd like to exchange this shirt for one in a larger size.",
                    "Since his arrest, the mob boss has exchanged a mansion for a jail cell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, England & Wales, Northern Ireland) Clipping of exchange contracts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To recommend and get recommendations.",
                  "examples": [
                    "Synonym: trade"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}