{
  "word": "sortie",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from French sortie (“act of exiting; exit, way out; (military) sally, sortie”), the past participle of sortir (“to exit, go out”), from Old French sortir, from Latin sortīrī, the present active infinitive of sortior (“to cast or draw lots; to choose, select; to distribute, divide; to obtain, receive; to share”), from sors (“something used to determine chances, a lot; casting or drawing of lots; decision by lot; a share”) (ultimately from Proto-Indo-European *ser- (“to bind, tie together; a thread”)), possibly influenced by surrēctus (“arisen, having been caused to arise; gotten up, having been gotten up”), the perfect passive participle of surgō (“to arise, get up, rise”), from subrigō (“to lift up; to straighten”), from sub- (prefix meaning ‘beneath, under’) + regō (“to direct, guide, steer; to govern, rule; to manage, oversee”) (ultimately from Proto-Indo-European *h₃reǵ- (“to right oneself, straighten; just; right”)).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sortie (plural sorties)",
          "definitionGroups": [
            {
              "group": "(military, also attributively and figuratively)",
              "entries": [
                {
                  "meaning": "An attack made by troops from a besieged position; a sally.",
                  "examples": []
                },
                {
                  "meaning": "(aviation) An operational flight carried out by a single military aircraft.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "An act of venturing out to do a task, etc.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": []
                },
                {
                  "meaning": "An act of trying to enter a new field of activity.",
                  "examples": []
                },
                {
                  "meaning": "(sports) An attacking move.",
                  "examples": []
                },
                {
                  "meaning": "(astronautics) An operational flight carried out by a spacecraft involving a return to Earth.",
                  "examples": []
                },
                {
                  "meaning": "(military) Synonym of sally port (“an entry to or opening into a fortification to enable a sally”)",
                  "examples": []
                },
                {
                  "meaning": "(photography) A series of aerial photographs taken during the flight of an aircraft; (by extension) a photography session.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sortie (third-person singular simple present sorties, present participle sortying or sortieing, simple past and past participle sortied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To carry out a sortie; to sally.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}