{
  "word": "wreath",
  "etymologies": [
    {
      "description": [
        "From Old English wriþa (bandage), from Proto-West Germanic *wrīþan (to twist), from Proto-Germanic *wrīþaną, from Proto-Indo-European *wreyt- (to twist).",
        "See also writhe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wreath (plural wreaths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something twisted, intertwined, or curled.",
                  "examples": [
                    "a wreath of smoke;  a wreath of clouds"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ornamental circular band made, for example, of plaited flowers and leaves, and used as decoration; a garland or chaplet, especially one given to a victor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) An appendage to the shield, placed above it, and supporting the crest; an orle, a torse. It generally represents a twist of two cords of silk, one tinctured like the principal metal, the other like the principal color in the coat of arms.",
                  "examples": [
                    "Synonyms: orle, torse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A defect in glass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wreath (third-person singular simple present wreaths, present participle wreathing, simple past and past participle wreathed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place an entwined circle of flowers upon or around something.",
                  "examples": [
                    "Old Nico wreathed the tomb of maiden Melitê."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wrap around something in a circle.",
                  "examples": [
                    "At the funeral, a circle of comrades wreathed the grave of the honored deceased."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To curl, writhe or spiral in the form of a wreath.",
                  "examples": [
                    "Though wit may flash from fluent lips, and mirth distract the breast,",
                    "Through midnight hours that yield no more their former hope of rest;",
                    "’Tis but as ivy-leaves around the ruined turret wreath",
                    "All green and wildly fresh without, but worn and grey beneath."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}