{
  "word": "blockbuster",
  "etymologies": [
    {
      "description": [
        "block +‎ buster"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blockbuster (plural blockbusters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A high-explosive bomb used for the purposes of demolishing extensive areas, such as a city block.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Something, such as a film or book, that sustains exceptional and widespread popularity and achieves enormous sales, as opposed to a box office bomb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Something, especially an event or a film, book or other creative work, that is intended to achieve high sales (perhaps indicated by large budgets or high advertising spending) or that is conceived on a large or epic scale",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Anything very large or powerful; a whopper.",
                  "examples": [
                    "“How nice,\" she responded to his invitation, “but I've got a blockbuster of a headache. I'm paying for last night. Call me tomorrow, will you?\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large firework of the firecracker type; an M-80.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) One who engages in blockbusting (technique encouraging people to sell property).",
                  "examples": [
                    "Whereas White residents fell prey to blockbusters who stoked fears of invading Negroes and plummeting housing values during the 1950s, African Americans confronted more-than-imagined difficulties in neighborhoods after the 1968 riots."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}