{
  "word": "parade",
  "etymologies": [
    {
      "description": [
        "From French parade (“an ostentatious display, a military display”), from parer (“to beautify, prepare, take pride in”) + -ade probably under influence from earlier Italian parata (“preparation, a military parade, an ostentatious display”) and Latin magnō parātū (“with great preparation”). Various senses similarly influenced by earlier French and Italian uses. Doublet of pare."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parade (countable and uncountable, plural parades)",
          "definitionGroups": [
            {
              "group": "An organized display of a group of people, particularly",
              "entries": [
                {
                  "meaning": "(military) Synonym of military parade: A show of troops, an assembly of troops as a show of force, to receive orders, or especially for inspection at set times.",
                  "examples": [
                    "There is left round about the circuit of the whole quarter, a parallell on all sides some 200, or 250 foote betweene the front of the quarter and the trench, called an Alarme Place, for the souldiers to draw out into Armes, into Parade, or when any Alarme or commotion happens..."
                  ]
                },
                {
                  "meaning": "A public procession, especially one commemorating a holiday or special event or (dated) in protest.",
                  "examples": [
                    "They went up with a Parade of 9 or 10 Coaches."
                  ]
                },
                {
                  "meaning": "(venery, uncommon) Synonym of gaggle: A group of geese when on the move, particularly a line of goslings shepherded by one or more adults.",
                  "examples": []
                },
                {
                  "meaning": "(venery, uncommon) Synonym of herd: A group of elephants when on the move.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A place reserved for such displays, particularly",
              "entries": [
                {
                  "meaning": "(military, now uncommon) Synonym of parade ground: A place specially designated for such displays or for practicing close-order drills.",
                  "examples": [
                    "Parade, is a Military word, signifying the Place where Troops usually draw together, in order to mount the Guards, or for any other Service."
                  ]
                },
                {
                  "meaning": "(dated) Synonym of promenade: A route, street, or square frequented by pedestrians or formerly used for military parades.",
                  "examples": [
                    "This Square is calcled the Parade."
                  ]
                },
                {
                  "meaning": "(uncommon) Synonym of road, used in place names.",
                  "examples": [
                    "His shop is located in Chester Pde."
                  ]
                }
              ]
            },
            {
              "group": "The people who make up such a display, particularly",
              "entries": [
                {
                  "meaning": "(military, now uncommon) The body of soldiers thus assembled.",
                  "examples": [
                    "The Commanding Officer is then to direct the Parade to Order Arms."
                  ]
                },
                {
                  "meaning": "The body of promenaders thus assembled.",
                  "examples": [
                    "We saw a great Parade or kind of Meeting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Synonym of show: any similarly orderly or ostentatious display, especially of a variety of people or a series of things paraded around.",
                  "examples": [
                    "...the ravishing assault of a well-disciplined diction, in a parade of curiosly-mustered words in their several ranks and files..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, figurative, uncommon) A row of shops beside a street.",
                  "examples": [
                    "Most new shopping centres... have broken away from the old strip parades which usually face each other across heavy inter-town traffic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, figurative, now uncommon) Short for programme parade: a description of the programming schedule formerly announced on the radio and various television channels.",
                  "examples": [
                    "Scottish Programme Parade"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "parade (third-person singular simple present parades, present participle parading, simple past and past participle paraded)",
          "definitionGroups": [
            {
              "group": "(intransitive) To take part in a parade, particularly",
              "entries": [
                {
                  "meaning": "To assemble for inspection, to receive orders, etc.",
                  "examples": [
                    "... the other three Companies were ordained by foure a clocke afternoone, to parade in the Market place, and afterwards to march to their Post..."
                  ]
                },
                {
                  "meaning": "To march impressively or ostentatiously.",
                  "examples": [
                    "No one fights a war in close-order formations any more but officers still love to force their men to parade, coming up with various plausible excuses for their enjoyment of command."
                  ]
                },
                {
                  "meaning": "(transitive) To march past.",
                  "examples": [
                    "After the field show, it is customary to parade the stands before exiting the field."
                  ]
                },
                {
                  "meaning": "(transitive) To march through or along.",
                  "examples": [
                    "They said nothing, but stared at each other with the horror of people exposed to all the torture of the demons who parade the African continent."
                  ]
                },
                {
                  "meaning": "(figurative) Synonym of promenade: to walk up and down, especially in public in order to show off and be seen by others.",
                  "examples": [
                    "The whole family paraded it together."
                  ]
                },
                {
                  "meaning": "(transitive, figurative, of vehicles) To move slowly through or among.",
                  "examples": [
                    "That evening the van of the Party for the Poor also paraded our street. They too blared music and made identical claims."
                  ]
                },
                {
                  "meaning": "(figurative, of waterfowl) To walk in a row led by one parent, often trailed by the other.",
                  "examples": [
                    "Nearer to the water pink-footed geese and white-faced coots paraded in the groves of rhus and bamboo."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To cause to take part in a parade, particularly",
              "entries": [
                {
                  "meaning": "To assemble soldiers for inspection, to receive orders, etc.",
                  "examples": [
                    "In a few moments, we were paraded in the frigate’s gangway; the first lieutenant—an elderly yellow-faced officer, in an ill-cut coat and tarnished gold lace—coming up, and frowning upon us."
                  ]
                },
                {
                  "meaning": "(figurative) Synonym of show off: to display or reveal prominently or ostentatiously, especially in a kind of procession.",
                  "examples": [
                    "... For she was not a sentimental mourner,Parading all her sensibility..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To furnish with a parade or parades.",
                  "examples": [
                    "The modern part that faces the sea is... paraded, well lighted, well drained."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From French parade (“a parry”), from parer (“to parry, to defend oneself”) + -ade, from Italian parata. Doublet of parry."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parade (plural parades)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) Synonym of parry in both its literal and figurative senses.",
                  "examples": [
                    "...in case the adversary after a finda, going to the parade, discover his brest to caveat..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}