{
  "word": "follow",
  "etymologies": [
    {
      "description": [
        "From Middle English folwen, folȝen, folgen, from Old English folgian (“to follow, pursue”), from Proto-West Germanic *folgēn, from Proto-Germanic *fulgāną (“to follow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "follow (plural follows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes attributive) In billiards and similar games, a stroke causing a ball to follow another ball after hitting it.",
                  "examples": [
                    "a follow shot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(social media) The act of following another user's online activity.",
                  "examples": [
                    "It doesn't take too many follows to become overwhelmed with the deluge of content on Twitter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "follow (third-person singular simple present follows, present participle following, simple past and past participle followed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To go after; to pursue; to move behind in the same path or direction, especially with the intent of catching.",
                  "examples": [
                    "Synonyms: trail, tail",
                    "Antonyms: guide, lead",
                    "Follow that car!",
                    "She left the room and I followed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To go or come after in a sequence.",
                  "examples": [
                    "Synonyms: succeed; see also Thesaurus:succeed",
                    "Antonyms: precede; see also Thesaurus:precede",
                    "B follows A in the alphabet.",
                    "We both ordered the soup, with roast beef to follow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carry out (orders, instructions, etc.).",
                  "examples": [
                    "Synonym: pursue",
                    "Follow these instructions to the letter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To live one's life according to (religion, teachings, etc).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To understand, to pay attention to.",
                  "examples": [
                    "Do you follow me?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To watch, to keep track of (reports of) some event or person.",
                  "examples": [
                    "I followed the incumbent throughout the election.",
                    "My friends don't regularly follow the news."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(social media, transitive) To subscribe to see content from an account on a social media platform.",
                  "examples": [
                    "Antonym: unfollow",
                    "If you want to see more of our articles, follow us on Twitter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To be a logical consequence of something.",
                  "examples": [
                    "Synonym: ensue",
                    "It follows that if two numbers are not equal then one is larger than the other.",
                    "If you don't practise proper hygiene, illness is sure to follow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To walk in, as a road or course; to attend upon closely, as a profession or calling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}