{
  "word": "reeve",
  "etymologies": [
    {
      "description": [
        "From Middle English reve, from Old English rēfa, an aphetism of ġerēfa (also groefa), from Proto-West Germanic *garāfijō (“officer, official”).",
        "Compare Danish greve, Swedish greve, Dutch graaf, German Graf. Role, and later word, mostly replaced by bailiff, of Anglo-Norman origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reeve (plural reeves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Any of several local officials, with varying responsibilities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) The president of a township or municipal district council.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) The holder of a proposed but unadopted commissioned rank of the Royal Air Force, equivalent to wing commander.",
                  "examples": [
                    "A list of new titles was manufactured as follows: Ensign, Lieutenant, Flight-Leader, Squadron-Leader, Reeve, Banneret, Fourth-Ardian, Third-Ardian, Second-Ardian, Ardian, Air Marshal.  […]  “Reeve”, perhaps, savoured a little too much of legal authority."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Apparent alternative form of reef (“to pull or yank strongly”, verb) or from Dutch reven (“to take in, insert”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "reeve (third-person singular simple present reeves, present participle reeving, simple past and past participle reeved or rove)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, dialect) To pass (a rope) through a hole or opening, especially so as to fasten it.",
                  "examples": [
                    "\"Let the rope go,\" he says. With his other hand he reaches down and reeves the two turns from the stanchion."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Variant of dialectal ree, but of obscure ultimate origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reeve (plural reeves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female of the species Philomachus pugnax, a highly gregarious, medium-sized wading bird of Eurasia; the male is a ruff.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}