{
  "word": "tout",
  "etymologies": [
    {
      "description": [
        "From a dialectal form of toot (“to stick out; project; peer out; peep”), itself from Middle English toten, totien, from Old English tōtian (“to peep out; look; pry; spectate”). Merged with Middle English touten (“to jut out, protrude, gaze upon, observe, peer”), from Old English *tūtian, related to Old English tȳtan (“to stand out, be conspicuous, shine”). Compare Icelandic túta (“a teat-like prominence”), tútna (“to be blown up”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tout (plural touts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone advertising for customers in an aggressive way.",
                  "examples": [
                    "Synonyms: barker, pitchman, (Australia) spruiker",
                    "Be careful of the ticket touts outside the arena, they are famed for selling counterfeits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, at a racecourse, who offers supposedly inside information on which horse is likely to win.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An informer in the Irish Republican Army.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, archaic) A spy for a smuggler, thief, or similar.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tout (third-person singular simple present touts, present participle touting, simple past and past participle touted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To flaunt, to publicize/publicise; to boast or brag; to promote.",
                  "examples": [
                    "Mary has been touted as a potential succesor to the current CEO."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, horse-racing, transitive) To spy out information about (a horse, a racing stable, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, horse-racing, transitive) To give a tip on (a racehorse) to a person, with the expectation of sharing in any winnings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, horse-racing, intransitive) To spy out the movements of racehorses at their trials, or to get by stealth or other improper means the secrets of the stable, for betting purposes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, horse-racing, intransitive) To act as a tout; to give a tip on a racehorse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To look for, try to obtain; used with for.",
                  "examples": [
                    "To understand the new London, I lived it. I slept rough with Roma beggars and touted for work with Baltic laborers on the kerb."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To look upon or watch.",
                  "examples": [
                    "Nor durst Orcanes view the Soldan's face, / But still upon the floor did pore and tout."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from French tout (“all”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tout",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) In the game of solo, a proposal to win all eight tricks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}