{
  "word": "confetti",
  "etymologies": [
    {
      "description": [
        "Borrowed (possibly via French) from Italian confetti (literally “confections”), used to describe sugar-coated almonds, and by extension things imitating them (like pellets of plaster), which were thrown in Italy during festivities like Carnival and weddings. (This practice is mentioned in English since at least the 1810s.) The French and the English adopted the practice of celebrating weddings and other festivities by throwing such candies, or (by the late 1800s) tiny pieces of colored paper symbolizing them, partially displacing their earlier practice of throwing rice."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "confetti (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Small pieces or strips (streamers) of colored paper or other material (metal, plaster, etc) generally thrown about at festive occasions, especially at weddings and in victory celebrations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Edible Italian sugar-coated almonds, especially those which are used as part of a traditional Italian wedding.",
                  "examples": [
                    "[...] a pale and fair devotee of fashion who has left off eating confetti, and recovered her bloom."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "confetti (third-person singular simple present confettis, present participle confettiing, simple past and past participle confettied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To scatter with confetti.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}