{
  "word": "undeadly",
  "etymologies": [
    {
      "description": [
        "From Middle English undedly, undeedly, undedlich, from Old English undēadlīc (“immortal, for all eternity”), equivalent to undead +‎ -ly."
      ],
      "adjectives": [
        {
          "description": "undeadly (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not subject to death; immortal.",
                  "examples": [
                    "\"The soul also hath her death, namely, when it lacketh and is destitute of the eternal and godly life, which truly and justly is called the life of the soul: but undeadly or immortal is it called, because it never ceaseth to live, how miserable soever the life of it be. [...]\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unable to be killed, quenched, or terminated; eternal; everlasting.",
                  "examples": [
                    "Much of his subsequent work related to processes for resolving what he once called \"undeadly quarrels\" in the international arena."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to the undead.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "undeadly (comparative more undeadly, superlative most undeadly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Immortally; eternally.",
                  "examples": [
                    "[...] and it had been Sebastian's fault that her husband was no longer living undeadly by her side."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From un- +‎ deadly."
      ],
      "adjectives": [
        {
          "description": "undeadly (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not deadly; not causing, producing, or resulting in death; harmless.",
                  "examples": [
                    "Ulysses, knowing well The wound undeadly (setting back his foot to form his stand) Thus spake to Socus: \"O thou wretch, thy death is in this hand, That stay'st my victory on Troy, and where thy charge was made In doubtful term [...]\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}