{
  "word": "embassy",
  "etymologies": [
    {
      "description": [
        "Modern variant of obsolete ambassy, from Middle French ambassee (“mission, embassy”), from Old French ambascee (also enbassee (“message for a high official, official mission”)) from Old Italian ambasciata, from Old Occitan ambaissada (“embassy”), derived from ambaissa (“message”), from Late Latin ambactia (“service rendered”) (attested also as ambascia, from Proto-Germanic *ambahtiją (“service”), *ambahtaz (“follower, servant”), from Gaulish ambaxtos (“dependant, vassal”, literally “one who is sent around”), from Proto-Celtic *ambaxtos (“servant”), from Proto-Indo-European *h₂m̥bʰi-h₂eǵ- (“drive around”); compare Latin ambactus, Old Irish amos, amsach (“mercenary, servant”), Welsh amaeth (“tenant farm”)). Doublet of ambassade."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "embassy (plural embassies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The function or duty of an ambassador.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An organization or group of officials who permanently represent a sovereign state in a second sovereign state or with respect to an international organization such as the United Nations.",
                  "examples": [
                    "The American embassy to France is located in Paris."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A temporary mission representing a sovereign state.",
                  "examples": [
                    "The Japanese embassy to the United States traveled to Washington, D.C., where it was received by James Buchanan, before continuing on to New York and then returning to Japan, making several stops on the way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The official residence of such a group, or of an ambassador.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A written account as to an embassy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}