{
  "word": "seize",
  "etymologies": [
    {
      "description": [
        "Earlier seise, from Middle English seisen, sesen, saisen, from Old French seisir (“to take possession of; invest (person, court)”), from early Medieval Latin sacīre (8th century) in the phrase ad propriam sacire, from Old Low Frankish *sakjan (“to sue, bring legal action”), from Proto-Germanic *sakjaną, *sakōną (compare Old English sacian (“to strive, brawl”)), from Proto-Germanic *sakaną (compare Old Saxon sakan (“to accuse”), Old High German sahhan (“to bicker, quarrel, rebuke”), Old English sacan (“to quarrel, claim by law, accuse”). Cognate to sake and Latin sagio (“to perceive acutely”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "seize (third-person singular simple present seizes, present participle seizing, simple past and past participle seized)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deliberately take hold of; to grab or capture.",
                  "examples": [
                    "Synonyms: clasp, grasp, grip; see also Thesaurus:grasp"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take advantage of (an opportunity or circumstance).",
                  "examples": [
                    "Synonym: jump on"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take possession of (by force, law etc.).",
                  "examples": [
                    "Synonyms: arrogate, commandeer, confiscate",
                    "to seize smuggled goods",
                    "to seize a ship after libeling"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have a sudden and powerful effect upon.",
                  "examples": [
                    "a panic seized the crowd",
                    "a fever seized him"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To bind, lash or make fast, with several turns of small rope, cord, or small line.",
                  "examples": [
                    "to seize two fish-hooks back to back",
                    "to seize or stop one rope on to another"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To fasten, fix.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lay hold in seizure, by hands or claws (+ on or upon).",
                  "examples": [
                    "to seize on the neck of a horse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have a seizure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bind or lock in position immovably; see also seize up.",
                  "examples": [
                    "Rust caused the engine to seize, never to run again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, intransitive) To submit for consideration to a deliberative body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) (with of) To cause (an action or matter) to be or remain before (a certain judge or court).",
                  "examples": [
                    "This Court will remain seized of this matter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, cooking) Of chocolate: to change suddenly from a fluid to an undesirably hard and gritty texture.",
                  "examples": [
                    "Chocolate seizes if a small amount of water (or watery liquid such as brandy) finds its way into the chocolate while it is melting.  […]  If chocolate seizes, it will look grainy and matte rather than glossy and smooth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}