{
  "word": "lump",
  "etymologies": [
    {
      "description": [
        "From Middle English lumpe, from a Germanic base akin to Proto-Germanic *limpaną (“to glide, go, hang loosely”). Compare Dutch lomp (“rag”), German Low German Lump (“rag”), German Lumpen (“rag”) and Lump (“ragamuffin”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lump (plural lumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that protrudes, sticks out, or sticks together; a cluster or blob; a mound or mass of no particular shape.",
                  "examples": [
                    "Stir the gravy until there are no more lumps.",
                    "a lump of coal; a lump of clay; a lump of cheese"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A swelling or nodule of tissue under the skin or in an internal part of the body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group, set, or unit.",
                  "examples": [
                    "The money arrived all at once as one big lump sum payment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, shaped mass of sugar, typically about a teaspoonful.",
                  "examples": [
                    "Do you want one lump or two with your coffee?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dull or lazy person.",
                  "examples": [
                    "Don't just sit there like a lump."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, as plural) A beating or verbal abuse.",
                  "examples": [
                    "He's taken his lumps over the years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A projection beneath the breech end of a gun barrel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of fish, the lumpsucker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang) Food given to a tramp to be eaten on the road.",
                  "examples": [
                    "“A lump,” explained The Whimperer  […]  “is wot a kin’ lady slips youse w’en youse batter de back door. If she invites youse in and lets youse t’row yer feet unner de table, it’s a set-down. If she slips youse a lunch in a poiper bag, it’s a lump. See?  […] ”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lump (third-person singular simple present lumps, present participle lumping, simple past and past participle lumped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat as a single unit; to group together in a casual or chaotic manner (as if forming an ill-defined lump of the items).",
                  "examples": [
                    "People tend to lump turtles and tortoises together, when in fact they are different creatures."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bear (a heavy or awkward burden); to carry (something unwieldy) from one place to another.",
                  "examples": [
                    "Well, a male body was brought to a certain surgeon by a man he had often employed, and the pair lumped it down on the dissecting table, and then the vendor received his money and went."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To burden (someone) with an undesired task or responsibility.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To hit or strike (a person).",
                  "examples": [
                    "If that's the only way you can fight, then you'd better be prepared to get lumped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form a lump or lumps.",
                  "examples": [
                    "Thin the paint with mineral spirits for a medium consistency so that it will not drip or lump."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}