{
  "word": "religious",
  "etymologies": [
    {
      "description": [
        "From Middle English religiouse, religious, religius, religeous, from Anglo-Norman religieus, religius, from Old French religious, religieux, and their source, Latin religiōsus (“religious, superstitious, conscientious”), from religiō. Doublet of religieux."
      ],
      "adjectives": [
        {
          "description": "religious (comparative more religious, superlative most religious)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Concerning religion.",
                  "examples": [
                    "The Senators and Representatives before mentioned, and the members of the several State Legislatures, and all executive and judicial Officers, both of the United States and of the several States, shall be bound by Oath or Affirmation, to support this Constitution; but no religious Test shall ever be required as a Qualification to any Office or public Trust under the United States."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Committed to the practice or adherence of religion.",
                  "examples": [
                    "I was much more religious as a teenager than I am now."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Highly dedicated, as one would be to a religion.",
                  "examples": [
                    "I'm a religious fan of college basketball."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "religious (plural religious or religiouses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of a religious order, i.e. a monk or nun.",
                  "examples": [
                    "Towards the end of the seventh century the monks of Fleury [...] clandestinely excavated the body of Benedict himself, plus the corpse of his even more shadowy sister and fellow religious, Scholastica."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}