{
  "word": "collect",
  "etymologies": [
    {
      "description": [
        "From Middle English collecten, a borrowing from Old French collecter, from Medieval Latin collectare (“to collect money”), from Latin collecta (“a collection of money, in Late Latin a meeting, assemblage, in Medieval Latin a tax, also an assembly for prayer, a prayer”), feminine of collectus, past participle of colligere, conligere (“to gather together, collect, consider, conclude, infer”), from com- (“together”) + legere (“to gather”), ultimately from Proto-Indo-European *leǵ- (“to gather, collect”)."
      ],
      "adjectives": [
        {
          "description": "collect (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be paid for by the recipient, as a telephone call or a shipment.",
                  "examples": [
                    "It was to be a collect delivery, but no-one was available to pay."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "collect (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With payment due from the recipient.",
                  "examples": [
                    "I had to call collect."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "collect (third-person singular simple present collects, present participle collecting, simple past and past participle collected)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To gather together; amass.",
                  "examples": [
                    "Suzanne collected all the papers she had laid out.",
                    "The team uses special equipment to collect data on temperature, wind speed and rainfall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To get; particularly, get from someone.",
                  "examples": [
                    "A bank collects a monthly payment on a client's new car loan.   A mortgage company collects a monthly payment on a house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To accumulate (a number of similar or related objects), particularly for a hobby or recreation.",
                  "examples": [
                    "John Henry collects stamps.",
                    "I don't think he collects as much as hoards.",
                    "My friend from school has started to collects mangas and novels recently"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To form a conclusion; to deduce, infer. (Compare gather, get.)",
                  "examples": [
                    "[…]  which consequence, I conceive, is very ill collected."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, often with on or against) To collect payments.",
                  "examples": [
                    "He had a lot of trouble collecting on that bet he made."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come together in a group or mass.",
                  "examples": [
                    "The rain collected in puddles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To infer; to conclude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a vehicle or driver) To collide with or crash into (another vehicle or obstacle).",
                  "examples": [
                    "The truck veered across the central reservation and collected a car that was travelling in the opposite direction."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English collecte, from Ecclesiastical Latin collēcta (“assembly; collect”), originally designating the gathering at the beginning of a liturgical celebration."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "collect (plural collects) (sometimes capitalized)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The prayer said before the reading of the epistle lesson, especially one found in a prayerbook, as with the Book of Common Prayer.",
                  "examples": [
                    "He used the day's collect as the basis of his sermon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}