{
  "word": "expressive",
  "etymologies": [
    {
      "description": [
        "From Middle French expressif."
      ],
      "adjectives": [
        {
          "description": "expressive (comparative more expressive, superlative most expressive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Effectively conveying thought or feeling.",
                  "examples": [
                    "expressive dancing"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "expressive (plural expressives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Any word or phrase that expresses (that the speaker, writer, or signer has) a certain attitude toward or information about the referent.",
                  "examples": [
                    "Consider the case of expressives, where no prior knowledge of the speaker’s attitudes are required to interpret the utterance. In (43) [\"That jerk Alexa keeps making me look bad\"], Steve does not need to know (and in fact has no prior knowledge of) anything relating to Siri’s attitudes towards Alexa to interpret that Siri has a negative attitude about Alexa. It is the expressive that jerk that implies the negative attitude."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, more narrowly) A word or phrase, belonging to a distinct word class or having distinct morphosyntactic properties, with semantic symbolism (for example, an onomatopoeia), variously considered either a synonym, a hypernym or a hyponym of ideophone.",
                  "examples": [
                    "I examine the valency of expressives, a class of ideophones in Mundari, comparing their behaviors as predicates to those of reduplicated verb forms."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}