{
  "word": "allotment",
  "etymologies": [
    {
      "description": [
        "From Old French alotement (modern French allotement)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "allotment (countable and uncountable, plural allotments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of allotting.",
                  "examples": [
                    "You will achieve more in designated sessions of quiet uninterrupted periods than in a longer allotment of time broken up by various activities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something allotted; a share, part, or portion granted or distributed",
                  "examples": [
                    "Similar customs prevailed in a part of Friesland, the most notable of which was the ‘Jus Theelacticum,’ or custom of the Theel lands, doles, or allottable lands in East Friesland, not far from the mouth of the Ems. There an inherited allotment was indivisible; on the death of the father it passed intact to the youngest son, and on his death without issue it fell into the possession of the whole community"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The allowance of a specific amount of money or other credit of a particular thing to a particular person.",
                  "examples": [
                    "Maynard used to help before he got sick, but there was no income except what I brought in my allotment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A plot of land rented from the council for growing fruit and vegetables.",
                  "examples": [
                    "The fallout of this unexpected turn of events was that it was Saturday morning, the first day of the Easter holidays, before the thought of my allotment even entered my head. Goodness only knew how big my carrots were going to be by the time I got round there!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}