{
  "word": "parlay",
  "etymologies": [
    {
      "description": [
        "The verb is derived from paroli (“cumulative bet in card games”), possibly modified under the influence of French parler (“to speak, talk”). Paroli is derived from French paroli (“double stake”), from Italian paroli, plural of parolo (first-person singular present indicative of parare (“to protect or shield (from); to prepare”), from Latin parāre, present active infinitive of parō (“to arrange, prepare; to furnish, provide”), from Proto-Indo-European *per- (“to go through; to carry forth, fare”)) + Italian -lo (suffix meaning ‘it; this or that thing’).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parlay (plural parlays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally US, gambling) A bet or series of bets where the stake and winnings are cumulatively carried forward; an accumulator. [from early 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "parlay (third-person singular simple present parlays, present participle parlaying, simple past and past participle parlayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, gambling) To carry forward the stake and winnings from a bet on to a subsequent wager or series of wagers. [from early 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To increase (an asset, money, etc.) by gambling or investing in a daring manner.",
                  "examples": [
                    "Shall we parlay the value of our products?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension, generally) To convert (a situation, thing, etc.) into something better.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Alternative spelling of parley (“to have a discussion, especially one between enemies”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}