{
  "word": "stir",
  "etymologies": [
    {
      "description": [
        "From Middle English stiren, sturien, from Old English styrian (“to be in motion, move, agitate, stir, disturb, trouble”), from Proto-Germanic *sturiz (“turmoil, noise, confusion”), related to Proto-West Germanic *staurijan (“to destroy, disturb”). Cognate with Old Norse styrr (“turmoil, noise, confusion”), German stören (“to disturb”), Dutch storen (“to disturb”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stir (countable and uncountable, plural stirs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or result of stirring (moving around the particles of a liquid etc.)",
                  "examples": [
                    "Can you give the soup a little stir?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "agitation; tumult; bustle; noise or various movements.",
                  "examples": [
                    "Why all these words, this clamour, and this stir?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Public disturbance or commotion; tumultuous disorder; seditious uproar.",
                  "examples": [
                    "Being advertised of some stirs raised by his unnatural sons in England."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Agitation of thoughts; conflicting passions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stir (third-person singular simple present stirs, present participle stirring, simple past and past participle stirred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disturb the relative position of the particles of (a liquid or similar) by passing an object through it.",
                  "examples": [
                    "Synonym: agitate",
                    "She stirred the pudding with a spoon.",
                    "He stirred his coffee so the sugar wouldn't stay at the bottom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disturb the content of (a container) by passing an object through it.",
                  "examples": [
                    "Would you please stir this pot so that the chocolate doesn't burn?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To incite to action.",
                  "examples": [
                    "Synonyms: arouse, instigate, prompt, excite; see also Thesaurus:incite"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring into debate; to agitate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To disturb, to disrupt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To change the place of in any manner; to move.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To begin to move, especially gently, from a still or unmoving position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a feeling or emotion: to rise, begin to be felt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be in motion; to be active or bustling; to exert or busy oneself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rise from sleep or unconsciousness.",
                  "examples": [
                    "Synonyms: arise, get up, rouse; see also Thesaurus:wake"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Romani stariben (“prison”), nominalisation of (a)star (“seize”), causative of ast (“remain”), probably from Sanskrit आतिष्ठति (ātiṣṭhati, “stand or remain by”), from तिष्ठति (tiṣṭhati, “stand”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stir (countable and uncountable, plural stirs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Jail; prison.",
                  "examples": [
                    "He's going to be spending maybe ten years in stir."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}