{
  "word": "sorrel",
  "etymologies": [
    {
      "description": [
        "From Middle English sorel, from Old French sorel, surele (“sorrel”), from Old French sur (“sour”), of Germanic origin, ultimately from Proto-Germanic *sūraz (“sour”); equivalent to sour +‎ -el (diminutive suffix). Compare Old English sūre (“sorrel”), Icelandic súra (“sorrel”), Dutch zuring (“sorrel”). More at sour."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sorrel (countable and uncountable, plural sorrels)",
          "definitionGroups": [
            {
              "group": "Any of various plants with acidic leaves, especially",
              "entries": [
                {
                  "meaning": "Rumex acetosa (common sorrel, garden sorrel), sometimes used as a salad vegetable.",
                  "examples": []
                },
                {
                  "meaning": "Members of genus Oxalis or family Oxalidaceae, woodsorrels.",
                  "examples": []
                },
                {
                  "meaning": "The roselle, Hibiscus sabdariffa.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drink, consumed especially in the Caribbean around Christmas, made from the flowers of Hibiscus sabdariffa: hibiscus tea.",
                  "examples": [
                    "For instance, one day we were sitting on the porch, looking down at the lagoon and the yachts from all over the world. He was drinking ginger beer mixed with rum, and I was drinking sorrel. No rum. Out of nowhere, he proposed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English *sorel, from Middle French *sorel, sorrel, surrel, from Middle French sor (“yellowish-brown, reddish-brown”), probably from Old Frankish *saur (“dried”), from Proto-Germanic *sauzaz (“dry”), from Proto-Indo-European *saus- (“dry, parched”); equivalent to sore (“reddish-brown”) +‎ -el (diminutive suffix). Cognate with Middle Dutch soor (“dry”), Old High German sōrēn (“to become dry”), and Old English sēar (“withered, barren”). See also sere."
      ],
      "adjectives": [
        {
          "description": "sorrel (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a brown colour, with a tint of red. (especially: a sorrel horse)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "sorrel (countable and uncountable, plural sorrels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brown colour, with a tint of red.",
                  "examples": [
                    "sorrel:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}