{
  "word": "asocial",
  "etymologies": [
    {
      "description": [
        "a- +‎ social; in the sense of “antisocial” and as a noun, appears to be a calque of German asozial / Asozialer."
      ],
      "adjectives": [
        {
          "description": "asocial (comparative more asocial, superlative most asocial)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not social, not relating to society.",
                  "examples": [
                    "All media operations are in effect desocialised  […] . But it is then interesting that from this wholly unhistorical and asocial base McLuhan projects certain images of society  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not sociable; having minimal social connections with others; not inclined to connect with others socially.",
                  "examples": [
                    "Mrs Alphen, from her deck chair, would call at him brightly, “Aren’t you ashamed of yourself, being so selfish and neglecting us ladies and all!” and she would gesture at the deck chair beside her, but he would only smile and scuttle away, realizing that he was asocial and a scoundrel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes proscribed) Antisocial.",
                  "examples": [
                    "The so­cial  worker  speaks  of asocial behavior. The term is familiar to the young criminal. The social worker is able to explain the causes of this asocial  behavior. But the delinquent could do it too, and in the very same terms."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "asocial (plural asocials)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person considered to be antisocial or to exhibit antisocial behaviour, especially as a classification used by the Nazi regime in Germany.",
                  "examples": [
                    "“Remember, there was no on-paper legislation against blacks, so they were often admitted to work camps on trumped-up charges and under various crimes. Some were interned as Communists, or as immigrants, who wore the blue badge. Or as homosexuals, who wore the pink badge, or as repeat criminals, who wore the green badge, or asocials, who wore the black badge.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}