{
  "word": "reach",
  "etymologies": [
    {
      "description": [
        "From Middle English rechen, from Old English rǣċan (“to reach”), from Proto-West Germanic *raikijan, from Proto-Germanic *raikijaną, from the Proto-Indo-European *Hreyǵ- (“to bind, reach”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reach (plural reaches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of stretching or extending; extension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to reach or touch with the person, a limb, or something held or thrown.",
                  "examples": [
                    "The fruit is beyond my reach.",
                    "to be within reach of cannon shot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The power of stretching out or extending action, influence, or the like; power of attainment or management; extent of force or capacity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Extent; stretch; expanse; hence, application; influence; result; scope.",
                  "examples": [
                    "While points measure the number of times the average person in a group sees an ad, reach measures the percentage of people in a group that see an ad at least once. Increasing the reach of an ad becomes increasingly expensive as you go along (for the mathematically inclined, it is an exponential function)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An exaggeration; an extension beyond evidence or normal; a stretch.",
                  "examples": [
                    "To call George eloquent is certainly a reach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing) The distance a boxer's arm can extend to land a blow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Any point of sail in which the wind comes from the side of a vessel, excluding close-hauled.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The distance traversed between tacks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A stretch of a watercourse which can be sailed in one reach (in the previous sense). An extended portion of water; a stretch; a straightish portion of a stream, river, or arm of the sea extending up into the land, as from one turn to another. By extension, the adjacent land.",
                  "examples": [
                    "the gulfe Iasius, and all the coast thereof is very full of creekes and reaches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A level stretch of a watercourse, as between rapids in a river or locks in a canal. (examples?)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An extended portion or area of land or water.",
                  "examples": [
                    "Through eerie reach of ancient woods / Where lumbering mists arise / I journey for nines moons of the year / To where a land of legend lies"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An article to obtain an advantage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The pole or rod connecting the rear axle with the forward bolster of a wagon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "reach (third-person singular simple present reaches, present participle reaching, simple past and past participle reached or (obsolete) raught)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To extend, stretch, or thrust out (for example a limb or object held in the hand).",
                  "examples": [
                    "He reached for a weapon that was on the table.",
                    "He reached for his shoe with his legs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive)  To give to someone by stretching out a limb, especially the hand; to give with the hand; to pass to another person; to hand over.",
                  "examples": [
                    "to reach one a book"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stretch out the hand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attain or obtain by stretching forth the hand; to extend some part of the body, or something held, so as to touch, strike, grasp, etc.",
                  "examples": [
                    "to reach an object with the hand, or with a spear",
                    "“I can't quite reach the pepper. Could you pass it to me?”",
                    "The gun was stored in a small box on a high closet shelf, but the boy managed to reach it by climbing on other boxes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a missile) To strike or touch.",
                  "examples": [
                    "His bullet reached its intended target."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To extend an action, effort, or influence to; to penetrate to; to pierce, or cut.",
                  "examples": [
                    "A few words, lovingly, encouragingly spoken failed to reach her heart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To extend to; to stretch out as far as; to touch by virtue of extent.",
                  "examples": [
                    "his hand reaches the river",
                    "When the forest reaches the river, you will be able to rest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To arrive at (a place) by effort of any kind.",
                  "examples": [
                    "After three years, he reached the position of manager.",
                    "The climbers reached the top of the mountain after a gruelling ten-day hike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To make contact with.",
                  "examples": [
                    "Synonyms: contact, get hold of, get in touch",
                    "I tried to reach you all day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To connect with (someone) on an emotional level, making them receptive of (one); to get through to (someone).",
                  "examples": [
                    "What will it take for me to reach him?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, India, Singapore) To arrive at a particular destination.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To continue living until or up to (a certain age).",
                  "examples": [
                    "You can only access the inheritance money when you reach the age of 25."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To understand; to comprehend.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strain after something; to make (sometimes futile or pretentious) efforts.",
                  "examples": [
                    "Reach for your dreams.",
                    "Reach for the stars!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To extend in dimension, time etc.; to stretch out continuously (past, beyond, above, from etc. something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To sail on the wind, as from one point of tacking to another, or with the wind nearly abeam.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, MTE, MLE) To arrive at a particular destination, especially to join someone; to meet up.",
                  "examples": [
                    "Synonym: link up",
                    "What time you reaching tomorrow?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reach (plural reaches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialect) Alternative form of retch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "reach (third-person singular simple present reaches, present participle reaching, simple past and past participle reached)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialect) Alternative form of retch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}