{
  "word": "organic",
  "etymologies": [
    {
      "description": [
        "From Middle English organic, organik, from Old French organique, from Latin organicus."
      ],
      "adjectives": [
        {
          "description": "organic (comparative more organic, superlative most organic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Pertaining to or derived from living organisms. [from 1778]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physiology, medicine) Pertaining to an organ of the body of a living organism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Relating to the compounds of carbon, relating to natural products.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture) Of food or food products, grown in an environment free from artificial agrichemicals, and possibly certified by a regulatory body. [from 1942]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology) Describing a form of social solidarity theorized by Emile Durkheim that is characterized by voluntary engagements in complex interdependencies for mutual benefit (such as business agreements), rather than mechanical solidarity, which depends on ascribed relations between people (as in a family or tribe).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) Of a military unit or formation, or its elements, belonging to a permanent organization (in contrast to being temporarily attached).",
                  "examples": [
                    "Socially, the term “organic” unit implies a military force characterized by relatively high cohesion, overlapping primary groups and a certain sense of shared past."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Instrumental; acting as instruments of nature or of art to a certain destined function or end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, of search results) Generated according to the ranking algorithms of a search engine, as opposed to paid placement by advertisers.",
                  "examples": [
                    "According to a recent survey by Jupiter Research, 80 percent of Web users get information from organic search results."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Developing in a gradual or natural fashion.",
                  "examples": [
                    "The writing of the script was an organic process."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Harmonious; coherent; structured.",
                  "examples": [
                    "The production came together in an organic whole."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "organic (plural organics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) An organic compound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An organic food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(science fiction) A living organism, as opposed to a robot or hologram.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}