{
  "word": "squash",
  "etymologies": [
    {
      "description": [
        "From Middle English squachen, squatchen, from Old French esquacher, escachier, from Vulgar Latin *excoāctiāre, from Latin ex + coāctāre. Probably influenced by Middle English quashen, quassen, from Old French esquasser, escasser (“to crush, shatter, destroy, break”), from Vulgar Latin *exquassare, from Latin ex- + quassare (“to shatter”) (see quash)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squash (countable and uncountable, plural squashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A sport played in a walled court with a soft rubber ball and bats like tennis racquets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A soft drink made from a fruit-based concentrate diluted with water.",
                  "examples": [
                    "Sure. I pour hot squash all over myself and we all have a good chuckle. Everyone except Muggins here."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place or a situation where people have limited space to move.",
                  "examples": [
                    "It's a bit of a squash in this small room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A preparation made by placing material on a slide (flat, rectangular piece of glass), covering it and applying pressure.",
                  "examples": [
                    "Synonym: smear"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, countable) Something soft and easily crushed; especially, an unripe pod of peas.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, countable, derogatory) Something unripe or soft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, countable) A sudden fall of a heavy, soft body; also, a shock of soft bodies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, professional wrestling) An extremely one-sided, usually short, match.",
                  "examples": [
                    "It was one of the most shocking WWE title matches ever witnessed, and effectively a 20-minute squash match as Brock Lesnar \"conquered\" his opponent."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "squash (third-person singular simple present squashes, present participle squashing, simple past and past participle squashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To beat or press into pulp or a flat mass; to crush.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To compress or restrict (oneself) into a small space; to squeeze.",
                  "examples": [
                    "Somehow, she squashed all her books into her backpack, which was now too heavy to carry.",
                    "We all managed to squash into Mum's tiny car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To suppress; to force into submission.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening of Narragansett askutasquash (“[a vegetable] eaten green (or raw)”), from askut (“green, raw”) +‎ asquash (“eaten”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squash (countable and uncountable, plural squash or squashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(botany, countable) A plant and its fruit of any of a few species of the genus Cucurbita, or gourd kind.",
              "entries": [
                {
                  "meaning": "Cucurbita maxima, including hubbard squash, great winter squash, buttercup squash, and some varieties of pumpkins.",
                  "examples": []
                },
                {
                  "meaning": "Cucurbita argyrosperma (syn. Cucurbita mixta), cushaw squash.",
                  "examples": []
                },
                {
                  "meaning": "Cucurbita moschata, butternut squash, Barbary squash, China squash.",
                  "examples": []
                },
                {
                  "meaning": "Cucurbita pepo, most pumpkins, acorn squash, summer squash, zucchini.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(botany) Any other similar-looking plant of other genera.",
              "entries": [
                {
                  "meaning": "Lagenaria siceraria (syn. Cucurbita verrucosa), calabash, long-neck squash.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) The edible or decorative fruit of these plants, or this fruit prepared as a dish.",
                  "examples": [
                    "We ate squash and green beans."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of musquash."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squash (plural squashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, countable) Muskrat.",
                  "examples": [
                    "The squash is a four-footed beast, bigger than a cat."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}