{
  "word": "saturnic",
  "etymologies": [
    {
      "description": [
        "Saturn +‎ -ic."
      ],
      "adjectives": [
        {
          "description": "saturnic (comparative more saturnic, superlative most saturnic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "containing lead or suffering from lead poisoning (saturnia)",
                  "examples": [
                    "As regards alcohol, eight of the men, including one subject of gout and one of lead-poisoning, confined their potations to two pints of beer or less daily. Of one more, a painter, gouty and saturnic, the amount was not ascertained."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "saturnine; tending to a gloomy, melancholy, or bitter disposition",
                  "examples": [
                    "They made an odd-looking pair. Thomas short, round and tubby with the look of a naughty cherub, Campbell tall, saturnic and inclined to look gloomy under his wide fawn sombrero."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "of or relating to the planet Saturn",
                  "examples": [
                    "Under these conditions the Moon could only collide with satellites in orbits external to the Moon itself since it is well-known that any sizable satellite inside the Roche limit would rapidly disintegrate into some kind of saturnic ring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Saturnalian: riotously merry; dissolute",
                  "examples": [
                    "A remarkable example of such saturnic mime is provided by Plato’s Symposium. Its beginning is saturnalia, its ending—komos; its whole setting is not everyday-realistic but saturnic, Bacchic, and the roots of “feast” philosophy (wine and the theme of eros) lie in Bacchism-saturnism."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}