{
  "word": "pineapple",
  "etymologies": [
    {
      "description": [
        "From Middle English pinappel (“pinecone”, literally “pine-apple/pine-fruit”), equivalent to pine +‎ apple. Later applied to the fruit of the pineapple plant due to its resemblance to a pinecone. Compare the Middle Dutch and Dutch pĳnappel, the Middle Low German pinappel, the Old High German pīnapful, the Middle High German pīnaphel, and the early Modern German pinapfel — all in the sense of “pine cone”. Compare also the post-Classical Latin pomum pini, the Old French pume de pin, the Middle French and French pomme de pin and Spanish piña."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pineapple (plural pineapples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tropical plant, Ananas comosus, native to South America, having thirty or more long, spined and pointed leaves surrounding a thick stem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ovoid fruit of the pineapple plant, which has very sweet white or yellow flesh, a tough, spiky shell and a tough, fibrous core.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The flesh of a pineapple fruit used as a food item.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An Australian fifty dollar note.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A web burrfish (Chilomycterus antillarum, syn. Chilomycterus geometricus)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light yellow colour, like that of pineapple flesh (also called pineapple yellow).",
                  "examples": [
                    "pineapple:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialectal) A pinecone; the cone of the fir.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A decorative carving of a pineapple fruit used as a symbol of hospitality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A hand grenade. (From the similarity to the shape of a pineapple fruit.)",
                  "examples": [
                    "Synonyms: grenade, hand grenade"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hairstyle consisting of a ponytail worn on top of the head, imitating the leaves of a pineapple.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}