{
  "word": "attaint",
  "etymologies": [
    {
      "description": [
        "From Middle English atteinte, from Old French ateint, past participle of ateindre; in some senses influenced by taint."
      ],
      "adjectives": [
        {
          "description": "attaint (comparative more attaint, superlative most attaint)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Convicted, attainted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Attainted; corrupted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "attaint (plural attaints)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A blow or strike, especially in jousting.",
                  "examples": [
                    "At the moment of impact, the king’s eyes are open, his body braced for the atteint; he takes the blow perfectly, its force absorbed by a body securely armoured, moving in the right direction, moving at the right speed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wound on the leg of a horse caused by a blow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, law) The giving of a false verdict by a jury; the conviction of such a jury, and the reversal of the verdict.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "attaint (third-person singular simple present attaints, present participle attainting, simple past and past participle attainted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To subject to attainder; to condemn (someone) to death and extinction of all civil rights.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To subject to calumny; to accuse of a crime or dishonour.",
                  "examples": [
                    "CHARLES STUART. Attainted and proscribed by name and grade in his British regiment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) To taint; to corrupt, sully.",
                  "examples": [
                    "Jem felt that his own character had been attainted; and that to many it might still appear suspicious."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}