{
  "word": "bond",
  "etymologies": [
    {
      "description": [
        "From Middle English bond, a variant of band, from Old English beand, bænd, bend (“bond, chain, fetter, band, ribbon, ornament, chaplet, crown”), from Proto-Germanic *bandaz, *bandiz (“band, fetter”). Cognate with Dutch band, German Band, Swedish band. Doublet of Bund. Related to bind."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bond (plural bonds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Evidence of a long-term debt, by which the bond issuer (the borrower) is obliged to pay interest when due, and repay the principal at maturity, as specified on the face of the bond certificate. The rights of the holder are specified in the bond indenture, which contains the legal terms and conditions under which the bond was issued. Bonds are available in two forms: registered bonds, and bearer bonds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A documentary obligation to pay a sum or to perform a contract; a debenture.",
                  "examples": [
                    "Investors face a quandary. Cash offers a return of virtually zero in many developed countries; government-bond yields may have risen in recent weeks but they are still unattractive. Equities have suffered two big bear markets since 2000 and are wobbling again. It is hardly surprising that pension funds, insurers and endowments are searching for new sources of return.",
                    "Many say that government and corporate bonds are a good investment to balance against a portfolio consisting primarily of stocks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A partial payment made to show a provider that the customer is sincere about buying a product or a service.  If the product or service is not purchased the customer then forfeits the bond.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often in the plural) A physical connection which binds, a band.",
                  "examples": [
                    "The prisoner was brought before the tribunal in iron bonds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An emotional link, connection or union; that which holds two or more people together, as in a friendship; a tie.",
                  "examples": [
                    "They had grown up as friends and neighbors, and not even vastly differing political views could break the bond of their friendship."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moral or political duty or obligation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A link or force between neighbouring atoms in a molecule.",
                  "examples": [
                    "Organic chemistry primarily consists of the study of carbon bonds, in their many variations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A binding agreement, a covenant.",
                  "examples": [
                    "You could rely on him. His word was his bond.",
                    "Herbert resented his wife for subjecting him to the bonds of matrimony; he claimed they had gotten married while drunk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bail bond.",
                  "examples": [
                    "The bailiff released the prisoner as soon as the bond was posted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any constraining or cementing force or material.",
                  "examples": [
                    "A bond of superglue adhered the teacups to the ceiling, much to the consternation of the cafe owners."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) In building, a specific pattern of bricklaying, based on overlapping rows or layers to give strength.",
                  "examples": [
                    "Synonym: bondwork"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A mortgage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(railways) A heavy copper wire or rod connecting adjacent rails of an electric railway track when used as a part of the electric circuit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bonden."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bond (third-person singular simple present bonds, present participle bonding, simple past and past participle bonded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To connect, secure or tie with a bond; to bind.",
                  "examples": [
                    "The gargantuan ape was bonded in iron chains and carted onto the stage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to adhere (one material with another).",
                  "examples": [
                    "The children bonded their snapshots to the scrapbook pages with mucilage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chemistry) To form a chemical compound with.",
                  "examples": [
                    "Under unusual conditions, even gold can be made to bond with other elements."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To guarantee or secure a financial risk.",
                  "examples": [
                    "The contractor was bonded with a local underwriter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form a friendship or emotional connection.",
                  "examples": [
                    "The men had bonded while serving together in Vietnam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put in a bonded warehouse; to secure (goods) until the associated duties are paid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, construction) To lay bricks in a specific pattern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, electricity) To make a reliable electrical connection between two conductors (or any pieces of metal that may potentially become conductors).",
                  "examples": [
                    "A house's distribution panel should always be bonded to the grounding rods via a panel bond."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bail out by means of a bail bond.",
                  "examples": [
                    "In the August election of 1874 I bonded out of jail eighteen colored men that had been in there, and there has not one of them been tried yet, and they never will be."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bonde (“peasant, servant, bondman”), from Old English bōnda, būnda (“householder, freeman, plebeian, husband”), perhaps from Old Norse bóndi (“husbandman, householder”, literally “dweller”), or a contraction of Old English būend (“dweller, inhabitant”), both from Proto-Germanic *būwandz (“dweller”), from Proto-Indo-European *bʰuH- (“to become, grow, appear”). See also bower, boor."
      ],
      "adjectives": [
        {
          "description": "bond (comparative more bond, superlative most bond)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Subject to the tenure called bondage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a state of servitude or slavedom; not free.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Servile; slavish; pertaining to or befitting a slave.",
                  "examples": [
                    "bond fear"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bond (plural bonds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A peasant; churl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vassal; serf; one held in bondage to a superior.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}