{
  "word": "trophy",
  "etymologies": [
    {
      "description": [
        "From Middle French trophée, from Latin trophaeum (“a sign of victory, a monument”), tropaeum, from Ancient Greek τρόπαιον (trópaion, “monument of an enemy's defeat”), from neuter of τροπαῖος (tropaîos, “of defeat”), from τροπή (tropḗ, “a rout, a turning of an enemy”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trophy (plural trophies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object, usually in the form of a statuette, cup, or shield, awarded for success in a competition or to mark a special achievement.",
                  "examples": [
                    "He won the trophy in a running competition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object taken as a prize by a hunter or conqueror, especially one that is displayed.",
                  "examples": [
                    "Around the posts hung helmets, darts, and spears, / And captive chariots, axes, shields, and bars, / And broken beaks of ships, the trophies of their wars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any emblem of success; a status symbol.",
                  "examples": [
                    "His trophies included his second wife, his successful children, the third and fourth homes in Palm Beach and Malibu, and his three yachts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(criminology, by extension) An object taken by a serial killer or rapist as a memento of the crime.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, Ancient Rome) A tropæum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, architecture)  A display of weaponry and other militaria, often captured from a defeated enemy, as an ornament designed for the purpose of triumphalist display by a victor or as a show of military prowess by a monarch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artifact or artwork that has been stolen by a criminal and traded on the black market.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An animal killed by a trophy hunter that usually has its parts sold on the black market.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trophy (third-person singular simple present trophies, present participle trophying, simple past and past participle trophied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adorn with trophies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To win a trophy in a competition.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}