{
  "word": "foundation",
  "etymologies": [
    {
      "description": [
        "From Middle English foundacioun, fundacioun, from Old French fondacion, from Latin fundātiō (“founding, foundation”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "foundation (countable and uncountable, plural foundations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of founding, fixing, establishing, or beginning to erect.",
                  "examples": [
                    "Synonym: establishment",
                    "Antonyms: abolition, dissolution, ruination",
                    "The foundation of his institute has been wrought with difficulty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That upon which anything is founded; that on which anything stands, and by which it is supported; the lowest and supporting layer of a superstructure; underbuilding.",
                  "examples": [
                    "Synonyms: basis, groundwork, underbuilding, underframework"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) The result of the work to begin something; that which stabilizes and allows an enterprise or system to develop.",
                  "examples": [
                    "Synonyms: groundwork, platform, stage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) In solitaire or patience games, one of the piles of cards that the player attempts to build, usually holding all cards of a suit in ascending order.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The lowest and supporting part or member of a wall, including the base course and footing courses; in a frame house, the whole substructure of masonry.",
                  "examples": [
                    "Synonyms: base, groundwall"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A donation or legacy appropriated to support a charitable institution, and constituting a permanent fund; endowment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is founded, or established by endowment; an endowed institution or charity.",
                  "examples": [
                    "The Wikimedia Foundation, Inc. is the parent organization of the Wiktionary collaborative project."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cosmetics) Cosmetic cream roughly skin-colored, designed to make the face appear uniform in color and texture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A basis for social bodies or intellectual disciplines.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}