{
  "word": "mickle",
  "etymologies": [
    {
      "description": [
        "From Middle English mickle, michel, mikel, mochel, muchel, mukel (“much; many; large, tall; great”), from Old English miċel, myċel (“big, large; great; much”), both from Proto-Germanic *mikilaz (“great, large; many, much”), from Proto-Indo-European *méǵh₂s (“big, great”). The word is cognate with Icelandic mikill (“large in quantity or number; much; great”). Doublet of much and muckle.",
        "For the adverb and noun forms, compare Middle English muchel (“extensively, greatly, much”, adverb) and Middle English muchel (“large amount”, noun).",
        "The noun sense “a small amount” was due to the proverb many a little makes a mickle being incorrectly rendered as many a mickle makes a muckle, leading to mickle being thought to mean “a small quantity” and muckle to mean “a large quantity”, even though muckle is a variant of mickle and both mean “a large quantity”."
      ],
      "adjectives": [
        {
          "description": "mickle (comparative more mickle, superlative most mickle)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, now chiefly Scotland and Northern England, especially Northumbria) (Very) great or large.",
                  "examples": [
                    "Synonym: muckle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "mickle (comparative more mickle, superlative most mickle)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, now chiefly Scotland) To a great extent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Frequently, often.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "mickle (countable and uncountable, plural mickles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, chiefly Scotland) A great amount.",
                  "examples": [
                    "Many a little makes a mickle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, Scotland, originally erroneous) A small amount.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Great or important people as a class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Greatness, largeness, stature.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}