{
  "word": "dwarf",
  "etymologies": [
    {
      "description": [
        "From Middle English dwergh, dwerw, dwerf, from Old English dweorg, from Proto-West Germanic *dwerg, from Proto-Germanic *dwergaz.",
        "Cognate with Scots dwerch; Old High German twerc (German Zwerg); Old Norse dvergr (Swedish dvärg); Old Frisian dwirg (West Frisian dwerch); Middle Low German dwerch, dwarch, twerg (German Low German Dwarg, Dwarch); Middle Dutch dwerch, dworch (Dutch dwerg).",
        "The Modern English noun has undergone complex phonetic changes. The form dwarf is the regular continuation of Old English dweorg, but the plural dweorgas would have given rise to dwarrows and the oblique stem dweorge- would have led to dwery. These forms are sometimes found as the nominative singular in Middle English texts and in English dialects. A parallel case is that of Old English burg giving burgh, borough, burrow, bury."
      ],
      "adjectives": [
        {
          "description": "dwarf (comparative dwarfer, superlative dwarfest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially in botany) Miniature.",
                  "examples": [
                    "The specimen is a very dwarf form of the plant.",
                    "It is possible to grow the plants as dwarf as one desires."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "dwarf (plural dwarfs or dwarves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mythology) Any member of a race of beings from (especially Scandinavian and other Germanic) folklore, usually depicted as having some sort of supernatural powers and being skilled in crafting and metalworking, often as short with long beards, and sometimes as clashing with elves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now often offensive) A person of short stature, often one whose limbs are disproportionately small in relation to the body as compared with typical adults, usually as the result of a genetic condition.",
                  "examples": [
                    "Synonyms: midget, pygmy (imprecise)",
                    "Antonyms: ettin, giant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An animal, plant or other thing much smaller than the usual of its sort.",
                  "examples": [
                    "Synonym: runt",
                    "dwarf tree",
                    "dwarf honeysuckle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A star of relatively small size.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dwarf (third-person singular simple present dwarfs, present participle dwarfing, simple past and past participle dwarfed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To render (much) smaller, turn into a dwarf (version).",
                  "examples": [
                    "Synonyms: miniaturize, shrink"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make appear (much) smaller, puny, tiny.",
                  "examples": [
                    "The newly-built skyscraper dwarfs all older buildings in the downtown skyline."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make appear insignificant.",
                  "examples": [
                    "Synonyms: eclipse, overshadow, outshadow, outshine, outdo, put to shame, upstage, surpass, outmatch, outstrip",
                    "Bach dwarfs all other composers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become (much) smaller.",
                  "examples": [
                    "Synonym: shrink"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hinder from growing to the natural size; to make or keep small; to stunt.",
                  "examples": [
                    "At present the whole sex is in a manner dwarfed and shrunk - into a race of beauties that seems almost another species"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}