{
  "word": "tween",
  "etymologies": [
    {
      "description": [
        "Clipping of in between."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tween (plural tweens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(animation) An action of tweening (inserting frames for continuity); a sequence of frames generated by tweening.",
                  "examples": [
                    "Because the results of a shape tween can be unpredictable, you can set shape hints to let Flash know how to proceed with the tween."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tween (third-person singular simple present tweens, present participle tweening, simple past and past participle tweened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cinematography) To generate intermediate frames in an animated sequence so as to give the appearance of smooth movement.",
                  "examples": [
                    "Simple motion tweening moves your objects in a straight line from here to there. […] You can also combine frame-by-frame animation with tweened animation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Blend of teen +‎ between in the sense of \"between childhood and adolescence\""
      ],
      "adjectives": [
        {
          "description": "tween (comparative more tween, superlative most tween)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or having to do with tweenagers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tween (plural tweens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A child, especially a girl, in the age range between middle childhood and adolescence, normally between eight and thirteen years of age.",
                  "examples": [
                    "When Play Along — the holder of the Care Bears master toy license — placed Care Bears plushes in Spencer Gifts last year, tweens and teenage girls bought the toys."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Blend of twenty +‎ teen"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tween (plural tweens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) a number or age in the twenties (plural only), or a person of that age",
                  "examples": [
                    "At that time Frodo was still in his tweens, as the hobbits called the irresponsible twenties between childhood and coming of age at thirty-three."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}