{
  "word": "ache",
  "etymologies": [
    {
      "description": [
        "From Middle English aken (verb), and ache (noun), from Old English acan (verb) (from Proto-Germanic *akaną (“to be bad, be evil”)) and æċe (noun) (from Proto-Germanic *akiz), both from Proto-Indo-European *h₂eg- (“sin, crime”). Cognate with Low German aken, achen, äken (“to hurt, to ache”), North Frisian akelig, æklig (“terrible, miserable, sharp, intense”), West Frisian aaklik (“nasty, horrible, dismal, dreary”), Dutch akelig (“nasty, horrible”).",
        "The verb was originally strong, conjugating for tense like take (e.g. I ake, I oke, I have aken), but gradually became weak during Middle English; the noun was originally pronounced as /eɪt͡ʃ/ as spelled (compare breach, from break). Historically the verb was spelled ake, and the noun ache (even after the form /eɪk/ started to become common for the noun; compare again break which is now also a noun). The verb came to be spelled like the noun when lexicographer Samuel Johnson mistakenly assumed that it derived from Ancient Greek ἄχος (ákhos, “pain”) due to the similarity in form and meaning of the two words."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ache (plural aches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Continued dull pain, as distinguished from sudden twinges, or spasmodic pain.",
                  "examples": [
                    "You may suffer a minor ache in your side.",
                    "The aches and pains died down after taking an analgesic."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ache (third-person singular simple present aches, present participle aching, simple past ached or (obsolete) oke, past participle ached or (obsolete) aken)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, stative) To suffer pain; to be the source of, or be in, pain, especially continued dull pain; to be distressed.",
                  "examples": [
                    "My feet were aching for days after the marathon.",
                    "Every muscle in his body ached."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, literary, rare) To cause someone or something to suffer pain.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English ache, from Old French ache, from Latin apium (“celery”). Reinforced by modern French ache."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ache (plural aches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) parsley",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Representing the pronunciation of the letter H."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ache (plural aches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rare spelling of aitch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}