{
  "word": "pecker",
  "etymologies": [
    {
      "description": [
        "From Middle English pekker, equivalent to peck (“to pick at something in the manner of a bird”) +‎ -er (“forming agent nouns”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pecker (plural peckers)",
          "definitionGroups": [
            {
              "group": "Someone who or something that pecks, striking or piercing in the manner of a bird's beak or bill, particularly:",
              "entries": [
                {
                  "meaning": "(uncommon or regional) Any tool used in a pecking fashion, particularly kinds of hoes or pickaxes.",
                  "examples": [
                    "The women with short peckers or parers,... of a foote long and about fiue inches in breadth: doe onely breake the vpper part of the ground to rayse vp the weedes, grasse, & old stubbes of corne stalkes with their rootes... For their corne,... with a pecker they make a hole, wherein they put foure graines."
                  ]
                },
                {
                  "meaning": "(uncommon) Any machine or machine part moving in a pecking fashion, particularly:",
                  "examples": [
                    "The upper end of the finger o carries a \"pecker\" p, which consists of a hardened steel piece with a V edge. This pecker is engaged by any one of several steps or notches in a stepped block m carried by the rocking lever l."
                  ]
                },
                {
                  "meaning": "(weaving, obsolete) A picker, a shuttle-driver: the device which moves backwards and forwards in the shuttle-box to drive the shuttle through the warp.",
                  "examples": [
                    "The shuttle... receives its motion from the peckers connected with cords pulled by the pecking lever."
                  ]
                },
                {
                  "meaning": "(telegraphy, historical) A kind of V-shaped telegraphic relay.",
                  "examples": [
                    "Click, click, click, the pecker is at work."
                  ]
                },
                {
                  "meaning": "(US regional, historical) Clipping of pecker mill, a rice mill.",
                  "examples": [
                    "Rice mills, called pecker, cog, and water mills... The first... so called, from the pestle's striking... in the manner of a wood pecker."
                  ]
                },
                {
                  "meaning": "(zoology) A bird, particularly a member of the group including the woodpeckers, flowerpeckers, oxpeckers, and berrypeckers.",
                  "examples": [
                    "The Titmouse, and the Peckers hungry Brood."
                  ]
                },
                {
                  "meaning": "(zoology, usually colloquial or US regional) Clipping of woodpecker (Picidae).",
                  "examples": [
                    "The pecker was esteemed a sacred and divine bird."
                  ]
                },
                {
                  "meaning": "(UK regional, obsolete) An eater, a diner.",
                  "examples": [
                    "He's a rare pecker."
                  ]
                },
                {
                  "meaning": "(UK regional) A bird's beak or bill.",
                  "examples": [
                    "Pecker, a bird's bill"
                  ]
                },
                {
                  "meaning": "(chiefly US, regional, slang) A penis; cock, dick.",
                  "examples": [
                    "The penis... pecker."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK colloquial, by extension of the sense ‘beak’) A nose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK colloquial, by extension, from the expression ‘keep one's pecker up’) Spirits, nerve, courage.",
                  "examples": [
                    "Mr. King... misstated the fact in saying that he had put a piece of lighted paper to the master's nose while asleep in that house; it was his hot pipe that he applied to the sleeper's nostrils, at the same time crying: Come, old chap, keep your pecker up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural, derogatory slang) Short for peckerwood (\"whitey; white trash\")",
                  "examples": [
                    "These peckers know that as well as me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural, derogatory slang) Short for peckerhead (\"dickhead; an aggressive or objectionable idiot\").",
                  "examples": [
                    "Goddammit! I give you peckers an inch and you automatically take a mile  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Clipping of pecker head (\"an electric motor's junction or terminal connection box, where power cords are connected to the winding leads\").",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}