{
  "word": "haze",
  "etymologies": [
    {
      "description": [
        "Origin unknown; there is nothing to connect the word with Old English hasu, haso (“gray”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "haze (usually uncountable, plural hazes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Very fine solid particles (smoke, dust) or liquid droplets (moisture) suspended in the air, slightly limiting visibility. (Compare fog, mist.)",
                  "examples": [
                    "Our hopes, however, soon vanished; for before eight o'clock, the serenity of the sky was changed into a thick haze, accompanied with rain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reduction of transparency of a clear gas or liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An analogous dullness on a surface that is ideally highly reflective or transparent.",
                  "examples": [
                    "The soap left a persistent haze on the drinking glasses.",
                    "The furniture has a haze, possibly from some kind of wax."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any state suggestive of haze in the atmosphere, such as mental confusion or vagueness of memory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, engineering, packaging) The degree of cloudiness or turbidity in a clear glass or plastic, measured in percent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, brewing) Any substance causing turbidity in beer or wine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "haze (third-person singular simple present hazes, present participle hazing, simple past and past participle hazed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be or become hazy, or thick with haze.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from hawze (“terrify, frighten, confound”), from Middle French haser (“irritate, annoy”)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "haze (third-person singular simple present hazes, present participle hazing, simple past and past participle hazed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, informal) To perform an unpleasant initiation ritual upon a usually non-consenting individual, especially freshmen to a closed community such as a college fraternity or military unit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To oppress or harass by forcing to do hard and unnecessary work.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) In a rodeo, to assist the bulldogger by keeping (the steer) running in a straight line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use aversive stimuli on (a wild animal, such as a bear) to encourage it to keep its distance from humans.",
                  "examples": [
                    "Hazing a bear involves creating a \"negative experience for a bear that seeks out human food or loses its natural avoidance of humans and developed areas,\" the release said. That involves using non-lethal rubber shotgun slugs, or rubber rounds and noise-deterrent rounds in sequence to scare bears away, according to the release."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}