{
  "word": "filler",
  "etymologies": [
    {
      "description": [
        "fill +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "filler (plural fillers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who fills.",
                  "examples": [
                    "They commonly have three, four, five, or six hewers or diggers, to four fillers, so as to keep the fillers always at work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something added to fill a space or add weight or size.",
                  "examples": [
                    "I recommend this album in the face of the fact that five of the eleven songs are the purest filler, dull instrumentals with a harmonica rifling over an indifferent rhythm section. The rest is magnificent […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any semisolid substance used to fill gaps, cracks or pores.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A relatively inert ingredient added to modify physical characteristics.",
                  "examples": [
                    "The word \"filler\" is taboo in the excipient world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short article in a newspaper or magazine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short piece of music or an announcement between radio or TV programmes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any spoken sound or word used to fill gaps in speech; filled pause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cut tobacco used to make up the body of a cigar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) In COBOL, the description of an unnamed part of a record that contains no data relevant to a given context (normally capitalised when in a data division).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) A plant that lacks a distinctive shape and can fill inconvenient spaces around other plants in pots or gardens.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(forestry, usually in the plural) Any standing tree or standard higher than the surrounding coppice in the form of forest known as \"coppice under standards\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, music) material of lower cost or quality that is used to fill a certain television time slot or physical medium, such as a music album",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}