{
  "word": "doodle",
  "etymologies": [
    {
      "description": [
        "Originally dialectal, from Low German dudeltopf, dudeldopp (“simpleton”). Influenced by dawdle. Compare also German dudeln (“to play (the bagpipe)”).",
        "The word doodle first appeared in the early 17th century to mean a fool or simpleton. German variants of the etymon include Dudeltopf, Dudentopf, Dudenkopf, Dude and Dödel. American English dude may be a derivation of doodle.",
        "The meaning \"fool, simpleton\" is intended in the song title \"Yankee Doodle\", originally sung by British colonial troops prior to the American Revolutionary War. This is also the origin of the early eighteenth century verb to doodle, meaning \"to swindle or to make a fool of\". The modern meaning emerged in the 1930s either from this meaning or from the verb \"to dawdle\", which since the seventeenth century has had the meaning of wasting time or being lazy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "doodle (plural doodles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A fool, a simpleton, a mindless person.",
                  "examples": [
                    "Mrs. Sneak. Why doodle! jackanapes! harkee, who am I?  Sneak. Come, don't go to call names: am I? vhy my vife, and I am your master."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small mindless sketch, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, sometimes childish) The penis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "doodle (third-person singular simple present doodles, present participle doodling, simple past and past participle doodled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To draw or scribble aimlessly.",
                  "examples": [
                    "The bored student doodled a submarine in his notebook."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) To drone like a bagpipe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Extracted from Labradoodle, itself a blend of labrador and poodle"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "doodle (plural doodles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any crossbreed of a poodle with a different breed of dog.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}