{
  "word": "evergreen",
  "etymologies": [
    {
      "description": [
        "From ever +‎ green."
      ],
      "adjectives": [
        {
          "description": "evergreen (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of plants, especially trees, that do not shed their leaves seasonally.",
                  "examples": [
                    "Synonym: sempervirent",
                    "Antonym: deciduous"
                  ]
                }
              ]
            },
            {
              "group": "(often figuratively) Continually fresh or self-renewing.",
              "entries": [
                {
                  "meaning": "(contracts) Being a clause which causes an automatic renewal of a contract unless action is taken.",
                  "examples": []
                },
                {
                  "meaning": "(computing) Of a document, a piece of software, or a dataset, being continually up-to-date (as opposed to being published at regular intervals and outdated in the meantime)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(broadcasting) Suitable for transmission at any time; not urgent or time-dependent.",
                  "examples": [
                    "Synonym: timeless"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "evergreen (plural evergreens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shrub or tree that does not shed its leaves or needles seasonally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically, informal) A conifer tree.",
                  "examples": [
                    "The spruce and fir trees crowded to the track on each side to welcome us, the arbor- vitae, with its changing leaves, prompted us to make haste, and the sight of the canoe-birch gave us spirits to do so. Sometimes an evergreen just fallen lay across the track with its rich burden of cones, looking, still, fuller of life than our trees in the most favorable positions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mass media, informal) A news story that can be published or broadcast at any time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "evergreen (third-person singular simple present evergreens, present participle evergreening, simple past and past participle evergreened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(patent law, pharmaceuticals) To extend the term of a patent beyond the normal legal limit, usually through repeated small modifications.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(banking) To set the repayment rate of a loan at or below the interest rate, so low that the principal will never be repaid.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}