{
  "word": "patrol",
  "etymologies": [
    {
      "description": [
        "From French patrouille, from Old French patrouille, patouille (“a night-watch”, literally “a tramping about”), from patrouiller, patouiller, patoiller (“to paddle or pudder in water, dabble with the feet, begrime, besmear”), from patte, pate (“paw, foot of an animal”), from Vulgar Latin *patta (“paw, foot”), from Frankish *patta (“paw, sole of the foot”), from Proto-Germanic *paþjaną, *paþōną (“to walk, tread, go, step, pace”), possibly from Proto-Indo-European *(s)pent-, *(s)pat- (“path; to walk”), a variant of Proto-Indo-European *pent-, *pat- (“path; to go”); see find. Cognate with Dutch pad, patte (“paw”), Low German pedden (“to step, tread”), German patschen (“to splash, smack, dabble, waddle”), German Patsche (“a swatter, beater, paw, puddle, mire”). Related to pad, path."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "patrol (countable and uncountable, plural patrols)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A going of the rounds along the chain of sentinels and between the posts, by a guard, usually consisting of three or four men, to insure greater security from attacks on the outposts.",
                  "examples": [
                    "Four members of the squadron were on patrol."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A movement, by a small body of troops beyond the line of outposts, to explore the country and gain intelligence of the enemy's whereabouts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The guards who go the rounds for observation; a detachment whose duty it is to patrol.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law enforcement) The largest division of officers within a police department or sheriff's office, whose assignment is to patrol and respond to calls for service.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any perambulation of a particular line or district to guard it; also, the people thus guarding.",
                  "examples": [
                    "a customs patrol",
                    "a fire patrol"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scouting) A unit of a troop, usually defined by certain ranks or age groups within the troop, and ideally comprised of six to eight members.",
                  "examples": [
                    "On a makeshift bed in the corner was an old woman looking very sick. Then a patrol of \"Missioner\" Scouts appeared on the scene: one seized a broom and swept out the room; the next made up the fire with some fuel he had procured and made her a cup of tea; another mended the rickety table, bed and chair, making them at any rate serviceable, while a fourth straightened out the bedclothes, propped the old lady up, and did his best to cheer her until the tea was ready."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From French patrouiller, from Old French patrouiller (“to paddle, paw about, patrol”), from patte (“a paw”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "patrol (third-person singular simple present patrols, present participle patrolling, simple past and past participle patrolled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go the rounds along a chain of sentinels; to traverse a police district or beat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To go the rounds of, as a sentry, guard, or policeman",
                  "examples": [
                    "to patrol a frontier",
                    "to patrol a beat"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}