{
  "word": "sag",
  "etymologies": [
    {
      "description": [
        "From late Middle English saggen, probably of North Germanic/Scandinavian/Old Norse origin, akin to Old Norse sokkva (“to sink”), from a denasalized derivative of Proto-Germanic *sinkwaną (“to sink”).",
        "Compare Norwegian Nynorsk sagga (“move slowly”));  probably akin to Danish and Norwegian sakke, Swedish sacka, Icelandic sakka. Compare also Dutch zakken and German sacken (from Low German)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sag (countable and uncountable, plural sags)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of sinking or bending; a droop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The difference in elevation of a wire, cable, chain or rope suspended between two consecutive points.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The difference in height or depth between the vertex and the rim of a curved surface, specifically used for optical elements such as a mirror or lens.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sag (third-person singular simple present sags, present participle sagging, simple past and past participle sagged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sink, in the middle, by its weight or under applied pressure, below a horizontal line or plane.",
                  "examples": [
                    "A line or cable supported by its ends sags, even if it is tightly drawn.",
                    "The floor of a room sags.",
                    "Her once firm bosom began to sag in her thirties."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) To lean, give way, or settle from a vertical position.",
                  "examples": [
                    "A building may sag one way or another.",
                    "The door sags on its hinges."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To lose firmness, elasticity, vigor, or a thriving state; to sink; to droop; to flag; to bend; to yield, as the mind or spirits, under the pressure of care, trouble, doubt, or the like; to be unsettled or unbalanced.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To loiter in walking; to idle along; to drag or droop heavily.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to bend or give way; to load.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To wear one's trousers so that their top is well below the waist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, Canada) To pull down someone else's pants.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sag (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of saag",
                  "examples": [
                    "The dal tarka (£5) is made from whole yellow split peas, while sag aloo (£5) brings potatoes in a rich and oily spinach puree."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}