{
  "word": "corduroy",
  "etymologies": [
    {
      "description": [
        "Origin uncertain. Probably from cord +‎ duroy (“name of a 17th century coarse fabric made in England”). Probably not from French *corde du roi (“cloth of the king”), which is unattested in French, where the term for the \"cloth of the king\" was velours côtelé. Possibly from cordesoy (“corde de soie”), or \"rope of silk or silk-like fabric\" in French), named for example in a 1756 advertisement for clothing fabrics; see Wikipedia article, and comparable in language form to the contemporary serg(e)dusoys (“silk serge”), see Serge (fabric)."
      ],
      "adjectives": [
        {
          "description": "corduroy (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a road, path, etc., paved with split or round logs laid crosswise side by side.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "corduroy (countable and uncountable, plural corduroys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heavy fabric, usually made of cotton, with vertical ribs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Ireland, slang) Cheap and poor-quality whiskey.",
                  "examples": [
                    "Synonym: kill-the-beggar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pattern on snow resulting from the use of a snow groomer to pack snow and improve skiing, snowboarding and snowmobile trail conditions. Corduroy is widely regarded as a good surface on which to ski or ride.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "corduroy (third-person singular simple present corduroys, present participle corduroying, simple past and past participle corduroyed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make (a road) by laying down split logs or tree-trunks over a marsh, swamp etc.",
                  "examples": [
                    "The night was very dark and it rained heavily, the roads were so bad that the troops had to cut trees and corduroy the road a part of the way, to get through."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}