{
  "word": "worthy",
  "etymologies": [
    {
      "description": [
        "From Middle English worthy, wurthi, from Old English *weorþiġ (“\"worthy\"”), equivalent to worth +‎ -y. Cognate with Dutch waardig (“worthy”), Middle Low German werdig (“worthy”), German würdig (“worthy”), Swedish värdig (“worthy”), Icelandic verðugt (“worthy”)."
      ],
      "adjectives": [
        {
          "description": "worthy (comparative worthier, superlative worthiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having worth, merit, or value.",
                  "examples": [
                    "This worthy mind should worthy things embrace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Admirable or honourable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Deserving, or having sufficient worth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Suited; suitable; befitting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "worthy (plural worthies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distinguished or eminent person.",
                  "examples": [
                    "That worthy one day, in our absence, being caught in the act of culpable talpicide, was rebuked by his mistress for disobeying his master's orders."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English worthien, wurthien, from Old English weorþian (“to esteem, honor, worship, distinguish, celebrate, exalt, praise, adorn, deck, enrich, reward”), from Proto-Germanic *werþōną (“to be worthy, estimate, appreciate, appraise”), from Proto-Indo-European *wert- (“to turn, wind”). Cognate with German werten (“to rate, judge, grade, score”), Swedish värdera (“to evaluate, rate, size up, assess, estimate”), Icelandic virða (“to respect, esteem”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "worthy (third-person singular simple present worthies, present participle worthying, simple past and past participle worthied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To render or treat as worthy; exalt; revere; honour; esteem; respect; value; reward; adore.",
                  "examples": [
                    "After having duly paid his addresses to it, he generally spends some time on the marble slab in front of the looking-glass, but without showing the slightest emotion at the sight of his own reflection, or worthying it with a song."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}