{
  "word": "rein",
  "etymologies": [
    {
      "description": [
        "From Middle English rein, reyne, borrowed from Anglo-Norman reyne, resne, from early Medieval Latin retina, ultimately from Classical Latin retineō (“hold back”), from re- + teneō (“keep, hold”). Compare modern French rêne.",
        "Displaced native Old English ġewealdleþer (literally “control leather”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rein (plural reins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strap or rope attached to a bridle or bit, used to control a horse, animal or young child.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) An instrument or means of curbing, restraining, or governing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rein (third-person singular simple present reins, present participle reining, simple past and past participle reined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To direct or stop a horse by using reins.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To restrain; to control; to check.",
                  "examples": [
                    "After an interval that he judged to have lasted twenty minutes, the bed began to shake with poorly reined sobs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To obey directions given with the reins.",
                  "examples": [
                    "She worked each horse at a walk, trot, and then a canter. The horses reined well and executed stops quickly."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Anglo-Norman reines, Middle French reins, and their source, Latin rēnēs. Doublet of ren."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rein (plural reins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, archaic, chiefly in plural) A kidney.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The inward impulses; the affections and passions, formerly supposed to be located in the area of the kidneys.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}