{
  "word": "discourse",
  "etymologies": [
    {
      "description": [
        "From Middle English discours, borrowed from Middle French discours (“conversation, speech”), from Latin discursus (“the act of running about”), from Latin discurrō (“run about”), from dis- (“apart”) + currō (“run”). Spelling modified by influence of Middle French cours (“course”). Doublet of discursus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "discourse (countable and uncountable, plural discourses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, archaic) Verbal exchange, conversation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Expression in words, either speech or writing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A formal lengthy exposition of some subject, either spoken or written.",
                  "examples": [
                    "The preacher gave us a long discourse on duty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any rational expression, reason.",
                  "examples": [
                    "difficult, strange, and harsh to the discourses of natural reason"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(social sciences, countable) An institutionalized way of thinking, a social boundary defining what can be said about a specific topic (after Michel Foucault).",
                  "examples": [
                    "But equally important to the emergence of uniquely African-American queer discourses is the refusal of African-American movements for liberation to address adequately issues of sexual orientation and gender identity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Dealing; transaction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "discourse (third-person singular simple present discourses, present participle discoursing, simple past and past participle discoursed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in discussion or conversation; to converse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To write or speak formally and at length.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To debate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To exercise reason; to employ the mind in judging and inferring; to reason.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To produce or emit (musical sounds).",
                  "examples": [
                    "Music discoursed on that melodious instrument, a Jew's harp, keeps the elfin women away from the hunter, because the tongue of the instrument is of steel."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}