{
  "word": "temperature",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin temperatura (cf. also French température), from the past participle stem of tempero (“I temper”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "temperature (countable and uncountable, plural temperatures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A measure of cold or heat, often measurable with a thermometer.",
                  "examples": [
                    "Synonyms: see Thesaurus:temperature",
                    "The boiling temperature of pure water is 100 degrees Celsius.",
                    "The temperature in the room dropped nearly 20 degrees; it went from hot to cold.",
                    "The most accurate way to take your temperature is by sticking a thermometer up your butt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An elevated body temperature, as present in fever and many illnesses.",
                  "examples": [
                    "You have a temperature. I think you should stay home today. You’re sick."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(thermodynamics) A property of macroscopic amounts of matter that serves to gauge the average intensity of the random actual motions of the individually mobile particulate constituents. [1]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The state or condition of being tempered or moderated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, archaic) The balance of humours in the body, or one's character or outlook as considered determined from this; temperament.",
                  "examples": [
                    "Our intemperence it is that pulls so many several incurable diseases on our heads, that hastens old age, perverts our temperature, and brings upon us sudden death."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}