{
  "word": "autism",
  "etymologies": [
    {
      "description": [
        "From German Autismus, coined by Swiss psychiatrist Eugen Bleuler, first usage dated to 1907 attributed by Carl Jung as an alternative of his for \"auto-erotism\", although Bleuler himself differentiates the terms in his book Dementia Praecox, first published 1911. From Ancient Greek αὐτός (autós, “self”) + -ισμός (-ismós, “-ism”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "autism (usually uncountable, plural autisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(clinical psychology) A pervasive neurological condition that is observable in early childhood and persists throughout the lifespan, characterised by atypical communication, language development, eye contact, and sensory experiences.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(clinical psychology) Synonym of autism spectrum (disorder); generalization of the specific to a range.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, clinical psychology, now medically obsolete) A diagnosis involving a pathological tendency to engage in self-centered fantasy thinking, historically considered a symptom of insanity and/or schizophrenia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang, offensive, derogatory, often self-deprecating) Abnormal and unhealthy focus or persistence, stereotypically coupled with low self-awareness and unhealthy hatred of opposition or criticism.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}