{
  "word": "shell",
  "etymologies": [
    {
      "description": [
        "From Middle English schelle, from Old English sċiell, from Proto-West Germanic *skallju, from Proto-Germanic *skaljō, from Proto-Indo-European *(s)kelH- (“to split, cleave”).",
        "Compare West Frisian skyl (“peel, rind”), Dutch schil (“peel, skin, rink”), Low German Schell (“shell, scale”), Irish scelec (“pebble”), Latin silex (“pebble, flint”), siliqua (“pod”), Old Church Slavonic сколика (skolika, “shell”). More at shale.\nDoublet of sheal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shell (plural shells)",
          "definitionGroups": [
            {
              "group": "A hard external covering of an animal.",
              "entries": [
                {
                  "meaning": "The calcareous or chitinous external covering of mollusks, crustaceans, and some other invertebrates.",
                  "examples": [
                    "In some mollusks, as the cuttlefish, the shell is concealed by the animal's outer mantle and is considered internal.",
                    "Genuine mother-of-pearl buttons are made from sea shells."
                  ]
                },
                {
                  "meaning": "(by extension) Any mollusk having such a covering.",
                  "examples": []
                },
                {
                  "meaning": "(entomology) The exoskeleton or wing covers of certain insects.",
                  "examples": []
                },
                {
                  "meaning": "The conjoined scutes that constitute the \"shell\" (carapace) of a tortoise or turtle.",
                  "examples": []
                },
                {
                  "meaning": "The overlapping hard plates comprising the armor covering the armadillo's body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The hard calcareous covering of a bird egg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the outer layers of skin of an onion.",
                  "examples": [
                    "The restaurant served caramelized onion shells."
                  ]
                }
              ]
            },
            {
              "group": "(botany) The hard external covering of various plant seed forms.",
              "entries": [
                {
                  "meaning": "The covering, or outside part, of a nut.",
                  "examples": [
                    "The black walnut and the hickory nut, both of the same Genus as the pecan, have much thicker and harder shells than the pecan."
                  ]
                },
                {
                  "meaning": "A pod containing the seeds of certain plants, such as the legume Phaseolus vulgaris.",
                  "examples": []
                },
                {
                  "meaning": "(in the plural) Husks of cacao seeds, a decoction of which is sometimes used as a substitute or adulterant for cocoa and its products such as chocolate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) The accreted mineral formed around a hollow geode.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) The casing of a self-contained single-unit artillery projectile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) A hollow, usually spherical or cylindrical projectile fired from a siege mortar or a smoothbore cannon. It contains an explosive substance designed to be ignited by a fuse or by percussion at the target site so that it will burst and scatter at high velocity its contents and fragments. Formerly called a bomb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) The cartridge of a breechloading firearm; a load; a bullet; a round.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) Any slight hollow structure; a framework, or exterior structure, regarded as not complete or filled in, as the shell of a house.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A garment, usually worn by women, such as a shirt, blouse, or top, with short sleeves or no sleeves, that often fastens in the rear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A coarse or flimsy coffin; a thin interior coffin enclosed within a more substantial one.",
                  "examples": [
                    "Upstairs in that chill darkened room which nobody passes who can help it , the old Baronet lies in his coffin shell - an awful form faintly defined beneath the sheet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A string instrument, as a lyre, whose acoustical chamber is formed like a shell.",
                  "examples": [
                    "The first lyre may have been made by drawing strings over the underside of a tortoise shell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The body of a drum; the often wooden, often cylindrical acoustic chamber, with or without rims added for tuning and for attaching the drum head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An engraved copper roller used in print works.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The thin coating of copper on an electrotype.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The watertight outer covering of the hull of a vessel, often made with planking or metal plating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, rigging) The outer frame or case of a block within which the sheaves revolve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A light boat whose frame is covered with thin wood, impermeable fabric, or water-proofed paper; a racing shell or dragon boat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A set of atomic orbitals that have the same principal quantum number.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The outward form independent of what is inside.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The empty outward form of someone or something.",
                  "examples": [
                    "The setback left him a mere shell; he was never the same again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An emaciated person.",
                  "examples": [
                    "He's lost so much weight from illness; he's a shell of his former self."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A psychological barrier to social interaction.",
                  "examples": [
                    "Even after months of therapy he's still in his shell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An operating system software user interface, whose primary purpose is to launch other programs and control their interactions; the user's command interpreter. Shell is a way to separate the internal complexity of the implementation of the command from the user. The internals can change while the user experience/interface remains the same.",
                  "examples": [
                    "The name \"Bash\" is an acronym which stands for \"Bourne-again shell\", itself a pun on the name of the \"Bourne shell\", an earlier Unix shell designed by Stephen Bourne, and the Christian concept of being \"born again\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) A legal entity that has no operations.",
                  "examples": [
                    "A shell corporation was formed to acquire the old factory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A concave rough cast-iron tool in which a convex lens is ground to shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A gouge bit or shell bit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonology) The onset and coda of a syllable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang) A person's ear.",
                  "examples": [
                    "Synonym: shell-like",
                    "Can I have a quick word in your shell?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shell (third-person singular simple present shells, present participle shelling, simple past and past participle shelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the outer covering or shell of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bombard, to fire projectiles at, especially with artillery.",
                  "examples": [
                    "The guns shelled the enemy trenches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To disburse or give up money, to pay. (Often used with out).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fall off, as a shell, crust, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To cast the shell, or exterior covering; to fall out of the pod or husk.",
                  "examples": [
                    "Nuts shell in falling.",
                    "Wheat or rye shells in reaping."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, intransitive) To switch to a shell or command line.",
                  "examples": [
                    "Automenu is a good program to try, and offers a fair amount of protection - but, unfortunately, it's one of those systems that allow users to shell to DOS."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form shallow, irregular cracks (in a coating).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(topology) To form a shelling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}