{
  "word": "contradict",
  "etymologies": [
    {
      "description": [
        "Derived from Latin contrādictus (“contradicted”), the past participle of contrādīcō (“speak against”) (originally two words)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "contradict (third-person singular simple present contradicts, present participle contradicting, simple past and past participle contradicted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deny the truth or validity of (a statement or statements).",
                  "examples": [
                    "His testimony contradicts hers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To oppose (a person) by denying the truth or pertinence of a given statement.",
                  "examples": [
                    "Everything he says contradicts me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be contrary to (something).",
                  "examples": [
                    "[…]  as he is going to a house dedicated to joy and mirth, it was fit he should divest himself of whatever was likely to contradict that intention, or be inconsistent with it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To give an order contrary to (another order or wish), oppose (something).",
                  "examples": [
                    "Lady Sprightly. What had you to do to contradict my commands?",
                    "Doll Subtilty. They were not fit to be obey’d, wherefore they were forbid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To give an order contrary to one given by (another person), oppose or resist (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To speak against; to forbid.",
                  "examples": [
                    "[…] magic hath been publicly professed in former times, in Salamanca, Cracovia, and other places, though after censured by several universities, and now generally contradicted, though practised by some still […]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}