{
  "word": "popular",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin populāris, from populus (“people”) + -āris (“-ar”)."
      ],
      "adjectives": [
        {
          "description": "popular (comparative more popular, superlative most popular)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Common among the general public; generally accepted. [from 15th c.]",
                  "examples": [
                    "Contrary to popular misconception, MacArthur Park is not the worst song ever written."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Concerning the people; public. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to or deriving from the people or general public. [from 16th c.]",
                  "examples": [
                    "At the coming of Calvin thither, the form of their civil regiment was popular, as it continueth at this day: neither king, nor duke, nor nobleman of any authority or power over them, but officers chosen by the people out of themselves, to order all things with public consent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Of low birth, not noble; vulgar, plebian. [16th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Aimed at ordinary people, as opposed to specialists etc.; intended for general consumption. [from 16th c.]",
                  "examples": [
                    "As a work of popular science it is exemplary: the focus may be the numbers, but most of the mathematical legwork is confined to the appendices and the accompanying commentary is amusing and witty, as well as informed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Cultivating the favour of the common people. [16th–18th c.]",
                  "examples": [
                    "Such popular humanity is treason."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Liked by many people; generally pleasing, widely admired. [from 17th c.]",
                  "examples": [
                    "They might have split 24 years ago, but the Smiths remain as popular as ever, and not just among those who remember them first time around."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Adapted to the means of the common people; cheap. [from 19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "popular (plural populars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is popular, especially at a school.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) An inexpensive newspaper with wide circulation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of the Populares",
                  "examples": [
                    "[...] when their ambassadors were come from Samos, and that they saw not only the populars, but also some others of their own party thought trusty before, to be now changed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}