{
  "word": "top",
  "etymologies": [
    {
      "description": [
        "From Middle English top, toppe, from Old English top (“top, highest part; summit; crest; tassel, tuft; (spinning) top, ball; a tuft or ball at the highest point of anything”), from Proto-West Germanic *topp, from Proto-Germanic *tuppaz (“braid, pigtail, end”), of unknown ultimate origin.",
        "Cognate with Scots tap (“top”), North Frisian top, tap, tup (“top”), Saterland Frisian Top (“top”), West Frisian top (“top”), Dutch top (“top, summit, peak”), Low German Topp (“top”), German Zopf (“braid, pigtail, plait, top”), Swedish topp (“top, peak, summit, tip”), Icelandic toppur (“top”).",
        "The sense of a spinning toy is separated from this, obscurely related to Dutch top and dop in this sense, against Standard Dutch tol, and French toupie having this sense."
      ],
      "adjectives": [
        {
          "description": "top (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Situated on the top of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Best; of the highest quality or rank.",
                  "examples": [
                    "She's in the top dance school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Very good, of high quality, power, or rank.",
                  "examples": [
                    "He's a top lawyer.",
                    "That is a top car."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "top (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rated first.",
                  "examples": [
                    "She came top in her French exam."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "top (countable and uncountable, plural tops)",
          "definitionGroups": [
            {
              "group": "The highest or uppermost part of something.",
              "entries": [
                {
                  "meaning": "(irrespective of present orientation) the part of something that is usually the top.",
                  "examples": [
                    "We flipped the machine onto its top."
                  ]
                },
                {
                  "meaning": "The uppermost part of a page, picture, viewing screen, etc.",
                  "examples": [
                    "Synonym: (of a page) head",
                    "Antonym: (of a page) foot",
                    "Further weather information can be found at the top of your television screen.",
                    "Headings appear at the tops of pages."
                  ]
                },
                {
                  "meaning": "A lid, cap or cover of a container.",
                  "examples": [
                    "Synonyms: cap, coverlid",
                    "Put a top on the toothpaste tube or it will go bad."
                  ]
                },
                {
                  "meaning": "A garment worn to cover the torso.",
                  "examples": [
                    "Antonym: bottom",
                    "I bought this top as it matches my jeans.",
                    "I like this pyjama top."
                  ]
                },
                {
                  "meaning": "A framework at the top of a ship's mast to which rigging is attached.",
                  "examples": []
                },
                {
                  "meaning": "(baseball) The first half of an inning, during which the home team fields and the visiting team bats.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) The crown of the head, or the hair upon it; the head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The near end of somewhere",
                  "examples": [
                    "The patio is at the top of my garden.",
                    "The shop is at the top of my street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A child’s spinning toy; a spinning top.",
                  "examples": [
                    "The boy was amazed at how long the top would spin."
                  ]
                }
              ]
            },
            {
              "group": "(heading) Someone who is eminent.",
              "entries": [
                {
                  "meaning": "(archaic) The chief person; the most prominent one.",
                  "examples": []
                },
                {
                  "meaning": "The highest rank; the most honourable position; the utmost attainable place.",
                  "examples": [
                    "to be at the top of one's class, or at the top of the school"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM) A dominant partner in a BDSM relationship or roleplay.",
                  "examples": [
                    "Synonyms: (usually male) dom, (female) domme",
                    "Antonyms: bottom, sub"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gay slang) A man penetrating or with a preference for penetrating during homosexual intercourse.",
                  "examples": [
                    "I prefer being a top, and my boyfriend prefers being a bottom.",
                    "Synonym: pitcher",
                    "Antonym: bottom"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, African-American Vernacular, MLE, MTE) Oral stimulation of the male member, a blowjob.",
                  "examples": [
                    "Synonyms: see Thesaurus:oral sex"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(particle physics) A top quark.",
                  "examples": [
                    "Hypernym: flavor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The utmost degree; the acme; the summit.",
                  "examples": [
                    "The top of my own ambition is to contribute to that work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ropemaking) A plug, or conical block of wood, with longitudinal grooves on its surface, in which the strands of the rope slide in the process of twisting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sound) Highest pitch or loudest volume.",
                  "examples": [
                    "She sang at the top of her voice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(wool manufacture) A bundle or ball of slivers of combed wool, from which the noils, or dust, have been taken out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, except in one sense of phrase on top of) Eve; verge; point.",
                  "examples": [
                    "Hee was upon the top of his marriage with Magdalaine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a cut gem between the girdle, or circumference, and the table, or flat upper surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, slang, dated) Topboots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf, cue sports, racquet sports) A stroke on the top of the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf, cue sports, racquet sports) A forward spin given to the ball by hitting it on or near the top; topspin",
                  "examples": [
                    "1886,  E.T.Sachs,  The Boys Own Annual: Lawn-Tennis of the Present‎[9], volume 9, page 778:What is wanted is just the reverse - i.e top or overspin, which causes the ball to revolve in the direction in which it is going."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in restaurants, preceded by a number) (A table at which there is, or which has enough seats for) a group of a specified number of people eating at a restaurant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for topswarm.",
                  "examples": [
                    "My first topswarm came off on the 25th June, and a second top on the day following; both were put into skeps of one size, and appeared to be equal as regards the number of Bees."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "top (third-person singular simple present tops, present participle topping, simple past and past participle topped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover on the top or with a top.",
                  "examples": [
                    "I like my ice cream topped with chocolate sauce."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To excel, to surpass, to beat, to exceed.",
                  "examples": [
                    "Synonyms: beat, better, best, exceed; see also Thesaurus:exceed",
                    "Titanic was the most successful film ever until it was topped by another Cameron film, Avatar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be in the lead, to be at number one position (of).",
                  "examples": [
                    "Celine Dion topped the UK music charts twice in the 1990s."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut or remove the top (as of a tree)",
                  "examples": [
                    "I don't want to be bald, so just top my hair.",
                    "Top and tail the carrots."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang, reflexive) To commit suicide.",
                  "examples": [
                    "Depression causes many people to top themselves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang, rare) To murder.",
                  "examples": [
                    "Synonyms: kill, murder, slaughter, slay; see also Thesaurus:kill"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM) To be the dominant partner in a BDSM relationship or roleplay.",
                  "examples": [
                    "I used to be a slave, but I ended up topping.",
                    "Giving advice to the dominant partner on how to run the BDSM session is called \"topping from the bottom\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gay slang, transitive, intransitive) To anally penetrate in gay sex.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To rise aloft; to be eminent; to tower.",
                  "examples": [
                    "topping passions"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To excel; to rise above others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To raise one end of (a yard, etc.), making it higher than the other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dyeing) To cover with another dye.",
                  "examples": [
                    "to top aniline black with methyl violet to prevent greening"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put a stiffening piece or back on (a saw blade).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) To arrange (fruit, etc.) with the best on top.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a horse) To strike the top of (an obstacle) with the hind feet while jumping, so as to gain new impetus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To improve (domestic animals, especially sheep) by crossing certain individuals or breeds with other superior breeds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut, break, or otherwise take off the top of (a steel ingot) to remove unsound metal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) To strike (the ball) above the centre; also, to make (a stroke, etc.) by hitting the ball in this way.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}