{
  "word": "ballet",
  "etymologies": [
    {
      "description": [
        "Borrowed from French ballet, from Italian balletto (“short dance, ballet”), diminutive form of ballo (“ball”), from Late Latin ballō (“to dance”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ballet (countable and uncountable, plural ballets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A classical form of dance.",
                  "examples": [
                    "a classically-trained ballet dancer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A theatrical presentation of such dancing, usually with music, sometimes in the form of a story.",
                  "examples": [
                    "Let's go to the ballet in the theatre tomorrow!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The company of persons who perform this dance.",
                  "examples": [
                    "Zara joined the ballet at the age of 14."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A light part song, frequently with a fa-la-la chorus, common among Elizabethan and Italian Renaissance composers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A bearing in coats of arms representing one or more balls, called bezants, plates, etc., according to colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any intricate series of operations involving coordination between individuals.",
                  "examples": [
                    "Food preparation on a potager no doubt became a kitchen ballet in which pans were constantly shifted, coals constantly replenished, and grates shaken out."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ballet (third-person singular simple present ballets, present participle balleting, simple past and past participle balleted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perform an action reminiscent of ballet dancing.",
                  "examples": [
                    "Situations that typically require longer iliac limbs than the measurements suggest include extreme iliac tortuosity, “balleting” of the limbs (Endurant and Excluder) (Fig. 90-3), and the need to extend to the external iliac arteries. It these anatomic circumstances, it is prudent to choose a longer length when in doubt."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}