{
  "word": "posh",
  "etymologies": [
    {
      "description": [
        "Unknown.",
        "Most likely derived from Romani posh (“half”), either because posh-kooroona (“half a crown”) (originally a substantial sum of money) was used metaphorically for anything pricey or upper-class, or because posh-houri (“half-penny”) became a general term for money.",
        "A period slang dictionary defines \"posh\" as a term used by thieves for \"money : generic, but specifically, a halfpenny or other small coin\". An example is given from James Payn's The Eavesdropper (1888): \"They used such funny terms: 'brads,' and 'dibbs,' and 'mopusses,' and 'posh' ... at last it was borne in upon me that they were talking about money.\"",
        "Evidence exists for a slang sense from the 1890s meaning dandy, which is quite possibly related.",
        "A popular folk etymology holds that the term is an acronym for \"port out, starboard home\", describing the cooler, north-facing cabins taken by the most aristocratic or rich passengers travelling from Britain to India and back. However, there is no evidence for this claim.",
        "It could also possibly be a clipping of polished.",
        "See also the articles mentioned in the References section below for additional discussion."
      ],
      "adjectives": [
        {
          "description": "posh (comparative posher or more posh, superlative poshest or most posh)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Associated with the upper classes.",
                  "examples": [
                    "She talks with a posh accent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Stylish, elegant, exclusive (expensive).",
                  "examples": [
                    "After the performance, they went out to a very posh restaurant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually offensive, especially in Scotland and Northern England) Snobbish, materialistic, prejudiced, under the illusion that one is better than everyone else.",
                  "examples": [
                    "We have a right posh git moving in next door"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "posh (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "fragments produced by an impact",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "slush",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "posh (third-person singular simple present poshes, present participle poshing, simple past and past participle poshed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(normally in the phrasal verb posh up) To make posh, or posher.",
                  "examples": [
                    "Synonym: poshen"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}