{
  "word": "fluke",
  "etymologies": [
    {
      "description": [
        "Of uncertain or obscure origin, perhaps dialectal. It seems to have originally referred to a lucky shot at billiards.  Possibly connected to sense 3, referring to whales' use of flukes to move rapidly."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fluke (plural flukes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lucky or improbable occurrence, with the implication that the occurrence could not be repeated.",
                  "examples": [
                    "The first goal was just a fluke."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fluke (third-person singular simple present flukes, present participle fluking, simple past and past participle fluked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To obtain a successful outcome by pure chance.",
                  "examples": [
                    "I fluked a pass in the multiple-choice exam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker) To fortuitously pot a ball in an unintended way.",
                  "examples": [
                    "He fluked the other red into the middle pocket, despite the double kiss."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old English flōc (“flatfish”), of Germanic origin, related to German flach (“flat”), Old Norse floke (“flatfish”), all ultimately from Proto-Germanic *flakaz."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fluke (plural flukes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flounder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trematode; a parasitic flatworm of the Trematoda class, related to the tapeworm.",
                  "examples": [
                    "The man had become infected with flukes after eating a meal of raw fish."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly as Etymology 2 or from Middle Low German flügel (“wing”), from Old High German vlügel, from Proto-Germanic *flugilaz (“wing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fluke (plural flukes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Either of the two lobes of a whale's or similar creature's tail.",
                  "examples": [
                    "The dolphin had an open wound on the left fluke of its tail where the propeller had injured it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Any of the triangular blades at the end of an anchor, designed to catch the ground.",
                  "examples": [
                    "The fluke of the anchor was wedged between two outcroppings of rock and could not be dislodged."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A metal hook on the head of certain staff weapons (such as a bill), made in various forms depending on function, whether used for grappling or to penetrate armour when swung at an opponent.",
                  "examples": [
                    "The polearm had a wide, sharpened fluke attached to the central point."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In general, a winglike formation on a central piece.",
                  "examples": [
                    "After casting the bronze statue, we filed down the flukes and spurs from the molding process."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Waste cotton.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}