{
  "word": "plant",
  "etymologies": [
    {
      "description": [
        "From Middle English plante, from Old English plante (“young tree or shrub, herb newly planted”), from Latin planta (“sprout, shoot, cutting”). Broader sense of \"any vegetable life, vegetation generally\" is from Old French plante. Doublet of clan, borrowed through Celtic languages.",
        "The verb is from Middle English planten, from Old English plantian (“to plant”), from Latin plantāre, later influenced by Old French planter. Compare also Dutch planten (“to plant”), German pflanzen (“to plant”), Swedish plantera (“to plant”), Icelandic planta (“to plant”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plant (plural plants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) An organism that is not an animal, especially an organism capable of photosynthesis. Typically a small or herbaceous organism of this kind, rather than a tree.",
                  "examples": [
                    "The garden had a couple of trees, and a cluster of colourful plants around the border."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) An organism of the kingdom Plantae; now specifically, a living organism of the Embryophyta (land plants) or of the Chlorophyta (green algae), a eukaryote that includes double-membraned chloroplasts in its cells containing chlorophyll a and b, or any organism closely related to such an organism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecology) Now specifically, a multicellular eukaryote that includes chloroplasts in its cells, which have a cell wall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(proscribed as biologically inaccurate) Any creature that grows on soil or similar surfaces, including plants and fungi.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A factory or other industrial or institutional building or facility.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object placed surreptitiously in order to cause suspicion to fall upon a person.",
                  "examples": [
                    "That gun's not mine! It's a plant! I've never seen it before!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anyone assigned to behave as a member of the public during a covert operation (as in a police investigation).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, placed amongst an audience, whose role is to cause confusion, laughter etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker) A play in which the cue ball knocks one (usually red) ball onto another, in order to pot the second; a set.",
                  "examples": [
                    "O’Sullivan risked a plant that went badly astray, splitting the reds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Machinery, such as the kind used in earthmoving or construction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A young tree; a sapling; hence, a stick or staff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The sole of the foot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang) A plan; a swindle; a trick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An oyster which has been bedded, in distinction from one of natural growth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialect) A young oyster suitable for transplanting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(control theory) The combination of process and actuator.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plant (third-person singular simple present plants, present participle planting, simple past and past participle planted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To place (a seed or plant) in soil or other substrate in order that it may live and grow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place (an object, or sometimes a person), often with the implication of intending deceit.",
                  "examples": [
                    "That gun's not mine! It was planted there by the real murderer!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place or set something firmly or with conviction.",
                  "examples": [
                    "Plant your feet firmly and give the rope a good tug.",
                    "to plant cannon against a fort; to plant a flag; to plant one's feet on solid ground"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To place in the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish or supply with plants.",
                  "examples": [
                    "to plant a garden, an orchard, or a forest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To engender; to generate; to set the germ of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish with a fixed and organized population; to settle; to establish.",
                  "examples": [
                    "to plant a colony"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To introduce and establish the principles or seeds of.",
                  "examples": [
                    "to plant Christianity among the heathen"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To set up; to install; to instate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}