{
  "word": "damp",
  "etymologies": [
    {
      "description": [
        "From Middle English dampen (“to stifle; suffocate”). Akin to Low German damp, Dutch damp, and German Dampf (“vapor, steam, fog”), Icelandic dampi, Swedish damm (“dust”), and to German dampf imperative of dimpfen (“to smoke”). Also Middle English dampen (“to extinguish, choke, suffocate”). Ultimately all descend from Proto-Germanic *dampaz."
      ],
      "adjectives": [
        {
          "description": "damp (comparative damper, superlative dampest) # Permitting the possession of alcoholic beverages, but not their sale.",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a state between dry and wet; moderately wet; moist.",
                  "examples": [
                    "Once the farms have been drained and the dead plants have been cut down and cleared, farmers then have to be alert for signs of black sigatoka, a devastating fungus which flourishes in damp conditions and can destroy banana farms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Despondent; dispirited, downcast.",
                  "examples": [
                    "Though Travis's 'Why does it always Rain on Me' boomed around the stands, there were few damp spirits in Galway on day two of the races."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "damp (countable and uncountable, plural damps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moisture; humidity; dampness.",
                  "examples": [
                    "What means this chilling damp that clings around me!",
                    "Why do I tremble thus!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Fog; fogginess; vapor.",
                  "examples": [
                    "Her chilling finger on my head,",
                    "With coldest touch congealed my soul—",
                    "Cold as the finger of the dead,",
                    "Or damps which round a tombstone roll—"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Dejection or depression; something that spoils a positive emotion (such as enjoyment, satisfaction, expectation or courage) or a desired activity.",
                  "examples": [
                    "But though the War was proclaim’d, and Preparations accordingly made for it, the Expectations from all receiv’d a sudden Damp, by the as sudden Death of King William."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or historical, mining) A gaseous product, formed in coal mines, old wells, pits, etc.",
                  "examples": [
                    "There are sulphurous Vapours which infect the Vegetables, and render the Grass unwholsom to the Cattle that feed upon it: Miners are often hurt by these Steams. Observations made in some of the Mines in Derbyshire, describe four sorts of those Damps."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "damp (third-person singular simple present damps, present participle damping, simple past and past participle damped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To dampen; to make moderately wet",
                  "examples": [
                    "Synonym: moisten",
                    "to damp cloth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To put out, as fire; to weaken, restrain, or make dull.",
                  "examples": [
                    "How many a day has been damped and darkened by an angry word!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To suppress vibrations (mechanical) or oscillations (electrical) by converting energy to heat (or some other form of energy).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}