{
  "word": "trail",
  "etymologies": [
    {
      "description": [
        "From Middle English trailen, from Old French trailler (“to tow; pick up the scent of a quarry”), from Vulgar Latin *tragulāre (“to drag”), from Latin tragula (“dragnet, javelin thrown by a strap”), probably related to Latin trahere (“to pull, drag along”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trail (plural trails)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The track or indication marking the route followed by something that has passed, such as the footprints of animal on land or the contrail of an airplane in the sky.",
                  "examples": [
                    "Synonyms: spoor, sign",
                    "trail of blood",
                    "condensation trail",
                    "data trail, paper trail"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A route for travel over land, especially a narrow, unpaved pathway for use by hikers, horseback riders, etc.",
                  "examples": [
                    "Synonyms: dirt track, footpath, path, track"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A route or circuit generally.",
                  "examples": [
                    "Politicians are on the campaign trail in preparation for this year's election."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A trailer broadcast on television for a forthcoming film or programme.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A walk in which all the edges are distinct.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The horizontal distance from where the wheel touches the ground to where the steering axis intersects the ground.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trail (third-person singular simple present trails, present participle trailing, simple past and past participle trailed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To follow behind (someone or something); to tail (someone or something).",
                  "examples": [
                    "The hunters trailed their prey deep into the woods."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drag (something) behind on the ground.",
                  "examples": [
                    "You'll get your coat all muddy if you trail it around like that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To leave (a trail of).",
                  "examples": [
                    "He walked into the house, soaking wet, and trailed water all over the place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To show a trailer of (a film, TV show etc.); to release or publish a preview of (a report etc.) in advance of the full publication.",
                  "examples": [
                    "His new film was trailed on TV last night.",
                    "There were no surprises in this morning's much-trailed budget statement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hang or drag loosely behind; to move with a slow sweeping motion.",
                  "examples": [
                    "The bride's long dress trailed behind her as she walked down the aisle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To run or climb like certain plants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To drag oneself lazily or reluctantly along.",
                  "examples": [
                    "Our parents marched to church and we trailed behind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be losing, to be behind in a competition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) To carry (a firearm) with the breech near the ground and the upper part inclined forward, the piece being held by the right hand near the middle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To create a trail in.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To travel by following or creating trails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To transport (livestock) by herding it along a trail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To take advantage of the ignorance of; to impose upon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}