{
  "word": "agree",
  "etymologies": [
    {
      "description": [
        "From Middle English agreen, from Old French agreer (“to accept or receive kindly”), from a gré (“favorably”), from Latin ad (“to”) + gratum (“pleasing”), ultimately from Proto-Indo-European *gʷerH- (“to welcome, greet, praise”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "agree (third-person singular simple present agrees, present participle agreeing, simple past and past participle agreed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be in harmony about an opinion, statement, or action; to have a consistent idea between two or more people.",
                  "examples": [
                    "Synonym: concur",
                    "all parties agree in the expediency of the law.",
                    "I mostly agree with what you said, but I consider your last point to be unfair.",
                    "I couldn't agree more with what you say."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, followed by \"to\") To give assent; to accede",
                  "examples": [
                    "to agree to an offer, or to opinion.",
                    "The workers didn not agree to the new terms offered by the trade union."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, Ireland) To yield assent to; to approve.",
                  "examples": [
                    "Bishops agree sex abuse rules"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a stipulation by way of settling differences or determining a price; to exchange promises; to come to terms or to a common resolve; to promise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To resemble; to coincide; to correspond.",
                  "examples": [
                    "the picture does not agree with the original; the two scales agree exactly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now always with with) To suit or be adapted in its effects; to do well.",
                  "examples": [
                    "the same food does not agree with every constitution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, grammar) To correspond to (another word) in a grammatical category, such as gender, number, case, or person.",
                  "examples": [
                    "In Romanian, all articles, adjectives, and pronouns agree in gender, number and case with the noun they refer to."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, law) To consent to a contract or to an element of a contract.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}