{
  "word": "squib",
  "etymologies": [
    {
      "description": [
        "Possibly imitative of a small explosion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squib (plural squibs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A small firework that is intended to spew sparks rather than explode.",
                  "examples": [
                    "English Navy squibs set fire to two dozen enemy ships in a Dutch harbor during the 16th-century battle against the Spanish Armada."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A similar device used to ignite an explosive or launch a rocket, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A kind of slow match or safety fuse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Any small firecracker sold to the general public, usually in special clusters designed to explode in series after a single master fuse is lit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) A malfunction in which the fired projectile does not have enough force behind it to exit the barrel, and thus becomes stuck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) The heating element used to set off the sodium azide pellets in a vehicle's airbag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, theater) In special effects, a small explosive used to replicate a bullet hitting a surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A short piece of witty writing; a lampoon.",
                  "examples": [
                    "Of the dozen or so surviving articles, squibs, and letters to the editor, the most remarkable appeared in the Whip and Satirist’s February 12, 1842, issue, and disclosed the existence of a cabal of gay men in New York's otherwise wholesome nightscape of brothels and riots."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A writer of lampoons.",
                  "examples": [
                    "The squibs are those who in the common phrase of the world are called libellers, lampooners, and pamphleteers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) In a legal casebook, a short summary of a legal action placed between more extensively quoted cases.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A short article, often published in journals, that introduces theoretically problematic empirical data or discusses an overlooked theoretical problem. In contrast to a typical article, a squib need not answer the questions that it poses.",
                  "examples": [
                    "In this squib I will prove that the number of possible metrical parsings into feet under these assumptions  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic except in idioms) An unimportant, paltry, or mean-spirited person.",
                  "examples": [
                    "Its a hard case when men of good deserving / must either driven be perforce to sterving / or asked for their pas by everie squib."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graphic design) A sketched concept or visual solution, usually very quick and not too detailed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "squib (third-person singular simple present squibs, present participle squibbing, simple past and past participle squibbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a sound like a small explosion.",
                  "examples": [
                    "A Snider squibbed in the jungle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, dated, transitive, intransitive) To throw squibs; to utter sarcastic or severe reflections; to contend in petty dispute.",
                  "examples": [
                    "to squib a little debate"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}