{
  "word": "distance",
  "etymologies": [
    {
      "description": [
        "From Middle English distance, distaunce, destaunce, from Old French destance, from Latin distantia (“distance, remoteness, difference”), from distāns, present participle of distō (“I stand apart, I am separate, distant, or different”), from di-, dis- (“apart”) + stō (“I stand”). Compare Dutch afstand (“distance”, literally “off-stand, off-stance”), German Abstand."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "distance (countable and uncountable, plural distances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The amount of space between two points, usually geographical points, usually (but not necessarily) measured along a straight line.",
                  "examples": [
                    "The distance to Petersborough is thirty miles.",
                    "From Moscow, the distance is relatively short to Saint Petersburg, relatively long to Novosibirsk, but even greater to Vladivostok."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Length or interval of time.",
                  "examples": [
                    "ten years' distance between my writing the one and the other"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) The difference; the subjective measure between two quantities.",
                  "examples": [
                    "We're narrowing the distance between the two versions of the bill.  The distance between the lowest and next gear on my bicycle is annoying."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Remoteness of place; a remote place.",
                  "examples": [
                    "'Tis distance lends enchantment to the view."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Remoteness in succession or relation.",
                  "examples": [
                    "the distance between a descendant and his ancestor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A space marked out in the last part of a racecourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figuratively) The entire amount of progress to an objective.",
                  "examples": [
                    "He had promised to perform this task, but did not go the distance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figuratively) A withholding of intimacy; alienation; variance.",
                  "examples": [
                    "The friendship did not survive the row: they kept each other at a distance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The remoteness or reserve which respect requires; hence, respect; ceremoniousness.",
                  "examples": [
                    "’Tis by respect and distance that authority is upheld."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The space measured back from the winning-post which a racehorse running in a heat must reach when the winner has covered the whole course, in order to run in the final heat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "distance (third-person singular simple present distances, present participle distancing, simple past and past participle distanced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move away (from) someone or something.",
                  "examples": [
                    "He distanced himself from the comments made by some of his colleagues."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To leave at a distance; to outpace, leave behind.",
                  "examples": [
                    "Then the horse, with muscles strong as steel, distanced the sound."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lose interest in a specific issue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}