{
  "word": "physical",
  "etymologies": [
    {
      "description": [
        "Borrowed from Late Latin physicālis, from Latin physica (“study of nature”), from Ancient Greek φυσική (phusikḗ), feminine singular of φυσικός (phusikós, “natural; physical”), from φύσις (phúsis, “origin, birth; nature, quality; form, shape; type, kind”), from φῠ́ω (phúō, “grow”), ultimately from Proto-Indo-European *bʰuH- (“to appear, become, rise up”)."
      ],
      "adjectives": [
        {
          "description": "physical (comparative more physical, superlative most physical)",
          "definitionGroups": [
            {
              "group": "Of medicine.",
              "entries": [
                {
                  "meaning": "(obsolete) Pertaining to the field of medicine; medical. [15th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) That practises medicine; pertaining to doctors, physicianly. [18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Medicinal; good for the health, curative, therapeutic. [16th–19th c.]",
                  "examples": [
                    "Phisicall [translating ϕαρμακώδεις (pharmakṓdeis)] herbes, as Helleborum, Lingewort, or Beares foote."
                  ]
                }
              ]
            },
            {
              "group": "Of matter or nature.",
              "entries": [
                {
                  "meaning": "Pertaining to the world as understood through the senses rather than the mind; tangible, concrete; having to do with the material world. [from 16th c.]",
                  "examples": [
                    "Labour, then, in the physical world, is  […]  employed in putting objects in motion."
                  ]
                },
                {
                  "meaning": "In accordance with the laws of nature; now specifically, pertaining to physics. [from 16th c.]",
                  "examples": [
                    "The substance has a number of interesting physical properties."
                  ]
                },
                {
                  "meaning": "Denoting a map showing natural features of the landscape (compare political). [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "Of the human body.",
              "entries": [
                {
                  "meaning": "Having to do with the body as opposed to the mind; corporeal,  bodily. [from 18th c.]",
                  "examples": [
                    "Are you feeling any physical effects?"
                  ]
                },
                {
                  "meaning": "Sexual, carnal. [from 18th c.]",
                  "examples": []
                },
                {
                  "meaning": "Involving bodily force or contact; vigorous, aggressive. [from 20th c.]",
                  "examples": [
                    "This team plays a very physical game, so watch out."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "physical (plural physicals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Physical examination.",
                  "examples": [
                    "How long has it been since your last physical?",
                    "Synonyms: checkup, check-up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(parapsychology) A physical manifestation of psychic origin, as through ectoplasmic solidification.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}