{
  "word": "handicap",
  "etymologies": [
    {
      "description": [
        "From hand-in-cap, in reference to holding the game stakes in a cap."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "handicap (countable and uncountable, plural handicaps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that prevents, hampers, or hinders.",
                  "examples": [
                    "Age is often a handicap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) An allowance of a certain amount of time or distance in starting, granted in a race (or other contest of skill) to the competitor possessing disadvantages; or an additional weight or other hindrance imposed upon the one possessing advantages, in order to equalize, as much as possible, the chances of success.",
                  "examples": [
                    "The older boy won, even though his opponent had been granted a handicap of five meters.",
                    "A handicap in chess often involves removal of the queen's rook."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes considered offensive) The disadvantage itself, in particular physical or mental disadvantages of people.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A race or similar contest in which there is an allowance of time, distance, weight, or other advantage, to equalize the chances of the competitors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable, card games) An old card game, similar to lanterloo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) Synonym of hand-in-cap (“old English trading game”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "handicap (third-person singular simple present handicaps, present participle handicapping, simple past and past participle handicapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To encumber with a handicap in any contest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative, by extension) To place at disadvantage.",
                  "examples": [
                    "The candidate was handicapped by her lack of experience."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To estimate betting odds.",
                  "examples": [
                    "Grandpa Andy would buy the racing form the day ahead of time so he could handicap the race before he even arrived at the track."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}