{
  "word": "compose",
  "etymologies": [
    {
      "description": [
        "From Middle English composen, from Old French composer (“to compose, compound, adjust, settle”), from com- + poser, as an adaptation of Latin componere (“to put together, compose”), from com- (“together”) + ponere (“to put, place”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "compose (third-person singular simple present composes, present participle composing, simple past and past participle composed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make something by merging parts. [from later 15th c.]",
                  "examples": [
                    "The editor composed a historical journal from many individual letters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make up the whole; to constitute.",
                  "examples": [
                    "A church is composed of its members."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nonstandard) To comprise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To construct by mental labor; to think up; particularly, to produce or create a literary or musical work.",
                  "examples": [
                    "The orator composed his speech over the week prior.",
                    "Nine numbered symphonies, including the Fifth, were composed by Beethoven.",
                    "It's difficult to compose without absolute silence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes reflexive) To calm; to free from agitation.",
                  "examples": [
                    "Try to compose your thoughts.",
                    "The defendant couldn't compose herself and was found in contempt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To arrange the elements of a photograph or other picture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To settle (an argument, dispute etc.); to come to a settlement.",
                  "examples": [
                    "By trying his best to compose matters with the mullahs, he had sincerely shown that he did not seek a violent collision  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To arrange in proper form; to reduce to order; to put in proper state or condition.",
                  "examples": [
                    "In a peaceful grave my corpse compose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) To arrange (types) in a composing stick for printing; to typeset.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}