{
  "word": "disease",
  "etymologies": [
    {
      "description": [
        "From Middle English disese, from Anglo-Norman desese, disaise, from Old French desaise, from des- + aise. Equivalent to dis- +‎ ease. Displaced native Middle English adle, audle (“disease”) (from Old English ādl (“disease, sickness”), see adle), Middle English cothe, coathe (“disease”) (from Old English coþu (“disease”), see coath)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "disease (countable and uncountable, plural diseases)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An abnormal condition of a human, animal or plant that causes discomfort or dysfunction; distinct from injury insofar as the latter is usually instantaneously acquired.",
                  "examples": [
                    "The tomato plants had some kind of disease that left their leaves splotchy and fruit withered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any abnormal or harmful condition, as of society, people's attitudes, way of living etc.",
                  "examples": [
                    "War is not man's great and terrible disease; war is a symptom, a result. The real disease is the virus of national sovereignty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lack of ease; uneasiness; trouble; vexation; disquiet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "disease (third-person singular simple present diseases, present participle diseasing, simple past and past participle diseased)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To cause unease; to annoy, irritate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To infect with a disease.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}