{
  "word": "retroflex",
  "etymologies": [
    {
      "description": [
        "From Latin rētrōflexus, the perfect participle of rētrōflectō (“bend, turn”), from flectō (“bend, turn”)."
      ],
      "adjectives": [
        {
          "description": "retroflex (comparative more retroflex, superlative most retroflex)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bent or curved backwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) Of pronunciation in which the tip of the tongue is raised and bent backwards, so that the underside of the tongue approaches or touches the palate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) Of pronunciation in which the tip of the tongue approaches or touches the back of the alveolar ridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) Of pronunciation in which the blade of the tongue approaches or touches the back of the alveolar ridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics, general sense) Of any of the aforementioned pronunciations.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "retroflex (plural retroflexes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) A consonant pronounced with the underside of the tongue approaching or touching the palate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) A consonant pronounced with the tip of the tongue approaching or touching the back of the alveolar ridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) A consonant pronounced with the blade of the tongue approaching or touching the back of the alveolar ridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics, general sense) Any of the aforementioned consonants.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}