{
  "word": "anodyne",
  "etymologies": [
    {
      "description": [
        "From Medieval Latin anōdynos (“stilling or relieving pain”), from Ancient Greek ἀνώδυνος (anṓdunos, “free from pain”), from ἀν- (an-, “without”) + ὀδύνη (odúnē, “pain”).",
        "Adjective sense “noncontentious” probably through French anodin (“harmless, trivial”), of same origin."
      ],
      "adjectives": [
        {
          "description": "From Medieval Latin anōdynos (“stilling or relieving pain”), from Ancient Greek ἀνώδυνος (anṓdunos, “free from pain”), from ἀν- (an-, “without”) + ὀδύνη (odúnē, “pain”). Adjective sense “noncontentious” probably through French anodin (“harmless, trivial”), of same origin.",
          "definitionGroups": []
        },
        {
          "description": "anodyne (comparative more anodyne, superlative most anodyne)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pharmacology) Capable of soothing or eliminating pain. [from 16th c.]",
                  "examples": [
                    "Many a time has the vapor of ether been inhaled for the relief of oppressed lungs; many a time has the sought relief been thus obtained; and just so many times has the discovery of the wonderful anodyne properties of this gas, as affecting all bodily suffering, been brushed past and overlooked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Soothing or relaxing. [from 18th c.]",
                  "examples": [
                    "Classical music is rather anodyne."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Noncontentious, blandly agreeable, unlikely to cause offence or debate. [from 20th c.]",
                  "examples": [
                    "Synonyms: bland, inoffensive, noncontentious"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "anodyne (plural anodynes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pharmacology) Any medicine or other agent that relieves pain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A source of relaxation or comfort.",
                  "examples": [
                    "So, with a sigh, because novels so often provide an anodyne and not an antidote, glide one into torpid slumbers instead of rousing one with a burning brand."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}