{
  "word": "universe",
  "etymologies": [
    {
      "description": [
        "From Middle English universe, from Old French univers, from Latin universum (“all things, as a whole, the universe”), neuter of universus (“all together, whole, entire, collective, general, literally turned or combined into one”), from uni-, combining form of unus (“one”) + versus (“turned”), perfect passive participle of vertō (“to turn”). Analyzable as uni- +‎ -verse through backformation of -verse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "universe (plural universes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sum of everything that exists in the cosmos.",
                  "examples": [
                    "I think that the universe was created by a life force rather than a deity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An entity similar to our universe; one component of a larger entity known as the multiverse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Everything under consideration.",
                  "examples": [
                    "In all this universe of possibilities, there is only one feasible option."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marketing, economics) A sample taken from the population.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An imaginary collection of worlds.",
                  "examples": [
                    "The universe in this comic book series is richly imagined."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literature, films) A collection of stories with characters and settings that are less interrelated than those of sequels or prequels.",
                  "examples": [
                    "Annabelle Comes Home (the 7th and most recent movie in the Conjuring universe, and the 3rd to focus on Annabelle) is a direct sequel to both previous Annabelle movies, which occurred before the events of The Conjuring – but take place after the events of the 2013 franchise-starter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A whole world, in the sense of perspective or social setting.",
                  "examples": [
                    "That didn’t just rock my world, it rocked my universe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pantheism) A deity who is equivalent to the sum of everything that exists in the cosmos.",
                  "examples": [
                    "The universe wants you to succeed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The Earth, the sphere of the world.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}