{
  "word": "fairy",
  "etymologies": [
    {
      "description": [
        "From Middle English fairye, fairie, from Old French faerie, from fae + -erie, from Vulgar Latin *Fāta (“goddess of fate”), from Latin fātum (“fate”). Equivalent to fey +‎ -ry.",
        "Attested in English from about 1300, first in the sense of \"enchantment, illusion, dream\" (\"that thou herdest is fairye\") and shortly thereafter \"realm of the fays, fairy-land\" and \"the inhabitants of fairyland, collectively\". The re-interpretation of the term as a countable noun denoting individual inhabitants of fairy-land can be traced to the 1390s, but became common only in the 16th century, perhaps due to reinterpreting phrases like faerie knight."
      ],
      "adjectives": [
        {
          "description": "fairy (comparative more fairy, superlative most fairy)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Like a fairy; fanciful, whimsical, delicate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "fairy (countable and uncountable, plural fairies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) The realm of faerie; enchantment, illusion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mythical being with magical powers, known in many sizes and descriptions, although often depicted in modern illustrations only as a small sprite with gauze-like wings, and revered in some modern forms of paganism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enchantress, or creature of overpowering charm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England, US, derogatory, colloquial) A male homosexual, especially one who is effeminate.",
                  "examples": [
                    "The cripple returned the smile and stuck out his hand. Miss Lonelyhearts clasped it, and they stood this way, smiling and holding hands, until Mrs. Doyle reëntered the room. \"What a sweet pair of fairies you guys are,\" she said. The cripple pulled his hand away and made as though to strike his wife."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of two species of hummingbird in the genus Heliothryx.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A legendary Chinese immortal.",
                  "examples": [
                    "Synonyms: xian, immortal"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}