{
  "word": "comma",
  "etymologies": [
    {
      "description": [
        "From Latin comma, from Ancient Greek κόμμα (kómma), from κόπτω (kóptō, “I cut”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "comma (plural commas or commata)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "English Wikipedia has an article on:commaWikipedia (typography) The punctuation mark ⟨,⟩ used to indicate a set of parts of a sentence or between elements of a list.",
                  "examples": [
                    "Synonyms: scratch comma, virgule, (in its obsolete form as a slash) virgula, (in its obsolete form as a middot) come, (obsolete) comma-point",
                    "Hyponyms: comma of Didymus, inverted comma, Oxford comma, serial comma, syntonic comma"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Romanian typography) A similar-looking subscript diacritical mark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Any of various nymphalid butterflies of the genus Polygonia, having a comma-shaped white mark on the underwings, especially Polygonia c-album and Polygonia c-aureum of North Africa, Europe, and Asia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A difference in the calculation of nearly identical intervals by different ways.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A delimiting marker between items in a genetic sequence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric) In Ancient Greek rhetoric, a short clause, something less than a colon, originally denoted by comma marks. In antiquity it was defined as a combination of words having no more than eight syllables in all. It was later applied to longer phrases, e.g. the Johannine comma.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A brief interval.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "comma (third-person singular simple present commas, present participle commaing, simple past and past participle commaed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, transitive) To place a comma or commas within text; to follow, precede, or surround a portion of text with commas.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}