{
  "word": "wane",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Old English wana (“defect, shortage”); the verb from Old English wanian via Middle English wanien. Both ultimately trace to Proto-West Germanic *wanōn, from Proto-Germanic *wanōną, from Proto-Indo-European *h₁weh₂- (“to leave, abandon; empty, deserted”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wane (plural wanes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gradual diminution in power, value, intensity etc.",
                  "examples": [
                    "In the morning, one might say, his face was of a fine florid hue, but after twelve o'clock, meridian -- his dinner hour -- it blazed like a grate full of Christmas coals; and continued blazing -- but, as it were, with a gradual wane -- till six o'clock, PM, or thereabouts; after which, I saw no more of the proprietor of the face, [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lunar phase during which the sun seems to illuminate less of the moon as its sunlit area becomes progressively smaller as visible from Earth.",
                  "examples": [
                    "It was very dark, for although the sky was clear the moon was now well in the wane, and would not rise till the small hours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) The end of a period.",
                  "examples": [
                    "The situation of the Venetian party in the wane of the eighteenth century had become extremely critical."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(woodworking) A rounded corner caused by lack of wood, often showing bark.",
                  "examples": [
                    "Sapwood, or even bark, may appear on the corners, or may have been cut off, resulting in wane, or missing timber."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wane (third-person singular simple present wanes, present participle waning, simple past and past participle waned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To progressively lose its splendor, value, ardor, power, intensity etc.; to decline.",
                  "examples": [
                    "Land and trade ever will wax and wane together."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Said of light that dims or diminishes in strength.",
                  "examples": [
                    "The skies may hold not the splendour of sundown fast; / It wanes into twilight as dawn dies down into day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, astronomy) Said of the Moon as it passes through the phases of its monthly cycle where its surface is less and less visible.",
                  "examples": [
                    "The fall of Jack, and the subsequent fall of Jill, simply represent the vanishing of one moon-spot after another, as the moon wanes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Said of a time period that comes to an end.",
                  "examples": [
                    "Fast as autumn days toward winter: yet it seems//Here that autumn wanes not, here that woods and streams"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To decrease physically in size, amount, numbers or surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To cause to decrease.",
                  "examples": [
                    "In which no lustful finger can profane him, Nor any earth with black eclipses wane him"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Scots wean."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wane (plural wanes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, slang) A child.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English wōne, wāne (“dwelling,\" \"custom”), of unclear origins, compare wont."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wane (plural wanes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Northern England and Scotland, obsolete) A house or dwelling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}