{
  "word": "convert",
  "etymologies": [
    {
      "description": [
        "From Old French convertir, from Latin converto (“turn around”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "Noun Verb",
          "definitionGroups": []
        },
        {
          "description": "convert (plural converts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who has converted to a religion.",
                  "examples": [
                    "They were all converts to Islam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is now in favour of something that he or she previously opposed or disliked.",
                  "examples": [
                    "I never really liked broccoli before, but now that I've tasted it the way you cook it, I'm a convert!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canadian football) The equivalent of a conversion in rugby",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "Noun Verb",
          "definitionGroups": []
        },
        {
          "description": "convert (third-person singular simple present converts, present participle converting, simple past and past participle converted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To transform or change (something) into another form, substance, state, or product.",
                  "examples": [
                    "A kettle converts water into steam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To change (something) from one use, function, or purpose to another.",
                  "examples": [
                    "He converted his garden into a tennis court."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To induce (someone) to adopt a particular religion, faith, ideology or belief (see also sense 11).",
                  "examples": [
                    "They converted her to Roman Catholicism on her deathbed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exchange for something of equal value.",
                  "examples": [
                    "We converted our pounds into euros."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To express (a quantity) in alternative units.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To express (a unit of measurement) in terms of another; to furnish a mathematical formula by which a quantity, expressed in the former unit, may be given in the latter.",
                  "examples": [
                    "How do you convert feet into metres?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To appropriate wrongfully or unlawfully; to commit the common law tort of conversion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, rugby football) To score extra points after (a try) by completing a conversion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive, soccer) To score (especially a penalty kick).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, ten-pin bowling) To score a spare.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To undergo a conversion of religion, faith or belief (see also sense 3).",
                  "examples": [
                    "We’ve converted to Methodism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become converted.",
                  "examples": [
                    "The chair converts into a bed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To cause to turn; to turn.",
                  "examples": [
                    "O, which way shall I first convert myself?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, logic) To change (one proposition) into another, so that what was the subject of the first becomes the predicate of the second.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To turn into another language; to translate.",
                  "examples": [
                    "which story […] Catullus more elegantly converted"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cricket) To increase one's individual score, especially from 50 runs (a fifty) to 100 runs (a century), or from a century to a double or triple century.",
                  "examples": [
                    "Gillespie was reminded he had promised to join team-mate Matthew Hayden in a nude lap of the ground if he converted his century into a double."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, marketing) To perform the action that an online advertisement is intended to induce; to reach the point of conversion.",
                  "examples": [
                    "Each time a user clicks on one of your adverts, you will be charged the bid amount whether the user converts or not."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, chess) To transform a material or positional advantage into a win.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}