{
  "word": "island",
  "etymologies": [
    {
      "description": [
        "From earlier iland, from Middle English iland, yland, ylond, from Old English īeġland, from Proto-West Germanic *auwjuland, from Proto-Germanic *awjōlandą (from Proto-Germanic *awjō (“island, waterland, meadow”), from Proto-Indo-European *h₂ekʷeh₂) + *landą (“land”), equivalent to ey +‎ land.",
        "Cognate with Scots island, iland, yland (“island”), West Frisian eilân (“island”), Saterland Frisian Ailound (“island”), Dutch eiland (“island”), Low German Eiland (“island”), German Eiland (“island”), Swedish ö (“island”), Öland (“Sweden's second largest island”), Danish ø (“island”), Norwegian øy (“island”), øyland (“large island”), Icelandic eyland (“island”).",
        "The insertion of ⟨s⟩—a 16th century spelling modification—is due to a change in spelling to the unrelated term isle, which previously lacked s (cf. Middle English ile, yle). The re-addition was mistakingly carried over to include iland as well. Related also to German Aue (“water-meadow”), Latin aqua (“water”). More at ea."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "island (plural islands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contiguous area of land, smaller than a continent, totally surrounded by water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, in place names) A contiguous area of land, smaller than a continent, partially surrounded by water; A peninsula; A half-island.",
                  "examples": [
                    "Despite its name, Barry Island is actually a peninsula"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An entity surrounded by other entities that are very different from itself.",
                  "examples": [
                    "an island of tranquility (a calm place surrounded by a noisy environment)",
                    "an island of colors on a butterfly's wing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A superstructure on an aircraft carrier's deck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A traffic island.",
                  "examples": [
                    "the island in the middle of a roundabout"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, West Midlands dialect) A roundabout; A traffic circle.",
                  "examples": [
                    "Dunton island, near Birmingham, is one of the most confusingly labelled islands in the U.K.",
                    "In Coventry, you will often hear people say: “Turn right at the island”."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bench, counter, etc., that is not connected to a wall or other furniture and which can be used from any side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(government) An unincorporated area wholly surrounded by one or more incorporated areas.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A phrase from which a wh-word cannot be extracted without yielding invalid grammar.",
                  "examples": [
                    "Adverbial subordinate clauses are islands for extraction: \"They have a billion dollars of inventory that they don't know where *(it) is\"."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "island (third-person singular simple present islands, present participle islanding, simple past and past participle islanded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surround with water; make into an island.",
                  "examples": [
                    "We paused at little river cities along the way and walked upon their bushy dikes, and heard tales of overflows in flood seasons, when four feet or more of water islanded the houses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set, dot (as if) with islands.",
                  "examples": [
                    "1842,  T.H.Chivers,  “The Song of Seralim: A Celestial Melologue”, in  Magnolia; Or Southern Appalachian - Vol. II - No.1, page 52:God dwells in light! Before the ocean of unmeasured space, was islanded with stars serenely bright, reflecting back the radiance of his face - he dwelt above in heaven’s immortal bliss, thinking into existence that which is.",
                    "1915,  Edward Hutton,  Naples and Southern Italy, page 22:This Apulia is a land of vast pastures and cornfields and olive gardens, islanded with many rich cities, notable if only for the splendour of their churches,[…]",
                    "1930,  Rupert Hughes,  Ladies’ Man, page 143:She knew that the town was islanded with many waters - the Hudson, the Harlem and the East rivers, and the Bay - but the rivers were hard to find in the universal velvetiness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To isolate.",
                  "examples": [
                    "High the vanes of Shrewsbury gleam",
                    "Islanded in Severn stream."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}