{
  "word": "posture",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French posture, from Italian postura, from Latin positūra (“position, situation”). Doublet of positura."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "posture (countable and uncountable, plural postures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The way a person holds and positions their body.",
                  "examples": [
                    "[…]  walking in a most dejected posture, without a band, unbraced, his arms a-cross his open breast, and his eyes bent to the floor;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A situation or condition.",
                  "examples": [
                    "Even as I was reading these fables of my millions, there lay on the desk before me a statement of the exact posture of my affairs  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's attitude or the social or political position one takes towards an issue or another person.",
                  "examples": [
                    "...that is, their Forts, Garrisons, and Guns upon the Frontiers of their Kingdomes; and continuall Spyes upon their neighbours; which is a posture of War."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) The position of someone or something relative to another; position; situation.",
                  "examples": [
                    "The Moon beheld in any posture, in respect of the Sun and us, sheweth us its superficies ... always equally clear."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "posture (third-person singular simple present postures, present participle posturing, simple past and past participle postured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) to put one's body into a posture or series of postures, especially hoping that one will be noticed and admired",
                  "examples": [
                    "If you're finished posturing in front of the mirror, can I use the bathroom now?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) to pretend to have an opinion or a conviction",
                  "examples": [
                    "The politicians couldn't really care less about the issue: they're just posturing for the media."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place in a particular position or attitude; to pose.",
                  "examples": [
                    "to posture oneself; to posture a model"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}