{
  "word": "ketchup",
  "etymologies": [
    {
      "description": [
        "Uncertain, but probably ultimately from Chinese via Malay kicap, from Hokkien 膎汁 (kê-chiap, “fish broth”), though precise path is unclear – there are related words in various Chinese dialects, and it may have entered English directly from Chinese. Cognate to Indonesian kecap, ketjap (“soy sauce”). Various other theories exist – see Ketchup: Etymology for extended discussion.",
        "First appeared in English in the late 17th century in reference to a Southeast Asian sauce encountered by British traders and sailors. The Oxford English Dictionary notes that it was commonly used in the 18th century to refer to a variety of similar sauces with varying ingredients—\"anchovies, mushrooms, walnuts, and oysters being particularly popular\"—but by the late 19th century the current tomato ketchup became the most popular form.",
        "Catsup (earlier catchup) is an alternative Anglicization, still in use in the U.S."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ketchup (countable and uncountable, plural ketchups)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, chiefly US, Canada, UK) Ellipsis of tomato ketchup.. A tomato-vinegar-based sauce, sometimes containing spices, onion or garlic, and (especially in the US) sweeteners.",
                  "examples": [
                    "Synonym: tomato catsup",
                    "Hypernyms: tomato sauce, red ketchup, red catsup",
                    "tomato ketchup",
                    "This diner serves ketchup in red bottles, and mustard in yellow ones."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, now rare) Such a sauce more generally (not necessarily based on tomatoes, but with mushrooms, fish, etc.). This is the older meaning.",
                  "examples": [
                    "Hyponyms: tomato ketchup, tomato catsup, fruit ketchup, fruit catsup, corn ketchup, corn catsup, green ketchup, green catsup, yellow ketchup, yellow catsup"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ketchup (third-person singular simple present ketchups, present participle ketchupping, simple past and past participle ketchupped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with ketchup.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}