{
  "word": "approach",
  "etymologies": [
    {
      "description": [
        "From Middle English aprochen, borrowed from Old French aprochier (modern French approcher), from Late Latin appropiāre, a verb based on Latin prope (“near”), ultimately from Proto-Indo-European *pro- (a variant of *per- (“before, in front; first”)) + *-kʷe (“suffix forming distributives from interrogatives”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "approach (third-person singular simple present approaches, present participle approaching, simple past and past participle approached)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come or go near, in place or time; to move toward; to advance nearer; to draw nigh.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, golf, tennis) To play an approach shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, figuratively) Used intransitively, followed by to: to draw near (to someone or something); to make advances; to approximate or become almost equal.",
                  "examples": [
                    "He approaches to the character of the ablest statesman."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rarely intransitive) Of an immovable object or a number of such objects: to be positioned as to (notionally) appear to be moving towards (a place).",
                  "examples": [
                    "As we drove along the driveway, the trees approaching the house seemed more eerie."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figuratively) To move toward (someone or something) in place, time, character, or value; to draw nearer to.",
                  "examples": [
                    "“Would counsel please approach the bench?” asked the judge.",
                    "He approached the age of manhood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring (something) near something else; to cause (something) to draw near.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attempt to make (a policy) or solve (a problem).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring up or propose to (someone) an idea, question, request, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, euphemistic) To have sexual intercourse with (someone).",
                  "examples": [
                    "Synonyms: see Thesaurus:copulate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To take approaches to (a place); to move towards (a place) by using covered roads, trenches, or other works.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English approche (“approach, arrival”), from approchen, aprochen (“to come or go near, approach; to adjoin, be close by; to enter (someone’s) presence; to be or become involved; to reach (a certain state); to arrive; to befall, happen to; to become similar to, resemble; to be a match for (someone)”); see etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "approach (plural approaches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) An act of drawing near in place or time; an advancing or coming near.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of coming near in character or value; an approximation.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(also figuratively) An avenue, passage, or way by which a building or place can be approached; an access.",
              "entries": [
                {
                  "meaning": "(climbing) A path taken to reach the climbing area, for example, from a car park, road, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A manner of making (a policy) or solving (a problem, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) An opportunity of drawing near; access.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(aviation, also attributively) The way an aircraft comes in to land at an airport.",
              "entries": [
                {
                  "meaning": "A specific procedure used for approaching and landing at an airport.",
                  "examples": [
                    "We flew the RNAV/GPS A approach to runway 16."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bowling) The area before the lane in which a bowler may stand or run up before bowling the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf, tennis) Short for approach shot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}