{
  "word": "coast",
  "etymologies": [
    {
      "description": [
        "From Middle English coste (“rib; side of the body, flank; side of a building; face of a solid figure; coast, shore; bay, gulf; sea; concavity, hollow; boundary, limit; land; country; district, province, region; locality, place; division of the heavens; compass direction; direction; location with reference to direction, side”) [and other forms], from Old French coste (“rib; side of an object; coast”) (modern French côte (“rib; coast; hill, slope”)), from Latin costa (“rib; side, wall”), from Proto-Indo-European *kost-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coast (plural coasts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The edge of the land where it meets an ocean, sea, gulf, bay, or large lake. [from 14th c.]",
                  "examples": [
                    "The rocky coast of Maine has few beaches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The side or edge of something. [15th–18th c.]",
                  "examples": [
                    "And the Coaſt towards which the lines KL and VX are drawn, may be call’d the Coaſt of unuſual Refraction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A region of land; a district or country. [14th–17th c.]",
                  "examples": [
                    "P. Crescentius, in his lib. 1 de agric. cap. 5, is very copious in this subject, how a house should be wholesomely sited, in a good coast, good air, wind, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A region of the air or heavens. [14th–17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English costeien (“to travel along a border or coast; to go alongside (something), skirt; to accompany, follow; to travel across, traverse; to be adjacent to, to border;”) [and other forms], from Anglo-Norman [Term?], Old French costoier (“to be at the side of”) […] (modern French côtoyer (“to pass alongside; (figuratively) to rub shoulders”)), from Latin costicāre, from Latin costa (“rib; side, wall”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "coast (third-person singular simple present coasts, present participle coasting, simple past and past participle coasted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To glide along without adding energy; to allow a vehicle to continue moving forward after disengaging the engine or ceasing to apply motive power.",
                  "examples": [
                    "When I ran out of gas, fortunately I managed to coast into a nearby gas station."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) To sail along a coast.",
                  "examples": [
                    "The Ancients coasted only in their Navigations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a minimal effort; to continue to do something in a routine way, without initiative or effort.",
                  "examples": [
                    "Yet the truth is that City would probably have been coasting by that point if the referee, Michael Oliver, had not turned down three separate penalties, at least two of which could be accurately described as certainties."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To draw near to; to approach; to keep near, or by the side of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To sail by or near; to follow the coastline of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To conduct along a coast or river bank.",
                  "examples": [
                    "The Indians  […]  coasted me a long the river."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialect) To slide downhill; to slide on a sled upon snow or ice.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}