{
  "word": "limbo",
  "etymologies": [
    {
      "description": [
        "From Middle English limbo, lymbo (“place where innocent souls exist temporarily until they can enter heaven”), from Latin limbō, the ablative singular of limbus (“border, edge; hem; fringe, tassel”) (notably in expressions like in limbō (“in limbo”) and e limbō (“out of limbo”)); further etymology uncertain, possibly from Proto-Indo-European *lemb- (“to hang limply or loosely”), from *leb- (“to hang down loosely (?)”). Doublet of limp."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "limbo (countable and uncountable, plural limbos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, Roman Catholicism) The place, thought to be on the edge of the bottomless pit of Hell, where the souls of innocent deceased people exist temporarily until they can enter heaven, specifically those of the saints who died before the advent of Jesus Christ (who occupy the limbo patrum or limbo of the patriarchs or fathers) and those of unbaptized infants (who occupy the limbo infantum or limbo of the infants). [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(countable) Any in-between place, or condition or state, of neglect or oblivion which results in deadlock, delay, or some other unresolved status. [from mid 17th c.]",
                  "examples": [
                    "My passport application has been stuck in bureaucratic limbo for two weeks."
                  ]
                },
                {
                  "meaning": "(slang, archaic, uncountable) Jail, prison; (countable) a jail cell or lockup. [from late 16th c.]",
                  "examples": [
                    "Blind Thaddeus O'Gorman was soon sent to limbo, safely secured in the police lock-up at Green Skipperton, whence he was removed next day to the nearest gaol, there to await trial at the next assize."
                  ]
                },
                {
                  "meaning": "(uncountable, obsolete) Synonym of Hades or Hell [from late 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, obsolete) Synonym of pawn (“the state of something being held as security for a loan, or as a pledge”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, military, nautical, weaponry) A type of antisubmarine mortar installed on naval vessels.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Origin uncertain; possibly an alteration of limber (“bendable, flexible, pliant”) with the ending of the word respelled to represent a Caribbean English pronunciation.",
        "It is unclear whether the verb is derived from the noun, or the noun is derived from the verb; the noun is attested slightly earlier."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "limbo (plural limbos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance, also attributively) A competitive dance originating from Trinidad and Tobago in which dancers take turns to cross under a horizontal bar while bending backwards. The bar is lowered with each round, and the competition is won by the dancer who passes under the bar in the lowest position without dislodging it or falling down.",
                  "examples": [
                    "If you're not up for watching limbos, bottle dancing, and fire eating, your best bet might be a leisurely dinner  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "limbo (third-person singular simple present limbos, present participle limboing, simple past and past participle limboed) (intransitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance) To dance the limbo (etymology 2, sense 1).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Often followed by under: to pass under something while bending backwards.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}