{
  "word": "lieutenant",
  "etymologies": [
    {
      "description": [
        "From Middle French lieutenant, from lieu (“place”) + tenant (“holding”). Doublet of locum tenens."
      ],
      "adjectives": [
        {
          "description": "lieutenant (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A military grade that is junior to the grade the adjective modifies: lieutenant colonel, lieutenant general, lieutenant commander.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lieutenant (plural lieutenants)",
          "definitionGroups": [
            {
              "group": "(military) The lowest Junior Commissioned Officer rank(s) in many military forces, often Army and Marines.",
              "entries": [
                {
                  "meaning": "(military, US) In the US Army, Air Force and Marines, holding the rank above Second Lieutenant and below Captain. Both ranks may be referred to as \"Lieutenant\" or as the complete forms of the ranks.",
                  "examples": []
                },
                {
                  "meaning": "(military, US, navy) A naval officer whose rank is above that of Ensign in the United States Navy and below that of a Lieutenant Commander. There are two ranks of lieutenant: Lieutenant Junior Grade and Lieutenant.",
                  "examples": []
                },
                {
                  "meaning": "(military, US) A Commissioned Officer in the United States Coast Guard, Public Health Service, or National Atmospheric and Oceanic Administration whose rank is above that of Ensign and below Lieutenant Commander. There are two ranks of lieutenant: Lieutenant Junior Grade and lieutenant.",
                  "examples": []
                },
                {
                  "meaning": "(military, UK) A Commissioned Officer in the British Army and Royal Marines, holding the rank above Second Lieutenant and below Captain. Both ranks may be referred to as \"Lieutenant,\" however \"Second Lieutenant\" is to specify that the officer is not yet a full Lieutenant.",
                  "examples": []
                },
                {
                  "meaning": "(military, UK) A naval officer whose rank is above that of Sub-Lieutenant in the British Navy and below that of a Lieutenant Commander.",
                  "examples": []
                },
                {
                  "meaning": "(military, Canada, Australia, New Zealand) A naval Commissioned Officer who holds the rank above Sub-Lieutenant and below Lieutenant Commander.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who manages or executes the plans and directives of another, more senior person - i.e. a manager to his director.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The second-in-command (2IC) of a group.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}