{
  "word": "feint",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from French feinte (“dummy, feint”), from feindre (“to fake, feign”), from Old French feindre, faindre, from Latin fingere, the present active infinitive of fingō (“to alter the truth to deceive, dissemble, feign, pretend; to fashion, form, shape”), ultimately from Proto-Indo-European *dʰeyǵʰ- (“to form, shape; to knead”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "feint (plural feints)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often military) A movement made to confuse an opponent; a dummy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing, fencing) A blow, thrust, or other offensive movement resembling an attack on some part of the body, intended to distract from a real attack on another part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something feigned; a false or pretend appearance; a pretence or stratagem.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "feint (third-person singular simple present feints, present participle feinting, simple past and past participle feinted)",
          "definitionGroups": [
            {
              "group": "(transitive, boxing, fencing)",
              "entries": [
                {
                  "meaning": "To direct (a blow, thrust, or other offensive movement resembling an attack) on some part of the body, intended to distract from a real attack on another part.",
                  "examples": []
                },
                {
                  "meaning": "(rare) To direct a feint or mock attack against (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, boxing, fencing, also often military) To make a feint or mock attack.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French feint, the past participle of feindre (“to fake, feign”): see etymology 1."
      ],
      "adjectives": [
        {
          "description": "feint (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing, fencing, also often military) Of an attack or offensive movement: directed toward a different part from the intended strike.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Feigned, counterfeit, fake.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant of faint (“barely perceptible; not bright, loud, or sharp”)."
      ],
      "adjectives": [
        {
          "description": "feint (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of lines printed on paper as a handwriting guide: not bold; faint, light; also, of such paper: ruled with faint lines of this sort. [from mid 19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}