{
  "word": "snipe",
  "etymologies": [
    {
      "description": [
        "From Middle English snipe, snype (a type of bird), from Old Norse snípa, as in mýrisnípa (“moor snipe”). Akin to Norwegian snipe.",
        "The verb originated in the 1770s among soldiers in British India where a hunter skilled enough to kill the elusive snipe was dubbed a \"sniper\". The term sniper was first attested in 1824 in the sense of the word \"sharpshooter\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "snipe (plural snipes or snipe) (Plural \"snipe\" is used only for the bird.)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various limicoline game birds of the genera Gallinago, Lymnocryptes and Coenocorypha in the family Scolopacidae, having a long, slender, nearly straight beak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fool; a blockhead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shot fired from a concealed place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(naval slang) A member of the engineering department on a ship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey slang) A goal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "snipe (third-person singular simple present snipes, present participle sniping, simple past and past participle sniped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hunt snipe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To shoot at individuals from a concealed place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, by extension) To shoot with a sniper rifle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To watch a timed online auction and place a winning bid against (the current high bidder) at the last possible moment.",
                  "examples": [
                    "I am the type who is liable to snipe youWith two seconds left to go, whoa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To nose (a log) to make it drag or slip easily in skidding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey slang) To score a goal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move the ball quickly in a different direction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from snip or a cognate"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "snipe (plural snipes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A cigarette butt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A end of a log remaining after timber has been cut away - sometimes referred to as a snipe-end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An animated promotional logo during a television show.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strip of copy announcing some late breaking news or item of interest, typically placed in a print advertisement in such a way that it stands out from the ad.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bottle of wine measuring 0.1875 liters, one fourth the volume of a standard bottle; a quarter bottle or piccolo.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Either from sneap or a figurative development from Etymology 1"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "snipe (plural snipes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp, clever answer; sarcasm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A note or sticker attached to an existing poster to provide further information (e.g. an event is sold out), political criticism, etc.",
                  "examples": [
                    "[R]egular campaign posters are easily adapted to the student market by sniping them.  […]  The student snipe should say something like, \"FOR STUDENTS ONLY: 5 EVENTS FOR AS LITTLE AS $20.00!\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "snipe (third-person singular simple present snipes, present participle sniping, simple past and past participle sniped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make malicious, underhand remarks or attacks.",
                  "examples": [
                    "Capitalizing on the restive mood, Mr. Farage, the U.K. Independence Party leader, took out an advertisement in The Daily Telegraph this week inviting unhappy Tories to defect. In it Mr. Farage sniped that the Cameron government — made up disproportionately of career politicians who graduated from Eton and Oxbridge — was “run by a bunch of college kids, none of whom have ever had a proper job in their lives.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attach a note or sticker to (an existing poster) to provide further information, political criticism, etc.",
                  "examples": [
                    "Campus newspaper advertising rates are inexpensive, flyers can be simple because the ticket-price message is strong, and regular campaign posters are easily adapted to the student market by sniping them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}