{
  "word": "storm",
  "etymologies": [
    {
      "description": [
        "From Middle English storm, from Old English storm (“a storm, tempest; a storm of arrows; disturbance, disquiet; uproar, tumult; rush, onrush, attack, violent attack”), from Proto-West Germanic *sturm, from Proto-Germanic *sturmaz (“storm”), from Proto-Indo-European *(s)twerH- (“to rotate, swirl, twirl, move around”). Related to stir."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "storm (plural storms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any disturbed state of the atmosphere, especially as affecting the earth's surface, and strongly implying destructive or unpleasant weather.",
                  "examples": [
                    "The boat was torn to pieces in the storm, and nobody survived."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A thunderstorm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A violent agitation of human society; a civil, political, or domestic commotion; violent outbreak.",
                  "examples": [
                    "The proposed reforms have led to a political storm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) A very strong wind on the wind scale, stronger than a gale, less than a hurricane (10 or higher on the Beaufort scale).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A violent assault on a stronghold or fortified position.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stormen, sturmen, from Old English styrman (“to storm, rage; make a great noise, cry aloud, shout”), from Proto-West Germanic *sturmijan, from Proto-Germanic *sturmijaną (“to storm”). Cognate with Dutch stormen (“to storm; bluster”), Low German stormen (“to storm”), German stürmen (“to storm; rage; attack; assault”), Swedish storma (“to storm; bluster”), Icelandic storma (“to storm”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "storm (third-person singular simple present storms, present participle storming, simple past and past participle stormed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(impersonal) (weather it) To be violent, with strong winds and usually rain, thunder, lightning, or snow.",
                  "examples": [
                    "It stormed throughout the night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) (figurative) To rage or fume; to be in a violent temper.",
                  "examples": [
                    "The master storms, the lady scolds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with adverbial of direction) To move quickly and noisily like a storm, usually in a state of uproar or anger.",
                  "examples": [
                    "She stormed out of the room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) [army; crowd, rioters] To assault (a significant building) with the aim to gain power over it.",
                  "examples": [
                    "Troops stormed the complex.",
                    "the storming of the Bastille"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) (rare, poetic) to assault, gain power over (heart, mind+).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}