{
  "word": "anthocarp",
  "etymologies": [
    {
      "description": [
        "antho- +‎ -carp"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "anthocarp (plural anthocarps)",
          "definitionGroups": [
            {
              "group": "(botany) Any of various forms of fruits in which part of the perianth tissue remains attached to the fruit, as part of the mechanism of dispersal.",
              "entries": [
                {
                  "meaning": "(botany) Lower part of a perianth containing the fruit, the upper part having dropped away, well seen in plants of the family Nyctaginaceae.",
                  "examples": []
                },
                {
                  "meaning": "(botany) In the Nyctaginaceae, individual apetalous flowers have a tubular, petaloid calyx that resembles a sympetalous corolla. The lower portion of the calyx tightly enwraps the one-seeded achene and is persistent around the fruit as an anthocarp. The calyx base plus the enclosed seed-bearing achene is the unit of dispersal.",
                  "examples": []
                },
                {
                  "meaning": "(botany) A collective, composite or aggregated fruit formed from an entire inflorescence, as in the sorosis of a pineapple or the syconus of a fig.",
                  "examples": []
                },
                {
                  "meaning": "(botany) A fruit resulting from many flowers, such as the pineapple; a fruit of which the perianth or the torus forms part.",
                  "examples": []
                },
                {
                  "meaning": "(botany) A composite false fruit, consisting of the actual fruit and the perianth.",
                  "examples": []
                },
                {
                  "meaning": "(botany) A fruit formed by the union of the floral organs or part of them, with the fruit itself, as in Nyctagineae; also applied to fruits with accessories, sometimes termed pseudocarps, as the strawberry and pineapple.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}