{
  "word": "jackhammer",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jackhammer (plural jackhammers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A portable percussive power tool that combines a hammer and chisel used to drill or break hard matter, for instance rock or concrete.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jackhammer (third-person singular simple present jackhammers, present participle jackhammering, simple past and past participle jackhammered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use a jackhammer.",
                  "examples": [
                    "Early the next day a crew came to fix the street. Vernon was out there at once, watching them jackhammer and haul the asphalt  [因"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To break (something) using a jackhammer.",
                  "examples": [
                    "The foundations for the barrier had been jackhammered away; the piles of broken concrete were just left alongside the road."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form (something) using a jackhammer.",
                  "examples": [
                    "Small ledges had been jackhammered at each end of the crater and timbers bolted into them, forming abutments of the bridge that was to come."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive, figurative) To move like a jackhammer.",
              "entries": [
                {
                  "meaning": "(of the heart or pulse) To beat hard, to pound.",
                  "examples": [
                    "[因  he lay rigid, his heart jackhammering, telling himself that there was nothing out there, nothing  [因"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To move (something) like a jackhammer.",
                  "examples": [
                    "He  [因  drew his knees toward his chest as far as the cramped space would allow, and jackhammered his feet into the forward wall of the trunk, which was formed by the backseat of the car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To strike (something) repeatedly with force, to pound.",
                  "examples": [
                    "Guam-based B-52 bombers, newly modified to haul 60,000 lbs. of bombs each, jackhammered a Viet Cong radio and communications center 35 miles northeast of Saigon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}