{
  "word": "libertarian",
  "etymologies": [
    {
      "description": [
        "liberty +‎ -arian, dating from 1789."
      ],
      "adjectives": [
        {
          "description": "libertarian (comparative more libertarian, superlative most libertarian)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the beliefs of libertarians; having a relative tendency towards liberty.",
                  "examples": [
                    "He has libertarian views.",
                    "A libertarian capitalist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Relating to liberty, or to the doctrine of free will, as opposed to the doctrine of necessity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "libertarian (plural libertarians)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who advocates liberty, either generally or in relation to a specific issue.",
                  "examples": [
                    "Synonym: eleutheromaniac",
                    "Hyponym: anarchist",
                    "civil libertarian ― one who favors civil liberties",
                    "cultural libertarian ― one who favors cultural freedom"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) A believer in libertarianism, a political doctrine that emphasizes individual liberty and a lack of governmental regulation, intervention, and oversight both in matters of the economy (‘free market’) and in personal behavior where no one’s rights are being violated or threatened.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Ireland) A left-libertarian, an antiauthoritarian believer in both individual freedom and social justice (social equality and mutual aid).",
                  "examples": [
                    "Landauer's reorientation of anarchist theory and practice in the direction of idealist and völkisch thought was often incomprehensible to the more traditional libertarians, and in the period of the second Sozialist Landauer no longer felt entirely comfortable with the simple \"anarchist\" label. For Landauer anarchism and socialism had always been different expressions of the same view; now he regarded anarchism as \"merely the negative side of what is positively called socialism.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) A believer in the freedom of thinking beings to choose their own destiny, i.e. a believer in free will as opposed to those who believe the future is predetermined.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}