{
  "word": "countermand",
  "etymologies": [
    {
      "description": [
        "From Old French contremander, from Medieval Latin contramandō, from contra + mandō (“I order; I command”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "countermand (plural countermands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An order to the contrary of a previous one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "countermand (third-person singular simple present countermands, present participle countermanding, simple past and past participle countermanded) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To revoke (a former command); to cancel or rescind by giving an order contrary to one previously given.",
                  "examples": [
                    "Synonyms: cancel, rescind",
                    "to countermand an order for goods"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To recall a person or unit with such an order.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cancel an order for (some specified goods).",
                  "examples": [
                    "Three of the maids of honour ſent to countermand their birth-day cloaths; two of them burnt all their collections of novels and romances, and ſent to a bookſeller’s in Pall-mall to buy each of them a bible, and Taylor’s holy living and dying."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To counteract, to act against, to frustrate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To prohibit (a course of action or behavior).",
                  "examples": [
                    "Synonyms: prohibit, forbid"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To oppose or revoke the command of (someone).",
                  "examples": [
                    "For us to alter anything, is to lift ourselves against God; and, as it were, to countermand him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To maintain control of, to keep under command.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}