{
  "word": "revenge",
  "etymologies": [
    {
      "description": [
        "From Middle French revenge, a derivation from revenger, from Old French revengier (possibly influenced by Old Occitan revènge (“revenge, comeback”), from Old Occitan revenir (“to come back”)), a variant of Middle French revancher, from Old French revenchier. The variants Old French vengier (whence French venger) and Old French venchier are both descended from Latin vindicō, with stress-conditioned different parallel development in the inflectional forms. Compare avenge and vengeance."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "revenge (usually uncountable, plural revenges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any form of personal, retaliatory action against an individual, institution, or group for some alleged or perceived harm or injustice.",
                  "examples": [
                    "Synonyms: payback, wreak; see also Thesaurus:revenge",
                    "Indifference is the sweetest revenge.",
                    "When I left my wife, she tried to set fire to the house in revenge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A win by a previous loser.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "revenge (third-person singular simple present revenges, present participle revenging, simple past and past participle revenged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take revenge for (a particular harmful action) or on behalf of (its victim); to avenge.",
                  "examples": [
                    "Arsenal revenged their loss to Manchester United last time with a 5–0 drubbing this time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, reflexive) To take one's revenge (on or upon someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To take vengeance; to revenge itself.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}