{
  "word": "costume",
  "etymologies": [
    {
      "description": [
        "From Middle English costume, custume, from Old French costume, custume, from Italian costume, from a Vulgar Latin *cōnsuētūmen or *costūmen, from Latin cōnsuētūdinem, accusative singular of cōnsuētūdō (“custom, habit”). Doublet of consuetude and custom.",
        "Verb circa 1823."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "costume (countable and uncountable, plural costumes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A style of dress, including garments, accessories and hairstyle, especially as characteristic of a particular country, period or people.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An outfit or a disguise worn as fancy dress etc.",
                  "examples": [
                    "We wore gorilla costumes to the party."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of clothes appropriate for a particular occasion or season.",
                  "examples": [
                    "The bride wore a grey going-away costume."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "From Middle English costume, custume, from Old French costume, custume, from Italian costume, from a Vulgar Latin *cōnsuētūmen or *costūmen, from Latin cōnsuētūdinem, accusative singular of cōnsuētūdō (“custom, habit”). Doublet of consuetude and custom. Verb circa 1823.",
          "definitionGroups": []
        },
        {
          "description": "costume (third-person singular simple present costumes, present participle costuming, simple past and past participle costumed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dress or adorn with a costume or appropriate garb.",
                  "examples": [
                    "Seated on the carpet, by the side of this basin, was seen Mr. Rochester, costumed in shawls, with a turban on his head. His dark eyes and swarthy skin and Paynim features suited the costume exactly. He looked the very model of an Eastern emir, an agent or a victim of the bowstring."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}