{
  "word": "fate",
  "etymologies": [
    {
      "description": [
        "From Latin fata (“prediction”), plural of fatum, from fatus (“spoken”), from for (“to speak”). In this sense, displaced native Old English wyrd, whence Modern English weird."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fate (countable and uncountable, plural fates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The presumed cause, force, principle, or divine will that predetermines events.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The effect, consequence, outcome, or inevitable events predetermined by this cause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An event or a situation which is inevitable in the fullness of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Destiny; often with a connotation of death, ruin, misfortune, etc.",
                  "examples": [
                    "Accept your fate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mythology) Alternative letter-case form of Fate (one of the goddesses said to control the destiny of human beings).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biochemistry) The products of a chemical reaction in their final form in the biosphere.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(embryology) The mature endpoint of a region, group of cells or individual cell in an embryo, including all changes leading to that mature endpoint",
                  "examples": [
                    "Synonym: developmental pathway"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fate (third-person singular simple present fates, present participle fating, simple past and past participle fated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To foreordain or predetermine, to make inevitable.",
                  "examples": [
                    "The oracle's prediction fated Oedipus to kill his father; not all his striving could change what would occur."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}