{
  "word": "creek",
  "etymologies": [
    {
      "description": [
        "From Middle English creke, kreke, creake, of unclear origin. It existed alongside a second variant in Middle English cryke, krike, cricke, from Old Norse kriki.. The first form possibly continues Old English *creca (attested in the diminutive crecca (“creek, bay, wharf”) also found in Anglo-Latin as creca, crecca), from Proto-West Germanic *krekō, from Proto-Germanic *krekô, *krekuz (“corner, hook, angle, bend, bight”), from Proto-Indo-European *ger- (“to turn, to wind”).",
        "See also Old Dutch creka, crika (“inlet, cove, creek”), Old Norse kriki, krikr (“angle, corner, nook, bight”), Old Norse kraki (“pole with a hook, anchor”), and possibly Old Norse krókr (“hook, bend, bight”). Modern cognates include West Frisian kreek (“creek”), Dutch kreek (“creek, cove, inlet, bight”), and French crique (“cove”) (borrowed from Germanic).",
        "Early British colonists of Australia and the Americas used the term in the usual British way, to name inlets; as settlements followed the inlets upstream and inland, the names were retained and creek was reinterpreted as a general term for a small waterway.."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "creek (plural creeks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A small inlet or bay, often saltwater, narrower and extending farther into the land than a cove; a recess in the shore of the sea, or of a river; the inner part of a port that is used as a dock for small boats.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, Canada, US) A stream of water (often freshwater) smaller than a river and larger than a brook; in Australia, also used of river-sized bodies of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any turn or winding.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}