{
  "word": "woman",
  "etymologies": [
    {
      "description": [
        "From Middle English womman, wimman, wifman, from Old English wīfmann (“woman”, literally “female person”), a compound of wīf (“woman, female”, whence English wife) +‎ mann (“person, human being”, whence English man); thus equivalent to wife +‎ man. For details on the pronunciation and spelling history, see the usage notes below.",
        "Cognate with Scots woman, weman (“woman”), Saterland Frisian Wieuwmoanske (“female person, female human, woman”). Similar constructions can be found in West Frisian frommes (“woman, girl”) (from frou and minske, literally \"woman human\").",
        "A few alternative spellings (see below) respell the term so as not to contain man."
      ],
      "adjectives": [
        {
          "description": "woman (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(particularly Nigeria, India, sometimes proscribed) Of or relating to a woman/women; female.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "woman (plural women)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An adult female human.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) All female humans collectively; womankind.",
                  "examples": [
                    "I am Woman, hear me roar / In numbers too big to ignore"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female person, usually an adult; a (generally adult) female sentient being, whether human, supernatural, elf, alien, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wife (or sometimes a fiancée or girlfriend).",
                  "examples": [
                    "And then, when he lies with his woman, the man may concurrently be with God, and so get increase of his soul."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female person who is extremely fond of or devoted to a specified type of thing. (Used as the last element of a compound.)",
                  "examples": [
                    "Perhaps my problem is that I am a cat woman. I can't imagine any finicky feline (and they all are that at one time or another) slobbering over anyone, even a beloved owner, the way a dog does."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female attendant or servant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "woman (third-person singular simple present womans, present participle womaning or womanning, simple past and past participle womaned or womanned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To staff with female labor.",
                  "examples": [
                    "The information desk is now manned (womaned) by someone whose main job is to help you reserve time slots for the computers or guide you through the arduous process of “logging on.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make effeminate or womanish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with, or unite to, a woman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To call (a person) \"woman\" in a disrespectful fashion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}