{
  "word": "salamander",
  "etymologies": [
    {
      "description": [
        "From Middle English salamandre, from Anglo-Norman salamandre, from Latin salamandra, from Ancient Greek σαλαμάνδρα (salamándra), of uncertain origin (per Beekes, likely Pre-Greek ); possibly of Iranian origin, see Persian سمندر‎ (samandar) for more information."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "salamander (plural salamanders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, slender, chiefly terrestrial amphibian of the order Caudata, superficially resembling a lizard.",
                  "examples": [
                    "[…] and most plainly Pierius, whose words in his hieroglyphicks are these: \"Whereas it is commonly said that a salamander extinguisheth fire, we have found by experience that it is so far from quenching hot coals, that it dyeth immediately therein.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mythology) A creature much like a lizard that is resistant to and lives in fire (in which it is often depicted in heraldry), hence the elemental being of fire.",
                  "examples": [
                    "“Not a chance, Ranger,” Bob Mason was speaking. “This little cuss is a salamander. He's been travelling through fire all day and there isn't a blister on him. …”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) A metal utensil with a flat head which is heated and put over a dish to brown the top.",
                  "examples": [
                    "The salamander, a fairly long metal utensil with a flat rounded head, was left in the fire until red hot and then used to brown the top of a dish without further cooking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) A small broiler (North America) or grill (Britain) that heats the food from above, used in professional cookery primarily for browning.",
                  "examples": [
                    "The chef first put the steak under the salamander to sear the outside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The pouched gopher, Geomys tuza, of the southern United States.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, obsolete) A large poker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metallurgy) Solidified material in a furnace hearth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) A portable stove used to heat or dry buildings under construction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A fire-eater (performer who pretends to swallow fire).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "salamander (third-person singular simple present salamanders, present participle salamandering, simple past and past participle salamandered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use a salamander (cooking utensil) in a cooking process.",
                  "examples": [
                    "When cold, sprinkle the custard thickly with sugar and salamander it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}