{
  "word": "breathe",
  "etymologies": [
    {
      "description": [
        "From Middle English brethen (“to breathe, blow, exhale, odour”), derived from Middle English breth (“breath”). Eclipsed Middle English ethien and orðiæn, from Old English ēþian and orþian (“to breathe”); as well as Middle English anden, onden, from Old Norse anda (“to breathe”). More at breath."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "breathe (third-person singular simple present breathes, present participle breathing, simple past and past participle breathed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To draw air into (inhale), and expel air from (exhale), the lungs in order to extract oxygen and excrete waste gases.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take in needed gases and expel waste gases in a similar way.",
                  "examples": [
                    "Fish have gills so they can breathe underwater."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To inhale (a gas) to sustain life.",
                  "examples": [
                    "While life as we know it depends on oxygen, scientists have speculated that alien life forms might breathe chlorine or methane."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To live.",
                  "examples": [
                    "I will not allow it, as long as I still breathe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To draw something into the lungs.",
                  "examples": [
                    "Try not to breathe too much smoke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To expel air from the lungs, exhale.",
                  "examples": [
                    "If you breathe on a mirror, it will fog up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exhale or expel (something) in the manner of breath.",
                  "examples": [
                    "The flowers breathed a heady perfume."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give an impression of, to exude.",
                  "examples": [
                    "The decor positively breathes classical elegance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To whisper quietly.",
                  "examples": [
                    "He breathed the words into her ear, but she understood them all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pass like breath; noiselessly or gently; to emanate; to blow gently.",
                  "examples": [
                    "The wind breathes through the trees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Evangelical and Charismatic Christianity, with God as agent) To inspire (scripture).",
                  "examples": [
                    "The affirmation before us, then, will be, \"All scripture is divinely breathed.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To exchange gases with the environment.",
                  "examples": [
                    "Garments made of certain new materials breathe well and keep the skin relatively dry during exercise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now rare) To rest; to stop and catch one's breath.",
                  "examples": [
                    "Well! breathe awhile, and then to it again!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stop, to give (a horse) an opportunity to catch its breath.",
                  "examples": [
                    "At higher altitudes you need to breathe your horse more often."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exercise; to tire by brisk exercise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To passionately devote much of one's life to (an activity, etc.).",
                  "examples": [
                    "Do you like hiking?  Are you kidding? I breathe hiking."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}