{
  "word": "pothole",
  "etymologies": [
    {
      "description": [
        "From dialectal pot (“pit, hollow, cavity”) +‎ hole. The \"cave\" senses, attested since at least 1809 (as pot-hole), may be from Middle English pot, potte (“a deep hole for a mine, or from peat-digging”), of uncertain origin; perhaps related to English pit, pote, or pot. Compare Scots pott, patt (“a pit dug in the ground; coalpit”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pothole (plural potholes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shallow pit or other edged depression in a road's surface, especially when caused by erosion by weather or traffic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pit formed in the bed of a turbulent stream.",
                  "examples": [
                    "The earliest ideas on the creation of potholes are that they were associated with \"moulins de glacier\" (glacier mills) formed where surface streams on glaciers and ice sheets fall into holes in the ice. Water entering these surficial holes was believed to impact on the bedrock beneath creating a large pothole. The \"Moulin Hypothesis\", first suggested in 1874, continued to be accepted by many authors until the 1950s. However, commencing in the 1930s, other authors have suggested dissatisfaction with the moulin hypothesis, largely on the grounds that it failed to explain how ice could remain stable long enough for the \"giant\" potholes to form and why many potholes (like those at Rockwood) were present in large numbers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A vertical cave system, often found in limestone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) A pit resulting from unauthorized excavation by treasure-hunters or vandals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, mining) A shallow hole dug for the purpose of prospecting for opal or gold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From pot +‎ hole. Attested since at least 1811 (also as pot-hole), possibly continuing Middle English *pothol (attested in the plural, potholys)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pothole (plural potholes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hole or recess on the top of a stove into which a pot may be placed.",
                  "examples": [
                    "Stoves with two or more potholesThe normal single-pot stove in which the pot sits on top, rather than being sunk into the pothole, has a major limitation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}