{
  "word": "shadow",
  "etymologies": [
    {
      "description": [
        "From Middle English schadowe, schadewe, schadwe (also schade > shade), from Old English sċeaduwe, sċeadwe, oblique form of sċeadu (“shadow, shade; darkness; protection”), from Proto-West Germanic *skadu, from Proto-Germanic *skadwaz (“shade, shadow”), from Proto-Indo-European *(s)ḱeh₃- (“darkness”)."
      ],
      "adjectives": [
        {
          "description": "shadow (comparative more shadow, superlative most shadow)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unofficial, informal, unauthorized, but acting as though it were.",
                  "examples": [
                    "The human resources department has a shadow information technology group without headquarters knowledge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having power or influence, but not widely known or recognized.",
                  "examples": [
                    "The director has been giving shadow leadership to the other group's project to ensure its success.",
                    "The illuminati shadow group has been pulling strings from behind the scenes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Acting in a leadership role before being formally recognized.",
                  "examples": [
                    "The shadow cabinet cannot agree on the terms of the agreement due immediately after they are sworn in.",
                    "The insurgents’ shadow government is being crippled by the federal military strikes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, politics) Part of, or related to, the opposition in government.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "shadow (countable and uncountable, plural shadows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dark image projected onto a surface where light (or other radiation) is blocked by the shade of an object.",
                  "examples": [
                    "My shadow lengthened as the sun began to set.",
                    "The X-ray showed a shadow on his lung."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relative darkness, especially as caused by the interruption of light; gloom; obscurity.",
                  "examples": [
                    "I immediately jumped into shadow as I saw them approach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area protected by an obstacle (likened to an object blocking out sunlight).",
                  "examples": [
                    "The mountains block the passage of rain-producing weather systems and cast a \"shadow\" of dryness behind them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A reflected image, as in a mirror or in water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) That which looms as though a shadow.",
                  "examples": [
                    "I don't have a shadow of doubt in my mind that my plan will succeed.",
                    "The shadow of fear of my being outed always affects how I live my life.",
                    "I lived in her shadow my whole life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small degree; a shade.",
                  "examples": [
                    "He did not give even a shadow of respect to the professor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An imperfect and faint representation.",
                  "examples": [
                    "He came back from war the shadow of a man.",
                    "The neopagan ritual was only a pale shadow of the ones the Greeks held thousands of years ago."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, law enforcement) A trainee, assigned to work with an experienced officer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who secretly or furtively follows another.",
                  "examples": [
                    "The constable was promoted to working as a shadow for the Royals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inseparable companion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) A drop shadow effect applied to lettering in word processors etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An influence, especially a pervasive or a negative one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spirit; a ghost; a shade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Latinism) An uninvited guest accompanying one who was invited.",
                  "examples": [
                    "Synonym: umbra"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Jungian psychology) An unconscious aspect of the personality.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shadow (third-person singular simple present shadows, present participle shadowing, simple past and past participle shadowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shade, cloud, or darken.",
                  "examples": [
                    "The artist chose to shadow this corner of the painting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To block light or radio transmission from.",
                  "examples": [
                    "Looks like that cloud's going to shadow us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(particularly espionage) To secretly or discreetly track or follow another, to keep under surveillance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To represent faintly and imperfectly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hide; to conceal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To accompany (a professional) during the working day, so as to learn about an occupation one intends to take up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, programming) To make (an identifier, usually a variable) inaccessible by declaring another of the same name within the scope of the first.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To apply the shadowing process to (the contents of ROM).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}