{
  "word": "doctor",
  "etymologies": [
    {
      "description": [
        "From Middle English doctor (“an expert, authority on a subject”), doctour, from Anglo-Norman doctour, from Latin doctor (“teacher”), from doceō (“I teach”). Displaced native Middle English lerare (“doctor, teacher”) (from Middle English leren (“to teach, instruct”) from Old English lǣran, lēran (“to teach, instruct, guide”), compare Old English lārēow (“teacher, master”)). Displaced Old English lǣċe (“doctor, physician”), and  doublet of docent."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "doctor (plural doctors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A physician; a member of the medical profession; one who is trained and licensed to heal the sick or injured. The final examination and qualification may award a doctor degree in which case the post-nominal letters are D.O., DPM, M.D., DMD, DDS, in the US or MBBS in the UK.",
                  "examples": [
                    "If you still feel unwell tomorrow, see your doctor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who has attained a doctorate, such as a Ph.D. or Th.D. or one of many other terminal degrees conferred by a college or university.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A veterinarian; a medical practitioner who treats non-human animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A nickname for a person who has special knowledge or talents to manipulate or arrange transactions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A teacher; one skilled in a profession or a branch of knowledge; a learned man.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Any mechanical contrivance intended to remedy a difficulty or serve some purpose in an exigency.",
                  "examples": [
                    "the doctor of a calico-printing machine, which is a knife to remove superfluous colouring matter",
                    "the doctor, or auxiliary engine, also called \"donkey engine\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fish, the friar skate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, nautical, slang) A ship's cook.",
                  "examples": [
                    "[…]  old Scotch Jem the boatswain, tunes his fiddle, and the doctor, (ship's cook,) produces his tambourine; the men dance on deck,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "doctor (third-person singular simple present doctors, present participle doctoring, simple past and past participle doctored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To act as a medical doctor to.",
                  "examples": [
                    "Her children doctored her back to health."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, humorous) To act as a medical doctor.",
                  "examples": [
                    "Doctor Princess: Put this on. [gives her lab coat to Finn] OK, you're a doctor now. Good luck.",
                    "Finn: Wait, wait, whoa, whoa, whoa, wait! I don't know how to doctor!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (someone) into an (academic) doctor; to confer a doctorate upon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To physically alter (medically or surgically) a living being in order to change growth or behavior.",
                  "examples": [
                    "They doctored their apple trees by vigorous pruning, and now the dwarfed trees are easier to pick.",
                    "We may legally doctor a pet to reduce its libido."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To genetically alter an extant species.",
                  "examples": [
                    "Mendel's discoveries showed how the evolution of a species may be doctored."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To alter or make obscure, as with the intention to deceive, especially a document.",
                  "examples": [
                    "To doctor the signature of an instrument with intent to defraud is an example of forgery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adulterate, drug, or poison (drink).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To take medicine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}