{
  "word": "duct",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin ductus (“leading, conducting”, noun), from dūcō (“to lead, conduct, draw”) +‎ -tus (action noun suffix). Doublet of ductus and douit. Also via Medieval Latin ductus (“a conveyance of water; a channel”), which itself has the first mentioned etymology."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "duct (plural ducts)",
          "definitionGroups": [
            {
              "group": "a pipe, tube or canal which carries gas or liquid from one place to another",
              "entries": [
                {
                  "meaning": "an enclosure or channel for electrical cable runs, telephone cables, or other conductors",
                  "examples": [
                    "Hyponym: bus duct"
                  ]
                },
                {
                  "meaning": "(anatomy) a vessel for conveying lymph or glandular secretions such as tears or bile",
                  "examples": [
                    "Hyponyms: bile duct, cochlear duct, collecting duct, cystic duct, duct of Wirsung, efferent duct, ejaculatory duct, epithelial duct, lacrimal duct, milk duct, Müllerian duct, nasolacrimal duct, pancreatic duct, paramesonephric duct, tear duct, thoracic duct, thyroglossal duct, utriculosaccular duct, Wolffian duct"
                  ]
                },
                {
                  "meaning": "(botany) a tube or elongated cavity (such as a xylem vessel) for conveying water, sap, or air",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) a layer (as in the atmosphere or the ocean) which occurs under usually abnormal conditions and in which radio or sound waves are confined to a restricted path",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) guidance, direction",
                  "examples": [
                    "[…]  otherwise to express His care and love to mankind, viz., in giving and consigning to them His written word for a rule and constant director of life, not leaving them to the duct of their own inclinations."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "duct (third-person singular simple present ducts, present participle ducting, simple past and past participle ducted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to enclose in a duct",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to channel something (such as a gas) or propagate something (such as radio waves) through a duct or series of ducts",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}