{
  "word": "dogman",
  "etymologies": [
    {
      "description": [
        "From dog (“the domesticated mammal Canis familiaris or Canis lupus familiaris”) +‎ -man (suffix denoting someone (possibly implied male) who is an expert in an area, who is employed or holds a position in an area, or who takes part in an activity) or man (senses 2 and 3)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dogman (plural dogmen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A man who has charge of dogs, such as a dog breeder or dog trainer; specifically, a man who trains dogs for the bloodsport of dogfighting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of dog man (“a man who likes dogs or prefers dogs as pets, often as opposed to liking cats”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cryptozoology, mythology) An alleged cryptid or mythological creature that is part dog and part man; also (religion) a deity who is part dog and part man.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A man who sells dog meat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From dog (“part of a crane that holds the items to be lifted”) +‎ -man (suffix denoting someone (possibly implied male) who is an expert in an area, who is employed or holds a position in an area, or who takes part in an activity), from the fact that such a person would often ride on the load lifted by the crane when carrying out their duty."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dogman (plural dogmen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand) An assistant to a crane operator, responsible for securing the crane's load and directing the operator.",
                  "examples": [
                    "Synonyms: banksman, dogger, signalman, spotter"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}