{
  "word": "outscout",
  "etymologies": [
    {
      "description": [
        "out- +‎ scout"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "outscout (plural outscouts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An advance scout.",
                  "examples": [
                    "[…]  tho’ the Enemy took the Train I had laid, and on sight of our small Body on the Hill, sent a Party from their greater Body to intercept them, before they could reach the Town; yet the Sequel prov’d, we had mistaken their Number, and it soon appeared to be much greater than we at first imagin’d. However our Out-scouts, as I may call ’em, got safe into the House  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A group of advance scouts; an advance scouting party.",
                  "examples": [
                    "As soon as they approached near the Town, the two Indians which were in the Canoa with our five Men for the Out-scout, jumped over-board, and we lost them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "outscout (third-person singular simple present outscouts, present participle outscouting, simple past and past participle outscouted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surpass in scouting, or reconnaissance.",
                  "examples": [
                    "In the Matabele campaign he had out-scouted the savage scouts and found his pleasure in tracking them among their native mountains  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To overpower by disdain; to outface.",
                  "examples": [
                    "Steel your thoughts, sharp your resolue, imbolden your spirit, grasp your swords; alarum mischief, & with an vndanted brow, out scout the grim opposition of most menacing perill."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}