{
  "word": "landscape",
  "etymologies": [
    {
      "description": [
        "From an alteration (due to Dutch landschap) of earlier landskip, lantschip, from Middle English *landschippe, *landschapp, from Old English landsċipe, landsċeap (“region, district, tract of land”), equivalent to land +‎ -ship; in some senses from Dutch landschap (“region, district, province, landscape”), from Middle Dutch landscap, lantscap (“region”), from Old Dutch *landskepi, *landskapi (“region”). Cognate with Scots landskape, landskep, landskip (“landscape”), West Frisian lânskip (“landscape”), Low German landschop (“landscape, district”), German Landschaft (“landscape, countryside, scenery”), Swedish landskap (“landscape, scenery, province”), Icelandic landskapur (“countryside”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "landscape (countable and uncountable, plural landscapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A portion of land or territory which the eye can comprehend in a single view, including all the objects it contains.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sociological aspect of a physical area.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A picture representing a real or imaginary scene by land or sea, the main subject being the general aspect of nature, as fields, hills, forests, water, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The pictorial aspect of a country.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, printing, uncountable) a mode of printing where the horizontal sides are longer than the vertical sides",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A space, indoor or outdoor and natural or man-made (as in \"designed landscape\")",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) a situation that is presented, a scenario",
                  "examples": [
                    "The software patent landscape has changed considerably in the last years"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "landscape (third-person singular simple present landscapes, present participle landscaping, simple past and past participle landscaped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To create or maintain a landscape.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}