{
  "word": "industry",
  "etymologies": [
    {
      "description": [
        "From Middle English industry, industrie, from Old French industrie, from Latin industria (“diligence, activity, industry”), from industrius (“diligent, active, zealous”), from Old Latin indostruus (“diligent, active”); origin unknown. Perhaps from indu (“in”) + ūst-, ūstr-, stem of ūrō (“burn, burn up, consume”, verb), related to Old High German ūstrī (“industry”), Old English andūstrian (“to hate, detest”, literally “to be consumed with zeal”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "industry (countable and uncountable, plural industries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The tendency to work persistently. Diligence.",
                  "examples": [
                    "The ant has made himself illustrious / Through constant industry industrious. / So what? / Would you be calm and placid / If you were full of formic acid?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, business, economics) Businesses of the same type, considered as a whole. Trade.",
                  "examples": [
                    "Long before popular music evolved its many genres and subgenres, the industry was driven by a simple one-size-fits-all philosophy uncomplicated by impassioned debates over the origins of trip hop or the difference between deatchore and screamo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, economics) Businesses that produce goods as opposed to services.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the singular, economics) The sector of the economy consisting of large-scale enterprises.",
                  "examples": [
                    "There used to be a lot of industry around here, but now the economy depends on tourism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(European software patent law) Automated production of material goods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) A typological classification of stone tools, associated with a technocomplex.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}