{
  "word": "clitoris",
  "etymologies": [
    {
      "description": [
        "From post-classical Latin clitoris (16th century), or its source, Koine Greek κλειτορίς (kleitorís), probably from Ancient Greek κλείω (kleíō, “I sheathe, shut”), in reference to its being covered by the labia minora.",
        "The related noun form κλείς (kleís) has a second meaning of \"a key, a latch or hook (to close a door).\" Wooden pegs were the original keys; a connection also revealed in Latin clavis (“nail”) and claudere (“to shut”) (see close). Some medical sources give a supposed Greek verb κλειτοριάζω (kleitoriázō, “touch or titillate lasciviously, tickle”) literally \"to be inclined (toward pleasure)\" (compare German Kitzler (“clitoris”, literally “tickler”), related to Greek κλειτύς (kleitús, “shut, closed”), a variant of κλιτύς (klitús, “hillside”), related to κλίνω (klínō, “I slope”), from the same root as κλῖμαξ (klîmax, “ladder”). But many sources take κλειτορίς (kleitorís) literally as Ancient Greek \"little hill\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clitoris (plural clitorises or clitorides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A sensitive elongated erectile organ at the anterior part of the vulva in female humans and mammals, homologous with the penis. [from 17th c.]",
                  "examples": [
                    "stimulate the clitoris",
                    "She complains that her boyfriend can't find her clitoris."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) A similar erectile sexual organ present in the cloacas of female ratites.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}