{
  "word": "jumper",
  "etymologies": [
    {
      "description": [
        "From jump +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jumper (plural jumpers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone or something that jumps, e.g. a participant in a jumping event in track or skiing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who attempts suicide by jumping from a great height.",
                  "examples": [
                    "Significantly more cervical spine injuries were seen in fallers as opposed to jumpers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short length of electrical conductor, to make a temporary connection. Also jump wire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electricity) A removable connecting pin on an electronic circuit board.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long drilling tool used by masons and quarry workers, consisting of an iron bar with a chisel-edged steel tip at one or both ends, operated by striking it against the rock, turning it slightly with each blow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A crude kind of sleigh, usually a simple box on runners which are in one piece with the poles that form the thills.",
                  "examples": [
                    "a jumper was found prepared to receive Mrs. Willoughby ; and the horse being led by the Captain himself , a passage through the forest was effected as far as the head of the Otsego"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(arachnology, informal) A jumping spider.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The larva of the cheese fly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, 18th century) One of certain Calvinistic Methodists in Wales whose worship was characterized by violent convulsions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horology) A spring to impel the star wheel, or a pawl to lock fast a wheel, in a repeating timepiece.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) A shot in which the player releases the ball at the highest point of a jump; a jump shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A nuclear power plant worker who repairs equipment in areas with extremely high levels of radiation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A platform game based around jumping.",
                  "examples": [
                    "This is an extremely hard to find platform jumper centered around everyone's favorite dot eating hero."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jumper (third-person singular simple present jumpers, present participle jumpering, simple past and past participle jumpered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To connect with an electrical jumper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the term jump (“short coat”) in sailors' jargon, of uncertain origin. Possibly from Scottish English jupe (“man's loose jacket or tunic”), from Middle English juype, gype, joupe, from Old French jupe, juppe, from Arabic جُبَّة‎ (jubba); see also jibba. Cognate with German Joppe. Alternatively, perhaps derived from jump."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jumper (plural jumpers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, Australia, New Zealand) A woollen sweater or pullover.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose outer jacket, especially one worn by workers and sailors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A one-piece, sleeveless dress, or a skirt with straps and a complete or partial bodice, usually worn over a blouse by women and children; pinafore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually plural, jumpers) Rompers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}