{
  "word": "rod",
  "etymologies": [
    {
      "description": [
        "From Middle English rodde, from Old English *rodd or *rodde (attested in dative plural roddum (“rod, pole”)), of uncertain origin, but probably from Proto-Germanic *rudd- (“stick, club”), from Proto-Indo-European *rewdʰ- (“to clear land”). Compare Old Norse rudda (“club”). For the root, compare English rid. Presumably unrelated to Proto-Germanic *rōdō (“rod, pole”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rod (plural rods)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A straight, round stick, shaft, bar, cane, or staff.",
                  "examples": [
                    "The circus strong man proved his strength by bending an iron rod, and then straightening it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A longitudinal pole used for forming part of a framework such as an awning or tent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A long slender usually tapering pole used for angling; fishing rod.",
                  "examples": [
                    "When I hooked a snake and not a fish, I got so scared I dropped my rod in the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stick, pole, or bundle of switches or twigs (such as a birch), used for personal defense or to administer corporal punishment by whipping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An implement resembling and/or supplanting a rod (particularly a cane) that is used for corporal punishment, and metonymically called the rod, regardless of its actual shape and composition.",
                  "examples": [
                    "The judge imposed on the thief a sentence of fifteen strokes with the rod."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stick used to measure distance, by using its established length or task-specific temporary marks along its length, or by dint of specific graduated marks.",
                  "examples": [
                    "I notched a rod and used it to measure the length of rope to cut."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A unit of length equal to 1 pole, a perch, 1⁄4 chain, 5+1⁄2 yards, 16+1⁄2 feet, or exactly 5.0292 meters (these being all equivalent).",
                  "examples": [
                    "‘And this thicket, so full of a natural art, was in the immediate vicinity, within a few rods, of the dwelling of Madame Deluc, whose boys were in the habit of closely examining the shrubberies about them in search of the bark of the sassafras.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An implement held vertically and viewed through an optical surveying instrument such as a transit, used to measure distance in land surveying and construction layout; an engineer's rod, surveyor's rod, surveying rod, leveling rod, ranging rod. The modern (US) engineer's or surveyor's rod commonly is eight or ten feet long and often designed to extend higher. In former times a surveyor's rod often was a single wooden pole or composed of multiple sectioned and socketed pieces, and besides serving as a sighting target was used to measure distance on the ground horizontally, hence for convenience was of one rod or pole in length, that is, 5+1⁄2 yards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A unit of area equal to a square rod, 30+1⁄4 square yards or 1⁄160 acre.",
                  "examples": [
                    "The house had a small yard of about six rods in size."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A straight bar that unites moving parts of a machine, for holding parts together as a connecting rod or for transferring power as a driveshaft.",
                  "examples": [
                    "The engine threw a rod, and then went to pieces before our eyes, springs and coils shooting in all directions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A rod cell: a rod-shaped cell in the eye that is sensitive to light.",
                  "examples": [
                    "The rods are more sensitive than the cones, but do not discern color."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Any of a number of long, slender microorganisms.",
                  "examples": [
                    "He applied a gram positive stain, looking for rods indicative of Listeria."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A stirring rod: a glass rod, typically about 6 inches to 1 foot long and 1⁄8 to 1⁄4 inch in diameter that can be used to stir liquids in flasks or beakers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A pistol; a gun.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar) The penis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A hot rod, an automobile or other passenger motor vehicle modified to run faster and often with exterior cosmetic alterations, especially one based originally on a pre-1940s model or (currently) denoting any older vehicle thus modified.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ufology) A rod-shaped object that appears in photographs or videos traveling at high speed, not seen by the person recording the event, often associated with extraterrestrial entities.",
                  "examples": [
                    "These cylindrical rods fly through the air at incredible speeds and can only be picked up by high-speed cameras."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A Cuisenaire rod.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A coupling rod or connecting rod, which links the driving wheels of a steam locomotive, and some diesel shunters and early electric locomotives.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rod (third-person singular simple present rods, present participle rodding, simple past and past participle rodded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) To reinforce concrete with metal rods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with rods, especially lightning rods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar, transitive) To penetrate sexually.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To hot rod.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}