{
  "word": "rid",
  "etymologies": [
    {
      "description": [
        "Fusion of Middle English redden (“to deliver from, rid, clear”) (from Old English hreddan (“to deliver, rescue, free from, take away”), from  Proto-West Germanic *hraddjan, from Proto-Germanic *hradjaną (“to save, deliver”)) and Middle English ridden (“to clear away, remove obstructions”) (from Old English ġeryddan (“to clear land”), from Proto-Germanic *riudijaną (“to clear”), from Proto-Indo-European *rewdʰ- (“to clear land”).",
        "Akin to Old Frisian hredda (“to save”), Dutch redden (“to save, deliver”), German retten (“to save, deliver”), roden (“to clear”) and reuten (“to clear”), Old Norse ryðja (“to clear, empty”), Old Norse hrōðja (“to clear, strip”). More at redd."
      ],
      "adjectives": [
        {
          "description": "rid (not comparable) (not used attributively)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Released from an obligation, problem, etc. (usually followed by of).",
                  "examples": [
                    "I’m glad to be rid of that stupid nickname."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rid (third-person singular simple present rids, present participle ridding, simple past rid or ridded, past participle rid or ridded or (rare, nonstandard) ridden)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To free (something) from a hindrance or annoyance.",
                  "examples": [
                    "Synonyms: deliver, disencumber",
                    "We're trying to rid the world of poverty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly obsolete) To banish.",
                  "examples": [
                    "Worst of all were the leeches. The soldiers had managed to rid them from the camp interiors, but once you ventured out on patrol and into the wetlands, they were everywhere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To kill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rid",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or nonstandard) simple past tense and past participle of ride",
                  "examples": [
                    "\"He would have rid that horse, too,\" pa says, \"if I hadn't a stopped him. A durn spotted critter wilder than a catty-mount. A deliberate flouting of her and me.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}