{
  "word": "apocatastasis",
  "etymologies": [
    {
      "description": [
        "From Latin, from Ancient Greek ἀποκατάστασις (apokatástasis, “restoration, reëstablishment”), from ἀποκαθίστημι (apokathístēmi, “to stand up again”), from ἀπό- (apó-, “back again”) + καθίστημι (kathístēmi, “I set, place, constitute, appoint”), from κατά- (katá-, “down, for”) + ἵστημι (hístēmi, “I set, stand, establish”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "apocatastasis (plural apocatastases)",
          "definitionGroups": [
            {
              "group": "(rare) restoration, renovation, reestablishment, particularly:",
              "entries": [
                {
                  "meaning": "(especially religion, rare) An apocalypse leading to the remaking of the world rather than a Final Judgment, (Christianity) an Origenist doctrine condemned by the 543 C.E. Synod of Constantinople.",
                  "examples": [
                    "The Egyptians were the first assertors of the soul's immortality, and of its transmigration, after the death and corruption of this body, into the bodies of other animals successively, viz. until it have run round through the whole circuit of terrestrial, marine, and volatile animals, after which, they say, it is to return again into a human body; they supposing this revolution or apocatastasis of souls to be made in no less space than that of three thousand years."
                  ]
                },
                {
                  "meaning": "(religion) The doctrine that all souls will enter heaven or paradise, (Christianity) an Origenist doctrine condemned by the 543 C.E. Synod of Constantinople.",
                  "examples": [
                    "No doctrine...contradicts the Holy Scripture in a more unwarrantable manner than that of the so-called Apokatastasis."
                  ]
                },
                {
                  "meaning": "(medicine, rare) return to an earlier condition.",
                  "examples": [
                    "We read of Apocatastasis or urine...of tumours, and other diseases."
                  ]
                },
                {
                  "meaning": "(astronomy) Return to the same apparent position, as after a revolution.",
                  "examples": [
                    "The accurate apocatastasis (i.e. regression to the same sign) of the moon, and in a similar manner of the sun."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}