{
  "word": "lead",
  "etymologies": [
    {
      "description": [
        "From Middle English led, leed, from Old English lēad (“lead”), from Proto-West Germanic *laud (“lead”), borrowed from Proto-Celtic *ɸloudom, from Proto-Indo-European *plewd- (“to flow”).",
        "Cognate with Scots leid, lede (“lead”), North Frisian lud, luad (“lead”), West Frisian lead (“lead”), Dutch lood (“lead”), German Lot (“solder, plummet, sounding line”), Swedish lod (“lead”), Icelandic lóð (“a plumb, weight”), Irish luaidhe (“lead”) Latin plumbum (“lead”). Doublet of loth. More at flow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lead (countable and uncountable, plural leads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A heavy, pliable, inelastic metal element, having a bright, bluish color, but easily tarnished; both malleable and ductile, though with little tenacity. It is easily fusible, forms alloys with other metals, and is an ingredient of solder and type metal. Atomic number 82, symbol Pb (from Latin plumbum).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, nautical) A plummet or mass of lead attached to a line, used in sounding depth at sea or (dated) to estimate velocity in knots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin strip of type metal, used to separate lines of type in printing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, typography) Vertical space in advance of a row or between rows of text. Also known as leading.",
                  "examples": [
                    "This copy has too much lead; I prefer less space between the lines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sheets or plates of lead used as a covering for roofs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plural leads) A roof covered with lead sheets or terne plates.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A thin cylinder of graphite used in pencils.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) bullets; ammunition.",
                  "examples": [
                    "They pumped him full of lead."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lead (third-person singular simple present leads, present participle leading, simple past and past participle leaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover, fill, or affect with lead.",
                  "examples": [
                    "continuous firing leads the grooves of a rifle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, printing, historical) To place leads between the lines of.",
                  "examples": [
                    "to lead a page",
                    "leaded matter"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English leden, from Old English lǣdan (“to lead”), from Proto-West Germanic *laidijan, from Proto-Germanic *laidijaną (“to cause one to go, lead”), causative of Proto-Germanic *līþaną (“to go”), from Proto-Indo-European *leyt- (“to leave, die”).",
        "Cognate with West Frisian liede (“to lead”), Dutch leiden (“to lead”), German leiten (“to lead”), Danish and Norwegian Bokmål lede (“to lead”), Norwegian Nynorsk leia (“to lead”), Swedish leda (“to lead”). Related to Old English līþan (“to go, travel”)."
      ],
      "adjectives": [
        {
          "description": "lead (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Foremost.",
                  "examples": [
                    "The contestants are all tied; no one has the lead position."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Main, principal, primary, first, chief, foremost.",
                  "examples": [
                    "the lead guitarist in band",
                    "the lead developer on a software project"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lead (countable and uncountable, plural leads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The act of leading or conducting; guidance; direction, course",
                  "examples": [
                    "to take the lead",
                    "to be under the lead of another"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Precedence; advance position; also, the measure of precedence; the state of being ahead in a race; the highest score in a game in an incomplete game.",
                  "examples": [
                    "the white horse had the lead.",
                    "to be in the lead",
                    "She lost the lead.",
                    "Smith managed to extend her lead over the second place to half a second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, countable) An insulated metallic wire for electrical devices and equipment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The situation where a runner steps away from a base while waiting for the pitch to be thrown.",
                  "examples": [
                    "The runner took his lead from first."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, card games, dominoes) The act or right of playing first in a game or round; the card suit, or piece, so played",
                  "examples": [
                    "your partner has the lead"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(acting) The main role in a play or film; the lead role.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(acting) The actor who plays the main role; lead actor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) The person in charge of a project or a work shift etc.",
                  "examples": [
                    "John is the development lead on this software product."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A channel of open water in an ice field.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, mining) A lode.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The course of a rope from end to end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rope, leather strap, or similar device with which to lead an animal; a leash",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a steam engine, the width of port opening which is uncovered by the valve, for the admission or release of steam, at the instant when the piston is at end of its stroke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(civil engineering) The distance of haul, as from a cutting to an embankment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horology) The action of a tooth, such as a tooth of a wheel, in impelling another tooth or a pallet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hypothesis that has not been pursued",
                  "examples": [
                    "The investigation stalled when all leads turned out to be dead ends."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Information obtained by a detective or police officer that allows him or her to discover further details about a crime or incident.",
                  "examples": [
                    "The police have a couple of leads they will follow to solve the case."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marketing) Potential opportunity for a sale or transaction, a potential customer.",
                  "examples": [
                    "Joe is a great addition to our sales team, he has numerous leads in the paper industry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Information obtained by a news reporter about an issue or subject that allows him or her to discover more details.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) The player who throws the first two rocks for a team.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(newspapers) A teaser; a lead-in; the start of a newspaper column, telling who, what, when, where, why and how. (Sometimes spelled as lede for this usage to avoid ambiguity.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An important news story that appears on the front page of a newspaper or at the beginning of a news broadcast",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) The axial distance a screw thread travels in one revolution. It is equal to the pitch times the number of starts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) In a barbershop quartet, the person who sings the melody, usually the second tenor",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The announcement by one voice part of a theme to be repeated by the other parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A mark or a short passage in one voice part, as of a canon, serving as a cue for the entrance of others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) The excess above a right angle in the angle between two consecutive cranks, as of a compound engine, on the same shaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical) The angle between the line joining the brushes of a continuous-current dynamo and the diameter symmetrical between the poles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical) The advance of the current phase in an alternating circuit beyond that of the electromotive force producing it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lead (third-person singular simple present leads, present participle leading, simple past and past participle led)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(heading, transitive) To guide or conduct.",
              "entries": [
                {
                  "meaning": "To guide or conduct with the hand, or by means of some physical contact connection.",
                  "examples": [
                    "a father leads a child    a jockey leads a horse with a halter    a dog leads a blind man"
                  ]
                },
                {
                  "meaning": "To guide or conduct in a certain course, or to a certain place or end, by making the way known; to show the way, especially by going with or going in advance of, to lead a pupil; to guide somebody somewhere or to bring somebody somewhere by means of instructions.",
                  "examples": [
                    "The guide was able to lead the tourists through the jungle safely."
                  ]
                },
                {
                  "meaning": "(figuratively): To direct; to counsel; to instruct",
                  "examples": [
                    "A good teacher should lead their students to the right answer."
                  ]
                },
                {
                  "meaning": "To conduct or direct with authority; to have direction or charge of; to command, especially a military or business unit.",
                  "examples": [
                    "to lead a political party",
                    "to lead the search team"
                  ]
                },
                {
                  "meaning": "To guide or conduct oneself in, through, or along (a certain course); hence, to proceed in the way of; to follow the path or course of; to pass; to spend. Also, to cause (one) to proceed or follow in (a certain course).",
                  "examples": [
                    "The evidence leads me to believe he is guilty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To guide or conduct, as by accompanying, going before, showing, influencing, directing with authority, etc.; to have precedence or preeminence; to be first or chief; — used in most of the senses of the transitive verb.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(heading) To begin, to be ahead.",
              "entries": [
                {
                  "meaning": "(transitive) To go or to be in advance of; to precede; hence, to be foremost or chief among.",
                  "examples": [
                    "the big sloop led the fleet of yachts;  the Guards led the attack;  Demosthenes leads the orators of all ages"
                  ]
                },
                {
                  "meaning": "(intransitive) To lead off or out, to go first; to begin.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To be more advanced in technology or business than others.",
                  "examples": []
                },
                {
                  "meaning": "(heading, sports)",
                  "examples": [
                    "to lead trumps",
                    "He led the ace of spades."
                  ]
                },
                {
                  "meaning": "(transitive, card games, dominoes) To begin a game, round, or trick, with",
                  "examples": [
                    "to lead trumps",
                    "He led the ace of spades."
                  ]
                },
                {
                  "meaning": "(intransitive) To be ahead of others, e.g., in a race.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To have the highest interim score in a game.",
                  "examples": []
                },
                {
                  "meaning": "(baseball) To step off base and move towards the next base.",
                  "examples": [
                    "The batter always leads off base."
                  ]
                },
                {
                  "meaning": "(shooting) To aim in front of a moving target, in order that the shot may hit the target as it passes.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, climbing) Lead climb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To draw or direct by influence, whether good or bad; to prevail on; to induce; to entice; to allure",
                  "examples": [
                    "to lead someone to a righteous cause"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To tend or reach in a certain direction, or to a certain place.",
                  "examples": [
                    "the path leads to the mill;  gambling leads to other vices"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To produce (with to).",
                  "examples": [
                    "The shock led to a change in his behaviour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of led.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To live or experience (a particular way of life).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "lead",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of led.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}