{
  "word": "finance",
  "etymologies": [
    {
      "description": [
        "From Middle English finaunce, from Anglo-Norman, Middle French finance, from finer (“to pay ransom”) (whence also English fine (“to pay a penalty”)), from fin (“end”), from Latin fīnis.",
        "Original English sense c. 1400 was “ending”. Sense of “ending/satisfying a debt” came from French influence: in sense of “ransom” mid 15th century, in sense of “taxation” late 15th century. In sense of “manage money” first recorded 1770."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "finance (countable and uncountable, plural finances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The management of money and other assets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The science of management of money and other assets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) Monetary resources, especially those of a public entity or a company.",
                  "examples": [
                    "Who's really in charge of a democracy's finances?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The provision of a loan, payment instalment terms, or similar arrangement, to enable a customer to purchase an item without paying the full amount straight away.",
                  "examples": [
                    "Finance on all our new cars is provided by ABC Loans Ltd."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "finance (third-person singular simple present finances, present participle financing, simple past and past participle financed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To conduct, or procure money for, financial operations; manage finances.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To pay ransom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To manage financially; be financier for; provide or obtain funding for a transaction or undertaking.",
                  "examples": [
                    "Synonym: fund",
                    "His parents financed his college education.",
                    "He financed his home purchase through a local credit union."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To extort ransom from.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}