{
  "word": "jack",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English jakke, from Anglo-Norman jacke, Middle French jaque, jacque, from jacques (“peasant”), from the proper name Jacques. Compare jacquerie."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jack (plural jacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A coarse mediaeval coat of defence, especially one made of leather. [from 14th c.]",
                  "examples": [
                    "jack of plate  (armor made up of small metal plates sewn between layers of cloth, similar to a brigandine)",
                    "jack of mail",
                    "padded jack"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Transferative use of the personal name Jack."
      ],
      "adjectives": [
        {
          "description": "jack (comparative more jack, superlative most jack)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) Tired, disillusioned; fed up (with). [from 19th c.]",
                  "examples": [
                    "In the end, black and white were both crawling on the ground in reconciliation. Both saying that they were plain jack of each other."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "jack (plural jacks)",
          "definitionGroups": [
            {
              "group": "A man.",
              "entries": [
                {
                  "meaning": "(chiefly capitalized) A name applied to a hypothetical or typical man. [from 14th c.]",
                  "examples": [
                    "After Dinner they frisk away to some known Place of Rendezvous, where (at Night) every Jack has his Jill and every Jill has her Jack."
                  ]
                },
                {
                  "meaning": "(countable, now chiefly US) A man, a fellow; a typical man; men in general. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(colloquial) A sailor. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(slang) A policeman or detective; (Australia) a military policeman. [from 19th c.]",
                  "examples": [
                    "Synonyms: jake; see also Thesaurus:police officer"
                  ]
                },
                {
                  "meaning": "(now rare) A manual laborer. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Canada, US, colloquial) A lumberjack. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "(India, historical, slang) A sepoy.",
                  "examples": [
                    "I hope to God his theories will not unman him in action, that he will not be musing and refining when he should be leading the Jacks  […]"
                  ]
                }
              ]
            },
            {
              "group": "A device or utensil.",
              "entries": [
                {
                  "meaning": "A device for turning a spit; a smokejack or roasting jack. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "Each of a series of blocks in a harpsichord or the earlier virginal, communicating the action of the key to the quill; sometime also, a hopper in a modern piano. [from 16th c.]",
                  "examples": [
                    "[W]hat the devil makes you so dull, Letitia? I thought to have found you popping about as brisk as the jacks of your harpsichord."
                  ]
                },
                {
                  "meaning": "(obsolete) A support for wood being sawn; a sawhorse or sawbuck. [16th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A device used to hold a boot by the heel, to assist in removing the boot. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "A mechanical device used to raise and (temporarily) support a heavy object, now especially to lift one side of a motor vehicle when (e.g.) changing a tyre. [from 17th c.]",
                  "examples": [
                    "She used a jack to lift her car and changed the tire."
                  ]
                },
                {
                  "meaning": "Any of various levers for raising or lowering the sinkers which push the loops down on the needles in a knitting machine or stocking frame. [from 18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(mining, now rare) A wedge for separating rocks rent by blasting. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A grating device used to separate and guide the threads in a warping machine; a heck box. [19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A machine for twisting the sliver as it leaves a carding machine, in the preparation of yarn. [19th–20th c.]",
                  "examples": []
                },
                {
                  "meaning": "(electronics) A switch for a jack plug, a jackknife switch; (more generally) a socket used to connect a device to a circuit, network etc. [from 19th c.]",
                  "examples": [
                    "telephone jack",
                    "Antonym: plug"
                  ]
                }
              ]
            },
            {
              "group": "A non-tool object or thing.",
              "entries": [
                {
                  "meaning": "(now historical, regional) A pitcher or other vessel for holding liquid, especially alcoholic drink; a black-jack. [from 16th c.]",
                  "examples": [
                    "He had his tea and hot rolls in a morning, while we were battening upon our quarter-of-a-penny loaf — our crug — moistened with attenuated small beer, in wooden piggings, smacking of the pitched leathern jack it was poured from."
                  ]
                },
                {
                  "meaning": "(card games, originally colloquial) The lowest court card in a deck of standard playing cards, ranking between the 10 and queen, with an image of a knave or pageboy on it. [from 17th c.]",
                  "examples": [
                    "Synonym: knave"
                  ]
                },
                {
                  "meaning": "(bowls) A small, typically white, ball used as the target ball in bowls; a jack-ball. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(nautical) A small ship's flag used as a signal or identifying device; a small flag flown at the bow of the vessel. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(UK, regional, now rare, historical) A measure of liquid corresponding to a quarter of a pint. [from 18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, slang) A fake coin designed to look like a sovereign. [19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(nautical, now rare, historical) A jack crosstree. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(games) A small, six-pointed playing piece used in the game of jacks. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(US) A torch or other light used in hunting to attract or dazzle game at night. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(slang, chiefly US) Money. [from 19th c.]",
                  "examples": [
                    "First off Regan carried fifteen grand, packed it in his clothes all the time. Real money, they tell me. Not just a top card and a bunch of hay. That's a lot of jack (or jack-shit)  […] ."
                  ]
                },
                {
                  "meaning": "(colloquial, euphemistic) Nothing, jack shit. [from 20th c.]",
                  "examples": [
                    "You haven't done jack. Get up and get this room cleaned up right now!"
                  ]
                },
                {
                  "meaning": "(cricket, slang) The eleventh batsman to come to the crease in an innings.",
                  "examples": []
                },
                {
                  "meaning": "(slang, Appalachians) A smooth often ovoid large gravel or small cobble in a natural water course.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A plant or animal.",
              "entries": [
                {
                  "meaning": "A pike, especially when young. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(chiefly US) A male ass, especially when kept for breeding. [from 17th c.]",
                  "examples": [
                    "Synonym: jackass"
                  ]
                },
                {
                  "meaning": "Any of the marine fish in the family Carangidae. [from 17th c.]",
                  "examples": [
                    "Synonym: jack mackerel"
                  ]
                },
                {
                  "meaning": "(US) A jackrabbit. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A large California rockfish, the bocaccio, Sebastes paucispinis.",
                  "examples": []
                },
                {
                  "meaning": "Mangifera caesia, related to the mango tree.",
                  "examples": []
                },
                {
                  "meaning": "(colloquial) Plant in the genus Arisaema, also known as Jack-in-the-pulpit, and capitalized Jack.",
                  "examples": []
                },
                {
                  "meaning": "(colloquial) Spadix of a plant (also capitalized Jack).",
                  "examples": []
                },
                {
                  "meaning": "(apparently does not occur standalone for the genus per se) Plant of the genus Emex, also considered synonymous to Rumex, if not then containing two species lesser jack and little jack for Emex spinosa syn. Rumex spinosus, Australian English three-corner jack and prickly jack for Emex australis syn. Rumex hypogaeus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jack (third-person singular simple present jacks, present participle jacking, simple past and past participle jacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To physically raise using a jack.",
                  "examples": [
                    "He jacked the car so that he could replace the brake pads.",
                    "Synonym: jack up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise or increase.",
                  "examples": [
                    "If you want to jack your stats you just write off failures as invalid results."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To increase the potency of an alcoholic beverage similarly to distillation by chilling it to below the freezing point of water, removing the water ice crystals that form, and leaving the still-liquid alcoholic portion.",
                  "examples": [
                    "Fruit of the orchard has been \"jacked\" these many generations, with Plymouth Rockers putting the hard cider barrel down into the ground to freeze, and  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To steal something, typically an automobile.",
                  "examples": [
                    "Someone jacked my car last night!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dance by moving the torso forward and backward in a rippling motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, vulgar) To jack off, to masturbate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Portuguese jaca (“jackfruit”), from Malayalam ചക്ക (cakka)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jack (plural jacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The edible fruit of the Asian tree (Artocarpus heterophyllus); also the tree itself. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The related tree Mangifera caesia.",
                  "examples": [
                    "Synonyms: white mango, wani"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jack (plural jacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, baseball) A home run.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jack (third-person singular simple present jacks, present participle jacking, simple past and past participle jacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, baseball) To hit (the ball) hard; especially, to hit (the ball) out of the field, producing a home run.",
                  "examples": [
                    "An excellent piece of work, Wayne thought, so good in fact, he wasn’t surprised when Bailey walked to the plate and on the first pitch jacked the ball far into the parking lot outside the left-field fence for a tournament winning homerun."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}