{
  "word": "fashion",
  "etymologies": [
    {
      "description": [
        "From Middle English facioun, from Anglo-Norman fechoun (compare Jersey Norman faichon), variant of Old French faceon, fazon, façon (“fashion, form, make, outward appearance”), from Latin factiō (“a making”), from faciō (“do, make”); see fact. Doublet of faction."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fashion (countable and uncountable, plural fashions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A current (constantly changing) trend, favored for frivolous rather than practical, logical, or intellectual reasons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Popular trends.",
                  "examples": [
                    "Check out the latest in fashion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A style or manner in which something is done.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The make or form of anything; the style, shape, appearance, or mode of structure; pattern, model; workmanship; execution.",
                  "examples": [
                    "the fashion of the ark, of a coat, of a house, of an altar, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Polite, fashionable, or genteel life; social position; good breeding.",
                  "examples": [
                    "men of fashion"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fashion (third-person singular simple present fashions, present participle fashioning, simple past and past participle fashioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make, build or construct, especially in a crude or improvised way.",
                  "examples": [
                    "I have three gourds which I fill with water and take back to my cave against the long nights. I have fashioned a spear and a bow and arrow, that I may conserve my ammunition, which is running low."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To make in a standard manner; to work.",
                  "examples": [
                    "Fashioned plate sells for more than its weight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To fit, adapt, or accommodate to.",
                  "examples": [
                    "Laws ought to be fashioned unto the manners and conditions of the people."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To forge or counterfeit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}