{
  "word": "regular",
  "etymologies": [
    {
      "description": [
        "From Middle English reguler, from Anglo-Norman reguler, Middle French reguler, regulier, and their source, Latin rēgulāris (“continuing rules for guidance”), from rēgula (“rule”), ultimately from Proto-Indo-European *reg- (“move in a straight line”)."
      ],
      "adjectives": [
        {
          "description": "regular (comparative more regular, superlative most regular)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) Bound by religious rule; belonging to a monastic or religious order (often as opposed to secular). [from 14th c.]",
                  "examples": [
                    "regular clergy, in distinction from the secular clergy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a constant pattern; showing evenness of form or appearance. [from 15th c.]",
                  "examples": [
                    "Synonyms: equable, uniform, unvarying; see also Thesaurus:steady",
                    "Antonyms: chaotic, irregular; see also Thesaurus:unsteady"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry, of a polygon) Both equilateral and equiangular; having all sides of the same length, and all (corresponding) angles of the same size [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry, of a polyhedron) Whose faces are all congruent regular polygons, equally inclined to each other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Demonstrating a consistent set of rules; showing order, evenness of operation or occurrence. [from 16th c.]",
                  "examples": [
                    "Synonyms: in order, ruly, tidy; see also Thesaurus:orderly",
                    "Antonyms: chaotic, tumultuous; see also Thesaurus:disorderly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) Of a moon or other satellite: following a relatively close and prograde orbit with little inclination or eccentricity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Well-behaved, orderly; restrained (of a lifestyle etc.). [from 16th c.]",
                  "examples": [
                    "Synonyms: decent, seemly, well-mannered",
                    "Antonyms: degenerate, irregular"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Happening at constant (especially short) intervals. [from 17th c.]",
                  "examples": [
                    "Synonyms: cyclical, frequent; see also Thesaurus:periodic",
                    "Antonyms: irregular, noncyclic",
                    "He made regular visits to go see his mother."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, of a verb, plural, etc) Following a set or common pattern; according to the normal rules of a given language. [from 17th c.]",
                  "examples": [
                    "Synonym: (verbs) weak",
                    "Antonyms: irregular, (verbs) strong",
                    "\"Walked\" is the past tense of the regular verb \"to walk\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) Having the expected characteristics or appearances; normal, ordinary, standard. [from 17th c.]",
                  "examples": [
                    "Synonyms: basic, common, unremarkable; see also Thesaurus:normal, Thesaurus:common",
                    "Antonyms: irregular, outlandish, weird; see also Thesaurus:strange"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly military) Permanently organised; being part of a set professional body of troops. [from 17th c.]",
                  "examples": [
                    "Antonym: irregular"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having bowel movements or menstrual periods at constant intervals in the expected way. [from 18th c.]",
                  "examples": [
                    "Maintaining a high-fibre diet keeps you regular."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Exemplary; excellent example of; utter, downright. [from 18th c.]",
                  "examples": [
                    "Synonyms: absolute, thorough, unalloyed; see also Thesaurus:total",
                    "a regular genius; a regular John Bull"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, zoology) Having all the parts of the same kind alike in size and shape.",
                  "examples": [
                    "a regular flower; a regular sea urchin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(crystallography) Isometric.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snowboarding) Riding with the left foot forward.",
                  "examples": [
                    "Antonym: goofy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematical analysis, not comparable, of a Borel measure) Such that every set in its domain is both outer regular and inner regular.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "regular (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, dialect, nonstandard) Regularly, on a regular basis.",
                  "examples": [
                    "Though no minister would visit the Skerburnfoot, or, if he went, departed quicker than he came, the girl Ailie attended regular at the catechising at the mains of Sker."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "regular (plural regulars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of the British Army (as opposed to a member of the Territorial Army or Reserve).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A frequent, routine visitor to an establishment.",
                  "examples": [
                    "Bartenders usually know their regulars by name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of an armed forces or police force.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A frequent customer, client or business partner.",
                  "examples": [
                    "This gentleman was one of the architect's regulars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) A coffee with one cream and one sugar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything that is normal or standard.",
                  "examples": [
                    "You separate the marbles by color until you have four groups, but then you notice that some of the marbles are regulars, some are shooters, and some are peewees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of a religious order who has taken the three ordinary vows.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number for each year, giving, added to the concurrents, the number of the day of the week on which the Paschal full moon falls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fixed number for each month serving to ascertain the day of the week, or the age of the moon, on the first day of any month.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}