{
  "word": "erect",
  "etymologies": [
    {
      "description": [
        "From Middle English erect, a borrowing from Latin ērectus (“upright”), past participle of ērigō (“raise, set up”), from ē- (“out”) + regō (“to direct, keep straight, guide”)."
      ],
      "adjectives": [
        {
          "description": "erect (comparative more erect, superlative most erect)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Upright; vertical or reaching broadly upwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of body parts) Rigid, firm; standing out perpendicularly, especially as the result of stimulation.",
                  "examples": [
                    "Synonyms: hard, stiff",
                    "The penis should be fully erect before commencing copulation.",
                    "erect nipples"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Having an erect penis.",
                  "examples": [
                    "Synonyms: hard, stiff",
                    "OK, baby, I'm erect now. Let's get it on!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Bold; confident; free from depression; undismayed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Directed upward; raised; uplifted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Watchful; alert.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) Elevated, as the tips of wings, heads of serpents, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English erecten, from the adjective (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "erect (third-person singular simple present erects, present participle erecting, simple past and past participle erected)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put up by the fitting together of materials or parts.",
                  "examples": [
                    "to erect a house or a fort"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to stand up or out.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To raise and place in an upright or perpendicular position; to set upright; to raise.",
              "entries": [
                {
                  "meaning": "(intransitive, aviation, of a gyroscopic attitude indicator) To spin up and align to vertical.",
                  "examples": [
                    "As soon as electrical power was restored, the attitude indicators' gyros would have begun to erect."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lift up; to elevate; to exalt; to magnify.",
                  "examples": [
                    "I, who am a party, am not to erect myself into a judge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To animate; to encourage; to cheer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, astrology) To cast or draw up (a figure of the heavens, horoscope etc.).",
                  "examples": [
                    "In 1581 Parliament made it a statutory felony to erect figures, cast nativities, or calculate by prophecy how long the Queen would live or who would succeed her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To enter a state of physiological erection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set up as an assertion or consequence from premises, etc.",
                  "examples": [
                    "from fallacious foundations, and misapprehended mediums, erecting conclusions no way inferrible from their premises"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set up or establish; to found; to form; to institute.",
                  "examples": [
                    "to erect a new commonwealth"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}