{
  "word": "metal",
  "etymologies": [
    {
      "description": [
        "From Middle English metal, a borrowing from Old French metal, from Latin metallum (“metal, mine, quarry, mineral”), itself a borrowing from Ancient Greek μέταλλον (métallon, “mine, quarry, metal”)."
      ],
      "adjectives": [
        {
          "description": "metal (comparative more metal, superlative most metal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Characterized by strong drum-beats and distorted guitars. [1970s and after]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the emotional or social characteristics associated with metal music; brash, bold, frank, unyielding, etc.",
                  "examples": [
                    "The beast will destroy everything in his path  With this song on the upcoming brawl  It sure is a long one and tough to pronounce but  It's the most metal title of all"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "metal (countable and uncountable, plural metals)",
          "definitionGroups": [
            {
              "group": "(heading) Chemical elements or alloys, and the mines where their ores come from.",
              "entries": [
                {
                  "meaning": "Any of a number of chemical elements in the periodic table that form a metallic bond with other metal atoms; generally shiny, somewhat malleable and hard, often a conductor of heat and electricity.",
                  "examples": []
                },
                {
                  "meaning": "Any material with similar physical properties, such as an alloy.",
                  "examples": []
                },
                {
                  "meaning": "(astronomy) An element which was not directly created after the Big Bang but instead formed through nuclear reactions; any element other than hydrogen and helium.",
                  "examples": [
                    "Thus, for the remaining elements, including oxygen, the solid phase appears to be important. In fact, at a metallicity of Z=0.02, and with a gas-to-dust ratio of 100, about half of the metals — including oxygen — are contained in the solid phase."
                  ]
                },
                {
                  "meaning": "Crushed rock, stones etc. used to make a road.",
                  "examples": []
                },
                {
                  "meaning": "(mining) The ore from which a metal is derived.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A mine from which ores are taken.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A light tincture used in a coat of arms, specifically argent (white or silver) and or (gold).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Molten glass that is to be blown or moulded to form objects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A category of rock music encompassing a number of genres (including thrash metal, death metal, heavy metal, etc.) characterized by strong drum-beats and distorted guitars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, archaic) The substance that constitutes something or someone; matter; hence, character or temper.",
                  "examples": [
                    "Synonym: mettle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The effective power or calibre of guns carried by a vessel of war.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, in the plural) The rails of a railway.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, travel, aviation) The actual airline operating a flight, rather than any of the codeshare operators.",
                  "examples": [
                    "We have American Airlines tickets, but it's on British Airways metal."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "metal (third-person singular simple present metals, present participle metaling or metalling, simple past and past participle metaled or metalled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a road using crushed rock, stones etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}