{
  "word": "diesel",
  "etymologies": [
    {
      "description": [
        "From German Diesel, named after inventor Rudolf Diesel, who developed a heavy-duty engine in Germany (1892–1897) and perfected it throughout his life."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "diesel (countable and uncountable, plural diesels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fuel derived from petroleum (or other oils) but heavier than gasoline/petrol. Used to power diesel engines which burn this fuel using the heat produced when air is compressed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A vehicle powered by a diesel engine.",
                  "examples": [
                    "Their effective service life was cut short by an almost simultaneous switch to diesels - a circumstance shared with many an engine north of the border."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling, slang) A rider who has an even energy output, without bursts of speed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang) Synonym of snakebite and black.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A particular cannabis hybrid.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "diesel (third-person singular simple present diesels, present participle dieseling, simple past and past participle dieseled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To ignite a substance by using the heat generated by compression.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) For a spark-ignition internal combustion engine to continue running after the electrical current to the spark plugs has been turned off. This occurs when there's enough heat in the combustion chamber to ignite the air and fuel mixture without a spark, the same way that heat and pressure cause ignition in a diesel engine.",
                  "examples": [
                    "The only reason the VW bug has a solenoid is to prevent it from dieseling."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}