{
  "word": "salty",
  "etymologies": [
    {
      "description": [
        "From Middle English salti, equivalent to salt +‎ -y.",
        "Compare Saterland Frisian soaltig (“salty”), West Frisian sâltich (“salty”), Dutch zoutig (“salty”), German Low German soltig (“salty”), German salzig (“salty”).",
        "(coarse; irritated, annoyed): Referencing the sharp, 'spicy' flavor of salt.\n(indignant): Perhaps implying the person is a crybaby, shedding salty tears, or derived from the preceding."
      ],
      "adjectives": [
        {
          "description": "salty (comparative saltier, superlative saltiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Tasting of salt.",
                  "examples": [
                    "A few types of molecules get sensed by receptors on the tongue. Protons coming off of acids ping receptors for \"sour.\" Sugars get received as \"sweet.\" Bitter, salty, and the proteinaceous flavor umami all set off their own neural cascades."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Containing salt.",
                  "examples": [
                    "At Zipaquirá, the salty ore is taken from the mine in chunks, then thrown into large tanks of water, where the salt is dissolved out. The resulting brine is drawn off into pipelines, containers, or tank trucks and sold  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, of language) Coarse; provocative; earthy.",
                  "examples": [
                    "In the following piece she has some characteristically salty things to say about what happens when law and medicine meet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Experienced, especially used to indicate a veteran of the naval services; salty dog (from salt of the sea).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Irritated, annoyed, angry, bitter, bitchy.",
                  "examples": [
                    "I want to beg your pardon for making you salty that night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Pertaining to the Sardinian language and those dialects of Catalan, spoken in the Balearic Islands and along the coast of Catalonia, that use definitive articles descended from the Latin ipse (“self”) instead of the Latin ille (“that”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}