{
  "word": "intercalate",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin intercalātus (perfect passive participle of intercalō (“I proclaim that something has been intercalated, I insert”)), from inter- (“between, among”) +‎ calo (“I call, I proclaim”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "intercalate (third-person singular simple present intercalates, present participle intercalating, simple past and past participle intercalated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To insert an extra leap day into a calendar in order to maintain synchrony with natural phenomena.",
                  "examples": [
                    "'[T]is wonderful where or when we ever got anything of this which we call wisdom, poetry, virtue. We never got it on any dated calendar day. Some heavenly days must have been intercalated somewhere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To insert an extra month into a calendar for the same purpose. The Hebrew calendar has such a month.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(molecular biology) To insert a substance between two or more molecules, bases, cells, or tissues.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To insert anything somewhere (especially between other things), such as an affix into a word. (Compare interpolate.)",
                  "examples": [
                    "... the personal pronouns which form the terminations of the verb, or by an intercalated suffix, the nature and relation of its objects and its subject , and to distinguish whether the object be animate or inanimate, ..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}