{
  "word": "scunge",
  "etymologies": [
    {
      "description": [
        "Probably related to scrounge."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scunge (countable and uncountable, plural scunges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Muck, scum, dirt, dirtiness; also used attributively.",
                  "examples": [
                    "Every saucepan he owned was piled there, caked with unidentifiable scunge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) A scrounger; one who habitually borrows.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) A dirty or untidy person; one who takes no pride in their appearance.",
                  "examples": [
                    "“You four scunges need to clean yourselves up,″ Jarrad announced — ironic given his own personal hygiene, Jake thought, which was less than impeccable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang, derogatory) A scoundrel; a worthless or despicable person.",
                  "examples": [
                    "The press officer was glad to get me onto the helicopter back to the airbase, as he obviously thought I must be a bit of a scunge asking political questions, when it was my job to report on how well the war was going and how the North was being held."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scunge (third-person singular simple present scunges, present participle scunging or scungeing, simple past and past participle scunged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mark with scunge; to begrime or besmirch.",
                  "examples": [
                    "“I was scunged. ... I hated myself, hated everything, felt useless and worthless, had no friends, no love, no career, no education, no parents and no tomorrows. It all added up to nothing.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To slink about; to sneak, to insinuate.",
                  "examples": [
                    "Neither will ye scunge after the gentry like M′Quirkie, and keep your creed in your hand ready to swap it for ony ither that may happen to be mair profitable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To scrounge; to borrow.",
                  "examples": [
                    "The Australian Labor Party in Victoria had a very successful result. Members of the National Party are scunging around trying to win Ballarat!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}