{
  "word": "paddock",
  "etymologies": [
    {
      "description": [
        "The noun is almost certainly a variant of dialectal British parrock (“enclosure; park; croft, small field, paddock”), from Middle English parrok, parrock (“enclosed pasture, paddock; coop; feeding stall; cabin, hut”) [and other forms], from Old English pearroc, pearruc (“fence used to enclose a space; area enclosed by such a fence, enclosure”), from Proto-West Germanic *parruk (“enclosure; pen for animals”), from Proto-Germanic *parrukaz (“fence; enclosure”); further etymology uncertain, perhaps related to Proto-Germanic *barō (“bar, beam; barrier”), possibly from Proto-Indo-European *bʰerH- (“to pierce; to strike”). Doublet of park.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "paddock (plural paddocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) A small enclosure or field of grassland, especially one used to exercise or graze horses or other animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(horse racing) An enclosure next to a racecourse where horses are paraded and mounted before a race and unsaddled after a race.",
                  "examples": []
                },
                {
                  "meaning": "(motor racing) An area at a racing circuit where the racing vehicles are parked and worked on before and between races.",
                  "examples": []
                },
                {
                  "meaning": "(sports, slang) A field on which a game is played; a playing field.",
                  "examples": []
                },
                {
                  "meaning": "(Australia, New Zealand) A field of grassland of any size, either enclosed by fences or delimited by geographical boundaries, especially a large area for keeping cattle or sheep.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Australia, New Zealand, mining) A place in a superficial deposit where ore or washdirt (“earth rich enough in metal to pay for washing”) is excavated; also, a place for storing ore, washdirt, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "paddock (third-person singular simple present paddocks, present participle paddocking, simple past and past participle paddocked) (transitive, chiefly Australia, New Zealand)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often passive) To place or keep (cattle, horses, sheep, or other animals) within a paddock (noun sense 1 or 2.4); hence, to provide (such animals) with pasture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To enclose or fence in (land) to form a paddock.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(mining)",
              "entries": [
                {
                  "meaning": "(also intransitive) To excavate washdirt (“earth rich enough in metal to pay for washing”) from (a superficial deposit).",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To store (ore, washdirt, etc.) in a paddock (noun sense 2.5).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English paddok, paddoke (“frog; toad”) [and other forms], from pad, pade (“frog; toad”) + -ok (diminutive suffix). Pad, pade is derived from Old English *pada, *padda, padde, from Proto-West Germanic *paddā, from Proto-Germanic *paddǭ (“toad”); further etymology uncertain, possibly ultimately from Proto-Indo-European *bʰew- (“to swell”). The English word is analysable as pad (“(Britain, dialectal) frog; toad”) +‎ -ock (suffix forming nouns, originally with diminutive senses).",
        "Sense 2 (“sledge”) is probably from the supposed resemblance of the object to a frog or toad."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "paddock (plural paddocks)",
          "definitionGroups": [
            {
              "group": "(chiefly Northern England, Northern Ireland, Scotland)",
              "entries": [
                {
                  "meaning": "A frog.",
                  "examples": [
                    "Cold as a paddock."
                  ]
                },
                {
                  "meaning": "A toad.",
                  "examples": []
                },
                {
                  "meaning": "(derogatory) A contemptible, or malicious or nasty, person.",
                  "examples": [
                    "Synonyms: see Thesaurus:jerk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A simple, usually triangular, sledge which is dragged along the ground to transport items.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}