{
  "word": "circumlocution",
  "etymologies": [
    {
      "description": [
        "From Latin circumlocūtiō (“the act of speaking around; circumlocution, periphrasis”). Surface analysis circum- (“around”) +‎ locution (“talk”), thus \"getting around (a problem) in speaking or writing\". Probably a calque of Ancient Greek περίφρασις (períphrasis, “periphrasis”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "circumlocution (countable and uncountable, plural circumlocutions)",
          "definitionGroups": [
            {
              "group": "(uncountable) A roundabout or indirect way of speaking; thus:",
              "entries": [
                {
                  "meaning": "(uncountable) Unnecessary use of extra words to express an idea, such as a pleonastic phrase (sometimes driven by an attempt at emphatic clarity) or a wordy substitution (the latter driven by euphemistic intent, pedagogic intent, or sometimes loquaciousness alone).",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) Necessary use of a phrase to circumvent either a vocabulary fault (of speaker or listener) or a lexical gap, either monolingually or in translation.",
                  "examples": [
                    "A technical word, such as hyperkalemia or hypoallergenic, can be glossed for general audiences with a circumlocution, such as \"high potassium level\" or \"less likely to cause allergies\" (respectively)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An instance of such usage; a roundabout expression, whether an inadvisable one or a necessary one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}