{
  "word": "telegraph",
  "etymologies": [
    {
      "description": [
        "From French télégraphe, equivalent to tele- (“far, distant”) +‎ graph (“writing”), suggested as a new name for Claude Chappe's overland semaphore network by André François Miot de Mélito in place of Chappe's original tachygraphe (“tachygraph, fast writer”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "telegraph (plural telegraphs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) Synonym of telegraphy, any process for transmitting arbitrarily long messages over a long distance using a symbolic code.",
                  "examples": [
                    "This strict sense of telegraph developed from French usage for Napoleon's overland semaphore network but rather arbitrarily excludes similar Chinese and other signalling networks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly historical) The electrical device gradually developed in the early 19th century to transmit messages using Morse code; the entire system used to transmit its messages including overhead lines and transoceanic cables.",
                  "examples": [
                    "The middle-class families celebrated by Kipling, the prolific lowbrow families whose sons officered the army and navy and swarmed over all the waste places of the earth from the Yukon to the Irrawaddy, were dwindling before 1914. The thing that had killed them was the telegraph. In a narrowing world, more and more governed from Whitehall, there was every year less room for individual initiative... By 1920 nearly every inch of the colonial empire was in the grip of Whitehall. Well-meaning, over-civilized men, in dark suits and black felt hats, with neatly rolled umbrellas crooked over the left forearm, were imposing their constipated view of life on Malaya and Nigeria, Mombasa and Mandalay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A visible or audible cue that indicates to an opponent the action that a character is about to take.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "telegraph (third-person singular simple present telegraphs, present participle telegraphing, simple past and past participle telegraphed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use a telegraph.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To clearly communicate to another nonverbally, whether by gesture, a change in attitude, or any other sign, especially unintentionally.",
                  "examples": [
                    "Her frown telegraphed her displeasure."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}