{
  "word": "processional",
  "etymologies": [
    {
      "description": [
        "procession +‎ -al"
      ],
      "adjectives": [
        {
          "description": "processional (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, pertaining to, or used during a procession, particularly at the start of a religious ceremony or wedding.",
                  "examples": [
                    "The publick Processional-way to the Chapter-house at Windesor, used time out of mind, led from the Presence-Chamber, down through the Cloister, and the great Gate of the Kings Lodging, into the upper Ward of the Castle, thence through the middle Ward, and part of the lower, to and through the passage, between the East-end of the Chappel, and Tomb-house, and thence into the Chapter-house, situate at the North-East Corner of St. George’s Chappel."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "processional (plural processionals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hymn or other music used during a procession; prosodion.",
                  "examples": [
                    "A perfectly drilled wedding procession, like a military one, should move forward in perfect step, rising and falling in a block or unit. To secure perfection of detail, the bars of the processional may be counted so that the music comes to an end at precisely the moment the bride and groom stand side by side at the chancel steps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people or things moving along in an orderly, stately, or solemn manner.",
                  "examples": [
                    "Synonym: procession"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism) A service book relating to ecclesiastical processions.",
                  "examples": [
                    "[47] Item that the Churchwardens of euery paryshe shall delyuer vnto our visitours the inuentories of vestmentes, copes, and other ornamentes, plate, bookes, and specyallye of Grayles, Couchers, Legendes, Processionalles, Hymnalles, Manuelles, Portuesses, and suche lyke apperteynyng to theyr Church."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}