{
  "word": "remission",
  "etymologies": [
    {
      "description": [
        "From Middle English remissioun (“release from duty; freeing of captives; mercy, pardon, respite; forgiveness; release from or reduction of penances; reduction in intensity (of a quality, symptom, etc.); transfer of property, quitclaim; legal opinion or submission; reference, cross-reference”) [and other forms], from Anglo-Norman remission, remissione, remissioun, remissiun and Middle French, Old French remission (“forgiveness of sin; pardoning of an offence; postponement; cessation, suspension; diminishing or weakening of something; reduction of debt; reduction in intensity of a disease or symptom”) (modern French rémission), and their etymon Late Latin remissiō (“forgiveness; pardon of sins”), Latin remissiō (“release; sending back; easing off, relaxing, softening; reduction of debt; reduction in intensity of a disease or symptom”), from remittō (“to remit, send back; to diminish; to relax; to do without, forego”) + -siō. Remittō is derived from re- (prefix meaning ‘back, backwards’) + mittō (“to cause to go; to send; to discharge, emit, let go, release; to throw; to extend, reach out; to announce, tell; to produce, yield; to attend, escort, guide; to dismiss, disregard; to end”) (possibly ultimately from Proto-Indo-European *meyth₂- (“to change, exchange; to change places, go past”) or *(s)meyt- (“to throw”)).",
        "The English word is cognate with Catalan remissió, Italian remissioni, remissione (“remission; withdrawal of legal action; compliance, submission”), Old Occitan remessió, Portuguese remisson, remissão (“pardon; remission”), Spanish remisión (“remission”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "remission (countable and uncountable, plural remissions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pardon of a sin; (chiefly historical, also figuratively) the forgiveness of an offence, or relinquishment of a (legal) claim or a debt.",
                  "examples": [
                    "Synonym: acceptilation",
                    "Antonym: irremission"
                  ]
                }
              ]
            },
            {
              "group": "A lessening of amount due, as in either money or work, or intensity of a thing.",
              "entries": [
                {
                  "meaning": "(law) A reduction or cancellation of the penalty for a criminal offence; in particular, the reduction of a prison sentence as a recognition of the prisoner's good behaviour.",
                  "examples": [
                    "Synonym: remitment"
                  ]
                },
                {
                  "meaning": "(medicine) An abatement or lessening of the manifestations of a disease; a period where the symptoms of a disease are absent.",
                  "examples": [
                    "Synonyms: anesis, remittence",
                    "Her cancer was in remission."
                  ]
                }
              ]
            },
            {
              "group": "An act of remitting, returning, or sending back.",
              "entries": [
                {
                  "meaning": "(law) A referral of a case back to another (especially a lower or inferior) court of law; a remand, a remittal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(spectroscopy) Reflection or scattering of light by a material; reemission.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "re- +‎ mission"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "remission (third-person singular simple present remissions, present participle remissioning, simple past and past participle remissioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To change the mission of; to provide with a new mission.",
                  "examples": [
                    "The Strykers have been remissioned, actually, to a mission of road security that actually takes advantage of the mobility that they provide."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}