{
  "word": "excuse",
  "etymologies": [
    {
      "description": [
        "From Middle English excusen (verb) and excuse (noun), borrowed from Old French escuser (verb) and excuse (noun), from Latin excūsō, excūsāre (“to excuse, allege in excuse, literally, free from a charge”), from ex (“out”) + causa (“a charge”); see cause, accuse and recuse. Displaced native Old English lād (“an excuse”) and lādian (“to excuse”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "excuse (countable and uncountable, plural excuses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Explanation designed to avoid or alleviate guilt or negative judgment; a plea offered in extenuation of a fault.",
                  "examples": [
                    "Tell me why you were late – and I don't want to hear any excuses!",
                    "I had to make an excuse for being late to the meeting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A defense to a criminal or civil charge wherein the accused party admits to doing acts for which legal consequences would normally be appropriate, but asserts that special circumstances relieve that party of culpability for having done those acts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often with preceding negative adjective, especially sorry, poor, or lame) An example of something that is substandard or of inferior quality.",
                  "examples": [
                    "That thing is a poor excuse for a gingerbread man. Hasn't anyone taught you how to bake?",
                    "He's a sorry excuse for a doctor."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "excuse (third-person singular simple present excuses, present participle excusing, simple past and past participle excused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To forgive; to pardon.",
                  "examples": [
                    "I excused him his transgressions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow to leave, or release from any obligation.",
                  "examples": [
                    "May I be excused from the table?",
                    "I excused myself from the proceedings to think over what I'd heard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide an excuse for; to explain, with the aim of alleviating guilt or negative judgement.",
                  "examples": [
                    "You know he shouldn't have done it, so don't try to excuse his behavior!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To relieve of an imputation by apology or defense; to make apology for as not seriously evil; to ask pardon or indulgence for.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}