{
  "word": "stale",
  "etymologies": [
    {
      "description": [
        "From Middle English stale, of uncertain etymology, but probably originally from Proto-Germanic *stāną (“to stand”): compare West Flemish stel in the same sense for ‘beer’ and ‘urine’."
      ],
      "adjectives": [
        {
          "description": "stale (comparative staler, superlative stalest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alcoholic beverages, obsolete) Clear, free of dregs and lees; old and strong.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "No longer fresh, in reference to food, urine, straw, wounds, etc.",
                  "examples": [
                    "Stale as breed or drinke is, rassis. Stale as meate is that begynneth to savoure, viel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "No longer fresh, new, or interesting, in reference to ideas and immaterial things; cliche, hackneyed, dated.",
                  "examples": [
                    "Better is...be it new or stale, A harmelesse lie, than a harmefull true tale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) No longer nubile or suitable for marriage, in reference to people; past one's prime.",
                  "examples": [
                    "Rosimunda...hathe an vncle a stale batcheler."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in general) Not new or recent; having been in place or in effect for some time.",
                  "examples": [
                    "In most states, you can be ticketed for failing to clear the intersection, even if you are hemmed in by traffic. One good clue to a stale green light is the pedestrian signal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture, obsolete) Fallow, in reference to land.",
                  "examples": [
                    "Lime would do very little or no good on stale ploughed lands."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Unreasonably long in coming, in reference to claims and actions.",
                  "examples": [
                    "a stale affidavit",
                    "a stale demand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Worn out, particularly due to age or over-exertion, in reference to athletes and animals in competition.",
                  "examples": [
                    "By this means the [horse's] legs are not made more stale than necessary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) Out of date, unpaid for an unreasonable amount of time, particularly in reference to checks.",
                  "examples": [
                    "Stale cheque,...a cheque which has remained unpaid for some considerable time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Of data: out of date; not synchronized with the newest copy.",
                  "examples": [
                    "The bug was found to be caused by stale data in the cache."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "stale (plural stales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Something stale; a loaf of bread or the like that is no longer fresh.",
                  "examples": [
                    "I went to Riggs's batty-cake shop, and asked 'em for a penneth of the cheapest and nicest stales, that were all but blue-mouldy, but not quite."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stale (third-person singular simple present stales, present participle staling, simple past and past participle staled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of alcohol, obsolete, transitive) To make stale; to age in order to clear and strengthen (a drink, especially beer).",
                  "examples": [
                    "Stalyn, or make stale drynke, defeco."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make stale; to cause to go out of fashion or currency; to diminish the novelty or interest of, particularly by excessive exposure or consumption.",
                  "examples": [
                    "Ile goe tell all the Argument of his Play aforehand, and so stale his Inuention to the Auditory before it come foorth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become stale; to grow odious from excessive exposure or consumption.",
                  "examples": [
                    "They have got so much of Christ as to be staled of his company."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alcoholic beverages, intransitive) To become stale; to grow unpleasant from age.",
                  "examples": [
                    "The Drink from that Time flattens and stales."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stale, from Old English stalu, from Proto-Germanic *stal-; compare English stell from this root. The development was paralleled by the ablaut which became English steal, from Middle English stele, from Old English stela, from Proto-Germanic *stel-. Both are from the same Proto-Indo-European root *stel-, *stol- (“to place, establish”), whence also Ancient Greek στελεός (steleós, “handle”). See also English stele."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stale (plural stales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, thin handle (of rakes, axes, etc.)",
                  "examples": [
                    "In Case your Cask is a Butt,...have ready boiling...Water, which put in, and, with a long Stale and a little Birch fastened to its End, scrub the Bottom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) One of the posts or uprights of a ladder.",
                  "examples": [
                    "Stales, the staves, or risings of a ladder, or the staves of a rack in a stable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the rungs on a ladder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, obsolete) The stem of a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The shaft of an arrow, spear, etc.",
                  "examples": [
                    "The Surgians cut of the stale of that shaft in suche wise, that they moued not the heade that was wythin the fleshe."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stale (third-person singular simple present stales, present participle staling, simple past and past participle staled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To make a ladder by joining rungs (\"stales\") between the posts.",
                  "examples": [
                    "For stalyng of the ladders of the Churche xx d."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stale, from Old French estal (“place, something placed”) (compare French étal), from Frankish stal, from Proto-Germanic *stallaz, earlier *staþlaz. Related to stall and stand."
      ],
      "adjectives": [
        {
          "description": "stale (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, obsolete) At a standstill; stalemated.",
                  "examples": [
                    "Then drawith he & is stale."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "stale (plural stales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, obsolete) A fixed position, particularly a soldier's in a battle-line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, uncommon) A stalemate; a stalemated game.",
                  "examples": [
                    "They stand at a stay; Like a Stale at Chesse, where it is no Mate, but yet the Game cannot stirre."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, obsolete) An ambush.",
                  "examples": [
                    "It is a stelling place and sovir harbry, Quhar ost in staill or embuschment may ly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A band of armed men or hunters.",
                  "examples": [
                    "The staill past throw the wod with sic noyis...yat all the bestis wer rasit fra thair dennys."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, military, obsolete) The main force of an army.",
                  "examples": [
                    "Neveryeles I knaw asweill by Englisemen as Scottishmen that their stale was no les then thre thowsand men."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stale (third-person singular simple present stales, present participle staling, simple past and past participle staled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, uncommon, transitive) To stalemate.",
                  "examples": [
                    "He shall stale þe black kyng in the pointe þer the crosse standith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, obsolete, intransitive) To be stalemated.",
                  "examples": [
                    "For vnder cuire I got sik check, that I micht neither muife nor neck, bot ather stale or mait."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Noun from Middle English stale, from Anglo-Norman estal (“urine”), from Middle Dutch stal (“urine”). Cognate with Middle Low German stal (“horse urine; bowel movement”). Verb from Middle English stalen, from Old French estaler (“urinate”), related to Middle High German stallen (“to piss”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stale (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(livestock, obsolete) Urine, especially used of horses and cattle.",
                  "examples": [
                    "[…] That they be not compelled to eate their owne donge, and drinke their owne stale with you?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stale (third-person singular simple present stales, present participle staling, simple past and past participle staled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(livestock, obsolete, intransitive) To urinate, especially used of horses and cattle.",
                  "examples": [
                    "Gif ony stal in the yet of the gilde...he sall gif iiijd. to the mendis."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stale (“bird used as a decoy”), probably from uncommon Anglo-Norman estale (“pigeon used to lure hawks”), ultimately from Proto-Germanic, probably *standaną (“to stand”). Compare Old English stælhran (“decoy reindeer”) and Northumbrian stællo (“catching fish”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stale (plural stales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry, hunting, obsolete) A live bird to lure birds of prey or others of its kind into a trap.",
                  "examples": [
                    "Like vnto the fowlers, that by their stales draw other birdes into their nets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any lure, particularly in reference to people used as live bait.",
                  "examples": [
                    "She ran in all the hastVnbrased and vnlast...It was a stale to takethe deuyll in a brake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(crime, obsolete) An accomplice of a thief or criminal acting as bait.",
                  "examples": [
                    "Their mynisters, be false bretherne or false sustern, stales of the deuyll."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) a partner whose beloved abandons or torments him in favor of another.",
                  "examples": [
                    "I perceiue Lucilla (sayd he) that I was made thy stale, and Philautus thy laughinge stocke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A patsy, a pawn, someone used under some false pretext to forward another's (usu. sinister) designs; a stalking horse.",
                  "examples": [
                    "That of the two nominated, one should be an unfit Man, and as it were a Stale, to bring the Office to the other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(crime, obsolete) A prostitute of the lowest sort; any wanton woman.",
                  "examples": [
                    "But to be leaft for such a one as she, The stale of all, what will folke thinke of me?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting, obsolete) Any decoy, either stuffed or manufactured.",
                  "examples": [
                    "'Tis the living bird that makes the best stale to draw others into the net."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stale (third-person singular simple present stales, present participle staling, simple past and past participle staled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, obsolete, transitive) To serve as a decoy, to lure.",
                  "examples": [
                    "The eye...Doth serue to stale her here and there where she doth come and go."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}