{
  "word": "palimpsest",
  "etymologies": [
    {
      "description": [
        "From Latin palimpsēstus, from Ancient Greek παλίμψηστος (palímpsēstos, “scraped again”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "palimpsest (plural palimpsests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A manuscript or document that has been erased or scraped clean, for reuse of the paper, parchment, vellum, or other medium on which it was written.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Monumental brasses that have been reused by engraving of the blank back side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) Circular features believed to be lunar craters that have been obliterated by later volcanic activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) Geological features thought to be related to features or effects below the surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Memory that has been erased and re-written.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cultural studies) The partial erasure of or superimposition on an older society or culture by a newer one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something bearing the traces of an earlier, erased form.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "palimpsest (third-person singular simple present palimpsests, present participle palimpsesting, simple past and past participle palimpsested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To scrape clean, as in parchment, for reuse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "On paper: to reuse, often by erasure or change of pen direction or color. Especially fueled by Earth Day.",
                  "examples": [
                    "Typically refers to a multi-layered work, e.g.: new ads covering old on a roadside sign."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}