{
  "word": "jig",
  "etymologies": [
    {
      "description": [
        "Unknown. Derivation from Middle English gyge (“fiddle”), from Old French gigue (“a fiddle”) has been proposed, but the connection and sense development are obscure. The sense “a type of dance” of modern French gigue is borrowed from English."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jig (plural jigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A light, brisk musical movement; a gigue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(traditional Irish music and dance) A lively dance in 6/8 (double jig), 9/8 (slip jig) or 12/8 (single jig) time; a tune suitable for such a dance. By extension, a lively traditional tune in any of these time signatures. Unqualified, the term is usually taken to refer to a double (6/8) jig.",
                  "examples": [
                    "They danced a jig."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(traditional English Morris dancing) A dance performed by one or sometimes two individual dancers, as opposed to a dance performed by a set or team.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A type of lure consisting of a hook molded into a weight, usually with a bright or colorful body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device in manufacturing, woodworking, or other creative endeavors for controlling the location, path of movement, or both of either a workpiece or the tool that is operating upon it. Subsets of this general class include machining jigs, woodworking jigs, welders' jigs, jewelers' jigs, and many others.",
                  "examples": [
                    "Cutting circles out of pinewood is best done with a compass-style jig."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) An apparatus or machine for jigging ore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A light, humorous piece of writing, especially in rhyme; a farce in verse; a ballad.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A trick; a prank.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jig (third-person singular simple present jigs, present participle jigging, simple past and past participle jigged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move briskly, especially as a dance.",
                  "examples": [
                    "The guests were jigging around on the dance floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move with a skip or rhythm; to move with vibrations or jerks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) To fish with a jig.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sing to the tune of a jig.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To trick or cheat; to cajole; to delude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) To sort or separate, as ore in a jigger or sieve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut or form, as a piece of metal, in a jigging machine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably a clipping of jigaboo, of uncertain origin, perhaps an African/Bantu word. Alternatively, jigaboo may be derived from jig (“dance”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jig (plural jigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, offensive, slang, dated, ethnic slur) A black person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}