{
  "word": "justiciary",
  "etymologies": [
    {
      "description": [
        "From Late Latin justitiaria, justiciaria (“judgeship, judiciarship; court sessions”), justitiarius, and justiciarius (“justiciar, judge, justice [of the peace]; judiciary, related to justice”), all from Latin iūstitia (“justice”) + -āria (“-ary”). Paralleled in Middle English and Early Modern English by forms from Anglo-Norman justiserie (“judgeship, judiciarship”), from Anglo-Norman and Middle French justicerie (“judgeship; tribunal”), from justice + -ery. As a translation of various Continental European offices, via Middle French justicier, Spanish justiciero, etc."
      ],
      "adjectives": [
        {
          "description": "justiciary (comparative more justiciary, superlative most justiciary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christian, theology, obsolete) Of or relating to justification or redemption before God.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christian, theology, obsolete) Of or relating to the doctrine (or heresy) that adherence to religious law redeems mankind before God.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Judicial: of or relating to the administration of justice, judges, or judgeships.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to the High Court of Justiciary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to a circuit court held by one of the judges of the High Court of Justiciary.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "justiciary (plural justiciaries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, countable, chiefly historical) A judgeship: a judge's jurisdiction, power, or office.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally Scotland, uncountable) The judiciary: a collective term for the court system or the body of judges, justices etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(historical) One who administers justice, particularly:",
              "entries": [
                {
                  "meaning": "(historical) A judge or justice.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A magistrate.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A Chief Justiciar: the highest political and judicial officer of the Kingdom of England in the 12th and 13th centuries.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A justiciar: a high-ranking judicial officer of medieval England or Scotland.",
                  "examples": []
                },
                {
                  "meaning": "(historical) Various equivalent medieval offices elsewhere in Europe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christian, theology) A believer in the doctrine (or heresy) that adherence to religious law redeems mankind before God.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}