{
  "word": "cup",
  "etymologies": [
    {
      "description": [
        "From Middle English cuppe, coppe, from the merger of Old English cuppe (“cup”) and Old English copp (“cup, vessel”).",
        "Old English cuppe is a borrowing from Late Latin cuppa, itself of obscure origin, but probably from earlier Latin cūpa (“tub, cask”), from Proto-Indo-European *kewp- (“a hollow”). Old English copp, however, is from Proto-West Germanic *kopp (“round object, bowl, vessel, knoll, summit, crown of the head”), from Proto-Germanic *kuppaz, from Proto-Indo-European *gew- (“to bend, curve, arch”) (whence also obsolete English cop (“top, summit, crown of the head”), German Kopf (“top, head”)).",
        "The Middle English word was further reinforced by Anglo-Norman cupe and Old French cope, coupe, from Latin cuppa. Compare also Saterland Frisian Kop (“cup”), West Frisian kop (“cup”), Dutch kop (“cup”), German Low German Koppke, Köppke (“cup”), Danish kop (“cup”), Swedish kopp (“cup”). Doublet of coupe and keeve."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cup (plural cups)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A concave vessel for drinking from, usually made of opaque material (as opposed to a glass) and with a handle.",
                  "examples": [
                    "Coordinate terms: mug, pannikin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The contents of said vessel.",
                  "examples": [
                    "Synonym: cupful",
                    "I drank two cups of water but still felt thirsty."
                  ]
                }
              ]
            },
            {
              "group": "A customary unit of measure",
              "entries": [
                {
                  "meaning": "(US) A US unit of liquid measure equal to 8 fluid ounces (1⁄16 of a US gallon; 236.5882365 mL) or 240 mL.",
                  "examples": []
                },
                {
                  "meaning": "(Canada) A Canadian unit of measure equal to 8 imperial ounces (1⁄20 imperial gallon; 227.3 mL) or 250 mL.",
                  "examples": []
                },
                {
                  "meaning": "(UK, dated) A British unit of measure equal to 1⁄2 imperial pint (10 imperial ounces; 284 mL) or 300 mL.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trophy in the shape of an oversized cup.",
                  "examples": [
                    "The World Cup is awarded to the winner of a quadrennial football tournament."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contest for which a cup is awarded.",
                  "examples": [
                    "The World Cup is the world's most widely watched sporting event."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) The main knockout tournament in a country, organised alongside the league.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A cup-shaped object placed in the target hole.",
                  "examples": [
                    "The ball just misses the cup."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in combination) Any of various sweetened alcoholic drinks.",
                  "examples": [
                    "cider cup",
                    "gin cup",
                    "claret cup"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada) A rigid concave protective covering for the male genitalia.",
                  "examples": [
                    "Synonym: (UK) box",
                    "Players of contact sports are advised to wear a cup."
                  ]
                }
              ]
            },
            {
              "group": "One of the two parts of a brassiere which each cover a breast.",
              "entries": [
                {
                  "meaning": "Prefixed with a letter, used as a measurement of bra or breast size.",
                  "examples": [
                    "\"For cleavage to show up in these photos, a girl has to have C-cup breasts — at least that's what they told me once.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The symbol \n  \n    \n      \n        ∪\n      \n    \n    {\\displaystyle \\cup }\n  \n denoting union and similar operations.",
                  "examples": [
                    "Coordinate term: cap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tarot) A suit of the minor arcana in tarot, or one of the cards from the suit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ultimate frisbee) A defensive style characterized by a three player near defense cupping the thrower; or those three players.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flexible concave membrane used to temporarily attach a handle or hook to a flat surface by means of suction.",
                  "examples": [
                    "Synonym: suction cup"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything shaped like a cup.",
                  "examples": [
                    "the cup of an acorn"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, historical) A cupping glass or other vessel or instrument used to produce the vacuum in cupping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) That which is to be received or indured; that which is allotted to one; a portion of blessings and afflictions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cup (third-person singular simple present cups, present participle cupping, simple past and past participle cupped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form into the shape of a cup, particularly of the hands.",
                  "examples": [
                    "Cup your hands and I'll pour some rice into them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hold something in cupped hands.",
                  "examples": [
                    "He cupped the ball carefully in his hands."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pour (a liquid, drink, etc.) into a cup.",
                  "examples": [
                    "We are cupping some new brands of coffee today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To supply with cups of wine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, surgery, archaic) To apply a cupping apparatus to; to subject to the operation of cupping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, engineering) To make concave or in the form of a cup.",
                  "examples": [
                    "to cup the end of a screw"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}