{
  "word": "snell",
  "etymologies": [
    {
      "description": [
        "From Middle English snell (“quick, fast”) from Old English snel, snell (“lively, quick”) from Proto-West Germanic *snell, from Proto-Germanic *snellaz (“active, swift, brisk”). Akin to Old Saxon snel, snell (“active, strenuous”), Dutch snel, Old High German snel (whence German schnell (“quick, swift”), Yiddish שנעל‎ (shnel, “quick, swift”), Italian snello (“quick, nimble”), Old French esnel, isnel (“snell”), and Occitan isnel, irnel (“snell”)), Old Norse snjallr (“skilful, excellent”) (whence Danish snild (“clever”))."
      ],
      "adjectives": [
        {
          "description": "snell (comparative sneller, superlative snellest) (now chiefly Scotland)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Quick, smart; sharp, active, brisk or nimble; lively.",
                  "examples": [
                    "That in ilk action, wise and snell / You may shaw Manly fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Quick-witted; clever.",
                  "examples": [
                    "With all this heavy artillery, somewhat slow and cumbrous, on great questions, he had no want, when he was speaking off-hand, of quick, snell remark, often witty and full of spirit, and often too unexpected, like lightning—flashing, smiting, and gone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Harsh, severe, or stinging.",
                  "examples": [
                    "Conscience is a rough lad, I grant you, and I am keen and snell also; but never mind, take his advice, and you’ll be some credit to your freens yet, ye scoonrel."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "snell (comparative more snell, superlative most snell)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of snelly",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unknown"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "snell (plural snells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short line of horsehair, gut, monofilament, etc., by which a fishhook or lure is attached to a longer (and usually heavier) line.",
                  "examples": [
                    "He tied on new baited snells and recovered the current with the oars."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "snell (third-person singular simple present snells, present participle snelling, simple past and past participle snelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To tie a hook to the end of a fishing line with a snell knot.",
                  "examples": [
                    "Can you show me how to snell a hook?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}