{
  "word": "alarm",
  "etymologies": [
    {
      "description": [
        "From Middle English alarme, alarom, borrowed from Middle French alarme, itself from Old Italian all'arme! (“to arms!, to the weapons!”), ultimately from Latin arma (“arms, weapons”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "alarm (countable and uncountable, plural alarms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A summons to arms, as on the approach of an enemy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any sound or information intended to give notice of approaching danger; a warning sound to arouse attention; a warning of danger.",
                  "examples": [
                    "Sound an alarm in my holy mountain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden attack; disturbance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sudden surprise with fear or terror excited by apprehension of danger; in the military use, commonly, sudden apprehension of being attacked by surprise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanical device for awaking people, or rousing their attention.",
                  "examples": [
                    "The clock radio is a friendlier version of the cold alarm by the bedside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of an alarm ringing, beeping or clanging, to give a noise signal at a certain time.",
                  "examples": [
                    "You should set the alarm on your watch to go off at seven o'clock."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "alarm (third-person singular simple present alarms, present participle alarming, simple past and past participle alarmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To call to arms for defense",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give (someone) notice of approaching danger",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rouse to vigilance and action; to put on the alert.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surprise with apprehension of danger; to fill with anxiety in regard to threatening evil; to excite with sudden fear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep in excitement; to disturb.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}