{
  "word": "circle",
  "etymologies": [
    {
      "description": [
        "From Middle English circle, cercle, from Old French cercle and Latin circulus, diminutive of Latin circus (“circle, circus”), from Ancient Greek κίρκος (kírkos, “circle, ring”), related to Old English hring (“ring”). Compare also Old English ċircul (“circle, zodiac”), which came from the same Latin source."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "circle (plural circles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A two-dimensional geometric figure, a line, consisting of the set of all those points in a plane that are equally distant from a given point (center).",
                  "examples": [
                    "Synonyms: (not in mathematical use) coil, (not in mathematical use) ring, (not in mathematical use) loop",
                    "The set of all points (x, y) such that (x − 1)2&thinsp;+&thinsp;y2 = r2 is a circle of radius r around the point (1, 0)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A two-dimensional geometric figure, a disk, consisting of the set of all those points of a plane at a distance less than or equal to a fixed distance (radius) from a given point.",
                  "examples": [
                    "Synonyms: disc, (in mathematical and general use) disk, (not in mathematical use; UK & Commonwealth only) round"
                  ]
                }
              ]
            },
            {
              "group": "Any shape, curve or arrangement of objects that approximates to or resembles the geometric figures.",
              "entries": [
                {
                  "meaning": "Any thin three-dimensional equivalent of the geometric figures.",
                  "examples": [
                    "Cut a circle out of that sheet of metal."
                  ]
                },
                {
                  "meaning": "A curve that more or less forms part or all of a circle.",
                  "examples": [
                    "The crank moves in a circle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specific group of persons; especially one who shares a common interest.",
                  "examples": [
                    "Synonyms: bunch, gang, group",
                    "inner circle",
                    "circle of friends",
                    "literary circle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The orbit of an astronomical body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A line comprising two semicircles of 30 yards radius centred on the wickets joined by straight lines parallel to the pitch used to enforce field restrictions in a one-day match.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Wicca) A ritual circle that is cast three times deosil and closes three times widdershins either in the air with a wand or literally with stones or other items used for worship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(South Africa, Philippines, India) A traffic circle or roundabout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Compass; circuit; enclosure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) An instrument of observation, whose graduated limb consists of an entire circle. When fixed to a wall in an observatory, it is called a mural circle; when mounted with a telescope on an axis and in Y's, in the plane of the meridian, a meridian or transit circle; when involving the principle of reflection, like the sextant, a reflecting circle; and when that of repeating an angle several times continuously along the graduated limb, a repeating circle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A series ending where it begins, and repeating itself.",
                  "examples": [
                    "Thus in a circle runs the peasant's pain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) A form of argument in which two or more unproved statements are used to prove each other; inconclusive reasoning.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Indirect form of words; circumlocution.",
                  "examples": [
                    "Has he given the lie, / In circle, or oblique, or semicircle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A territorial division or district.",
                  "examples": [
                    "The ten Circles of the Holy Roman Empire were those principalities or provinces which had seats in the German Diet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A bagginess of the skin below the eyes from lack of sleep.",
                  "examples": [
                    "After working all night, she had circles under her eyes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "circle (third-person singular simple present circles, present participle circling, simple past and past participle circled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To travel around along a curved path.",
                  "examples": [
                    "The wolves circled the herd of deer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surround.",
                  "examples": [
                    "A high fence circles the enclosure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place or mark a circle around.",
                  "examples": [
                    "Circle the jobs that you are interested in applying for."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel in circles.",
                  "examples": [
                    "Vultures circled overhead."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}