{
  "word": "shame",
  "etymologies": [
    {
      "description": [
        "From Middle English schame, from Old English sċamu, from Proto-Germanic *skamō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shame (usually uncountable, plural shames)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Uncomfortable or painful feeling due to recognition or consciousness of one's own impropriety or dishonor, or something being exposed that should have been kept private.",
                  "examples": [
                    "When I realized that I had hurt my friend, I felt deep shame.",
                    "The teenager couldn’t bear the shame of introducing his parents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something to regret.",
                  "examples": [
                    "It was a shame not to see the show after driving all that way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Reproach incurred or suffered; dishonour; ignominy; derision.",
                  "examples": [
                    "[…]  because ye haue borne the shame of the heathen,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cause or reason of shame; that which brings reproach and ignominy.",
                  "examples": [
                    "Rimmer ducked his body low into his chair, so just his head remained above the table top, and peered past the backs of the examinees in front of him, waiting for the adjudicator to make his move. Waiting for him to leap forward and rip off his flimsy flightsuit, exposing his shame: his illustrated body, Rimmer's cheating frame."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is shameful and private, especially private parts.",
                  "examples": [
                    "She turns to lift her robe, and lays it across her as though she were revealing her shame, as though she were naked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The capacity to be ashamed, inhibiting one from brazen behaviour; due regard for one's own moral conduct and how one is perceived by others; restraint, moderation, decency.",
                  "examples": [
                    "Don't you have any shame?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English schamen, from Old English sċamian, from Proto-West Germanic *skamēn, from Proto-Germanic *skamāną."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "shame (third-person singular simple present shames, present participle shaming, simple past and past participle shamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to feel shame.",
                  "examples": [
                    "I was shamed by the teacher's public disapproval."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with reproach or ignominy; to denounce as having done something shameful; to dishonor; to disgrace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive or compel by shame.",
                  "examples": [
                    "The politician was shamed into resigning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To feel shame, be ashamed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To mock at; to deride.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}