{
  "word": "fetial",
  "etymologies": [
    {
      "description": [
        "From Latin fētiālis (“priest who sanctioned treaties and demanded satisfaction from enemies before formal declarations of war”).",
        "The root of the Latin word is thought to be Proto-Indo-European *dʰeh₁- (“to do, place, put”), also the source of the verb Latin faciō (“to do; to build, construct; to appoint”). The nominalized form of this verb, Proto-Indo-European *dʰéh₁tis (“act of putting, placement”), would have developed into an Italic noun *fētis (unattested, but conjectured to mean something like \"statute, treaty\" or \"prescription, law\", developing to mean \"body of priests\"), which was combined with the adjective-forming suffix -ālis to yield Latin fētiālis.",
        "The unadapted Latin forms fetialis (singular) and fetiales (plural) are also used in English, sometimes with italicization, sometimes without."
      ],
      "adjectives": [
        {
          "description": "fetial (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to a fetial (member of the Roman college of priests who acted as representatives in disputes with foreign nations); (by extension) ambassadorial, heraldic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Concerned with declarations of war and treaties of peace.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "fetial (plural fetials)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Rome, politics, religion, historical) A member of the Roman college of priests who acted as representatives in disputes with foreign nations.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}