{
  "word": "prebendary",
  "etymologies": [
    {
      "description": [
        "From Medieval Latin praebendārius, from Late Latin praebenda (“literally ‘things to be supplied’; prebend”), neuter plural of gerundive of praebeō (“supply”), from prae- (“pre-”) + habeō (“have, hold”)."
      ],
      "adjectives": [
        {
          "description": "prebendary (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to the office or person of a prebendary; prebendal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to official positions that are profitable for the incumbent, to the allocation of such positions, or to a system in which such allocation is prevalent.",
                  "examples": [
                    "In the contemporary world prebendary income for officials can be found in all third world countries where public revenues are inadequate to cover salaries at a sufficiently high level to enable bureaucrats to sustain what they regard as a proper standard of living.  […]  However, in societies where traditional bureaucratic practices are well remembered, and where a “formalistic” dichotomy between what is officially prescribed and what is actually practiced prevails, it is scarcely surprising if the real (prebendary) income of many, if not most public officials,  should far exceed their formally prescribed salary levels."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "prebendary (plural prebendaries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An honorary canon of a cathedral or collegiate church.",
                  "examples": [
                    "Among the prebendaries have been men eminent for their learning and piety: as Lancelot Andrews, bishop of Winchester, Dr. Sherlock, Archdeacon Paley, and the Rev. William Beloe, B.D. well known by his translation of Herodotus."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}