{
  "word": "sequester",
  "etymologies": [
    {
      "description": [
        "From Middle English sequestren (verb) and sequestre (noun), from Old French sequestrer , from Late Latin sequestrō (“separate, give up for safekeeping”), from Latin sequester (“mediator, depositary”), probably originally meaning \"follower\", from Proto-Indo-European *sekʷ- (“follow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sequester (plural sequesters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "sequestration; separation",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A person with whom two or more contending parties deposit the subject matter of the controversy; one who mediates between two parties; a referee",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A sequestrum.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sequester (third-person singular simple present sequesters, present participle sequestering, simple past and past participle sequestered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To separate from all external influence; to seclude; to withdraw.",
                  "examples": [
                    "The jury was sequestered from the press by the judge's order."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To separate in order to store.",
                  "examples": [
                    "The coal burning plant was ordered to sequester its CO2 emissions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To set apart; to put aside; to remove; to separate from other things.",
                  "examples": [
                    "Synonyms: see Thesaurus:set apart"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) To prevent an ion in solution from behaving normally by forming a coordination compound",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To temporarily remove (property) from the possession of its owner and hold it as security against legal claims.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause (one) to submit to the process of sequestration; to deprive (one) of one's estate, property, etc.",
                  "examples": [
                    "It was his tailor and his cook, his fine fashions and his French ragouts, which sequestered him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, politics, law) To remove (certain funds) automatically from a budget.",
                  "examples": [
                    "The Budget Control Act of 2011 sequestered 1.2 trillion dollars over 10 years on January 2, 2013."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(international law) To seize and hold enemy property.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To withdraw; to retire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To renounce (as a widow may) any concern with the estate of her husband.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}