{
  "word": "milky",
  "etymologies": [
    {
      "description": [
        "From Middle English mylky, melky, equivalent to milk +‎ -y. Cognate with German milchig (“milky”), Swedish mjölkig (“milky”). Doublet of milchig."
      ],
      "adjectives": [
        {
          "description": "milky (comparative milkier, superlative milkiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Resembling milk in color, consistency, smell, etc.; consisting of milk.",
                  "examples": [
                    "[…]  some Plants upon breaking their Vessels yield a milky Juice; others a Yellow of peculiar Tastes and Qualities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(color science, informal) Of the black in an image, appearing as dark gray rather than black.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a drink) Containing (an especially large amount of) milk.",
                  "examples": [
                    "milky tea; milky cocoa"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of grains) Containing a whitish liquid, juicy.",
                  "examples": [
                    "Shot up from broad rank blades that droop below,",
                    "The nodding WHEAT-EAR forms a graceful bow,",
                    "With milky kernels starting full, weigh’d down,",
                    "Ere yet the sun hath ting’d its head with brown;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Cowardly.",
                  "examples": [
                    "‘Who said there was going to be any killing?’ The lightning flared up and showed his tight shabby jacket, the bunch of soft hair at the nape. ‘I’ve got a date, that’s all. You be careful what you say, Spicer. You aren’t milky, are you?’",
                    "‘I’m not milky. You got me wrong, Pinkie. I just don’t want another killing  […] ’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Immature, childish.",
                  "examples": [
                    "Gone is your fighting Youth, whom you have bred",
                    "From milkie Childhood to the years of bloud!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Producing milk, lactating.",
                  "examples": [
                    "[…]  ye heare the Lamb by many a bleat",
                    "Woo’d to come suck the milkie Teat:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}