{
  "word": "geography",
  "etymologies": [
    {
      "description": [
        "From Middle French géographie, from Latin geōgraphia, from Ancient Greek γεωγραφία (geōgraphía, “a description of the earth”), from γῆ (gê, “earth”) + γράφω (gráphō, “write”).",
        "Use in reference to lavatories derives from the mid-20th century euphemism \"show one the geography of the house\" in reference to pointing out the toilets."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "geography (countable and uncountable, plural geographies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A description of the earth: a treatise or textbook on geography",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) an atlas or gazetteer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The study of the physical properties of the earth, including how humans affect and are affected by them.",
                  "examples": [
                    "Synonyms: see Thesaurus:geography"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Terrain: the physical properties of a region of the earth.",
                  "examples": [
                    "The geography of the Andes approaches never made transportation easy; routes to Bogota, Quito, La Paz, and Cuzco were so precipitous as to slow down the development of those Spanish cities in the interior."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any subject considered in terms of its physical distribution.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) Similar books, studies, or regions concerning other planets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The physical arrangement of any place, particularly (UK, slang) a house.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly upper-class UK, euphemistic) The lavatory: a room used for urination and defecation.",
                  "examples": [
                    "The Business Man Jocular: ‘I say, where's the geography, old son?’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The relative arrangement of the parts of anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly business and marketing) A territory: a geographical area as a field of business or market sector.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}