{
  "word": "dog",
  "etymologies": [
    {
      "description": [
        "From Middle English dogge (whence also Scots dug (“dog”)), from Old English dogga, docga, of uncertain origin.",
        "The original meaning seems to have been a common dog, as opposed to a well-bred one, or something like 'cur', and perhaps later came to be used for stocky dogs. Possibly a pet-form diminutive with suffix -ga (compare frocga (“frog”), *picga (“pig”)), appended to a base *dog-, *doc- of unclear origin and meaning. One possibility is Old English dox (“dark, swarthy”) (compare frocga from frox). Another proposal is that it derives from Proto-West Germanic *dugan (“to be suitable”), the origin of Old English dugan (“to be good, worthy, useful”), English dow, German taugen. The theory goes that it could have been an epithet for dogs, commonly used by children, meaning \"good/useful animal.\". Another is that it is related to *docce (“stock, muscle”), from Proto-West Germanic *dokkā (“round mass, ball, muscle, doll”), whence English dock (“stumpy tail”).",
        "In 14th-century England, hound (from Old English hund) was the general word for all domestic canines, and dog referred to a subtype resembling the modern mastiff and bulldog. By the 16th century, dog had become the general word, and hound had begun to refer only to breeds used for hunting. In the 16th century, the word dog was adopted by several continental European languages as their word for mastiff."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dog (plural dogs)",
          "definitionGroups": [
            {
              "group": "A mammal of the family Canidae:",
              "entries": [
                {
                  "meaning": "The species Canis familiaris (sometimes designated Canis lupus familiaris), domesticated for thousands of years and of highly variable appearance because of human breeding.",
                  "examples": [
                    "The dog barked all night long."
                  ]
                },
                {
                  "meaning": "Any member of the family Canidae, including domestic dogs, wolves, coyotes, jackals, foxes, and their relatives (extant and extinct); canid.",
                  "examples": []
                },
                {
                  "meaning": "(often attributive) A male dog, wolf, or fox, as opposed to a bitch or vixen.",
                  "examples": [
                    "Firstly, he was there to encourage and assist the hounds (a scratch pack – mostly dog-hounds drafted from fox-hound kennels because they were over-sized)  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The meat of this animal, eaten as food:",
                  "examples": [
                    "Did you know that they eat dog in South Korea?"
                  ]
                }
              ]
            },
            {
              "group": "A person:",
              "entries": [
                {
                  "meaning": "(slang, derogatory) A dull, unattractive girl or woman.",
                  "examples": [
                    "She’s a real dog."
                  ]
                },
                {
                  "meaning": "(slang) A man, guy, chap.",
                  "examples": [
                    "You lucky dog!"
                  ]
                },
                {
                  "meaning": "(derogatory) Someone who is cowardly, worthless, or morally reprehensible.",
                  "examples": [
                    "Come back and fight, you dogs!",
                    "You dirty dog."
                  ]
                },
                {
                  "meaning": "(slang) A sexually aggressive man.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A mechanical device or support:",
              "entries": [
                {
                  "meaning": "Any of various mechanical devices for holding, gripping, or fastening something, particularly with a tooth-like projection.",
                  "examples": []
                },
                {
                  "meaning": "A click or pallet adapted to engage the teeth of a ratchet wheel, to restrain the back action.",
                  "examples": [
                    "Synonyms: click, pallet, pawl, ratchet"
                  ]
                },
                {
                  "meaning": "A metal support for logs in a fireplace.",
                  "examples": [
                    "The dogs were too hot to touch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) The eighteenth Lenormand card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hot dog: a frankfurter, wiener, or similar sausage; or a sandwich made from this.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) Underdog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, almost always in the plural) Foot.",
                  "examples": [
                    "My dogs are barking! ― My feet hurt!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cockney rhyming slang) (from \"dog and bone\") Phone or mobile phone.",
                  "examples": [
                    "My dog is dead.My mobile-phone battery has run out of charge and is no longer able to function."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the cones used to divide up a racetrack when training horses.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(informal) Something that performs poorly.",
              "entries": [
                {
                  "meaning": "(film) A flop; a film that performs poorly at the box office.",
                  "examples": [
                    "Blue was released, and as Redford had predicted, it was a dog."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dog (third-person singular simple present dogs, present participle dogging, simple past and past participle dogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pursue with the intent to catch.",
                  "examples": [
                    "Synonyms: chase, chase after, go after, pursue, tag, tail, track, trail"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To follow in an annoying or harassing way.",
                  "examples": [
                    "The woman cursed him so that trouble would dog his every step."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To fasten a hatch securely.",
                  "examples": [
                    "It is very important to dog down these hatches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, emerging usage in Britain) To watch, or participate, in sexual activity in a public place.",
                  "examples": [
                    "I admit that I like to dog at my local country park."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To intentionally restrict one's productivity as employee; to work at the slowest rate that goes unpunished.",
                  "examples": [
                    "Synonyms: soldier, goldbrick",
                    "A surprise inspection of the night shift found that some workers were dogging it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To criticize.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To divide (a watch) with a comrade.",
                  "examples": [
                    "A. We never stood 4 to 8 p.m. watches, sir. We dogged our watches.Q. I suppose that is 6 to 8 p.m., then; it is a little indistinct. I mean the second dog watch."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of dogshit."
      ],
      "adjectives": [
        {
          "description": "dog (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Of inferior quality; dogshit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}