{
  "word": "sympathetic",
  "etymologies": [
    {
      "description": [
        "Mid 17th century in the sense “relating to an affinity or paranormal influence”, from sympathy +‎ -etic (“pertaining to”), on the pattern of pathetic. Displaced native Old English efnþrōwiende."
      ],
      "adjectives": [
        {
          "description": "sympathetic (comparative more sympathetic, superlative most sympathetic)",
          "definitionGroups": [
            {
              "group": "Of, related to, feeling, showing, or characterized by sympathy.",
              "entries": [
                {
                  "meaning": "Showing approval of or favor towards an idea or action.",
                  "examples": [
                    "Synonym: approving"
                  ]
                }
              ]
            },
            {
              "group": "(of a person) Attracting the liking of others.",
              "entries": [
                {
                  "meaning": "(construction) Designed in a sensitive or appropriate way.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(relational) Relating to, producing, or denoting an effect which arises through an affinity, interdependence, or mutual association.",
              "entries": [
                {
                  "meaning": "(of magic) A supernatural connection or power resulting from two items having the same form or some other correspondence.",
                  "examples": []
                },
                {
                  "meaning": "(sound) Relating to musical tones produced by sympathetic vibration or to strings so tuned as to sound by sympathetic vibration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(neuroanatomy, neurology, relational) Relating to or denoting the part of the autonomic nervous system consisting of nerves arising from ganglia near the middle part of the spinal cord, supplying the internal organs, blood vessels, and glands, and balancing the action of the parasympathetic nerves.",
                  "examples": [
                    "Sympathetic innervation involves epinephrine.",
                    "Antonym: parasympathetic"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}