{
  "word": "fiddle",
  "etymologies": [
    {
      "description": [
        "From Middle English fithele, from Old English *fiþele, from Proto-West Germanic *fiþulā, from Proto-Germanic *fiþulǭ (“fiddle”), of uncertain etymology. Some contest that the Germanic terms are borrowed variations of Late Latin vitula (see viola); others contest that the word has a separate origin within Germanic languages, and still others believe that the Late Latin term for the stringed instrument is a borrowing from Germanic as a change of Latin t to Germanic þ is highly improbable, yet Germanic þ to Latin t is well documented (see troop, Teobaldo, etc.). Cognate with Old High German fidula (German Fiedel), Middle Dutch vedele (Dutch vedel, veel), Old Norse fiðla (Icelandic fiðla, Danish fiddel, Norwegian fela).",
        "The change from /ðl/ to /dl/ in modern English is regular; compare staddle, swaddle (in brothel, it was prevented; see that entry for discussion)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fiddle (plural fiddles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of violin, a small unfretted stringed instrument with four strings tuned (lowest to highest) G-D-A-E, usually held against the chin and played with a bow; the position of a violinist in a band; (usually proscribed) any of various bowed stringed instruments, particularly those of the violin family when played non-classically.",
                  "examples": [
                    "...Of harpe & of salteriun. of fiðele & of coriun..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Synonym of clown: an unserious person entertaining a group.",
                  "examples": [
                    "1693, John Locke, Some Thoughts Concerning Education, p. 208:",
                    "You would not have your Son the Fiddle to every jovial Company."
                  ]
                }
              ]
            },
            {
              "group": "(figurative) Unskillful or unartful behavior, particularly when showy and superficially pleasing.",
              "entries": [
                {
                  "meaning": "(chiefly US, dated slang) Synonym of scam, a fraud or swindle.",
                  "examples": [
                    "Says Bevin: 'I want peace... and we shan't get it unless we deal with one another as friends. I will be a party to no fiddles.'"
                  ]
                },
                {
                  "meaning": "(slang) Synonym of workaround, a quick and less than perfect solution for some flaw or problem.",
                  "examples": [
                    "That parameter setting is just a fiddle to make the lighting look right."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially nautical) Any rail or device that prevents items from sliding off a table, stove, etc. in rough water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK slang, obsolete) Synonym of arrest warrant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK slang, obsolete) Synonym of watchman's rattle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK slang, obsolete) A trifling amount.",
                  "examples": [
                    "Done at a fiddle."
                  ]
                }
              ]
            },
            {
              "group": "Something resembling a violin in shape, particularly:",
              "entries": [
                {
                  "meaning": "(biology) A dock (Rumex pulcher) with leaves supposed to resemble the musical instrument.",
                  "examples": []
                },
                {
                  "meaning": "A long pole pulled by a draft animal to drag loose straw, hay, etc.",
                  "examples": []
                },
                {
                  "meaning": "A rack for drying pottery after glazing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fiddle (third-person singular simple present fiddles, present participle fiddling, simple past and past participle fiddled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To play the fiddle or violin, particularly in a folk or country style.",
                  "examples": [
                    "to fiddle while Rome burns"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fidget or play; to idly amuse oneself, to act aimlessly, idly, or frivolously, particularly out of nervousness or restlessness.",
                  "examples": [
                    "Stop fiddling with your food. Either tell me what's wrong or just eat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To cheat or swindle; to commit fraud.",
                  "examples": [
                    "Fred was sacked when the auditors caught him fiddling the books."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Synonym of tinker, to make small adjustments or improvements.",
                  "examples": [
                    "Coordinate term: fettle",
                    "I needed to fiddle with these settings to get the image to look right."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}