{
  "word": "appropriate",
  "etymologies": [
    {
      "description": [
        "From Middle English appropriaten, borrowed from Latin appropriatus, past participle of approprio (“to make one's own”), from ad (“to”) + proprio (“to make one's own”), from proprius (“one's own, private”)."
      ],
      "adjectives": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "appropriate (comparative more appropriate, superlative most appropriate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Suitable or fit; proper.",
                  "examples": [
                    "The headmaster wondered what an appropriate measure would be to make the pupil behave better."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Suitable to the social situation or to social respect or social discreetness; socially correct; socially discreet; well-mannered; proper.",
                  "examples": [
                    "I don't think it was appropriate for the cashier to tell me out loud in front of all those people at the check-out that my hair-piece looked like it was falling out of place.",
                    "While it is not considered appropriate for a professor to date his student, there is no such concern once the semester has ended."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Set apart for a particular use or person; reserved.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "appropriate (third-person singular simple present appropriates, present participle appropriating, simple past and past participle appropriated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take to oneself; to claim or use, especially as by an exclusive right.",
                  "examples": [
                    "Let no man appropriate the use of a common benefit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set apart for, or assign to, a particular person or use, especially in exclusion of all others; with to or for.",
                  "examples": [
                    "A spot of ground is appropriated for a garden.",
                    "to appropriate money for the increase of the navy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain, ecclesiastical, law) To annex (for example a benefice, to a spiritual corporation, as its property).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To make suitable to; to suit.",
                  "examples": [
                    "Under the towers were a number of gloomy subterraneous apartments with vaulted roofs, the use of which imagination was left to guess, and could only appropriate to punishment and horror."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}