{
  "word": "coverage",
  "etymologies": [
    {
      "description": [
        "From Middle English coverage, equivalent to cover +‎ -age."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coverage (countable and uncountable, plural coverages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amount by which something or someone is covered.",
                  "examples": [
                    "Don't go to lunch if we don't have enough coverage for the help-desk phones.",
                    "Before laying sod on that clay, the ground needs two inches of coverage with topsoil.",
                    "The enemy fire is increasing – can we get some immediate coverage from those bunkers?",
                    "There are overlapping coverages on your insurance policies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount of space or time given to an event in newspapers or on television.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) The average number of reads representing a given nucleotide in the reconstructed sequence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The area covered by a mobile phone (cellphone) or other radio network.",
                  "examples": [
                    "The primary coverage area of a station is that area throughout which the station can be received without objectionable interference from static, electrical interfering noises, or interference from other radio broadcasting stations, practically all of the time the station is in operation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The signal strength, reception of a radio signal.",
                  "examples": [
                    "Mobile phone coverage is poor in some areas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Journalism: the attention given by the press or news media about some news; the total of stories published or broadcast about a topic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) Defense.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}