{
  "word": "class",
  "etymologies": [
    {
      "description": [
        "From Middle French classe, from Latin classis (“a class or division of the people, assembly of people, the whole body of citizens called to arms, the army, the fleet, later a class or division in general”), from Proto-Indo-European *kelh₁- (“to call, shout”). Doublet of clas and classis."
      ],
      "adjectives": [
        {
          "description": "class (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, Tyneside, slang) great; fabulous",
                  "examples": [
                    "To talented authors Tim Ash and Brian Reich for introducing me to John Wiley & Sons—a truly class outfit."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "class (countable and uncountable, plural classes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A group, collection, category or set sharing characteristics or attributes.",
                  "examples": [
                    "The new Ford Fiesta is set to be best in the 'small family' class.",
                    "That is one class-A heifer you got there, sonny.",
                    "Often used to imply membership of a large class.",
                    "This word has a whole class of metaphoric extensions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology, countable) A social grouping, based on job, wealth, etc. In Britain, society is commonly split into three main classes: upper class, middle class and working class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The division of society into classes.",
                  "examples": [
                    "Jane Austen's works deal with class in 18th-century England."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Admirable behavior; elegance.",
                  "examples": [
                    "Apologizing for losing your temper, even though you were badly provoked, showed real class."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education, countable and uncountable) A group of students in a regularly scheduled meeting with a teacher.",
                  "examples": [
                    "The class was noisy, but the teacher was able to get their attention with a story."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A series of lessons covering a single subject.",
                  "examples": [
                    "I took the cooking class for enjoyment, but I also learned a lot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A group of students who commenced or completed their education during a particular year. A school class.",
                  "examples": [
                    "The class of 1982 was particularly noteworthy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A category of seats in an airplane, train or other means of mass transportation.",
                  "examples": [
                    "I used to fly business class, but now my company can only afford economy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(taxonomy, countable) A rank in the classification of organisms, below phylum and above order; a taxon of that rank.",
                  "examples": [
                    "Magnolias belong to the class Magnoliopsida."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Best of its kind.",
                  "examples": [
                    "It is the class of Italian bottled waters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics) A grouping of data values in an interval, often used for computation of a frequency distribution.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(set theory) A collection of sets definable by a shared property.",
                  "examples": [
                    "The class of all sets is not a set.",
                    "Every set is a class, but classes are not generally sets. A class that is not a set is called a proper class."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A group of people subject to be conscripted in the same military draft, or more narrowly those persons actually conscripted in a particular draft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(object-oriented programming, countable) A set of objects having the same behavior (but typically differing in state), or a template defining such a set in terms of its common properties, functions, etc.",
                  "examples": [
                    "an abstract base class"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the sections into which a Methodist church or congregation is divided, supervised by a class leader.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "class (third-person singular simple present classes, present participle classing, simple past and past participle classed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assign to a class; to classify.",
                  "examples": [
                    "I would class this with most of the other mediocre works of the period."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be grouped or classed.",
                  "examples": [
                    "the genus or family under which it classes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To divide into classes, as students; to form into, or place in, a class or classes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}