{
  "word": "stow",
  "etymologies": [
    {
      "description": [
        "From Middle English stowe, from Old English stōw (“place, location”), from Proto-West Germanic *stōwu, from Proto-Germanic *stōwō (“a place, stowage”), from Proto-Indo-European *steh₂- (“to stand, place, put”). Cognate with Old Frisian stō (“place”), Icelandic stó (“fireplace”), Dutch stouw (“place”). See also -stow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stow (plural stows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A place, stead.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stowen, stawen, stewen, from Old English stōwian (“to hold back, restrain”), from Proto-Germanic *stōwōną, *stōwijaną (“to stow, dam up”), from Proto-Indo-European *steh₂- (“to stand, place”). Cognate with Dutch stuwen, stouwen (“to stow”), Low German stauen (“to blin, halt, hinder”), German stauen (“to halt, hem in, stow, pack”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "stow (third-person singular simple present stows, present participle stowing, simple past and past participle stowed) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put something away in a compact and tidy manner, in its proper place, or in a suitable place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To store or pack something in a space-saving manner and over a long time.",
                  "examples": [
                    "Yet everybody knows that a cargo properly stowed in a seaworthy craft reaches market in much the better condition than by rail, though perhaps it is some hours longer on the way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To arrange, pack, or fill something tightly or closely.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dispose of, lodge, or hide somebody somewhere.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang, transitive) To cease; to stop doing something.",
                  "examples": [
                    "But when I strove my flame to tell, / Says she, 'Come, stow that patter, / If you're a cove wot likes a gal, / Vy don't you stand some gatter?' / In course I instantly complied— / Two brimming quarts of porter, / With sev'ral goes of gin beside, / Drain'd Bet the Coaley's daughter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}