{
  "word": "standard",
  "etymologies": [
    {
      "description": [
        "From Middle English standard, from Old French estandart (“gathering place, battle flag”), from Frankish *standahard (literally “stand firm, stand hard”), equivalent to stand +‎ -ard. Alternative etymology derives the second element from Frankish *oʀd (“point, spot, place”) (compare Old French ordé (“pointed”), Old English ord (“point, source, vanguard”), German Standort (“location, place, site, position, base”, literally “standing-point”)). Merged with Middle English standar, stander, standere (“flag, banner”, literally “stander”), equivalent to stand +‎ -er. More at stand, hard, ord."
      ],
      "adjectives": [
        {
          "description": "standard (comparative more standard, superlative most standard)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Falling within an accepted range of size, amount, power, quality, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a tree or shrub) Growing alone as a free-standing plant; not trained on a post etc.",
                  "examples": [
                    "There are women who cannot grow alone as standard trees;—for whom the support and warmth of some wall, some paling, some post, is absolutely necessary […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having recognized excellence or authority.",
                  "examples": [
                    "standard works in history; standard authors"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a usable or serviceable grade or quality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, of a motor vehicle) Having a manual transmission.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "As normally supplied (not optional).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Conforming to the standard variety.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "standard (plural standards)",
          "definitionGroups": [
            {
              "group": "A principle or example or measure used for comparison.",
              "entries": [
                {
                  "meaning": "A level of quality or attainment.",
                  "examples": []
                },
                {
                  "meaning": "Something used as a measure for comparative evaluations; a model.",
                  "examples": [
                    "the court, which used to be the standard of propriety and correctness of speech"
                  ]
                },
                {
                  "meaning": "A musical work of established popularity.",
                  "examples": []
                },
                {
                  "meaning": "A rule or set of rules or requirements which are widely agreed upon or imposed by government.",
                  "examples": []
                },
                {
                  "meaning": "The proportion of weights of fine metal and alloy established for coinage.",
                  "examples": [
                    "By the present standard of the coinage, sixty-two shillings is coined out of one pound weight of silver."
                  ]
                },
                {
                  "meaning": "(sociolinguistics) standard idiom, a prestigious or standardized language variety; standard language",
                  "examples": []
                },
                {
                  "meaning": "A bottle of wine containing 0.750 liters of fluid.",
                  "examples": []
                },
                {
                  "meaning": "(India) Grade level in primary education.",
                  "examples": [
                    "I am in fifth standard."
                  ]
                }
              ]
            },
            {
              "group": "A vertical pole with something at its apex.",
              "entries": [
                {
                  "meaning": "An object supported in an upright position, such as a lamp standard.",
                  "examples": []
                },
                {
                  "meaning": "The flag or ensign carried by a military unit.",
                  "examples": []
                },
                {
                  "meaning": "One of the upright members that supports the horizontal axis of a transit or theodolite.",
                  "examples": []
                },
                {
                  "meaning": "Any upright support, such as one of the poles of a scaffold.",
                  "examples": []
                },
                {
                  "meaning": "A sturdy, woody plant whose upright stem is used to graft a less hardy ornamental flowering plant on, rather then actually planting it.",
                  "examples": []
                },
                {
                  "meaning": "A tree of natural size supported by its own stem, and not dwarfed by grafting on the stock of a smaller species nor trained upon a wall or trellis.",
                  "examples": []
                },
                {
                  "meaning": "The sheth of a plough.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A manual transmission vehicle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The upper petal or banner of a papilionaceous corolla.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shipbuilding) An inverted knee timber placed upon the deck instead of beneath it, with its vertical branch turned upward from that which lies horizontally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large drinking cup.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A collar of mail protecting the neck.",
                  "examples": [
                    "Synonym: pisane"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for standard poodle.",
                  "examples": [
                    "Since standards are large dogs, they grow much more rapidly than miniatures and toys, which means that they require more supplements."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}