{
  "word": "hamper",
  "etymologies": [
    {
      "description": [
        "From Middle English hamper, contracted from hanaper, hanypere, from Anglo-Norman hanaper, Old French hanapier, hanepier (“case for holding a large goblet or cup”), from hanap (“goblet, drinking cup”), from Frankish *hnapp (“cup, bowl, basin”), from Proto-Germanic *hnappaz (“cup, bowl”).",
        "Cognate with Old High German hnapf (“cup, bowl, basin”) (German Napf (“bowl”)), Dutch nap (“cup”), Old English hnæpp (“bowl”). More at nap."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hamper (plural hampers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large basket, usually with a cover, used for the packing and carrying of articles or small animals",
                  "examples": [
                    "a hamper of wine",
                    "a clothes hamper",
                    "an oyster hamper, which contains two bushels"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon outside New England) A wicker or plastic basket specifically for holding laundry (from clothes hamper), as opposed to a covered wicker basket which is a true hamper",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A gift basket.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hamper (third-person singular simple present hampers, present participle hampering, simple past and past participle hampered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put into a hamper.",
                  "examples": [
                    "Competition pigeons are hampered for the truck trip to the point of release where the race back starts."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English hamperen, hampren (“to hamper, oppress”), probably of the same origin as English hamble (“to limp”), Scots hamp (“to halt in walking, stutter”), Dutch haperen (“to falter, hesitate”), German hemmen (“to stop, hinder, check”). More at hamble."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hamper (plural hampers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shackle; a fetter; anything which impedes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Articles ordinarily indispensable, but in the way at certain times.",
                  "examples": [
                    "One afternoon there was a mighty queer noise aloft, which set the men running in every direction. It was the main-t'-gallant-mast. Crash! it broke off just above the cap, and held there by the rigging, dashed with every roll from side to side, with all the hamper that belonged to it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hamper (third-person singular simple present hampers, present participle hampering, simple past and past participle hampered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put a hamper or fetter on; to shackle",
                  "examples": [
                    "Synonyms: ensnare, inveigle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To impede in motion or progress.",
                  "examples": [
                    "Synonyms: hinder, embarrass, encumber"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}