{
  "word": "extenuation",
  "etymologies": [
    {
      "description": [
        "An adaptation of extenuātiōn-, the oblique stem of the Latin extenuātiō (“a thinning or diminishing”, “rarefaction”; rhetoric “a lessening”, “diminution”, “extenuation”), noun of action from extenuō (“I thin, reduce, or diminish”). Equivalent to extenuate +‎ -ion. Compare the French exténuation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "extenuation (countable and uncountable, plural extenuations)",
          "definitionGroups": [
            {
              "group": "(countable and uncountable) The action of extenuating; extenuated condition.",
              "entries": [
                {
                  "meaning": "The action or process of making or becoming thin; an instance of this; a shrunken condition; leanness, emaciation.",
                  "examples": [
                    "This mightily helpeth the extenuation of members."
                  ]
                },
                {
                  "meaning": "(of air, obsolete) Making less dense; rarefaction.",
                  "examples": [
                    "Winds proceed from extenuation of the Air, by the Sun."
                  ]
                },
                {
                  "meaning": "(obsolete) The action or process of making slender or diminishing in bulk; an instance of this.",
                  "examples": [
                    "All Dilatation is some degree of Extenuation."
                  ]
                },
                {
                  "meaning": "(obsolete) The action of making less or weak; and instance of this; a weakening, impoverishment. Also, mitigation (of blame or punishment).",
                  "examples": [
                    "The saide citie is much decaid…not a little to the extenuacion of that part of this realme."
                  ]
                },
                {
                  "meaning": "The action of representing (something) as slight and trifling; underrating; an instance of this, a plea to this end; a modification in terms.",
                  "examples": [
                    "Sometimes…wee humble ourselves lower than there is cause…And no lesse well doth God take these submisse extenuations of our selves."
                  ]
                },
                {
                  "meaning": "(rhetoric, obsolete) A figure in which a term is used which, in contrast with the more fitting term it supplants, understates or seeks to diminish the significance of something.",
                  "examples": [
                    "We call him the Disabler or figure of Extenuation."
                  ]
                },
                {
                  "meaning": "The action of lessening, or seeking to lessen, the guilt of (an offence or fault) by alleging partial excuses; and instance or means of doing this; a plea in mitigation of censure.",
                  "examples": [
                    "Extenuation, by which the Crime, that seemed great, is made lesse."
                  ]
                },
                {
                  "meaning": "(US, humorous, in the plural as “extenuations”) Thin garments.",
                  "examples": [
                    "They were clad in silken extenuations from the throat to the feet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}