{
  "word": "snood",
  "etymologies": [
    {
      "description": [
        "From Middle English snod, from Old English snōd (“headdress, fillet, snood”), from Proto-Germanic *snōdō (“rope, string”), from Proto-Indo-European *snoh₁téh₂ (“yarn, thread”), from *sneh₁(i)- (“to twist, wind, weave, plait”). Cognate with Scots snuid (“snood”), Swedish snod, snodd (“twist, twine”). Compare also Old Saxon snōva (“necklace”), Old Norse snúa (“to turn, twist”), snúðr (“a twist, twirl”), English needle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "snood (plural snoods)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A band or ribbon for keeping the hair in place, including the hair-band formerly worn in Scotland and northern England by young unmarried women.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small hairnet or cap worn by women to keep their hair in place.",
                  "examples": [
                    "Hypernym: hairnet",
                    "Hyponym: shpitzel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The flap of erectile red skin on the beak of a male turkey.",
                  "examples": [
                    "Coordinate terms: caruncle, comb, cockscomb, crest, wattle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short line of horsehair, gut, monofilament, etc., by which a fishhook is attached to a longer (and usually heavier) line; a snell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of clothing to keep the neck warm; neckwarmer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "snood (third-person singular simple present snoods, present participle snooding, simple past and past participle snooded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To keep the hair in place with a snood.",
                  "examples": [
                    "Janet has kilted her green kirtle A little aboon her knee, And she has snooded her yellow hair A little aboon her bree,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}