{
  "word": "century",
  "etymologies": [
    {
      "description": [
        "From Middle English centurie (“a count of one hundred (of anything); a division of the Roman army; century; a division of land”), from Old French centurie, from Latin centuria, from centum (“one hundred”). The most common modern use is a shortening of century of years."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "century (plural centuries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of 100 consecutive years; often specifically a numbered period with conventional start and end dates, e.g., the twentieth century, which stretches from (strictly) 1901 through 2000, or (informally) 1900 through 1999. The first century AD was from 1 to 100.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A unit in ancient Roman army, originally of 100 army soldiers as part of a cohort, later of more varied sizes (but typically containing 60 to 70 or 80) soldiers or other men (guards, police, firemen), commanded by a centurion.",
                  "examples": [
                    "Holonyms: maniple, cohort, legion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A political division of ancient Rome, meeting in the Centuriate Assembly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hundred things of the same kind; a hundred.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A hundred runs scored either by a single player in one innings, or by two players in a partnership.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker) A score of one hundred points.",
                  "examples": [
                    "That was his tenth professional century."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A race a hundred units (as meters, kilometres, miles) in length.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, informal) A banknote in the denomination of one hundred dollars.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}