{
  "word": "move",
  "etymologies": [
    {
      "description": [
        "From Middle English moven, moeven, meven, borrowed from Old Northern French mover, moveir and Old French mouver, moveir (“to move”) (compare modern French mouvoir from Old French movoir), from Latin movēre, present active infinitive of moveō (“move; change, exchange, go in or out, quit”), from Proto-Indo-European *mew- (“to move, drive”). Cognate with Lithuanian mauti (“to push on, rush”), Sanskrit मीवति (mī́vati, “pushes, presses, moves”), Middle Dutch mouwe (“sleeve”). More at muff. Largely displaced native English stir, from Middle English stiren, sturien, from Old English styrian."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "move (plural moves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of moving; a movement.",
                  "examples": [
                    "Synonyms: see Thesaurus:movement",
                    "A slight move of the tiller, and the boat will go off course."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act for the attainment of an object; a step in the execution of a plan or purpose.",
                  "examples": [
                    "He made another move towards becoming a naturalized citizen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A formalized or practiced action used in athletics, dance, physical exercise, self-defense, hand-to-hand combat, etc.",
                  "examples": [
                    "She always gets spontaneous applause for that one move.",
                    "He can win a match with that one move."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The event of changing one's residence.",
                  "examples": [
                    "Synonyms: removal, relocation",
                    "The move into my fiancé's house took two long days.",
                    "They were pleased about their move to the country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A change in strategy.",
                  "examples": [
                    "I am worried about our boss's move.",
                    "It was a smart move to bring on a tall striker to play against the smaller defenders."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A transfer, a change from one employer to another.",
                  "examples": [
                    "Robin van Persie squandered United's best chance late on but otherwise it was a relatively comfortable afternoon for Liverpool's new goalkeeper Simon Mignolet, who has yet to concede a Premier League goal since his £9m summer move from Sunderland."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(board games) The act of moving a token on a gameboard from one position to another according to the rules of the game.",
                  "examples": [
                    "The best move of the game was when he sacrificed his rook in order to gain better possession.",
                    "It's your move! Roll the dice!",
                    "If you roll a six, you can make two moves.",
                    "Synonym: play"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(board games, usually in the plural) A round, in which each player has a turn.",
                  "examples": [
                    "You can win in three moves if you do that."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "move (third-person singular simple present moves, present participle moving, simple past and past participle moved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change place or posture; to go, in any manner, from one place or position to another.",
                  "examples": [
                    "A ship moves rapidly.",
                    "I was sitting on the sofa for a long time, feeling too lazy to move.",
                    "Synonym: stir"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act; to take action; to begin to act",
                  "examples": [
                    "to move in a matter",
                    "Come on guys, let's move: there's work to do!",
                    "Synonyms: get moving, stir"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change residence, for example from one house, town, or state, to another; to go and live at another place. See also move out and move in.",
                  "examples": [
                    "I decided to move to the country for a more peaceful life.",
                    "They moved closer to work to cut down commuting time.",
                    "I'm moving next week but I don't have anything packed yet.",
                    "The rook moved from a8 to a6.",
                    "My opponent's counter was moving much quicker round the board than mine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ergative) To cause to change place or posture in any manner; to set in motion; to carry, convey, draw, or push from one place to another",
                  "examples": [
                    "The waves moved the boat up and down.",
                    "The horse moves a carriage.",
                    "Synonyms: stir, impel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chess, board games) To transfer (a piece) from one space or position on the board to another.",
                  "examples": [
                    "She moved the queen closer to the centre of the board.",
                    "He rolled a 5 and moved his counter to Boardwalk, the most expensive property on the Monopoly board."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To excite to action by the presentation of motives; to rouse by representation, persuasion, or appeal; to influence.",
                  "examples": [
                    "This song moves me to dance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To arouse the feelings or passions of; especially, to excite to tenderness or compassion, to excite (for example, an emotion).",
                  "examples": [
                    "That book really moved me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To propose; to recommend; specifically, to propose formally for consideration and determination, in a deliberative assembly; to submit",
                  "examples": [
                    "Two days were thus wasted in the quarrel between the consuls. It was clear that while Faminius was present no decision could be arrived at. Owing to Flaminius' absence through illness, Aemilius seized the opportunity to move a resolution which the senate adopted. Its purport was that the Ambracians should have all their property restored to them; they should be free to live under their own laws; they should impose such harbour dues and other imposts by land and sea as they desired, provided that the Romans and their Italian allies were exempt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To mention; to raise (a question); to suggest (a course of action); to lodge (a complaint).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To incite, urge (someone to do something); to solicit (someone for or of an issue); to make a proposal to.",
                  "examples": [
                    "\"Sir,\" seyde Sir Boys, \"ye nede nat to meve me of such maters, for well ye wote I woll do what I may to please you.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To apply to, as for aid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, transitive, intransitive) To request an action from the court.",
                  "examples": [
                    "An attorney moved the court to issue a restraining order.",
                    "The district attorney moved for a non-suit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To bow or salute upon meeting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, business) To sell or market (especially physical inventory or illicit drugs).",
                  "examples": [
                    "This business will fail if it can't move the inventory quickly."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}