{
  "word": "hangnail",
  "etymologies": [
    {
      "description": [
        "Corruption of agnail (literally “painful (anguished) nail”), by folk-etymological reanalysis as hang +‎ nail; from Middle English agnail, from Old English angnæġl, from ang- (“tight/painful”) +‎ næġl (“nail”). The first part is from Proto-Germanic *anguz, from Proto-Indo-European *h₂énǵʰus (“narrow, tight”), while the second is from Proto-Germanic *naglaz, from Proto-Indo-European *h₃negʰ-. The first component, ang- is also the origin of anguish, anger, and angst, while næġl is the origin of nail. Compare more \"pure\" Scots angernail, and similarly folk-influenced dialectal variants wrangnail and ragnail, all meaning \"hangnail\" and from Middle English. Cognate with Old High German ungnagel and Old Frisian angneil, o(n)gneil.",
        "Original sense of “loose strip of tissue”; the sense of “pointed corner of nail” is modern, and is connected with the reanalysis, due to stockings catching or “hanging” on the nail."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hangnail (plural hangnails)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose, narrow strip of nail tissue protruding from the side edge and anchored near the base of a fingernail or toenail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pointed upper corner of the toenail (often created by improperly trimming by rounding the corner) that, as the nail grows, presses into the flesh or protrudes so that it may catch (“hang”) on stockings or shoes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}