{
  "word": "consociation",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin cōnsociātiōnem, the accusative singular of cōnsociātiō (“alliance; association, union”), from cōnsociō (“to make common; to associate; to connect, join (in), unite; to agree with; to share”) + -tiō (suffix forming nouns relating to actions or the results of actions). Cōnsociō is derived from con- (prefix indicating a being or bringing together of several things) + sociō (“to ally, associate; to join, unite; to share in”) (from socius (“associated; joining in, sharing, partaking; akin, kindred, related; allied, confederate, leagued, united”, adjective), ultimately from Proto-Indo-European *sekʷ- (“to follow”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "consociation (countable and uncountable, plural consociations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Associating, or coming together in a union; (countable) an instance of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Intimate companionship or fellowship; (countable) an instance of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, Christianity) A confederation of Christian churches or organizations.",
              "entries": [
                {
                  "meaning": "(US, Congregationalism, specifically) A voluntary, permanent council made up of representatives of neighbouring Congregational churches for mutual advice and co-operation in ecclesiastical matters; also, a meeting of pastors and delegates from churches thus united.",
                  "examples": [
                    "In Connecticut some of the Congregational churches are associated in consociations and the others in associations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, ecology) A subdivision of an association, made up chiefly of organisms of a single species.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, politics) A power-sharing arrangement over territory entered into by competing groups.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) An alliance; a confederation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}