{
  "word": "twist",
  "etymologies": [
    {
      "description": [
        "From Middle English twist, from Old English *twist, in compounds (e.g. mæsttwist (“a rope; stay”), candeltwist (“a wick”)), from Proto-Germanic *twistaz, a derivative of *twi- (“two-”) (compare also twine, between, betwixt).",
        "Related to Saterland Frisian Twist (“discord”), Dutch twist (“twist; strife; discord”), German Low German Twist (“strife; discord”), German Zwist (“turmoil; strife; discord”), Swedish tvist (“quarrel; dispute”), Icelandic tvistur (“deuce”).",
        "The verb is from Middle English twisten. Compare Dutch twisten, Danish tviste (“to dispute”), Swedish tvista (“to argue; dispute”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "twist (countable and uncountable, plural twists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A twisting force.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything twisted, or the act of twisting.",
                  "examples": [
                    "Peter was always proud afterwards when he remembered that, with the Bargee's furious fingers tightening on his ear, the Bargee's crimson countenance close to his own, the Bargee's hot breath on his neck, he had the courage to speak the truth.",
                    "\"I wasn't catching fish,\" said Peter.",
                    "\"That's not your fault, I'll be bound,\" said the man, giving Peter's ear a twist—not a hard one—but still a twist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The form given in twisting.",
                  "examples": [
                    "[He] shrunk at first sight of it; he found fault with the length, the thickness, and the twist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The degree of stress or strain when twisted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of thread made from two filaments twisted together.",
                  "examples": [
                    "I was one morning walking arm in arm with him in St James's Park, his dress then being  […]  waistcoat and breeches of the same blue satin,  trimmed with silver twist à la hussarde, and ermine edges."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sliver of lemon peel added to a cocktail, etc.",
                  "examples": [
                    "Bunny sat on the only remaining stool at the leather-padded oval bar in the Iron Lounge. It was happy hour, two drinks for the price of one. She decided on a martini with a twist, and while the bartender was preparing her drink, she scanned the faces looking at the bar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden bend (or short series of bends) in a road, path, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distortion to the meaning of a word or passage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unexpected turn in a story, tale, etc.",
                  "examples": [
                    "Roy: Oh no, now I know there's a twist. I'm gonna spend the whole film guessing what it is. Damn you, Dominator!Moss: Just try and forget that there's a twist.Roy: Oh, how can you forget there's a twist?...Douglas: Oh, I've heard of this flick. There's a twist in it, isn't there?... I bet he's a woman, that bloke. No, you think it's the future, but it's actually set in the past. It's not Earth. It's all a dream!... They're all clones. He's his own brother. Everyone's a ghost."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(preceded by definite article) A type of dance characterised by rotating one’s hips. See Twist (dance) on Wikipedia for more details.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rotation of the body when diving.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sprain, especially to the ankle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A twig.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A girl, a woman.",
                  "examples": [
                    "(Dane, speaking about a woman character) \"I'll see where the twist flops\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A roll or baton of baked dough or pastry in a twisted shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A small roll of tobacco.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A material for gun barrels, consisting of iron and steel twisted and welded together.",
                  "examples": [
                    "Damascus twist"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The spiral course of the rifling of a gun barrel or a cannon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang) A beverage made of brandy and gin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strong individual tendency or bent; inclination.",
                  "examples": [
                    "a twist toward fanaticism"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) An appetite for food.",
                  "examples": [
                    "He [the yearling bull] had a good handsome male head, and he had a capital twist. He had a spring in his rib, and was something over seven feet in girth. He was well covered, and had all the recommendations of quality, symmetry, and size."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for hair twist.",
                  "examples": [
                    "The physician should evaluate for a history of tight ponytails, buns, chignons, braids, twists, weaves, cornrows, dreadlocks, sisterlocks, and hair wefts in addition to the usage of religious hair coverings."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "twist (third-person singular simple present twists, present participle twisting, simple past and past participle twisted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To turn the ends of something, usually thread, rope etc., in opposite directions, often using force.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To join together by twining one part around another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To contort; to writhe; to complicate; to crook spirally; to convolve.",
                  "examples": [
                    "twisting it into a serpentine form."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wreathe; to wind; to encircle; to unite by intertexture of parts.",
                  "examples": [
                    "longing to twist bays with that ivy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To wind into; to insinuate.",
                  "examples": [
                    "Avarice twists itself into all human concerns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To turn a knob etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To distort or change the truth or meaning of words when repeating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form a twist (in any of the above noun meanings).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To injure (a body part) by bending it in the wrong direction.",
                  "examples": [
                    "Then Romany went down, then we fell together, and the chaps separated us. I got another knock-down blow in, and was beginning to enjoy the novelty of it, when Romany staggered and limped.",
                    "‘I’ve done,’ he said. ‘I’ve twisted my ankle.’ He’d caught his heel against a tuft of grass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a path) To wind; to follow a bendy or wavy course; to have many bends.",
                  "examples": [
                    "My coming to New York had been a mistake; for whereas I had looked for poignant wonder and inspiration in the teeming labyrinths of ancient streets that twist endlessly from forgotten courts and squares and waterfronts to courts and squares and waterfronts equally forgotten, and in the Cyclopean modern towers and pinnacles that rise blackly Babylonian under waning moons, I had found instead only a sense of horror and oppression which threatened to master, paralyze, and annihilate me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to rotate.",
                  "examples": [
                    "The tide seized us and swept us along, and in the races where this happened there were sucking whirlpools, strong enough to twist us round."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dance the twist (a type of dance characterised by twisting one's hips).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To coax.",
                  "examples": [
                    "\"On the three-thousand-dollar reward John Bain is offerin' for the return of his sister,\" said Ace. \"Now listen--I know a certain big Chinee had her kidnapped outa her 'rickshaw out at the edge of the city one evenin'. He's been keepin' her prisoner in his house, waitin' a chance to send her up-country to some bandit friends of his'n; then they'll be in position to twist a big ransome outa John Bain, see? [...]\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) In the game of blackjack (pontoon or twenty-one), to be dealt another card.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}