{
  "word": "devolve",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin dēvolvō (“roll or tumble off or down”), from dē + volvō (“roll”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "devolve (third-person singular simple present devolves, present participle devolving, simple past and past participle devolved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To roll (something) down; to unroll. [15th–19th c.]",
                  "examples": [
                    "every headlong stream / Devolves its winding waters to the main."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be inherited by someone else; to pass down upon the next person in a succession, especially through failure or loss of an earlier holder. [from 16th c.]",
                  "examples": [
                    "an accident […] rendered him permanently lame, and therefore unfitted him, in the opinion of his parents, to inherit his father's many titles, which, it was then arranged, should devolve upon his younger brother."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To delegate (a responsibility, duty, etc.) on or upon someone. [from 17th c.]",
                  "examples": [
                    "They devolved their whole authority into the hands of the council of sixty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fall as a duty or responsibility on or upon someone. [from 18th c.]",
                  "examples": [
                    "For the nonce he was rather nonplussed but inasmuch as the duty plainly devolved upon him to take some measures on the subject he pondered suitable ways and means during which Stephen repeatedly yawned."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To degenerate; to break down. [from 18th c.]",
                  "examples": [
                    "A discussion about politics may devolve into a shouting match."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}