{
  "word": "niggard",
  "etymologies": [
    {
      "description": [
        "From Middle English nigard, nygard (“miser”), from nig (“niggardly person”), possibly of Scandinavian origin;\ncompare Old Icelandic hnǫggr (“miserly, stingy”), Old Norse *hniggw, with descendants Swedish njugg (“stingy”), dialectal Swedish niggla (“be stingy”), dialectal Norwegian nigla.\nUltimately from Proto-Germanic *hnauwjaz, source of Old English hneaw (“stingy”), replaced by Middle English nig.\nPossibly cognate to niggle (“miser”).\nCompare German Knicker (“niggard”), knickerig (“niggardly”). Not related to nigger."
      ],
      "adjectives": [
        {
          "description": "niggard (comparative more niggard, superlative most niggard)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sparing; stinting; parsimonious.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Miserly or stingy.",
                  "examples": [
                    "It was, however, the pleasure of his niggard and unhappy fortune, that in seeking a place proper for his accommodation, he and Dapple tumbled into a deep and very dark pit, among a number of old buildings."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "niggard (plural niggards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A miser or stingy person; a skinflint.",
                  "examples": [
                    "All his pleasures were social; and while health and fortune smiled upon him, he was no niggard either of his time or talents to those who needed them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A false bottom in a grate, used for saving fuel.",
                  "examples": [
                    "It was evening: he ordered a fire and lights; and, leaning his face on his hand as he contemplated the fitful and dusky upbreakings of the flame through the bars of the niggard and contracted grate […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "niggard (third-person singular simple present niggards, present participle niggarding, simple past and past participle niggarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hoard; to act stingily.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}