{
  "word": "reserve",
  "etymologies": [
    {
      "description": [
        "From Old French reserver."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reserve (countable and uncountable, plural reserves)",
          "definitionGroups": [
            {
              "group": "(behaviour) Restriction.",
              "entries": [
                {
                  "meaning": "The act of reserving or keeping back; reservation; exception.",
                  "examples": [
                    "The book is on reserve.",
                    "I accept your view with one reserve."
                  ]
                },
                {
                  "meaning": "Restraint of freedom in words or actions; backwardness; caution in personal behavior.",
                  "examples": []
                }
              ]
            },
            {
              "group": "That which is reserved or kept back, as for future use.",
              "entries": [
                {
                  "meaning": "A natural resource known to exist but not currently exploited.",
                  "examples": [
                    "New oil reserves are continuously being discovered, but not as fast as the existing ones are running out."
                  ]
                },
                {
                  "meaning": "A tract of land reserved, or set apart, for a particular purpose",
                  "examples": [
                    "the Connecticut Reserve in Ohio was originally set apart for the school fund of Connecticut.",
                    "the Clergy Reserves in Canada are for the support of the clergy."
                  ]
                },
                {
                  "meaning": "(Canada) A tract of land set apart for the use of an Aboriginal group; Indian reserve (compare US reservation.)",
                  "examples": []
                },
                {
                  "meaning": "(military) A body of troops kept in the rear of an army drawn up for battle, reserved to support the other lines as occasion may require; a force or body of troops kept for an exigency.",
                  "examples": []
                },
                {
                  "meaning": "(finance, insurance) Funds kept on hand to meet planned or unplanned financial requirements.",
                  "examples": []
                },
                {
                  "meaning": "A reserve price in an auction.",
                  "examples": []
                },
                {
                  "meaning": "Wine held back and aged before being sold.",
                  "examples": []
                },
                {
                  "meaning": "(ceramics) Absence of color or decoration; the state of being left plain.",
                  "examples": [
                    "Each is decorated with a simple disk in reserve and a band in reserve adorned with white dots."
                  ]
                }
              ]
            },
            {
              "group": "(social) Something initially kept back for later use in a recreation.",
              "entries": [
                {
                  "meaning": "(sports) A member of a team who does not participate from the start of the game, but can be used to replace tired or injured team-mates.",
                  "examples": []
                },
                {
                  "meaning": "(card games) A group or pile of cards dealt out at the beginning of a patience or solitaire game to be used during play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In exhibitions, a distinction indicating that the recipient will get a prize in the event of another person being disqualified.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(calico printing) A resist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A preparation used on an object being electroplated to fix the limits of the deposit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "reserve (third-person singular simple present reserves, present participle reserving, simple past and past participle reserved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To keep back; to retain.",
                  "examples": [
                    "We reserve the right to make modifications."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To keep in store for future or special use.",
                  "examples": [
                    "This cake is reserved for the guests!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To book in advance; to make a reservation.",
                  "examples": [
                    "I reserved a table for us at the best restaurant in town.",
                    "Synonyms: sign up, register, schedule, enroll, book"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To make an exception of; to except.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}