{
  "word": "digression",
  "etymologies": [
    {
      "description": [
        "From Old French digressiun or disgressiun, from Latin digressio, from digressus + -io (“forming abstract nouns from verbs”), the past passive participle of digredi (“to step away, to digress”), from dis- + gradi (“to step, walk, go”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "digression (countable and uncountable, plural digressions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An aside, an act of straying from the main subject in speech or writing.",
                  "examples": [
                    "The lectures included lengthy digressions on topics ranging from the professor's dog to the meaning of life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(generally uncountable) The act of straying from the main subject in speech or writing, (rhetoric) particularly for rhetorical effect.",
                  "examples": [
                    "make digression... by way of digression..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A deviancy, a sin or error, an act of straying from the path of righteousness or a general rule.",
                  "examples": [
                    "Nature...More stronger hadde her operacyonThan she hath nowe in her dygressyon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A deviation, an act of straying from a path.",
                  "examples": [
                    "By this little digression into Gascony, the Duke had an opportunity... to re-inforce himself with some particular Servants of his."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy, physics) An elongation, a deflection or deviation from a mean position or expected path.",
                  "examples": [
                    "This digression [of the Sun] is not equall, but neare the Æquinoxiall intersections, it is right and greater, near the Solstices, more oblique and lesser."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}