{
  "word": "swill",
  "etymologies": [
    {
      "description": [
        "From Middle English swilen (“to wash; swirl; wash away”), from Old English swillan, swilian (“to wash; wash down; swill; gargle”), from Proto-West Germanic *swilljan, from Proto-Germanic *swiljaną (“to gulp, swallow”), from Proto-Indo-European *swel- (“to drink, gulp, swallow”). Related to English swallow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swill (countable and uncountable, plural swills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) A mixture of solid and liquid food scraps fed to pigs etc; especially kitchen waste for this purpose.",
                  "examples": [
                    "Synonyms: hogwash, slops, pigswill"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any disgusting or distasteful liquid.",
                  "examples": [
                    "I cannot believe anyone could drink this swill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, figurative) Anything disgusting or worthless.",
                  "examples": [
                    "This new TV show is a worthless load of swill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A large quantity of liquid drunk at one swallow.",
                  "examples": [
                    "Synonym: swig",
                    "He took a swill of his drink and tried to think of words."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Inexpensive beer or alcohol.",
                  "examples": [
                    "Coordinate terms: hooch, rotgut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ultimate Frisbee) A badly-thrown pass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swill (third-person singular simple present swills, present participle swilling, simple past and past participle swilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drink (or, rarely, eat) greedily or to excess.",
                  "examples": [
                    "O’Malley answered calmly as he shoved half of the pie into his mouth.",
                    "“Stop! Stop—swilling that pie!” the colonel roared."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wash (something) by flooding with water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (a liquid or liquid-filled vessel) in a circular motion.",
                  "examples": [
                    "Jimmie looked lovingly at the flask, smelt it, and then, placing it next his ear, swilled it round to hear the splash of liquor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a liquid) To move around or over a surface.",
                  "examples": [
                    "[…]  before them, between the high banks of the Vaal, they saw only a world of brown water, streaked with white froth, hurling down upon them. It rose above the foot-board and swilled to the level of the seat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To inebriate; to fill with drink.",
                  "examples": [
                    "Have I not kept open house for three days and nights, and swilled yourself and comrades with liquor for a week, and haven’t you all been drunk at my expense for several days?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To feed swill to (pigs).",
                  "examples": [
                    "“Carlia, have you swilled the pigs?”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}