{
  "word": "flapper",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flapper (plural flappers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, historical) A young girl usually between the ages of 15 and 18, especially one not \"out\" socially.",
                  "examples": [
                    "Stud's eyes roved. Plenty of girls, most of them young flappers, Loretta's age. Only a couple of years ago they were kids."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, chiefly historical) A young woman, especially when unconventional or without decorum or displaying daring freedom or boldness; now particularly associated with the Jazz Age of the 1920s. [from 19th c.]",
                  "examples": [
                    "F. Scott Fitzgerald is best known as a chronicler of the 1920s and as the writer who, more than any other, identified, delineated, and popularized the female representative of that era, the flapper. Though it is an overstatement to say that Fitzgerald created the flapper, he did, with considerable assistance from his wife Zelda, offer the public an image of a young woman who was spoiled, sexually liberated, self-centered, fun-loving, and magnetic.  […]  Although she is often seen now as a mere fashion of the bygone Jazz Age, the flapper should be regarded as one of the great authentic characters in American history."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "flap (verb) +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flapper (plural flappers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who or that which flaps.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting) A young game bird just able to fly, particularly a wild duck.",
                  "examples": [
                    "Small fish, and frog and fish spawn are also eaten, and the ducklings feed upon many species of animalculæ, flies, pollywogs and worms, etc., disturbed by heavy rains which wash the banks, while the young ducks are passing to the \"flapper\" stage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flipper; a limb of a turtle, which functions as a flipper or paddle when swimming.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plumbing) A flapper valve.",
                  "examples": [
                    "In this case, slide the collar of the flapper over the overflow tube until it seats against the bottom of the flush valve."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The hand.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "flap (noun) +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flapper (plural flappers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rock climbing) Any injury that results in a loose flap of skin on the fingers, making gripping difficult.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}