{
  "word": "fray",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Late Middle English fraien (“to beat so as to cause bruising, to bruise; to crush; to rub; to wear, wear off”), borrowed from Old French fraier, freier, freiier (modern French frayer (“to clear, open up (a path, etc.); (figuratively) to find one’s way through (something); (obsolete) to rub”)), from Latin fricāre, the present active infinitive of fricō (“to chafe; to rub”), an intensive form of friō (“to break into pieces, crumble; to rub”), ultimately from Proto-Indo-European *bʰreyH- (“to cut”). Sense 1.2 (“to force or make (a path, way, etc.) through”) is derived from modern French frayer: see above.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fray (plural frays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or obsolete) A consequence of rubbing, unravelling, or wearing away; a fraying; also, a place where fraying has occurred.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fray (third-person singular simple present frays, present participle fraying, simple past and past participle frayed)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(also figuratively) To rub or wear away (something); to cause (something made of strands twisted or woven together, such as cloth or rope) to unravel through friction; also, to irritate (something) through chafing or rubbing; to chafe.",
                  "examples": []
                },
                {
                  "meaning": "(specifically) Of a deer: to rub (its antlers or head) against a tree, etc., to remove the velvet from antlers or to mark territory; also, to rub its antlers against (a tree, etc.) for that purpose.",
                  "examples": []
                },
                {
                  "meaning": "To force or make (a path, way, etc.) through.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To bruise (someone or something); also, to take the virginity of (someone, usually a female person); to deflower.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To become unravelled or worn; to unravel.",
                  "examples": [
                    "The laces frayed at the cut end."
                  ]
                },
                {
                  "meaning": "To rub.",
                  "examples": []
                },
                {
                  "meaning": "(specifically) Of a deer: to rub its antlers against a tree, etc., to remove the velvet or to mark territory.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) Of a person's mental strength, nerves, temper, etc.: to become exhausted or worn out.",
                  "examples": [
                    "The hectic day ended in her nerves frayed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Late Middle English fraien (“to attack, invade; to make an attack; to brawl, fight; to make a loud noise (?); to frighten, terrify; to be frightened of (something), fear”), an aphetic variant of affraien (“to attack, invade; to harass; to brawl, fight; to riot; to reproach; to frighten, terrify; to be frightened of (something), fear; to alarm, disturb; to arouse, awaken, excite”) (whence affray), from Anglo-Norman affraier, afrayer (“to frighten, terrify; to disquiet; to disturb”) [and other forms], a variant of effreier, esfreier [and other forms], and Old French effreer, esfreer (“to frighten, scare; to be afraid”) [and other forms] (modern French effrayer), from Vulgar Latin *exfridāre, from Latin ex- (prefix indicating privation) + Frankish *friþu (“peace”) (from Proto-Germanic *friþuz (“peace, tranquility; refuge, sanctuary”), ultimately from Proto-Indo-European *preyH- (“to love; to please”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fray (third-person singular simple present frays, present participle fraying, simple past and past participle frayed) (archaic or obsolete)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(except poetic) To alarm or frighten (someone or something).",
                  "examples": [
                    "Synonyms: (archaic) affray, (obsolete) effray"
                  ]
                },
                {
                  "meaning": "Often followed by away, off, or out: to frighten or scare (someone or something) away.",
                  "examples": [
                    "Synonym: (archaic) affray"
                  ]
                },
                {
                  "meaning": "(by extension)",
                  "examples": []
                },
                {
                  "meaning": "To assail or attack (someone or something); to drive (someone or something) away by attacking.",
                  "examples": []
                },
                {
                  "meaning": "To chase (someone or something) away; to disperse.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To be afraid or frightened; to fear.",
                  "examples": []
                },
                {
                  "meaning": "To make an assault or attack; also, to create a disturbance; to brawl, to fight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Late Middle English frai (“an assault, attack; a brawl, fight; disturbance, uproar; fine for assault or breach of the peace”), an aphetic variant of affrai, effrai (“an assault, attack; a brawl, fight; disturbance, uproar; public disturbance, riot; dismay; fear; something frightening”), then:",
        "See further at etymology 2."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fray (countable and uncountable, plural frays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A noisy commotion, especially resulting from fighting; a brawl, a fight; also, a loud quarrel.",
                  "examples": [
                    "Though they did not know the reason for the dispute, they did not hesitate to leap into the fray."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, figuratively) A heated argument; a war of words.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Conflict, disagreement.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "(countable) An assault or attack.",
                  "examples": [
                    "Synonym: (archaic) affray"
                  ]
                },
                {
                  "meaning": "(countable) A loud noise; a cacophony, a din.",
                  "examples": []
                },
                {
                  "meaning": "(except Scotland, uncountable) Fright, terror; (countable) an instance of this.",
                  "examples": [
                    "Synonym: (obsolete) affray"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "An aphetic variant of defray."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fray (third-person singular simple present frays, present participle fraying, simple past and past participle frayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, rare) To bear the expense of (something); to defray.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}