{
  "word": "atheist",
  "etymologies": [
    {
      "description": [
        "From Middle French athéiste (athée + -iste), from Latin atheos, from Ancient Greek ἄθεος (átheos, “godless, without god”), from ἀ- (a-, “without”) + θεός (theós, “god”)."
      ],
      "adjectives": [
        {
          "description": "atheist (comparative more atheist, superlative most atheist)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to atheists or atheism; atheistic.",
                  "examples": [
                    "He would have been seven times more Epicure and atheist than he was."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "atheist (plural atheists)",
          "definitionGroups": [
            {
              "group": "(religion) A person who does not believe in deities.",
              "entries": [
                {
                  "meaning": "(strictly) A person who believes that no deities exist (especially, one who has no other religious belief).",
                  "examples": []
                },
                {
                  "meaning": "(broadly) A person who rejects belief that any deities exist (whether or not that person believes that deities do not exist).",
                  "examples": []
                },
                {
                  "meaning": "(loosely) A person who has no belief in any deities, such as a person who has no concept of deities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) A person who does not believe in a particular deity (or any deity in a particular pantheon), notwithstanding that they may believe in another deity.",
                  "examples": [
                    "Throughout history, atheists were simply people who did not believe the prevalent God of the day. For the sun-worshippers, Christians were atheists. For Jewish people, Christians were atheists. Whoever does not believe in your God is by definition, an atheist.  […]  With all the countless Gods concocted by man, I claim that my Christian friends and I have something in common. We are all atheists, I just believe in one less God than they."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(proscribed) A person who does not believe in any religion (not even a religion without gods)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "atheist (third-person singular simple present atheists, present participle atheisting, simple past and past participle atheisted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, very rare) To make someone an atheist.",
                  "examples": [
                    "The multitude of opinions doth draw him away, or else Atheist him, that he will be nothing.  […]  The multitude of opinions  […]  doth un-atheist him, put him upon the search and examination what is the truth of God."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}