{
  "word": "shoulder",
  "etymologies": [
    {
      "description": [
        "From Middle English schuldre, sholder, shulder, schulder, from Old English sculdra, sculdor (“shoulder”), from Proto-West Germanic *skuldru (“shoulder”), of uncertain origin. Perhaps related to Proto-Germanic *skelduz (“shield”), see shield. Cognate with Old Frisian skuldere (“shoulder”) (West Frisian skouder (“shoulder”)), Middle Low German scholder (“shoulder”), Low German Schuller (“shoulder”), Dutch schouder (“shoulder”), German Schulter (“shoulder”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shoulder (plural shoulders)",
          "definitionGroups": [
            {
              "group": "The part of an animal's body between the base of the neck and forearm socket.",
              "entries": [
                {
                  "meaning": "The part of the human torso forming a relatively horizontal surface running away from the neck.",
                  "examples": [
                    "The parrot was sitting on Steve's shoulder."
                  ]
                },
                {
                  "meaning": "(anatomy) The joint between the arm and the torso, sometimes including the surrounding muscles, tendons, and ligaments.",
                  "examples": []
                },
                {
                  "meaning": "A cut of meat comprising the upper joint of the foreleg and the surrounding muscle.",
                  "examples": []
                },
                {
                  "meaning": "The portion of a garment where the shoulder is clothed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything forming a shape resembling a human shoulder.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(topography) A shelf between two levels.",
              "entries": [
                {
                  "meaning": "A usually unsealed strip of land bordering a road, where vehicles can drive or park in an emergency.",
                  "examples": [
                    "He stopped the car on the shoulder of the highway to change the flat tire."
                  ]
                },
                {
                  "meaning": "The portion of a hill or mountain just below the peak.",
                  "examples": []
                },
                {
                  "meaning": "A lateral protrusion of a hill or mountain.",
                  "examples": []
                },
                {
                  "meaning": "The angle of a bastion included between the face and flank.",
                  "examples": []
                },
                {
                  "meaning": "An abrupt projection which forms an abutment on an object, or limits motion, etc., such as the projection around a tenon at the end of a piece of timber.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) The flat portion of type that is below the bevelled portion that joins up with the face.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(of an object) The portion between the neck and the body.",
              "entries": [
                {
                  "meaning": "(music) The rounded portion of a stringed instrument where the neck joins the body.",
                  "examples": []
                },
                {
                  "meaning": "The rounded portion of a bottle where the neck meets the body.",
                  "examples": []
                },
                {
                  "meaning": "(firearms) The angled section between the neck and the main body of a cartridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) That which supports or sustains; support.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a key between the cuts and the bow.Parts of a Yale lock-type key",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) The part of a wave that has not yet broken.",
                  "examples": [
                    "Synonym: hook"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A season or a time of day when there is relatively little air traffic.",
                  "examples": [
                    "Coordinate term: noon balloon"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shoulder (third-person singular simple present shoulders, present participle shouldering, simple past and past participle shouldered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To push (a person or thing) using one's shoulder.",
                  "examples": [
                    "Around her numberless the rabble flowed, / Shouldering each other, crowding for a view."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put (something) on one's shoulders.",
                  "examples": [
                    "Early in the morning they shouldered light packs, took their rifles, crossed the big draw, and entered the timber where was the deadfall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place (something) against one's shoulders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To bear a burden, as a financial obligation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To accept responsibility for.",
                  "examples": [
                    "shoulder the blame"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form a shape resembling a shoulder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move by or as if by using one's shoulders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To round and slightly raise the top edges of slate shingles so that they form a tighter fit at the lower edge and can be swung aside to expose the nail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To slope downwards from the crest and whitewater portion of a wave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, slang) Of a servant: to embezzle money from (the employer).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}