{
  "word": "gong",
  "etymologies": [
    {
      "description": [
        "From Malay gong, possibly onomatopoeic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gong (plural gongs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A percussion instrument consisting of a metal disk that emits a sonorous sound when struck with a soft hammer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) A medal or award, particularly Knight Bachelor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gong (third-person singular simple present gongs, present participle gonging, simple past and past participle gonged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make the sound of a gong; to ring a gong.",
                  "examples": [
                    "Poor old Pyecraft! He has just gonged, no doubt to order another buttered tea-cake!"
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To send a signal to, using a gong or similar device.",
              "entries": [
                {
                  "meaning": "To halt (originally, a contestant in a talent show; later, a performer, a speaker).",
                  "examples": [
                    "As she was gonged, host Daryl Somers swept rapidly across and salvaged an embarrassing situation by putting his arm around her and asking her whether she had children."
                  ]
                },
                {
                  "meaning": "To warn.",
                  "examples": [
                    "The driver gonged the pedestrian crossing the tracks, but the pedestrian didn't stop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang, transitive) To give an award or medal to.",
                  "examples": [
                    "In 1972 he was awarded the British Red Cross Silver Medal for his services to the Red Cross. In 1978 he was 'gonged' once again, this time with the Queen's Jubilee Medal, marking the 25th year of her reign."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gong, from Old English gong, where it was originally a variant of the noun gang (“a going, walk, journey, way, etc.”), derived from the verb gangan (“to go, walk, travel”), whose relation to go in Proto-Germanic remains unclear. Doublet of gang."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gong (plural gongs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An outhouse: an outbuilding used as a lavatory.",
                  "examples": [
                    "Þaða he to gange com."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The contents of an outhouse pit: shit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Mandarin 功 (gōng, “merit; achievement”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gong (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A kind of cultivation energy, more powerful than qi.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) An advanced practice that cultivates such energy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}