{
  "word": "blocker",
  "etymologies": [
    {
      "description": [
        "From Middle English blocker, blokker, bloker, blokkere, equivalent to block +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blocker (plural blockers)",
          "definitionGroups": [
            {
              "group": "Agent noun of block (“obstruct or prevent”); something that blocks something else.",
              "entries": [
                {
                  "meaning": "(sports) One who blocks or impedes the movement of an opponent.",
                  "examples": []
                },
                {
                  "meaning": "(computing) One who prevents another user from contacting them electronically.",
                  "examples": [
                    "Likewise, any connections shared between your child (the blocker) and the user being blocked will also be broken."
                  ]
                },
                {
                  "meaning": "(computing) An application that stops / impedes unauthorised access to a programme.",
                  "examples": [
                    "an ad blocker",
                    "a content blocker"
                  ]
                },
                {
                  "meaning": "(computing) A bug or issue that prevents software from being released.",
                  "examples": [
                    "Synonym: showstopper"
                  ]
                },
                {
                  "meaning": "(marketing) A gatekeeper who refuses the marketer access to the person they wish to contact.",
                  "examples": [
                    "Sometimes your sales progress skids to a halt. We've all met more blockers than we'd care to. Some are assigned by the company to filter services  […]"
                  ]
                },
                {
                  "meaning": "(biology, medicine) Any of various medications that block (inhibit) the activity of a chemical messenger or its receptors, such as cardiac conduction modifiers (e.g., alpha-blockers), gastric acid inhibitors (H₂ histamine blockers), puberty blockers, and others.",
                  "examples": []
                },
                {
                  "meaning": "A close-fitting rectangular glove worn by a goalie in multiple forms of hockey.",
                  "examples": []
                },
                {
                  "meaning": "(poker) A blocker bet.",
                  "examples": []
                },
                {
                  "meaning": "(card games) A playing card, needed by one player, that is held by another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who blocks (stretches or moulds) hats.",
                  "examples": [
                    "Because in 1937 Benjamin is still an apprentice, he remains bound to the Eastern Finland Hat Factory.  […]  Benjamin now does much of the same work as the master cutters and blockers and enjoys their grudging approval of his skills."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}