{
  "word": "jangle",
  "etymologies": [
    {
      "description": [
        "From Middle English janglen (“to talk excessively, chatter; to talk idly, gossip; to nag; to complain, grumble; to argue, debate; to discuss, talk; to talk indistinctly, jabber; to make a noise or outcry; of a bird: to chatter, twitter”) [and other forms], from Old French jangler (“to chatter, gossip; to argue noisily; to bawl”) [and other forms]; further etymology uncertain, perhaps from Old Dutch *jangelon (“to jeer”) (compare Middle Dutch jangelen (“to murmur, grumble, buzz, mutter, drone, simmer”), modern Dutch jengelen (“to whine, persistently nag, whimper”), though the Oxford English Dictionary finds this improbable) and ultimately imitative."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "jangle (third-person singular simple present jangles, present participle jangling, simple past and past participle jangled)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To cause (something) to make a rattling metallic sound.",
                  "examples": []
                },
                {
                  "meaning": "To express or say (something) in an argumentative or harsh manner.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To irritate or jar (something).",
                  "examples": [
                    "The sound from the next apartment jangled my nerves."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To make a rattling metallic sound.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To speak in an angry or harsh manner.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To quarrel verbally; to wrangle.",
                  "examples": [
                    "Synonym: squabble"
                  ]
                },
                {
                  "meaning": "(obsolete) Of a person: to speak loudly or too much; to chatter, to prate; of a bird: to make a noisy chattering sound.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English jangle (“gossip, idle talk; a dispute”), from Anglo-Norman jangle and Old French jangle (“gossip, idle talk; a dispute”), from Old French jangler (“to chatter, gossip; to argue noisily; to bawl”): see further at etymology 1. Later uses are derived directly from the verb.",
        "Sense 3 (“sound typified by undistorted, treble-heavy electric guitars”) is said to derive from a line in the song Mr. Tambourine Man (1965) by the American singer-songwriter Bob Dylan (born 1941): “Hey, Mr. Tambourine Man, play a song for me / In the jingle jangle morning, I’ll come following you.”"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jangle (plural jangles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rattling metallic sound; a clang.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "The sound of people talking noisily.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) Arguing, contention, squabbling.",
                  "examples": [
                    "Synonyms: altercation, bickering"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, attributively) A sound typified by undistorted, treble-heavy electric guitars, played in a droning chordal style, characteristic of 1960s folk rock and 1980s indie rock music.",
                  "examples": [
                    "Synonym: jingle-jangle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}