{
  "word": "omega",
  "etymologies": [
    {
      "description": [
        "From Middle English, from Ancient Greek ὦ μέγα (ô méga), meaning “great ω” (omega is a long vowel in Ancient Greek)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "omega (plural omegas or omegala)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The twenty-fourth letter of the Classical and the Modern Greek alphabet, and the twenty-eighth letter of the Old and the Ancient Greek alphabet, i.e. the last letter of every Greek alphabet. Uppercase version: Ω; lowercase: ω.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often capitalized) The end; the final, last or ultimate in a sequence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) Angular velocity; symbol: ω.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(set theory) A transfinite ordinal number referring to the next position after ordering a countably infinite set.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An omega male.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) The percentage change in an option value divided by the percentage change in the underlying asset's price.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fandom slang) In omegaverse fiction, a person of a submissive secondary sex driven by biology, magic, or other means to bond with an alpha, with males of this type often being able to get pregnant.",
                  "examples": [
                    "By writing a male character as an omega, experiences of being treated as other in female-coded ways are imagined to be experienced by a character who represents the male norm."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}