{
  "word": "halo",
  "etymologies": [
    {
      "description": [
        "From Latin halōs, from Ancient Greek ἅλως (hálōs, “threshing floor; disk; disk of the sun or moon; ring of light around the sun or moon”), of unknown origin. The threshing floor's circular threshold or oxen walking on it in a circle gave rise to the other meanings. Used in English since 1563; the sense of light around someone’s head since 1646."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "halo (plural halos or haloes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A circular band of coloured light, visible around the sun or moon etc., caused by reflection and refraction of light by ice crystals in the atmosphere.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A cloud of gas and other matter surrounding and captured by the gravitational field of a large diffuse astronomical object, such as a galaxy or cluster of galaxies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything resembling this band, such as an effect caused by imperfect developing of photographs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) nimbus, a luminous disc, often of gold, around or over the heads of saints, etc., in religious paintings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The metaphorical aura of glory, veneration or sentiment which surrounds an idealized entity.",
                  "examples": [
                    "her halo slipped"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(advertising) The bias caused by the halo effect.",
                  "examples": [
                    "In both cases, they found that  […]  there was a halo effect (e.g., when a \"low cholesterol\" claim was made, consumers perceived other nutrients, such as fat, also to be at low levels when they were actually high). Andrews reported that these misleading halos were reduced only when the claims were accompanied by an evaluative disclosure  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, religion, iconography) a circular annulus ring, frequently luminous, often golden, floating above the head",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A circular brace used to keep the head and neck in position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(motor racing) A rollbar placed in front of the driver, used to protect the cockpit of an open cockpit racecar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) Short for halo headlight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "halo (third-person singular simple present haloes, present participle haloing, simple past and past participle haloed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To encircle with a halo.",
                  "examples": [
                    "Synonym: inaureole"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}