{
  "word": "wicket",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman, Old Northern French wiket, from Old Norse (specifically, Old East Norse) víkjas, diminutive of vik. Compare modern French guichet, ultimately from the same Old Norse source."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wicket (plural wickets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small door or gate, especially one beside a larger one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small window or other opening, sometimes fitted with a grating.",
                  "examples": [
                    "As he did so he heard the shuffle of footsteps entering the chapel and the clicking of the confessional wicket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A service window, as in a bank or train station, where a customer conducts transactions with a teller",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a ticket barrier at a rail station, box office at a cinema, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) One of the two wooden structures at each end of the pitch, consisting of three vertical stumps and two bails; the target for the bowler, defended by the batsman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A dismissal; the act of a batsman getting out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The period during which two batsmen bat together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The pitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The area around the stumps where the batsmen stand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(croquet) Any of the small arches through which the balls are driven.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(skiing, snowboarding) A temporary metal attachment that one attaches one's lift-ticket to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialect) A shelter made from tree boughs, used by lumbermen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) The space between the pillars, in post-and-stall working.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, informal) An angle bracket when used in HTML.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(veterinary) A device to measure the height of animals, usually dogs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}