{
  "word": "leprous",
  "etymologies": [
    {
      "description": [
        "From Middle English leprous (“having leprosy or a skin disease with symptoms like leprosy; (alchemy) of metals or minerals: impure; a leper”) [and other forms], from Anglo-Norman leprous, lepros [and other forms], Middle French lepros, lepreux, and Old French leprous, lepros (“having leprosy; a leper”) (modern French lépreux), and from their etymon Late Latin leprosus (“having leprosy; (alchemy) of metals: impure; a leper”), from Latin lepra (“leprosy”) + -ōsus (suffix meaning ‘full of; overly; prone to’ forming adjectives from nouns). Lepra is derived from Ancient Greek λέπρᾱ (léprā, “leprosy”), from λεπῐ́ς (lepís, “flake, scale; epithelial debris”) (perhaps from λέπω (lépō, “to peel, strip off a husk or rind”) + -ῐς (-is, suffix forming feminine nouns)) + -ᾱ (-ā, suffix forming action nouns from verbs)."
      ],
      "adjectives": [
        {
          "description": "leprous (comparative more leprous, superlative most leprous)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to or infected with one of the diseases known as leprosy.",
                  "examples": [
                    "Synonyms: (rare) lepric, leproid, (archaic) leprosed, leprosied, lazar, lazarlike"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Similar to leprosy or its symptoms.",
                  "examples": [
                    "Synonym: lazarlike"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the appearance of the skin of one infected with leprosy; flaking, peeling, scabby, scurfy.",
                  "examples": [
                    "And why, except that it had moved everywhere with them and they regarded it as one of their possessions, had they kept the hatrack, its glass now leprous, most of its hooks broken, its woodwork ugly with painting-over?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, archaic) Immoral, or corrupted or tainted in some manner; also, ostracized, shunned.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alchemy, historical) Of gold or other metals: contaminated with other substances; impure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, archaic) Synonym of leprose (“covered with thin scurfy scales, scaly-looking”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Causing leprosy or a disease resembling it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}