{
  "word": "takeaway",
  "etymologies": [
    {
      "description": [
        "Univerbation of take +‎ away."
      ],
      "adjectives": [
        {
          "description": "takeaway (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Australia, South Africa and New Zealand) (Of food) intended to be eaten off the premises from which it was bought.",
                  "examples": [
                    "I couldn't be bothered to cook, so I bought a takeaway curry."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "takeaway (plural takeaways)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Australia, South Africa and New Zealand) A restaurant that sells food to be eaten elsewhere.",
                  "examples": [
                    "If you're hungry, there's a takeaway just around the corner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Australia and New Zealand) A meal which has been purchased and has been carefully packaged as to be taken and consumed elsewhere.",
                  "examples": [
                    "I fancy an Indian takeaway tonight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) The preliminary part of a golfer′s swing when the club is brought back away from the ball.",
                  "examples": [
                    "One drill to help you work on the long, low takeaway is to place a tee, a coin, or even another ball just beyond your back foot (whatever you choose should be slightly inside your toe to promote a slightly inside swing path)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A concession made by a labor union in the course of negotiations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(frequently in the plural) An idea from a talk, presentation, etc., that the listener or reader should remember and consider.",
                  "examples": [
                    "For example, one of the big takeaways for myself (even though I know better) is when I don′t review my goals daily I get sucked into what′s currently happening and easily get distracted from what′s most important."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}