{
  "word": "vouch",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English vouchen (“to call, summon; to provide; to make available, proffer; to affirm, declare formally”) [and other forms], from Anglo-Norman vocher, voucher, woucher, and Old French vocher, voucher, vochier (“to call, summon; to claim; to call upon, invoke; to denounce”) [and other forms], from Vulgar Latin *vocicāre, derived from Latin vocāre (“to call, summon; to call upon, invoke; to designate, name; to bring or put (into a condition or state”), ultimately from Proto-Indo-European *wekʷ- (“to sound out; to speak”).",
        "Verb sense 6.1 (“to summon (someone) into court to establish a warranty of title to land”) in the form vouch to warrant or vouch to warranty is a calque of Anglo-Norman and Old French voucher a garant.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vouch (plural vouches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or obsolete) An assertion, a declaration; also, a formal attestation or warrant of the correctness or truth of something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "The verb is derived from Middle English vouchen (“to call, summon; to provide; to make available, proffer; to affirm, declare formally”) [and other forms], from Anglo-Norman vocher, voucher, woucher, and Old French vocher, voucher, vochier (“to call, summon; to claim; to call upon, invoke; to denounce”) [and other forms], from Vulgar Latin *vocicāre, derived from Latin vocāre (“to call, summon; to call upon, invoke; to designate, name; to bring or put (into a condition or state”), ultimately from Proto-Indo-European *wekʷ- (“to sound out; to speak”). Verb sense 6.1 (“to summon (someone) into court to establish a warranty of title to land”) in the form vouch to warrant or vouch to warranty is a calque of Anglo-Norman and Old French voucher a garant. The noun is derived from the verb.",
          "definitionGroups": []
        },
        {
          "description": "vouch (third-person singular simple present vouches, present participle vouching, simple past and past participle vouched)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To call on (someone) to be a witness to something.",
                  "examples": []
                },
                {
                  "meaning": "To cite or rely on (an authority, a written work, etc.) in support of one's actions or opinions.",
                  "examples": [
                    "Synonym: (archaic) obtest"
                  ]
                },
                {
                  "meaning": "To affirm or warrant the correctness or truth of (something); also, to affirm or warrant (the truth of an assertion or statement).",
                  "examples": [
                    "Synonyms: attest, avouch, certify"
                  ]
                },
                {
                  "meaning": "To bear witness or testify to the nature or qualities (of someone or something).",
                  "examples": []
                },
                {
                  "meaning": "To back, confirm, or support (someone or something) with credible evidence or proof.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) Synonym of vouchsafe (“to condescendingly or graciously give or grant (something)”)",
                  "examples": []
                },
                {
                  "meaning": "(archaic or obsolete) To assert, aver, or declare (something).",
                  "examples": []
                },
                {
                  "meaning": "(law)",
                  "examples": []
                },
                {
                  "meaning": "In full vouch to warrant or vouch to warranty: to summon (someone) into court to establish a warranty of title to land.",
                  "examples": []
                },
                {
                  "meaning": "Followed by over: of a vouchee (a person summoned to court to establish a warranty of title): to summon (someone) to court in their place.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To guarantee legal title (to something).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive) Often followed by for.",
              "entries": [
                {
                  "meaning": "To bear witness or testify; to guarantee or sponsor.",
                  "examples": [
                    "I can vouch that he wasn’t at the scene of the crime."
                  ]
                },
                {
                  "meaning": "To provide evidence or proof.",
                  "examples": []
                },
                {
                  "meaning": "To express confidence in or take responsibility for (the correctness or truth of) something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}