{
  "word": "pyx",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Late Middle English pix, pixe (“vessel for holding a host, pyx; hip bone socket, pyxis”) [and other forms], from Late Latin pyxis (“vessel for holding a host”), Latin pyxis (“small box for medicines or toiletries; box holding sample coins for testing; hip bone socket; sailor's compass”), from Koine Greek πυξίς (puxís), Ancient Greek πῠξῐ́ς (puxís, “box; box or tablet made of boxwood; cylinder”), from πῠ́ξος (púxos, “box tree; boxwood”) + -ῐς (-is, suffix forming feminine nouns). Doublet of box.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pyx (plural pyxes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism, also figurative) A small, usually round container used to hold the host (“consecrated bread or wafer of the Eucharist”), especially when bringing communion to the sick or others unable to attend Mass.",
                  "examples": [
                    "Synonym: (rare) pyxis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, rare) A (small) box; a casket, a coffret.",
                  "examples": [
                    "Synonym: pyxis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) A box used in a mint as a place to deposit sample coins intended to have the fineness of their metal and their weight tested before the coins are issued to the public.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, obsolete, rare) A compass used by sailors.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pyx (third-person singular simple present pyxes, present participle pyxing, simple past and past participle pyxed) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To place (the host) in a pyx.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To enclose (something) in a box or other container; specifically, to place (a deceased person's body) in a coffin; to coffin, to encoffin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) To deposit (sample coins) in a pyx; (by extension) to test (such coins) for the fineness of metal and weight before a mint issues them to the public.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}