{
  "word": "clinic",
  "etymologies": [
    {
      "description": [
        "From French clinique, from Late Latin clīnicus (“a bed-ridden person, one baptized on a sick-bed, a physician”), from Ancient Greek κλῑνικός (klīnikós, “pertaining to a bed”), from κλῑ́νη (klī́nē, “bed”), from κλῑ́νω (klī́nō, “to lean, incline”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clinic (plural clinics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A medical facility, such as a hospital, especially one for the treatment and diagnosis of outpatients.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, by extension) A hospital session to diagnose or treat patients.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, obsolete) A school, or class, in which medicine or surgery is taught by examining and treating patients in the presence of the pupils.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group practice of several physicians or other health professionals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A meeting for the diagnosis of problems, or training, on a particular subject.",
                  "examples": [
                    "A local community group will be holding a legal clinic where low-income residents can consult a lawyer for free."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A temporary office arranged on a regular basis to allow politicians to meet their constituents.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(wrestling) A series of workouts used to build skills of practitioners regardless of team affiliation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A bed-ridden person",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Somene who receives baptism on a sickbed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}