{
  "word": "tithe",
  "etymologies": [
    {
      "description": [
        "From Middle English tithe, tythe, tethe, from Old English tēoþa, tēoða, teogoþa (in verb senses via Middle English tithen, tythen, tethen, from Old English tēoþian, teogoðian), from a proposed Proto-Germanic *tehunþô, *tehundô (“a tenth”), with its nasal consonant being lost according to the Ingvaeonic nasal spirant law. Cognate with West Frisian tsiende (“tithe”), Saterland Frisian Teeged (“tithe”), German Zehnt (“tithe”), Danish tiende (“tithe”), Icelandic tíund (“tithe”), Dutch tiende (“tithe”)."
      ],
      "adjectives": [
        {
          "description": "tithe (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Tenth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tithe (plural tithes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A tenth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The tenth part of the increase arising from the profits of land and stock, allotted to the clergy for their support, as in England, or devoted to religious or charitable uses.",
                  "examples": [
                    "Synonyms: decim, (Italian contexts) decima, decimate, decimation, tithing, titheling"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contribution to one's religious community or congregation of worship (notably to the LDS church)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small part or proportion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tithe (third-person singular simple present tithes, present participle tithing, simple past and past participle tithed)",
          "definitionGroups": [
            {
              "group": "To give one-tenth or a tithe of something, particularly:",
              "entries": [
                {
                  "meaning": "(transitive) To pay something as a tithe.",
                  "examples": [
                    "He teoðode gynd eall his cyne rice ðone teoðan del ealra his landa."
                  ]
                },
                {
                  "meaning": "(transitive) To pay a tithe upon something.",
                  "examples": [
                    "...ge tiogoðiað eowre mintan & eowerne dile & eowerne kymen."
                  ]
                },
                {
                  "meaning": "(intransitive) To pay a tithe; to pay a 10% tax",
                  "examples": [
                    "Synonym: decimate"
                  ]
                },
                {
                  "meaning": "(intransitive, figuratively) To pay or offer as a levy in the manner of a tithe or religious tax.",
                  "examples": [
                    "These slaves are either the sonnes of Christians, tithed in their childhoods, Captives taken in the warres, or Renegadoes."
                  ]
                }
              ]
            },
            {
              "group": "To take one-tenth or a tithe of something, particularly:",
              "entries": [
                {
                  "meaning": "(transitive) To impose a tithe upon someone or something.",
                  "examples": [
                    "Leeuy, that took tithis, is tithid."
                  ]
                },
                {
                  "meaning": "(transitive) To spare only every tenth person, killing the rest (usually in relation to the sacking of the episcopal seat at Canterbury by the pagan Danes in 1011).",
                  "examples": [
                    "Þe folk of Crist was tiþed, þat is to seie, nyne slayn and þe tenþe i-kepte."
                  ]
                },
                {
                  "meaning": "(transitive) To enforce or collect a tithe upon someone or something.",
                  "examples": [
                    "Synonyms: decimate, tithe out"
                  ]
                },
                {
                  "meaning": "(transitive, obsolete) To decimate: to kill every tenth person, usually as a military punishment.",
                  "examples": [
                    "Synonym: decimate"
                  ]
                },
                {
                  "meaning": "(intransitive) To enforce or collect a tithe.",
                  "examples": [
                    "Those who tithe and toll upon them for their spiritual and temporal benefit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To compose the tenth part of something.",
                  "examples": [
                    "Her sorrowes did not tith her ioy."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}