{
  "word": "brittle",
  "etymologies": [
    {
      "description": [
        "From Middle English britel, brutel, brotel (“brittle”), from Old English *brytel, *bryttol (“brittle, fragile”, literally “prone to or tending to break”); equivalent to brit +‎ -le."
      ],
      "adjectives": [
        {
          "description": "brittle (comparative brittler or more brittle, superlative brittlest or most brittle)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Inflexible; liable to break, snap, or shatter easily under stress, pressure, or impact.",
                  "examples": [
                    "Cast iron is much more brittle than forged iron.",
                    "A diamond is hard but brittle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not physically tough or tenacious; apt to break or crumble when bending.",
                  "examples": [
                    "Shortbread is my favorite cold pastry, yet being so brittle it crumbles easily, and a lot goes to waste."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) Said of rocks and minerals with a conchoidal fracture; capable of being knapped or flaked.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Emotionally fragile, easily offended.",
                  "examples": [
                    "What a brittle personality! A little misunderstanding and he's an emotional wreck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering, computing, of a system) Poorly error- or fault-tolerant; having little in the way of redundancy or defense in depth; susceptible to catastrophic failure in the event of a relatively-minor malfunction or deviance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, proscribed) Diabetes that is characterized by dramatic swings in blood sugar level.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "brittle (usually uncountable, plural brittles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A confection of caramelized sugar and nuts.",
                  "examples": [
                    "As a child, my favorite candy was peanut brittle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Anything resembling this confection, such as flapjack, a cereal bar, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brittle (third-person singular simple present brittles, present participle brittling, simple past and past participle brittled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become brittle.",
                  "examples": [
                    "The project is based on a similar project, the Class project, which was started by the University of Cornell several years ago under the leadership of Stuart Lynn to preserve brittling old books."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}