{
  "word": "spatula",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin spatula (“a flat piece”), the diminutive form of spatha (“broad or flat tool”), from Ancient Greek σπάθη (spáthē, “a broad wood or metal blade”). Doublet of spauld; compare spatha and spathe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spatula (plural spatulas or spatulae or spatulæ)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kitchen utensil consisting of a flat surface attached to a long handle, used for turning, lifting, or stirring food.",
                  "examples": [
                    "Synonyms: fish slice, fish trowel, turner, pancake turner, kitchen turner, cooking turner, flipper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) A kitchen utensil consisting of a flexible surface attached to a long handle, used for scraping the sides of bowls.",
                  "examples": [
                    "Synonyms: scraper, dough scraper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A palette knife.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A thin hand tool, often made of nickel, for handling chemicals or other materials, when weighing, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A croupier's tool for turning up cards in a casino.",
                  "examples": [
                    "The croupier delicately faced her other two cards with the tip of his spatula. A four! She had lost!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) A sclerotized, T-shaped plate in the prothorax of larvae of flies belonging to family Cecidomyiidae, the gall midges.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spatula (third-person singular simple present spatulas, present participle spatulaing, simple past and past participle spatulaed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lift with or as if with a spatula.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike with a spatula.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}