{
  "word": "design",
  "etymologies": [
    {
      "description": [
        "From Middle English designen, from Old French designer, from Latin designō (“I mark out, point out, describe, design, contrive”), from de- (or dis-) + signō (“I mark”), from signum (“mark”). Doublet of designate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "design (countable and uncountable, plural designs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specification of an object or process, referring to requirements to be satisfied and thus conditions to be met for them to solve a problem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plan (with more or less detail) for the structure and functions of an artifact, building or system.",
                  "examples": [
                    "The initial design of the park was rejected for being too expensive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pattern, as an element of a work of art or architecture.",
                  "examples": [
                    "We're working on some new designs for our range of summer shirts"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The composition of a work of art.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Intention or plot.",
              "entries": [
                {
                  "meaning": "(particularly) Malicious or malevolent intention.",
                  "examples": [
                    "To have evil designs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The shape or appearance given to an object, especially one that is intended to make it more attractive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The art of designing",
                  "examples": [
                    "Danish furniture design is world-famous."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "design (third-person singular simple present designs, present participle designing, simple past and past participle designed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To plan and carry out (a picture, work of art, construction etc.). [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To plan (to do something).",
                  "examples": [
                    "The king designed to mount an expedition to the New World."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To assign, appoint (something to someone); to designate. [16th–19th c.]",
                  "examples": [
                    "He was designed to the study of the law."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To mark out and exhibit; to designate; to indicate; to show; to point out; to appoint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To manifest requirements to be satisfied by an object or process for them to solve a problem.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}