{
  "word": "perfect",
  "etymologies": [
    {
      "description": [
        "From Middle English perfit, from Old French parfit (modern: parfait), from Latin perfectus, perfect passive participle of perficere (“to finish”), from per- (“through, thorough”) + facere (“to do, to make”). Spelling modified 15c. to conform to Latin etymology. Doublet of parfait.",
        "Displaced native Old English fulfremed."
      ],
      "adjectives": [
        {
          "description": "perfect (comparative perfecter or more perfect, superlative perfectest or most perfect)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fitting its definition precisely.",
                  "examples": [
                    "a perfect circle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having all of its parts in harmony with a common purpose.",
                  "examples": [
                    "That bucket with the hole in the bottom is a poor bucket, but it is perfect for watering plants."
                  ]
                }
              ]
            },
            {
              "group": "Without fault or mistake; without flaw, of supreme quality.",
              "entries": [
                {
                  "meaning": "(of a copy) Exact, correctly reflecting the original in all aspects.",
                  "examples": [
                    "The expert forger made a perfect copy of the victim's driver's license"
                  ]
                },
                {
                  "meaning": "(of an actor) Having thoroughly learned or memorized a part.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete outside set of phrases) Of a person: having thoroughly learned or memorized a lesson; of a lesson: having been thoroughly learned or memorized.",
                  "examples": [
                    "Practice makes perfect.",
                    "word-perfect, letter-perfect"
                  ]
                },
                {
                  "meaning": "(obsolete) Fully trained or very knowledgeable; highly skilled",
                  "examples": [
                    "Our Battaile is more full of Names then yours, / Our Men more perfect in the vse of Armes, / Our Armor all as strong, our Cause the best"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Excellent and delightful in all respects.",
                  "examples": [
                    "a perfect day"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Morally or spiritually immaculate or ideal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, of a tense or verb form) Representing a completed action.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Sexually mature and fully differentiated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Of flowers: having both male parts (stamens) and female parts (carpels).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Of a number: equal to the sum of its proper divisors.",
                  "examples": [
                    "6 is perfect because the sum of its proper divisors, 1, 2, and 3, which is 6, is equal to the number itself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematical analysis) Of a set: equal to its set of limit points, i.e. set A is perfect if A=A'.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Describing an interval or any compound interval of a unison, octave, or fourths and fifths that are not tritones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a cocktail) Made with equal parts of sweet and dry vermouth.",
                  "examples": [
                    "a perfect Manhattan; a perfect Rob Roy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Well informed; certain; sure.",
                  "examples": [
                    "I am perfect that the Pannonians and Dalmatians for their liberties are now in arms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Innocent, guiltless; without blemish.",
                  "examples": [
                    "My fault being nothing—as I have told you oft— / But that two villains, whose false oaths prevail'd / Before my perfect honour, swore to Cymbeline / I was confederate with the Romans: so / Follow'd my banishment"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sane, of sound mind.",
                  "examples": [
                    "Pray, do not mock me. / I am a very foolish fond old man, / Fourscore and upward, not an hour more nor less / And, to deal plainly, / I fear I am not in my perfect mind."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "perfect (plural perfects)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The perfect tense, or a form in that tense.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A perfect score; the achievement of finishing a stage or task with no mistakes.",
                  "examples": [
                    "Awarded for scoring all Perfects in the Dominator rank!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, Christianity) A leader of the Cathar movement.",
                  "examples": [
                    "Synonym: perfectus",
                    "Hyponym: perfecta"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From perfect (adjective)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "perfect (third-person singular simple present perfects, present participle perfecting, simple past and past participle perfected)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make perfect; to improve or hone.",
                  "examples": [
                    "I am going to perfect this article.",
                    "You spend too much time trying to perfect your dancing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To take an action, usually the filing of a document in the correct venue, that secures a legal right.",
                  "examples": [
                    "perfect an appeal; perfect an interest; perfect a judgment"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}