{
  "word": "signpost",
  "etymologies": [
    {
      "description": [
        "sign +‎ post"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "signpost (plural signposts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A post bearing a sign that gives information on directions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cryptic crosswords) A word or phrase within a clue that serves as an indicator, rather than being fodder.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "signpost (third-person singular simple present signposts, present participle signposting, simple past and past participle signposted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To install signposts on.",
                  "examples": [
                    "The route wasn't signposted, and we got lost on the way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To direct (somebody) to services, resources, etc.",
                  "examples": [
                    "We believe that some Carers' Centres already offer an effective 'first stop shop' for signposting carers to local organisations, services and benefits, and for providing ongoing support as carers' circumstances change."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To indicate logical progress of a discourse using words or phrases such as now, right, to recap, to sum up, as I was saying, etc.",
                  "examples": [
                    "Bede, never one to shrink from a challenge, focused his energies not only onto calculating Easter but also onto describing why the maths mattered as much as the result. In this, his elevated rhetoric is balanced by a very human enthusiasm — it's hard not to love a writer who signposts his core hypotheses with phrases such as 'now to gut the bowels of this question!'"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To signal, as if with a signpost",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}