{
  "word": "withdraw",
  "etymologies": [
    {
      "description": [
        "From Middle English withdrawen, withdrauen (“to depart, leave, move away; (reflexive) to go away; (reflexive) to leave someone’s service; (often reflexive) to draw back or retreat (from a battlefield or dangerous place), withdraw; to abandon, desert; to go, go forth; to move; of the sea, water, etc.: to (cause to) ebb, recede, subside; to disappear; to slacken, wane; (often reflexive) to cease, stop; to desist, refrain; (reflexive) to go back on, recant; to avoid, eschew; to bring under control, contain, suppress; to curb, curtail; to delay, put off; to demur, refuse; to carry or take away, deprive of, remove; to contract, draw away or in, retract; to deny, refuse; to revoke; to withhold; to divert; to separate; to adopt, borrow, imitate”) [and other forms], from with- (prefix meaning ‘away; back’) + drawen, drauen (“to drag, pull, tow, tug, draw [and other senses]”) (ultimately from Proto-Indo-European *dʰregʰ- (“to drag, pull; to run”)); see further at with- and draw. The English word is analysable as with- +‎ draw."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "withdraw (third-person singular simple present withdraws, present participle withdrawing, simple past withdrew, past participle withdrawn)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To draw or pull (something) away or back from its original position or situation.",
                  "examples": []
                },
                {
                  "meaning": "To remove (someone or (reflexive, archaic) oneself) from a position or situation; specifically (military), to remove (soldiers) from a battle or position where they are stationed.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To draw or pull (a bolt, curtain, veil, or other object) aside.",
                  "examples": []
                },
                {
                  "meaning": "To take away or take back (something previously given or permitted); to remove, to retract.",
                  "examples": []
                },
                {
                  "meaning": "To cause or help (someone) to stop taking an addictive drug or substance; to dry out. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "To take (one's eyes) off something; to look away.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": [
                    "Synonyms: unsay; see also Thesaurus:recant",
                    "to withdraw false charges"
                  ]
                },
                {
                  "meaning": "To disregard (something) as belonging to a certain group.",
                  "examples": []
                },
                {
                  "meaning": "To remove (a topic) from discussion or inquiry.",
                  "examples": []
                },
                {
                  "meaning": "To stop (a course of action, proceedings, etc.)",
                  "examples": []
                },
                {
                  "meaning": "To take back (a comment, something written, etc.); to recant, to retract.",
                  "examples": [
                    "Synonyms: unsay; see also Thesaurus:recant",
                    "to withdraw false charges"
                  ]
                },
                {
                  "meaning": "(archaic or obsolete) To distract or divert (someone) from a course of action, a goal, etc.",
                  "examples": []
                },
                {
                  "meaning": "(banking, finance) To extract (money) from a bank account or other financial deposit.",
                  "examples": [
                    "Antonym: deposit"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "Chiefly followed by from: to leave a place, someone's presence, etc., to go to another room or place.",
                  "examples": []
                },
                {
                  "meaning": "(specifically, military) Of soldiers: to leave a battle or position where they are stationed; to retreat.",
                  "examples": []
                },
                {
                  "meaning": "Chiefly followed by from: to stop taking part in some activity; also, to remove oneself from the company of others, from publicity, etc.",
                  "examples": []
                },
                {
                  "meaning": "To stop talking to or interacting with other people and start thinking thoughts not related to what is happening.",
                  "examples": []
                },
                {
                  "meaning": "To stop taking an addictive drug or substance; to undergo withdrawal. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "Of a man: to remove the penis from a partner's body orifice before ejaculation; to engage in coitus interruptus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English withdrawe (“act of stopping a judicial proceeding”), from withdrawen, withdrauen (verb): see etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "withdraw (plural withdraws) (obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of drawing back or removing; a removal, a withdrawal or withdrawing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Synonym of withdraught (“a dismissal of a lawsuit with prejudice based on a plaintiff's withdrawal of the suit; a retraxit; also, a fine imposed on a plaintiff for such a dismissal”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}