{
  "word": "sneeze",
  "etymologies": [
    {
      "description": [
        "From Middle English snesen (“to sneeze”), alteration of earlier fnesen (“to sneeze”), from Old English fnēosan (“to sneeze, snort”), from Proto-West Germanic *fneusan, from Proto-Germanic *fneusaną, from Proto-Indo-European *pnew- (“to breathe, pant, snort, sneeze”). Cognate with dialectal Dutch fniezen (“to sneeze”), Old Norse fnýsa (“to snort”).",
        "Compare neeze, from Middle English nesen, from Old English *hnēosan (“to sneeze”), cognate with Old High German niosan (“to sneeze”), Old Norse hnjósa (“to sneeze”). See neeze.",
        "It has been suggested that the change could be due to a misinterpretation of the uncommon initial sequence fn- as ſn- (sn- written with a long s), although the change is regular, seen also in snore and snort from Middle English fnoren and fnorten, and in late Middle English snatted from earlier Middle English fnatted (“snub-nosed”). The fn- forms of all these words fell out of use in the 1400s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sneeze (plural sneezes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of sneezing.",
                  "examples": [
                    "Synonyms: (medicine) sternutation, (medicine) ptarmus",
                    "Jared's hay fever gives him terrible sneezes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sneeze (third-person singular simple present sneezes, present participle sneezing, simple past sneezed or (nonstandard) snoze, past participle sneezed or (nonstandard) snozen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To expel air as a reflex induced by an irritation in the nose.",
                  "examples": [
                    "To avoid passing on your illness, you should sneeze into your sleeve."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To expel air as if the nose were irritated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To expel or displace (air, snot, etc) from the nose or mouth by the process above.",
                  "examples": [
                    "Lily shook her head violently and sneezed a large blue-bottle fly from where that insect had perched itself on the tip of her nose."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}