{
  "word": "fillip",
  "etymologies": [
    {
      "description": [
        "From Middle English filippen, philippe (“to flick or snap a finger against the thumb”); further origin uncertain, but probably imitative. See flip. It is not clear whether the verb is derived from the noun, or vice versa."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fillip (plural fillips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The action of holding the tip of a finger against the thumb and then releasing it with a snap; a flick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp strike or tap made using this action, or (by extension) by other means.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Something unimportant, a trifle; also, the brief time it takes to flick one's finger (see noun sense 1); a jiffy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Something that excites or stimulates.",
                  "examples": [
                    "This measure gave a fillip to the housing market.",
                    "The athlete’s victory provided a much-needed fillip for national pride."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fillip (third-person singular simple present fillips, present participle filliping or (archaic) fillipping, simple past and past participle filliped or (archaic) fillipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike, project, or propel with a fillip (that is, a finger released quickly after being pressed against the thumb); to flick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To project quickly; to snap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To strike or tap smartly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To drive as if by a fillip (noun sense 1); to excite, stimulate, whet.",
                  "examples": [
                    "The spicy aroma filliped my appetite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make a fillip (noun sense 1) (with the fingers).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}