{
  "word": "puggle",
  "etymologies": [
    {
      "description": [
        "British dialect (Hertfordshire, Essex), from pug (“to poke”) +‎ -le (“frequentative suffix”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "puggle (third-person singular simple present puggles, present participle puggling, simple past and past participle puggled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, regional) To coax (a rabbit) from a burrow by poking a stick down the hole and moving it about; to delve into a hole in order to locate an animal.",
                  "examples": [
                    "In concluding my remarks on the East Sussex Hounds, I must observe, that perhaps they have the worst and most difficult country in the world to hunt through, intersected with immense woods, and slotted with some thousands of sheep, besides being naturally a very cold-scenting soil; consequently the hounds puggle more than is pleasing to the eye, have little or no dash, but are very patient and very perfect in working up to their fox, and are probably much surer killers than any other hounds […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, regional) To poke around a hole with a stick, as to explore, remove obstacles, etc.",
                  "examples": [
                    "I am no sooner seated by a fire, but my hand instinctively fumbles after the poker, and I proceed to puggle the glowing embers, until (except timely warning prevent) I have displaced the whole into the fender."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Transferal of trademarked name of a range of soft toys from the mid-1970s which superficially resemble baby echidnas."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "puggle (plural puggles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia) A baby monotreme (echidna or platypus).",
                  "examples": [
                    "Larger furred/spined puggles can be held in a wooden box with shredded paper."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Blend of pug +‎ beagle"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "puggle (plural puggles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small mixed breed of dog created by mating a pug and beagle.",
                  "examples": [
                    "Jake Gyllenhaal and Sylvester Stallone are among the puggle lovers, but so are a slew of regular people who want in on the tawny, fawny, puppy-faced action and will pay hundreds or thousands of dollars for the pleasure."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}