{
  "word": "yet",
  "etymologies": [
    {
      "description": [
        "From Middle English yet, yit, from Old English ġīet, gȳta, from Proto-West Germanic *jūta, from Proto-Germanic *juta (compare West Frisian jit, jitte (“yet”), Dutch ooit (“ever”), German jetzt (“now”)), compound of (1) *ju (“already”, adverb), from Proto-Indo-European *h₂yew-, accusative of *h₂óyu (“long time”) and (2) the Proto-Germanic *ta (“to, towards”) , from Proto-Indo-European *do. More at aye and -th."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "yet (not comparable)",
          "definitionGroups": [
            {
              "group": "Thus far; up to the present; up to some unspecified time.",
              "entries": [
                {
                  "meaning": "In negative or interrogative use, often with an expectation or potential of something happening in the future.",
                  "examples": [
                    "I haven't finished yet.",
                    "Have you finished yet?",
                    "We do not yet know what happened.",
                    "He has never yet been late for an appointment."
                  ]
                },
                {
                  "meaning": "In negative imperative use, asking for an action to be delayed.",
                  "examples": [
                    "Don't switch it on yet – wait until I've reconnected the pump."
                  ]
                },
                {
                  "meaning": "(poetic or archaic) In affirmative use: still.",
                  "examples": [
                    "He is  yet breathing. (He is still breathing.)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "At some future time; eventually.",
                  "examples": [
                    "The riddle will be solved yet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(after 'have' and certain copulative verbs, followed by an infinitive) Not as of the time referenced.",
                  "examples": [
                    "I’ve yet to see him. — I have not yet seen him.",
                    "I had yet to go to a convention. — I had not yet gone to a convention.",
                    "They are yet to win a single match. — They have not yet won a single match.",
                    "He seemed yet to be convinced. — He seemed not yet to have been convinced."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In addition.",
                  "examples": [
                    "There are two hours yet to go until our destination."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(degree) Even.",
                  "examples": [
                    "K-2 is yet higher than this.",
                    "Oh no! Yet more problems!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English yeten, from Old English ġēotan (“to flow, pour”), from Proto-West Germanic *geutan, from Proto-Germanic *geutaną (“to flow, pour”), from Proto-Indo-European *ǵʰewd- (“to pour”). Cognate with Scots yat (“to pour, yet”), West Frisian jitte (“to scatter, shed, pour”), Dutch gieten (“to pour, cast, mould”), German gießen (“to pour, cast, mould”), Swedish gjuta (“to pour, cast”). Doublet of yote."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "yet (plural yets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) A metal pan or boiler; yetling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "yet (third-person singular simple present yets, present participle yetting, simple past yet or yetted, past participle yet or yetted or yoten)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To pour.",
                  "examples": [
                    "[…]  & stablenes of perseueraunce; graunt  me for all wor[l]dly consolacyons the swete, gracyous vnccyon of the holy goost, & for all carnall loue / yet into my soule the loue of thyne holy name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete outside dialects) To melt; found; cast (e.g. metal, by pouring it into a mould when molten).",
                  "examples": [
                    "[…]  whiche shall present him selfe openly stained or embrued with sondry colours, or poudered with the duste of stones that he cutteth, or perfumed with tedious sauours of the metalles by him yoten."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English yeten, ȝeten, from Old English ġietan, from Proto-Germanic *getaną, from Proto-Indo-European *gʰed-. More at get."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "yet (third-person singular simple present yets, present participle yetting, simple past yot, past participle yotten)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard, West Country) To get.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}