{
  "word": "sib",
  "etymologies": [
    {
      "description": [
        "From Middle English sib, from Old English sibb (“related, akin, sib”), from Proto-Germanic *sibjaz (“related”), from Proto-Indo-European *sebʰ-, *swebʰ- (“one's own”). Cognate with West Frisian besibbe (“related”), Middle Dutch sibbe (“related”), Middle Low German sibbe (“related”), Middle High German sippe (“related”), Icelandic sifi (“related”)."
      ],
      "adjectives": [
        {
          "description": "sib",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having kinship or relationship; related by same-bloodedness; having affinity; being akin; kindred.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English sib, sibbe, from Old English sibb (“relationship; gossip; friendliness, kindness; love, friendship, peace, concord, unity, tranquility; peace of mind; a relative, kinsman, kinswoman”), from Proto-West Germanic *sibbju, from Proto-Germanic *sibjō (“kinship”), from Proto-Indo-European *sebʰ-, *swebʰ- (“one's own”).",
        "Cognate with West Frisian sibbe (“relative, family member”), Dutch sibbe (“sib”), German Sippe (“tribe, clan”), Icelandic sifjar (“in-laws”), Latin suus (“one's own”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sib (plural sibs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Kindred; kin; kinsmen; a body of persons related by blood in any degree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kinsman; a blood relation; a relative, near or remote; one closely allied to another; an intimate companion.",
                  "examples": [
                    "But she got up to go, and Domenico obeyed me too in mock meekness, making himself sib and coeval to Hortense, submissive to frowning elder brother, something incestuous in it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sibling, brother or sister (irrespective of gender)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Any group of animals or plants sharing a corresponding genetic relation",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of individuals unilaterally descended from a single (real or postulated) common ancestor",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English *sibben, *sibbien, from Old English sibbian (“to make peace; rejoice”), from Proto-Germanic *sibjōną (“to reconcile”), Proto-Indo-European *sebʰ-, *swebʰ- (“one's own”). Cognate with German sippen (“to be in relationship with, become related to”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sib (third-person singular simple present sibs, present participle sibbing, simple past and past participle sibbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring into relation; establish a relationship between; make friendly; reconcile.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the abbreviation SIB, or self-injurious behavior, a behavior found in autism."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sib (third-person singular simple present sibs, present participle sibbing, simple past and past participle sibbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, clinical psychology) To engage in repetitive behaviors such as eye-poking, skin-picking, hand-biting, or head-banging.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}