{
  "word": "cuckold",
  "etymologies": [
    {
      "description": [
        "From Middle English cokolde, cokewold, cockewold, kukwald, kukeweld, from Old French cucuault; a compound of cucu (“cuckoo”) (some varieties of the cuckoo bird lay their eggs in another’s nest) and Old French -auld. Cucu is either a directly derived onomatopoeic derivative of the cuckoo's call, or from Latin cucūlus. Latin cucūlus is a compound of onomatopoeic cucu (compare Late Latin cucus) and the diminutive suffix -ulus.",
        "Old French -auld is from Frankish *-wald (similar suffixes are used in some personal names within other Germanic languages as well; compare English Harold, for instance), a suffixal use of Frankish *wald (“wielder, ruler, leader”), from Proto-Germanic *waldaz (compare German Gewalt, from the related *waldą (“power, might”)), from *waldaną (“to rule”), from Proto-Indo-European *h₂welh₁- (“to be strong; to rule”).",
        "Appears in Middle English in noun form circa 1250 as cokewald. First known use of the verb form is 1589."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cuckold (plural cuckolds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A man married to an unfaithful wife, especially when he is unaware or unaccepting of the fact.",
                  "examples": [
                    "Synonyms: cornuto, cuck; see also Thesaurus:cuckold",
                    "Coordinate terms: cuckquean; see also Thesaurus:cuckquean"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fetishism) A man who is attracted to or aroused by the sexual infidelity of a partner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A West Indian plectognath fish, Rhinesomus triqueter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The scrawled cowfish, Acanthostracion quadricornis and allied species.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cuckold (third-person singular simple present cuckolds, present participle cuckolding, simple past and past participle cuckolded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a cuckold or cuckquean of someone by being unfaithful, or by seducing their partner or spouse.",
                  "examples": [
                    "Synonyms: cuck, horn, hornify; see also Thesaurus:cuckoldize"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}