{
  "word": "escort",
  "etymologies": [
    {
      "description": [
        "Borrowed from French escorte, itself borrowed from Italian scorta."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "escort (plural escorts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people or vehicles, generally armed, who go with a person or people of importance to safeguard them on a journey or mission.",
                  "examples": [
                    "The soldier who was pulling at the other end was clumsily unhorsed, and I myself was all but thrown by the unexpected jerk. This ludicrous incident at first provoked mirth among my escort, a mirth which their superstitious minds immediately turned into an ill omen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An accompanying person in such a group.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A guard who travels with a dangerous person, such as a criminal, for the protection of others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people attending as a mark of respect or honor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An accompanying person in a social gathering, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Protection, care, or safeguard on a journey or excursion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(somewhat euphemistic) A sex worker who does not operate in a brothel, but with whom clients make appointments; a call girl or male equivalent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "escort (third-person singular simple present escorts, present participle escorting, simple past and past participle escorted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To attend to in order to guard and protect; to accompany as a safeguard (for the person escorted or for others); to give honorable or ceremonious attendance to",
                  "examples": [
                    "He reported that the police escorted the children five or six blocks beyond Natural Bridge Avenue and at that point stopped the white children who were following and shooed them back to the park."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To accompany (a person) in order to compel them to go somewhere (e.g. to leave a building).",
                  "examples": [
                    "At this point, the Tenant became extremely angry.... the Tenant started yelling even louder and charged at me. The Tenant was restrained by the security guard and escorted out of the hearing room. The Tenant was ultimately escorted out of the Board’s office because he continued his yelling and aggressive behaviour in the hallway and at the customer service desk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To go with someone as a partner, for example on a formal date.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}