{
  "word": "pang",
  "etymologies": [
    {
      "description": [
        "The origin of the noun is uncertain; it is possibly derived from Middle English *pange, perhaps an altered form of prange, prōnge (“affliction, agony, pain; pointed instrument”) as in prongys of deth (“pangs of death, death throes”), from Anglo-Latin pronga, of unknown origin. Perhaps connected with Middle Dutch prange, pranghe (“instrument for pinching”) (modern Dutch prang (“horse restraint; fetter, neck iron”)), Middle Low German prange (“pole, stake; (possibly) kind of pillory or stocks”), Old English pyngan (“to prick”). The word may thus be related to prong.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pang (plural pangs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often in the plural) A paroxysm of extreme physical pain or anguish; a feeling of sudden and transitory agony; a throe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often in the plural) A sudden sharp feeling of an emotional or mental nature, as of joy or sorrow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pang (third-person singular simple present pangs, present participle panging, simple past and past participle panged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to have great pain or suffering; to torment, to torture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pang",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard) simple past tense of ping",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}