{
  "word": "stuff",
  "etymologies": [
    {
      "description": [
        "From Middle English stuffen (“to equip, furnish”), borrowed from Old French estoffer, estofer (“to provide what is necessary, equip, stuff”), borrowed from Old High German stoffōn, from Proto-West Germanic *stoppōn (“to clog up, block, fill”). More at stop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stuff (usually uncountable, plural stuffs)",
          "definitionGroups": [
            {
              "group": "(informal) Miscellaneous items or objects; (with possessive) personal effects.",
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) Furniture; goods; domestic vessels or utensils.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Unspecified things or matters.",
                  "examples": [
                    "I had to do some stuff."
                  ]
                }
              ]
            },
            {
              "group": "The tangible substance that goes into the makeup of a physical object.",
              "entries": [
                {
                  "meaning": "(archaic) A material for making clothing; any woven textile, but especially a woollen fabric.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) Boards used for building.",
                  "examples": []
                },
                {
                  "meaning": "Abstract/figurative substance or character.",
                  "examples": []
                },
                {
                  "meaning": "Paper stock ground ready for use. When partly ground, it is called half stuff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Used as placeholder, usually for material of unknown type or name.",
                  "examples": [
                    "Synonyms: doodad, thingamabob; see also Thesaurus:thingy",
                    "Can I have some of that stuff on my ice-cream sundae?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Narcotic drugs, especially heroin.",
                  "examples": [
                    "Synonyms: dope, gear; see also Thesaurus:recreational drug"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A medicine or mixture; a potion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes euphemistic) Refuse or worthless matter; hence, also, foolish or irrational language.",
                  "examples": [
                    "Synonyms: garbage, rubbish, nonsense, stuff and nonsense; see also Thesaurus:trash, Thesaurus:nonsense",
                    "Don't give me any of that 'what-about' stuff!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A melted mass of turpentine, tallow, etc., with which the masts, sides, and bottom of a ship are smeared for lubrication.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, criminal argot, dated) Money.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stuff (third-person singular simple present stuffs, present participle stuffing, simple past and past participle stuffed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill by packing or crowding something into; to cram with something; to load to excess.",
                  "examples": [
                    "I'm going to stuff this pillow with feathers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill a space with (something) in a compressed manner.",
                  "examples": [
                    "He stuffed his clothes into the closet and shut the door."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cooking) To fill with seasoning.",
                  "examples": [
                    "She stuffed the turkey for Thanksgiving using her secret recipe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To load goods into (a container) for transport.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, used in the passive) To sate.",
                  "examples": [
                    "I’m stuffed after having eaten all that turkey, mashed potatoes and delicious stuffing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(takes a reflexive pronoun) To eat, especially in a hearty or greedy manner.",
                  "examples": [
                    "Synonyms: fill one's face, feed one's face, stuff one's face",
                    "She sits on the sofa all day, watching TV and stuffing herself with cream buns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain, Australia, New Zealand) To break; to destroy.",
                  "examples": [
                    "He skidded off the road and totally stuffed his brand new car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, vulgar, Britain, Australia, New Zealand) To sexually penetrate.",
                  "examples": [
                    "Synonyms: fuck, root, screw",
                    "His wife came home early and found him on the couch stuffing the maid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mildly vulgar, often imperative) Used to contemptuously dismiss or reject something. See also stuff it.",
                  "examples": [
                    "Stuff your stupid rules, I'll do what I like."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To heavily defeat or get the better of.",
                  "examples": [
                    "Mudchester Rovers were stuffed 7-0 in the semi-final.",
                    "They totally stuffed us in that business deal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut off another competitor in a race by disturbing his projected and committed racing line (trajectory) by an abrupt manoeuvre.",
                  "examples": [
                    "I got stuffed by that guy on the supermoto going into that turn, almost causing us to crash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To preserve a dead bird or other animal by filling its skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To obstruct, as any of the organs; to affect with some obstruction in the organs of sense or respiration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form or fashion by packing with the necessary material.",
                  "examples": [
                    "An Eastern king put a judge to death for an iniquitous sentence, and ordered his hide to be stuffed into a cushion, and placed upon the tribunal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To crowd with facts; to cram the mind of; sometimes, to crowd or fill with false or idle tales or fancies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To compress (a file or files) in the StuffIt format, to be unstuffed later.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}