{
  "word": "almond",
  "etymologies": [
    {
      "description": [
        "From Middle English almond, almaund, from Old French almande, amande, from Vulgar Latin *amendla, *amandula, from Latin amygdala, from Ancient Greek ἀμυγδάλη (amugdálē), of uncertain origin. Influenced by amandus and by many French and Spanish words of Arabic origin that began with the Arabic definite article al-."
      ],
      "adjectives": [
        {
          "description": "almond (comparative more almond, superlative most almond)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Brownish, resembling the colour of an almond nut.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "almond (countable and uncountable, plural almonds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A type of tree nut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A small deciduous tree in family Rosaceae, Prunus amygdalus, that produces predominantly sweet almonds.",
                  "examples": [
                    "In early March the almonds are in flower, delicately pink, and there are washes of bright daffodils beneath the orchard trees; you can see women gathering them for market."
                  ]
                }
              ]
            },
            {
              "group": "Other plants that produce almond-like nuts:",
              "entries": [
                {
                  "meaning": "Prunus dulcis var. amara, bitter almond, a variety that only produces bitter fruits",
                  "examples": [
                    "Synonym: bitter almond"
                  ]
                },
                {
                  "meaning": "Prunus japonica, flowering almond, an ornamental shrub in family Rosaceae",
                  "examples": []
                },
                {
                  "meaning": "Prunus andersonii, desert almond, a North American shrub in family Rosaceae",
                  "examples": []
                },
                {
                  "meaning": "Prunus fasciculata, desert range almond or wild almond, North American shrub in family Rosaceae",
                  "examples": []
                },
                {
                  "meaning": "Terminalia catappa, Indian almond or tropical almond, in family Combretaceae",
                  "examples": []
                },
                {
                  "meaning": "Brabejum stellatifolium or bitter almond, in family Proteaceae",
                  "examples": [
                    "Synonym: bitter almond"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The colour of the kernel of an almond without its shell and thin seed coat, a creamy off-white colour.",
                  "examples": [
                    "almond:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The color of an almond still covered by its skin, a shade of brown.",
                  "examples": [
                    "almond:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Flavor or other characteristics of almond.",
                  "examples": [
                    "I can't eat it if it has too much almond in it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything shaped like an almond; specifically, (anatomy, archaic) a tonsil.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}