{
  "word": "maternal",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Late Middle English maternal, maternall, from Middle French maternel (“maternal”) (modern French maternel (“maternal; native”)), or from its etymon Late Latin māternālis (“maternal”), from Latin māternus (“maternal; related to the mother or her side of the family”) + -ālis (suffix forming adjectives of relationship from nouns). Māternus is derived from māter (“mother”) (ultimately from Proto-Indo-European *méh₂tēr (“mother”)) + -rnus (suffix forming adjectives). The English word is cognate with Italian maternale, materno, Portuguese maternal, materno, Spanish maternal, materno.",
        "The noun is derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "maternal (comparative more maternal, superlative most maternal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to a mother; having the characteristics of a mother; motherly.",
                  "examples": [
                    "Antonyms: fatherly, paternal",
                    "His weakness seemed to bring out her maternal instincts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Related through the mother, or her side of the family.",
                  "examples": [
                    "Antonym: paternal",
                    "Toby is my maternal uncle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy, medicine) Derived from the mother as opposed to the foetus during pregnancy.",
                  "examples": [
                    "Antonyms: fetal, foetal"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "maternal (plural maternals) (rare)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, informal) A mother.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person related through the mother, or her side of the family; a maternal relative.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}