{
  "word": "floor",
  "etymologies": [
    {
      "description": [
        "From Middle English flor, flore, from Old English flōr (“floor, pavement, ground, bottom”), from Proto-Germanic *flōrō, *flōrô, *flōraz (“flat surface, floor, plain”), from Proto-Indo-European *pleh₂ros (“floor”), from Proto-Indo-European *pleh₂- (“flat”).",
        "Cognate with West Frisian flier (“floor”), Dutch vloer (“floor”), German Flur (“field, floor, entrance hall”), Swedish flor (“floor of a cow stall”), Irish urlár (“floor”), Scottish Gaelic làr (“floor, ground, earth”), Welsh llawr (“floor, ground”), Latin plānus (“level, flat”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "floor (plural floors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The interior bottom or surface of a house or building; the supporting surface of a room.",
                  "examples": [
                    "The room has a wooden floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(proscribed) Ground (surface of the Earth, as opposed to the sky or water or underground).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lower inside surface of a hollow space.",
                  "examples": [
                    "Many sunken ships rest on the ocean floor.",
                    "The floor of a cave served the refugees as a home.",
                    "The pit floor showed where a ring of post holes had been."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A structure formed of beams, girders, etc, with proper covering, which divides a building horizontally into storeys/stories.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The supporting surface or platform of a structure such as a bridge.",
                  "examples": [
                    "Wooden planks of the old bridge's floor were nearly rotten."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A storey/story of a building.",
                  "examples": [
                    "For years we lived on the third floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a parliament, the part of the house assigned to the members, as opposed to the viewing gallery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hence, the right to speak at a given time during a debate or other public event.",
                  "examples": [
                    "Will the senator from Arizona yield the floor?",
                    "The mayor often gives a lobbyist the floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) That part of the bottom of a vessel on each side of the keelson which is most nearly horizontal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A horizontal, flat ore body; the rock underlying a stratified or nearly horizontal deposit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) The bottom of a pit, pothole or mine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The largest integer less than or equal to a given number.",
                  "examples": [
                    "The floor of 4.5 is 4."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gymnastics) An event performed on a floor-like carpeted surface; floor exercise",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gymnastics) A floor-like carpeted surface for performing gymnastic movements.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A lower limit on the interest rate payable on an otherwise variable-rate loan, used by lenders to defend against falls in interest rates. Opposite of a cap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dance floor.",
                  "examples": [
                    "She's a maniac, maniac on the floor / And she's dancing like she never danced before"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The trading floor of a stock exchange, pit; the area in which business is conducted at a convention or exhibition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The area of a casino where gambling occurs.",
                  "examples": [
                    "2004,  Tim Hatton,  Tock Tock Birds: A Spider in the Web of International Terrorism‎[2], page 284:At each table stood a young, slim, poker-faced croupier serving the punters who anxiously watched the turning of the cards. The next two floors were similar though not quite as spectacular and the stakes were lower."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The area of an establishment where food and drink are served to customers.",
                  "examples": [
                    "1947 March 18,  U.S Government Printing Office,  Proceedings and Debates of the Congress, Eightieth Congress, First Session, page 2206:The conference started as an impromptu session in the coffee shop this morning when waitresses walked off the floor rather than serve four Negro men and women delegates."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "floor (third-person singular simple present floors, present participle flooring, simple past and past participle floored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or furnish with a floor.",
                  "examples": [
                    "floor a house with pine boards"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strike down or lay level with the floor; to knock down.",
                  "examples": [
                    "Sam floored him perpetually, and beat his face to a jelly, without getting a scratch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, dated) To hang (a picture on exhibition) near the base of a wall, where it cannot easily be seen.",
                  "examples": [
                    "Antonym: sky"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(driving, transitive, slang) To push (a pedal) down to the floor, especially to accelerate.",
                  "examples": [
                    "our driver floored the pedal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, transitive) To silence by a conclusive answer or retort.",
                  "examples": [
                    "floor an opponent"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, transitive) To amaze or greatly surprise.",
                  "examples": [
                    "We were floored by his confession."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, transitive) To finish or make an end of.",
                  "examples": [
                    "floor a college examination"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) To set a lower bound.",
                  "examples": [
                    "floored division"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}