{
  "word": "ball",
  "etymologies": [
    {
      "description": [
        "From Middle English bal, ball, balle, from an unattested Old English *beall, *bealla (“round object, ball”) or Old Norse bǫllr (“a ball”), both from Proto-Germanic *balluz, *ballô (“ball”), from Proto-Indo-European *bʰoln- (“bubble”), from Proto-Indo-European *bʰel- (“to blow, inflate, swell”). Cognate with Old Saxon ball, Dutch bal, Old High German bal, ballo (German Ball (“ball”); Ballen (“bale”)). Related forms in Romance are borrowings from Germanic. See also balloon, bale."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ball (countable and uncountable, plural balls)",
          "definitionGroups": [
            {
              "group": "A solid or hollow sphere, or roughly spherical mass.",
              "entries": [
                {
                  "meaning": "A quantity of string, thread, etc., wound into a spherical shape.",
                  "examples": [
                    "a ball of wool; a ball of twine"
                  ]
                }
              ]
            },
            {
              "group": "(mathematics) Homologue or analogue of a disk in the Euclidean plane.",
              "entries": [
                {
                  "meaning": "(mathematics) In 3-dimensional Euclidean space, the volume bounded by a sphere.",
                  "examples": []
                },
                {
                  "meaning": "(mathematics) The set of points in a metric space of any number of dimensions lying within a given distance (the radius) of a given point.",
                  "examples": []
                },
                {
                  "meaning": "(mathematics) The set of points in a topological space lying within some open set containing a given point.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(ballistics, firearms) A solid, spherical nonexplosive missile for a cannon, rifle, gun, etc.",
              "entries": [
                {
                  "meaning": "A jacketed non-expanding bullet, typically of military origin.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, obsolete) Such bullets collectively.",
                  "examples": [
                    "[…]  the Good Old Cause, which, as they seemed to represent it, smelt of Gunpowder and ball  […]"
                  ]
                }
              ]
            },
            {
              "group": "A roundish, protuberant portion of some part of the body.",
              "entries": [
                {
                  "meaning": "(anatomy) The front of the bottom of the foot, just behind the toes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The globe; the earthly sphere.",
                  "examples": [
                    "What, though in solemn Silence, all / Move round the dark terrestrial Ball!"
                  ]
                }
              ]
            },
            {
              "group": "(sports, countable) An object that is the focus of many sports and games, in which it may be thrown, caught, kicked, bounced, rolled, chased, retrieved, hit with an instrument, spun, etc., usually roughly spherical but whose size, weight,   bounciness, colour, etc. differ according to the game",
              "entries": [
                {
                  "meaning": "(uncountable) Any sport or game involving a ball; its play, literally or figuratively.",
                  "examples": [
                    "The children were playing ball on the beach. George played his college ball at Stanford."
                  ]
                },
                {
                  "meaning": "(baseball, countable) A pitch that falls outside of the strike zone.",
                  "examples": []
                },
                {
                  "meaning": "(pinball, countable) An opportunity to launch the pinball into play.",
                  "examples": [
                    "If you get to a million points, you get another ball."
                  ]
                },
                {
                  "meaning": "(cricket, countable) A single delivery by the bowler, six of which make up an over.",
                  "examples": []
                },
                {
                  "meaning": "(soccer, countable) A pass; a kick of the football towards a teammate.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(mildly vulgar, slang, usually in the plural) A testicle.",
              "entries": [
                {
                  "meaning": "(in the plural) Nonsense.",
                  "examples": [
                    "That’s a load of balls, and you know it!"
                  ]
                },
                {
                  "meaning": "(in the plural) Courage.",
                  "examples": [
                    "I doubt he’s got the balls to tell you off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) A leather-covered cushion, fastened to a handle called a ballstock; formerly used by printers for inking the form, then superseded by the roller.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(farriery, historical) A large pill, a form in which medicine was given to horses; a bolus.",
                  "examples": [
                    "The laxative alterative has not this advantage, the aloes, of which it is composed, being extremely bitter, and therefore requiring to be given in the form of a ball."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, countable, uncountable, singular only) One thousand US dollars.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ball (third-person singular simple present balls, present participle balling, simple past and past participle balled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form or wind into a ball.",
                  "examples": [
                    "Synonyms: roll up, wad",
                    "to ball cotton"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metalworking) To heat in a furnace and form into balls for rolling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, vulgar) To have sexual intercourse with.",
                  "examples": [
                    "Synonyms: see Thesaurus:copulate with"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To gather balls which cling to the feet, as of damp snow or clay; to gather into balls.",
                  "examples": [
                    "the horse balls",
                    "the snow balls"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, usually in present participle) To be hip or cool.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(university slang) To reject from a fraternity or sorority. (Short for blackball.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard, slang) To play basketball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To punish by affixing a ball and chain.",
                  "examples": [
                    "any man refusing to do police duty will be punished by the sergts by balling him the rest of the day."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle French bal, from Middle French baler (“to dance”), from Old French baller, from Late Latin ballō (“to dance”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ball (plural balls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A formal dance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A very enjoyable time.",
                  "examples": [
                    "Synonyms: blast, whale of a time",
                    "I had a ball at that concert."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A competitive event among young African-American and Latin American LGBTQ+ people in which prizes are awarded for drag and similar performances. See ball culture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}