{
  "word": "diddle",
  "etymologies": [
    {
      "description": [
        "From dialectal duddle (“to trick”) (16th century), and diddle, duddle (“to totter”) (17th century), perhaps dissimilated from dialectal didder, dither (“to shake, tremble”), from Middle English dideren (“to shake, quiver, tremble”) and Middle English bididren (“to seduce, deceive”), from Old English bedidrian, bedyderian (“to trick, deceive”). Compare also Saterland Frisian diedelje (“to play or sing without a melody”), Dutch bedodden, bedotten (“to trick, fool, diddle”), German Low German Diedeldentjes (“pranks, pranking”). Possibly influenced or reinforced by the name (which itself was probably chosen as an allusion to duddle) of the swindling character Jeremy Diddler in Kenney's Raising the Wind (1803).",
        "Meaning \"to have sex with\" is from the 19th century; \"to masturbate\" is from the 1950s. Compare dildo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "diddle (plural diddles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) In percussion, two consecutive notes played by the same hand (either RR or LL), similar to the drag, except that by convention diddles are played the same speed as the context in which they are placed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, childish) The penis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "diddle (third-person singular simple present diddles, present participle diddling, simple past and past participle diddled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To cheat; to swindle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To molest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To masturbate (especially of women).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To waste time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To totter, like a child learning to walk; to daddle.",
                  "examples": [
                    "And, when his forward strength began to bloom, / To see him diddle up and down the Room!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing, slang) To manipulate a value at the level of individual bits (binary digits).",
                  "examples": [
                    "Coordinate term: twiddle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}