{
  "word": "strike",
  "etymologies": [
    {
      "description": [
        "From Middle English stryken, from Old English strīcan, from Proto-West Germanic *strīkan, from Proto-Germanic *strīkaną, from Proto-Indo-European *streyg- (“to stroke, rub, press”).",
        "Cognate with Dutch strijken, German streichen, Danish stryge, Icelandic strýkja, strýkva."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "strike (plural strikes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A status resulting from a batter swinging and missing a pitch, or not swinging at a pitch when the ball goes in the strike zone, or hitting a foul ball that is not caught.",
                  "examples": [
                    "It was then I knew I had made my third mistake.  Yes, three strikes right across the plate, and as I hollered \"Honey, please wait\" she was gone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bowling) The act of knocking down all ten pins in on the first roll of a frame.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A work stoppage (or otherwise concerted stoppage of an activity) as a form of protest.",
                  "examples": [
                    "Synonym: walkout",
                    "Antonyms: industrial peace, lockout, non-strike, nonstrike"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blow or application of physical force against something.",
                  "examples": [
                    "[…]  and they could hear the rough sound, could hear too the first strikes of rain as though called down by the music."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) In an option contract, the price at which the holder buys or sells if they choose to exercise the option.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An old English measure of corn equal to the bushel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The status of being the batsman that the bowler is bowling at.",
                  "examples": [
                    "The batsmen have crossed, and Dhoni now has the strike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The primary face of a hammer, opposite the peen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) The compass direction of the line of intersection between a rock layer and the surface of the Earth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instrument with a straight edge for levelling a measure of grain, salt, etc., scraping off what is above the level of the top; a strickle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Fullness of measure; the whole amount produced at one time.",
                  "examples": [
                    "a strike of malt; a strike of coin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, by extension) Excellence; quality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An iron pale or standard in a gate or fence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ironworking) A puddler's stirrer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The extortion of money, or the attempt to extort money, by threat of injury; blackmail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The discovery of a source of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The strike plate of a door.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A nibble on the bait by a fish.",
                  "examples": [
                    "I must admit that my focus was divided, which limited my fishing success. I made a few casts, then arranged my inanimate subjects and took photos. When my indicator went down on my first strike, I cleanly missed the hook up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philately) A cancellation postmark.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "strike (third-person singular simple present strikes, present participle striking, simple past struck or (see usage notes) striked or (all obsolete) stroke or strook or strake, past participle struck or (see usage notes) stricken or (obsolete) strucken)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sometimes with out or through) To delete or cross out; to scratch or eliminate.",
                  "examples": [
                    "Please strike the last sentence."
                  ]
                }
              ]
            },
            {
              "group": "(physical) To have a sharp or sudden effect.",
              "entries": [
                {
                  "meaning": "(transitive) To hit.",
                  "examples": [
                    "Strike the door sharply with your foot and see if it comes loose.  A bullet struck him.  The ship struck a reef."
                  ]
                },
                {
                  "meaning": "(transitive) To give, as a blow; to impel, as with a blow; to give a force to; to dash; to cast.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To deliver a quick blow or thrust; to give blows.",
                  "examples": [
                    "A hammer strikes against the bell of a clock."
                  ]
                },
                {
                  "meaning": "(transitive) To manufacture, as by stamping.",
                  "examples": [
                    "We will strike a medal in your honour."
                  ]
                },
                {
                  "meaning": "(intransitive, dated) To run upon a rock or bank; to be stranded; to run aground.",
                  "examples": [
                    "The ship struck in the night."
                  ]
                },
                {
                  "meaning": "(transitive) To cause to sound by one or more beats; to indicate or notify by audible strokes. Of a clock, to announce (an hour of the day), usually by one or more sounds.",
                  "examples": [
                    "The clock struck twelve.  The drums strike up a march."
                  ]
                },
                {
                  "meaning": "(intransitive) To sound by percussion, with blows, or as if with blows.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To cause or produce by a stroke, or suddenly, as by a stroke.",
                  "examples": [
                    "to strike a light"
                  ]
                },
                {
                  "meaning": "(transitive) To cause to ignite by friction.",
                  "examples": [
                    "to strike a match"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To thrust in; to cause to enter or penetrate.",
                  "examples": [
                    "A tree strikes its roots deep."
                  ]
                }
              ]
            },
            {
              "group": "(personal, social) To have a sharp or severe effect.",
              "entries": [
                {
                  "meaning": "(transitive) To punish; to afflict; to smite.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To carry out a violent or illegal action.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To act suddenly, especially in a violent or criminal way.",
                  "examples": [
                    "The bank robber struck on the 2nd and 5th of May."
                  ]
                },
                {
                  "meaning": "(transitive, figurative) To impinge upon.",
                  "examples": [
                    "The first thing to strike my eye was a beautiful pagoda.  Tragedy struck when his brother was killed in a bush fire."
                  ]
                },
                {
                  "meaning": "(intransitive) To stop working as a protest to achieve better working conditions.",
                  "examples": [
                    "Synonym: strike work"
                  ]
                },
                {
                  "meaning": "(transitive, dated) To quit (one's job).",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To impress, seem or appear (to).",
                  "examples": [
                    "Golf has always struck me as a waste of time."
                  ]
                },
                {
                  "meaning": "(transitive) To create an impression.",
                  "examples": [
                    "The news struck a sombre chord."
                  ]
                },
                {
                  "meaning": "(sports) To score a goal.",
                  "examples": []
                },
                {
                  "meaning": "To make a sudden impression upon, as if by a blow; to affect with some strong emotion.",
                  "examples": [
                    "to strike the mind with surprise;  to strike somebody with wonder, alarm, dread, or horror"
                  ]
                },
                {
                  "meaning": "To affect by a sudden impression or impulse.",
                  "examples": [
                    "The proposed plan strikes me favourably.  May the Lord strike down those sinners!  I was struck dumb with astonishment."
                  ]
                },
                {
                  "meaning": "(intransitive, UK, obsolete, slang) To steal or rob; to take forcibly or fraudulently.",
                  "examples": []
                },
                {
                  "meaning": "(slang, archaic) To borrow money from; to make a demand upon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To touch; to act by appulse.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive) To take down, especially in the following contexts.",
              "entries": [
                {
                  "meaning": "(nautical) To haul down or lower (a flag, mast, etc.)",
                  "examples": []
                },
                {
                  "meaning": "(by extension) To capitulate; to signal a surrender by hauling down the colours.",
                  "examples": [
                    "The frigate has struck, sir! We've beaten them, the lily-livers!"
                  ]
                },
                {
                  "meaning": "To dismantle and take away (a theater set; a tent; etc.).",
                  "examples": [
                    "The crew struck the set with a ferocity hitherto unseen, an army more valiant in retreat than advance."
                  ]
                },
                {
                  "meaning": "To unfasten, to loosen (chains, bonds, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To set off on a walk or trip.",
                  "examples": [
                    "They struck off along the river."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass with a quick or strong effect; to dart; to penetrate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To break forth; to commence suddenly; with into.",
                  "examples": [
                    "to strike into reputation;  to strike into a run"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become attached to something; said of the spat of oysters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make and ratify.",
                  "examples": [
                    "to strike a bargain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To level (a measure of grain, salt, etc.) with a straight instrument, scraping off what is above the level of the top.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(masonry) To cut off (a mortar joint, etc.) even with the face of the wall, or inward at a slight angle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hit upon, or light upon, suddenly.",
                  "examples": [
                    "My eye struck a strange word in the text.  They soon struck the trail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sugar-making, obsolete) To lade thickened sugar cane juice from a teache into a cooler.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To stroke or pass lightly; to wave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To advance; to cause to go forward; used only in the past participle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To balance (a ledger or account).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To discover a source of something, often a buried raw material such as ore (especially gold) or crude oil.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}