{
  "word": "stele",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek στήλη (stḗlē, “upright rock; pillar; column”), plural form στῆλαι (stêlai). Doublet of stela."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stele (plural steles or stelai)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) An upright (or formerly upright) slab containing engraved or painted decorations or inscriptions; a stela.",
                  "examples": [
                    "A superior class of members...had their names inscribed upon a marble stélé or column."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology, uncommon) Any carved or engraved surface.",
                  "examples": [
                    "Two large hieroglyphed steles incised upon the face of a projecting mass of boldly rounded cliff."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture, archaeology, obsolete) An acroterion, the decoration on the ridge of an ancient Greek building such as a temple.",
                  "examples": [
                    "Stele. The ornaments on the ridge of a Greek temple, answering to the antefixæ on the summit of the flank entablatures, are thus designated."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From 1886 French stèle, from Ancient Greek στήλη (stḗlē, “upright rock; pillar; column”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stele (plural steles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The central core of a plant's root and stem system, especially including the vascular tissue and developed from the plerome.",
                  "examples": [
                    "The stele may have—in different structures—one to many protoxylem (primitive wood) groups, and is accordingly described as monarch...diarch...triarch...tetrarch...polyarch."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}