{
  "word": "community",
  "etymologies": [
    {
      "description": [
        "From Late Middle English communite, borrowed from Old French communité, comunité, comunete (modern French communauté), from Classical Latin commūnitās (“community; public spirit”), from commūnis (“common, ordinary; of or for the community, public”) + -itās (ultimately from Proto-Indo-European *-teh₂ts (“suffix forming nouns indicating a state of being”)). Commūnis is derived from con- (“prefix indicating a being or bringing together of several objects”) (from cum (“with”), ultimately from Proto-Indo-European *ḱóm (“along, at, next to, with”)) + mūnus (“employment, office, service; burden, duty, obligation”) (ultimately from Proto-Indo-European *mey- (“to change, exchange”)). Ostensibly equivalent to commune +‎ -ity. Doublet of communitas."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "community (countable and uncountable, plural communities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A group sharing common characteristics, such as the same language, law, religion, or tradition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A residential or religious collective; a commune.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, ecology) A group of interdependent organisms inhabiting the same region and interacting with each other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Internet) A group of people interacting by electronic means for educational, professional, social, or other purposes; a virtual community.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The condition of having certain attitudes and interests in common.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) Common enjoyment or possession; participation.",
                  "examples": [
                    "a community of goods"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Common character; likeness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Commonness; frequency.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Wales, countable) A local area within a county or county borough which is the lowest tier of local government, usually represented by a community council or town council, which is generally equivalent to a civil parish in England.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}