{
  "word": "flatlander",
  "etymologies": [
    {
      "description": [
        "From flatland +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flatlander (plural flatlanders)",
          "definitionGroups": [
            {
              "group": "(chiefly derogatory) A person who lives at, lived at, or was raised by someone at a low altitude or from any city. A person not raised in or by someone directly from high mountain areas. (used by those who were born, raised, and are still living in higher altitude non-city or city like areas).",
              "entries": [
                {
                  "meaning": "(Western US, especially in the Rocky Mountains) Anyone from the East; anyone from outside the Rockies.",
                  "examples": [
                    "[...as] Rocky Mountain News termed it. Although some potential visitors would wonder whether it was safe, especially \"flatlanders\" unaccustomed to mountain driving, Trail Ridge provided a perfect roadbed  […]"
                  ]
                },
                {
                  "meaning": "(Appalachia) Any outsider to Appalachia.",
                  "examples": [
                    "Briefly put, the image of the \"poor\" in Appalachia imposed by the poverty workers on these people relies on a faulty model.  […]  In their own efforts to explain the wary attitudes of Appalachian people toward \"flatlanders,\" the poverty workers  […]"
                  ]
                },
                {
                  "meaning": "(northern central Pennsylvania) Anyone from southern Pennsylvania (particularly around Philadelphia), New Jersey, or other low-lying areas outside the Alleghenies / Appalachians.",
                  "examples": []
                },
                {
                  "meaning": "(northern New England) Any non-native, but particularly one from southern New England (including Massachusetts), downstate New York, or New Jersey.",
                  "examples": [
                    "[…]  Abenaki resistance in the eighteenth century than with the westward migration of New Englanders in the nineteenth century, but the Abenakis initiated that now time-honored Vermont tradition of discouraging flatlanders from settling here."
                  ]
                },
                {
                  "meaning": "(Upper Peninsula of Michigan) Anyone from Wisconsin.",
                  "examples": []
                },
                {
                  "meaning": "(Northern Michigan) Anyone from lower Michigan (those below Mt. Pleasant).",
                  "examples": []
                },
                {
                  "meaning": "(lower Michigan) Anyone from Indiana or Ohio.",
                  "examples": []
                },
                {
                  "meaning": "(Wisconsin) Anyone from Illinois.",
                  "examples": []
                },
                {
                  "meaning": "(Canada) Anyone from Saskatchewan.",
                  "examples": []
                },
                {
                  "meaning": "(Georgia) Anyone from Florida.",
                  "examples": []
                },
                {
                  "meaning": "(Central Coast NSW) Anyone from Umina.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) An inhabitant of or observer in a universe with two spatial dimensions.",
                  "examples": [
                    "The perceptual acts of the two-dimensional flatlander are seen by the projective Euclidean eyes as funny, [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling) A flatland BMX rider.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}