{
  "word": "amuse",
  "etymologies": [
    {
      "description": [
        "From Late Middle English *amusen (“to mutter, be astonished, gaze meditatively on”), from Old French amuser (“to stupefy, waste time, be lost in thought”), from a- + muser (“to stare stupidly at, gape, wander, waste time, loiter, think carefully about, attend to”), of uncertain and obscure origin. Cognate with Occitan musa (“idle waiting”), Italian musare (“to gape idly about”). Possibly from Old French *mus (“snout”) from Vulgar Latin *mūsa (“snout”)  — compare Medieval Latin mūsum (“muzzle, snout”) –, from Proto-Germanic *mū- (“muzzle, snout”), from Proto-Indo-European *mū- (“lips, muzzle”). Compare North Frisian müs, mös (“mouth”), German Maul (“muzzle, snout”).",
        "Alternative etymology connects muser and musa with Frankish *muoza (“careful attention, leisure, idleness”), from Proto-Germanic *mōtǭ (“leave, permission”), from Proto-Indo-European *med- (“to acquire, possess, control”).\nThis would make it a cognate of Dutch musen (“to leisure”), Old High German *muoza (“careful attention, leisure, idleness”) and muozōn (“to be idle, have leisure or opportunity”), German Muße (“leisure”). More at empty."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "amuse (third-person singular simple present amuses, present participle amusing, simple past and past participle amused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To entertain or occupy (someone or something) in a pleasant manner; to stir (an individual) with pleasing emotions.",
                  "examples": [
                    "I watch these movies because they amuse me.",
                    "It always amuses me to hear the funny stories why people haven't got a ticket, but I never let them get in without paying."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause laughter or amusement; to be funny.",
                  "examples": [
                    "His jokes rarely fail to amuse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To keep in expectation; to beguile; to delude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To occupy or engage the attention of; to lose in deep thought; to absorb; also, to distract; to bewilder.",
                  "examples": [
                    "Hairs which have most amused me have not been in the Face or Head, but on the Back, and not in Men but Children, as I long ago observed in that Endemial Distemper of little Children in Languedock, called the Morgellons,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}