{
  "word": "devil",
  "etymologies": [
    {
      "description": [
        "From Middle English devil, devel, deovel, from Old English dēofol, dēoful, from earlier dīobul (“devil”), from Latin diabolus, ultimately from Ancient Greek διάβολος (diábolos, “accuser, slanderer”), also as \"Satan\" (in Jewish/Christian usage, translating Biblical Hebrew שָׂטָן‎ (śātān)), from διαβάλλω (diabállō, “to slander”), literally “to throw across”, from διά (diá, “through, across”) + βάλλω (bállō, “throw”). The Old English word was probably adopted under influence of Latin diabolus (itself from the Greek). Other Germanic languages adopted the word independently: compare Saterland Frisian Düüwel (“devil”), West Frisian duvel (“devil”), Dutch duivel, duvel (“devil”), German Low German Düvel (“devil”), German Teufel (“devil”), Danish djævel (“devil”), Swedish djävul (“devil”) (older: djefvul, Old Swedish diævul, Old Norse djǫfull). Doublet of diable, diablo, and diabolus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "devil (plural devils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) An evil creature, the objectification of a hostile and destructive force.",
                  "examples": [
                    "Synonym: demon",
                    "Antonyms: angel, god"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(folklore) A fictional image of a man, usually red or orange in skin color; with a set of horns on his head, a pointed goatee and a long tail and carrying a pitchfork; that represents evil and portrayed to children in an effort to discourage bad behavior.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bad part of the conscience; the opposite to the angel.",
                  "examples": [
                    "Antonyms: angel, conscience",
                    "The devil in me wants to let him suffer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wicked or naughty person, or one who harbors reckless, spirited energy, especially in a mischievous way; usually said of a young child.",
                  "examples": [
                    "Synonyms: imp, rascal, scamp, scoundrel",
                    "Antonyms: angel, saint",
                    "Those two kids are devils in a toy store."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing that is awkward or difficult to understand or do.",
                  "examples": [
                    "Synonyms: bastard, bitch, (UK) bugger, stinker",
                    "Antonyms: (US) cakewalk, piece of cake",
                    "That math problem was a devil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, with an article, as an intensifier) Hell.",
                  "examples": [
                    "Synonyms: (euphemistic) deuce, (euphemistic) dickens, (vulgar) fuck, heck, hell",
                    "What in the devil is that?",
                    "What the devil is that?",
                    "She is having a devil of a time fixing it.",
                    "You can go to the devil for all I care."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, especially a man; used to express a particular opinion of him, usually in the phrases poor devil and lucky devil.",
                  "examples": [
                    "Synonyms: (UK) bugger, (used of a woman) cow, (UK) sod"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A printer's assistant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) A poltergeist that haunts printing works.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dust devil.",
                  "examples": [
                    "The formation of tornados and water-spouts is very probably identical with that of dust-storms and \"devils,\" viz., a sudden disturbance of the vertical equilibrium of the atmosphere, where by an upward rush of air is generated, which rapidly becomes spiral."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal, in compounds) A barren, unproductive and unused area.",
                  "examples": [
                    "devil strip"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) A dish, as a bone with the meat, broiled and excessively peppered; a grill with Cayenne pepper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine for tearing or cutting rags, cotton, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Tasmanian devil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling, slang) An endurance event where riders who fall behind are periodically eliminated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Ellipsis of devil seam.: The seam between garboard strake and the keel (a seam on wooden boats)",
                  "examples": [
                    "Coordinate terms: between the devil and the deep blue sea, devil to pay"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "devil (third-person singular simple present devils, present participle (US) deviling or devilling, simple past and past participle (US) deviled or devilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make like a devil; to invest with the character of a devil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To annoy or bother.",
                  "examples": [
                    "Synonyms: bedevil; see also Thesaurus:annoy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To work as a ‘devil’; to work for a lawyer or writer without fee or recognition.",
                  "examples": [
                    "He did not repeat the scathing estimate of her character by Quatrefages, who at that time spent one afternoon a week devilling at the Consulate, keeping the petty-cash box in order."
                  ]
                }
              ]
            },
            {
              "group": "To prepare (food) with spices, making it spicy:",
              "entries": [
                {
                  "meaning": "To grill with cayenne pepper; to season highly in cooking, as with pepper.",
                  "examples": []
                },
                {
                  "meaning": "To finely grind cooked ham or other meat with spices and condiments.",
                  "examples": []
                },
                {
                  "meaning": "To prepare a sidedish of shelled halved boiled eggs to whose extracted yolks are added condiments and spices, which mixture then is placed into the halved whites to be served.",
                  "examples": [
                    "She's going to devil four dozen eggs for the picnic."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}