{
  "word": "reel",
  "etymologies": [
    {
      "description": [
        "From Middle English reel, reele, from Old English rēol, hrēol, from Proto-West Germanic *hrehul, from Proto-Germanic *hrehulaz, *hrahilaz, from Proto-Indo-European *krek- (“to weave, beat”). Cognate with Icelandic ræl, hræll."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reel (plural reels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shaky or unsteady gait.",
                  "examples": [
                    "Doubtless the present game of chess was developed through just such fiddling; perhaps someone once thought that the drunken reel of the knight was hostile to the essence of Chess."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lively dance originating in Scotland; also, the music of this dance; often called a Scottish (or Scotch) reel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of spool, turning on an axis, on which yarn, threads, lines, or the like, are wound.",
                  "examples": [
                    "a log reel, used by seamen",
                    "an angler's reel",
                    "a garden reel",
                    "nudge the fruit machine reel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture) A device consisting of radial arms with horizontal stats, connected with a harvesting machine, for holding the stalks of grain in position to be cut by the knives.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) A short compilation of sample film work used as a demonstrative resume in the entertainment industry.",
                  "examples": [
                    "Synonym: showreel"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "reel (third-person singular simple present reels, present participle reeling, simple past and past participle reeled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wind on a reel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To spin or revolve repeatedly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To unwind, to bring or acquire something by spinning or winding something else.",
                  "examples": [
                    "He reeled off some tape from the roll and sealed the package."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To walk shakily or unsteadily; to stagger; move as if drunk or not in control of oneself.",
                  "examples": [
                    "Sarah reels a little, nevertheless, under the dog's boisterous greeting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with back) To back off, step away, or sway backwards unsteadily and suddenly.",
                  "examples": [
                    "He reeled back from the punch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make or cause to reel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have a whirling sensation; to be giddy.",
                  "examples": [
                    "In these lengthened vigils his brain often reeled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be in shock.",
                  "examples": [
                    "New Jersey was reeling on Wednesday from the impact of Hurricane Sandy, which has caused catastrophic flooding here in Hoboken and in other New York City suburbs, destroyed entire neighborhoods across the state and wiped out iconic boardwalks in shore towns that had enchanted generations of vacationgoers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To produce a mechanical insect-like song, as in grass warblers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To roll.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}