{
  "word": "gravel",
  "etymologies": [
    {
      "description": [
        "From Middle English gravel, grauel, from Old French gravele, diminutive of grave (“gravel, seashore”), from Medieval Latin grava, ultimately from Proto-Celtic *grāwā (“gravel, pebbles”) (compare Breton groa, Cornish grow, Welsh gro), from Proto-Indo-European *gʰroh₁weh₂, from *gʰreh₁w- (“to grind”). Compare also Old English græfa (“coal”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gravel (usually uncountable, plural gravels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Small fragments of rock, used for laying on the beds of roads and railways, and as ballast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type or grade of small rocks, differentiated by mineral type, size range, or other characteristics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, geology) A particle from 2 to 64 mm in diameter, following the Wentworth scale.",
                  "examples": [
                    "Coordinate terms: (>256 mm) boulder, (64–256 mm) cobble, (62.5 μm – 2 mm) sand, (3.9–62.5 μm) silt, (0.98–3.9 μm) clay, (0.95–977 nm) colloid"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, archaic) Kidney stones; a deposit of small calculous concretions in the kidneys and the urinary or gall bladder; also, the disease of which they are a symptom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lameness in the foot of a horse, usually caused by an abscess.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Inability to see at night; night blindness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, cycling) gravel cycling, a discipline in cycling different from road cycling, mountain biking or cyclocross, for a large part on gravel roads, typically with a dedicated gravel bike",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gravel (third-person singular simple present gravels, present participle gravelling or graveling, simple past and past participle gravelled or graveled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply a layer of gravel to the surface of a road, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To puzzle or annoy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To run (as a ship) upon the gravel or beach; to run aground; to cause to stick fast in gravel or sand.",
                  "examples": [
                    "William Conqerour when he invaded this Iland, chanced at his arrival to be gravelled, and one of his feet stuck so fast in the sand, that he fell to the ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To check or stop; to confound; to perplex.",
                  "examples": [
                    "The physician was so gravelled and amazed withal, that he had not a word more to say."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hurt or lame (a horse) by gravel lodged between the shoe and foot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}