{
  "word": "scrimshaw",
  "etymologies": [
    {
      "description": [
        "The origin of the verb is unknown, but it has possibly been influenced by the surname Scrimshaw. Various etymologies have been proposed (for example, that it derives from scrimshank (“(Britain, military slang) to be idle, to shirk duty”)), but the Oxford English Dictionary does not consider any of them convincing.",
        "The noun is probably derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scrimshaw (countable and uncountable, plural scrimshaws) (originally US, nautical, also attributively)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A small ornamental handicraft created by carving or engraving bone (originally whalebone or whales' teeth), ivory, or other materials, formerly produced by sailors on whaling ships to pass the time on long voyages. [from mid 19th c.]",
                  "examples": [
                    "Synonyms: (archaic) scrimshander, (archaic) scrimshandy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The manufacture of small ornamental handicrafts by carving or engraving bone, ivory, or other materials, formerly by sailors on whaling ships to pass the time on long voyages. [from mid 19th c.]",
                  "examples": [
                    "Synonyms: (obsolete, rare) scrimshander, scrimshandering"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scrimshaw (third-person singular simple present scrimshaws, present participle scrimshawing, simple past and past participle scrimshawed) (originally US, nautical)",
          "definitionGroups": [
            {
              "group": "(transitive) [from mid 19th c.]",
              "entries": [
                {
                  "meaning": "To create (a small ornamental handicraft also called a scrimshaw) by carving or engraving on bone (originally whalebone or whales' teeth), ivory, or other materials.",
                  "examples": []
                },
                {
                  "meaning": "To carve or engrave (bone, ivory, or other materials) with ornamental designs.",
                  "examples": []
                },
                {
                  "meaning": "To carve or engrave (ornamental designs) on bone, ivory, or other materials.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a handicraft of scrimshaw. [from early 19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}