{
  "word": "quake",
  "etymologies": [
    {
      "description": [
        "From Middle English quaken, from Old English cwacian (“to quake, tremble, chatter”), from Proto-Germanic *kwakōną (“to shake, quiver, tremble”), from Proto-Indo-European *gʷog- (“to shake, swing”), related to Old English cweċċan (“to shake, swing, move, vibrate, shake off, give up”) (see quitch),  Dutch kwakkelen (“to ail, be ailing”), German Quackelei (“chattering”), Danish kvakle (“to bungle”), Latin vēxō (“toss, shake violently, jostle, vex”), Irish bogadh (“a move, movement, shift, change”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quake (plural quakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trembling or shaking.",
                  "examples": [
                    "We felt a quake in the apartment every time the train went by."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An earthquake, a trembling of the ground with force.",
                  "examples": [
                    "California is plagued by quakes; there are a few minor ones almost every month."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quake (third-person singular simple present quakes, present participle quaking, simple past and past participle quaked or (archaic) quoke or (obsolete) quook)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To tremble or shake.",
                  "examples": [
                    "I felt the ground quaking beneath my feet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To be in a state of fear, shock, amazement, etc., such as might cause one to tremble.",
                  "examples": [
                    "Turning back, then, toward the basement staircase, she began to grope her way through blinding darkness, but had taken only a few uncertain steps when, of a sudden, she stopped short and for a little stood like a stricken thing, quite motionless save that she quaked to her very marrow in the grasp of a great and enervating fear."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}