{
  "word": "romanize",
  "etymologies": [
    {
      "description": [
        "Roman +‎ -ize"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "romanize (third-person singular simple present romanizes, present participle romanizing, simple past and past participle romanized)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put letters or words written in another writing system into the Latin (Roman) alphabet.",
                  "examples": [
                    "Synonyms: Latinize, transliterate",
                    "The author romanizes Chinese names using the Wade–Giles system rather than the Pinyin system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, historical, usually capitalized) To bring under the authority or influence of Rome.",
                  "examples": [
                    "But since this custome was probably disused before their Invasion or Conquest, and the Romanes confessedly practised the same, since their possession of this Island, the most assured account will fall upon the Romanes, or Brittains Romanized."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, usually capitalized) To make or become Roman in character or style.",
                  "examples": [
                    "[…]  perhaps he has Romaniz’d his Grecian Dames too much, and made them speak sometimes as if they had been born in the City of Rome, and under the Empire of Augustus."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, usually capitalized) To make or become Roman Catholic in religion (by conversion), character or style.",
                  "examples": [
                    "Synonym: Latinize"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To fill with Latin words or idioms.",
                  "examples": [
                    "Synonym: Latinize"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}