{
  "word": "energy",
  "etymologies": [
    {
      "description": [
        "From Middle French énergie, from Late Latin energia, from Ancient Greek ἐνέργεια (enérgeia, “activity”), from ἐνεργός (energós, “active”), from ἐν (en, “in”) + ἔργον (érgon, “work”). The sense in physics was coined by Thomas Young in 1802 in his lectures on Natural Philosophy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "energy (countable and uncountable, plural energies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The impetus behind all motion and all activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The capacity to do work.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A quantity that denotes the ability to do work and is measured in a unit dimensioned in mass × distance²/time² (ML²/T²) or the equivalent.",
                  "examples": [
                    "Units:\nSI: joule (J), kilowatt-hour (kW·h)\nCGS: erg (erg)\nCustomary: foot-pound-force, calorie, kilocalorie (i.e. dietary calories), BTU, liter-atmosphere, ton of TNT"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An intangible, modifiable force (often characterized as either 'positive' or 'negative') believed in some New Age religions to emanate from a person, place or thing and which is (or can be) preserved and transferred in human interactions; shared mood or group habit; a vibe, a feeling, an impression. (Compare aura.)",
                  "examples": [
                    "Reiki, much like prayer, is a personal exercise that can easily convert negative energy into positive energy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Eastern Orthodoxy, theology, often in the plural) The external actions and influences resulting from an entity’s internal nature (ousia) and by which it is made manifest, as opposed to that internal nature itself; the aspect of an entity that can affect the wider world and be apprehended by other beings.",
                  "examples": [
                    "The three Persons of the Holy Trinity have the same opinion, make the same decision, and put forth the same energy and action."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(role-playing games, video games, board games) A measure of how many actions a player or unit can take; in the fantasy genre often called magic points or mana.",
                  "examples": [
                    "Synonym: action points"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}