{
  "word": "inner",
  "etymologies": [
    {
      "description": [
        "From Middle English inner, ynner, ynnere, from Old English innera, comparative of inne (“within”), from Proto-Indo-European *h₁en."
      ],
      "adjectives": [
        {
          "description": "inner (not generally comparable, comparative innermore, superlative innermost)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being or occurring (farther) inside, situated farther in, located (situated) or happening on the inside of something, situated within or farther within contained within something.",
                  "examples": [
                    "inner door;  inner room;  inner sanctum;  inner surface"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Close to the centre, located near or closer to center.",
                  "examples": [
                    "the inner suburbs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Inside or closer to the inside of the body.",
                  "examples": [
                    "inner ear"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of mind or spirit, relating to the mind or spirit, to spiritual or mental processes, mental, spiritual, relating to somebody's private feelings or happening in somebody's mind, existing as an often repressed part of one's psychological makeup.",
                  "examples": [
                    "inner confidence;  inner strength;  inner life;  inner child;  inner artist;  inner peace;  inner light"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not obvious, private, not expressed, not apparent, hidden, less apparent, deeper, obscure; innermost or essential; needing to be examined closely or thought about in order to be seen or understood.",
                  "examples": [
                    "inner meaning;  inner resources;  inner logic"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Privileged, more or most privileged, more or most influential, intimate, exclusive, more important, more intimate, private, secret, confined to an exclusive group, exclusive to a center; especially a center of influence being near a center especially of influence.",
                  "examples": [
                    "inner circle;  inner council"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "inner (plural inners)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inner part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(South Africa) A duvet, excluding the cover.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A forward who plays in or near the center of the field.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A thin glove worn inside batting gloves or wicket-keeping gloves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK politics) One who supports remaining in the European Union.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, firearms) The 2nd circle on a target, between the bull (or bull's eye) and magpie.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}