{
  "word": "prerogative",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman prerogative (noun), from Latin praerogātīva (“previous verdict; claim, privilege”), noun use of the feminine singular of praerogātīvus (“having first vote; privileged”)."
      ],
      "adjectives": [
        {
          "description": "prerogative (comparative more prerogative, superlative most prerogative)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a hereditary or official right or privilege.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characterized by lawless state actions, as in a prerogative state.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "prerogative (plural prerogatives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hereditary or official right or privilege.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A right, or power that is exclusive to a monarch etc, especially such a power to make a decision or judgement.",
                  "examples": [
                    "The military fame of a subject was considered as an insolent invasion of the Imperial prerogative; and it became the duty, as well as interest, of every Roman general, to guard the frontiers intrusted to his care, without aspiring to conquests which might have proved no less fatal to himself than to the vanquished barbarians."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A right, especially when due to one's position or role.",
                  "examples": [
                    "If you choose another approach — that's your prerogative. But the problem is that parents often don't realize they're making the choice  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A property, attribute or ability which gives one a superiority or advantage over others; an inherent advantage or privilege; a talent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}