{
  "word": "proportionality",
  "etymologies": [
    {
      "description": [
        "proportional +‎ -ity, from Latin proportionalitas."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "proportionality (countable and uncountable, plural proportionalities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) the property of being proportional",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) the principle that government action ought to be proportional to the ends achieved (e.g. the military should not be deployed to stop petty vandalism)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) the degree to which something is in proportion",
                  "examples": [
                    "Which is to say that given two line segments, there is not necessarily, in some absolute sense, any third line segment whose length can be said to be the product of the first two line segments. There must be some other line segment whose length serves as the \"unit\".But such a \"unit\" is not necessary when stating that \"the area of a rectangle is the product of the lengths of its sides\", right? That is because the length of a line segment is inversely proportional to the length of its measuring unit, so the product of the lengths of two line segments would be inversely proportional to the square of the length of the measuring unit, but if the product is expressed as a line segment then the length of that line segment is inversely proportional to the length of the measuring unit. There would be a conflict between two differing proportionalities."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}