{
  "word": "traitor",
  "etymologies": [
    {
      "description": [
        "From Middle English traitor, traitour, traytour, from Old French traïtor (French traître), from Latin trāditor. Displaced native Middle English swike from Old English swica (“traitor”), and Middle English proditour and traditour borrowed directly from Latin. The general Old English word denoting \"traitor\" was lǣwa or lǣwend."
      ],
      "adjectives": [
        {
          "description": "traitor (comparative more traitor, superlative most traitor)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Traitorous.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "traitor (plural traitors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who violates an allegiance and betrays their country; someone guilty of treason; one who, in breach of trust, delivers their country to an enemy, or yields up any fort or place entrusted to their defense, or surrenders an army or body of troops to the enemy, unless when vanquished.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who takes arms and levies war against their country; or one who aids an enemy in conquering their country.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) One who betrays any confidence or trust.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "traitor (third-person singular simple present traitors, present participle traitoring, simple past and past participle traitored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act the traitor toward; to betray; to deceive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}