{
  "word": "obligate",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin obligātus, past participle of obligō. Doublet of oblige, taken through French."
      ],
      "adjectives": [
        {
          "description": "obligate (comparative more obligate, superlative most obligate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Requiring a (specified) way of life, habitat, etc.. [from 19th c.]",
                  "examples": [
                    "[A]nalysis of the chemical composition of their bones reveals that they were obligate carnivores."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Indispensable; essential; necessary; obligatory; mandatory; unavoidably invoked.",
                  "examples": [
                    "In addition to being the obligate food source for monarch caterpillars, milkweeds also provide abundant nectar for the adult butterflies.",
                    "In some languages such signaling is optional, whereas in others it is obligate."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "obligate (third-person singular simple present obligates, present participle obligating, simple past and past participle obligated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Canada, US, Scotland) To bind, compel, constrain, or oblige by a social, legal, or moral tie.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Canada, US, Scotland) To cause to be grateful or indebted; to oblige.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Canada, US, Scotland) To commit (money, for example) in order to fulfill an obligation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}