{
  "word": "cow",
  "etymologies": [
    {
      "description": [
        "From Middle English cou, cu, from Old English cū (“cow”), from Proto-West Germanic *kū, from Proto-Germanic *kūz (“cow”), from Proto-Indo-European *gʷṓws (“cow”).",
        "Cognate with Sanskrit गो (go), Ancient Greek βοῦς (boûs), Persian گاو‎ (gâv)), Latvian govs (“cow”), Proto-Slavic *govędo (Serbo-Croatian govedo, Russian говядина (govjadina) (\"beef\")), Scots coo (“cow”), North Frisian ko, kø (“cow”), West Frisian ko (“cow”), Dutch koe (“cow”), Low German Koh, Koo, Kau (“cow”), German Kuh (“cow”), Swedish ko (“cow”), Norwegian ku (“cow”), Icelandic kýr (“cow”), Latin bōs (“ox, bull, cow”), Armenian կով (kov, “cow”).",
        "The plural kine is from Middle English kyne, kyn, kuin, kiin, kien (“cows”), either a double plural of Middle English ky, kye (“cows”), equivalent to modern kye +‎ -en, or inherited from Old English cȳna (“cows', of cows”), genitive plural of cū (“cow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cow (plural cows or cattle or kine) (see usage notes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(strictly) An adult female of the species Bos taurus, especially one that has calved.",
                  "examples": [
                    "Cow milk is the most common form of milk in Europe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(formerly inexact but now common) Any member of the species Bos taurus regardless of sex or age, including bulls and calves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) Beef: the meat of cattle as food.",
                  "examples": [
                    "The only meat I eat is cow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) Any bovines or bovids generally, including yaks, buffalo, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A female member of other large species of mammal, including the bovines, moose, whales, seals, hippos, rhinos, manatees, and elephants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, UK, Australia, informal) A woman considered unpleasant in some way, particularly one considered nasty, stupid, fat, lazy, or difficult.",
                  "examples": [
                    "Greville Preston: You've been set up, you silly cow. Now, don't let me hear any more about this unless you have absolute stand-up-in-court proof it's kosher...Mattie Storin: Pig."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A chock: a wedge or brake used to stop a machine or car.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from Old Norse kúga (“to oppress”) (whence also Norwegian and Danish kue, Swedish kuva); compare Icelandic kúfa (“to set on top”) and Faroese kúga (“to oppress”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "cow (third-person singular simple present cows, present participle cowing, simple past and past participle cowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly in the passive voice) To intimidate; to daunt the spirits or courage of.",
                  "examples": [
                    "Synonyms: see Thesaurus:intimidate",
                    "Con artists are not cowed by the law."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cow (plural cows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) A chimney cowl.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}