{
  "word": "descend",
  "etymologies": [
    {
      "description": [
        "From Middle English decenden, borrowed from Old French descendre, from Latin descendere, past participle descensus (“to come down, go down, fall, sink”), from de- (“down”) + scandere (“to climb”). See scan, scandent. Compare ascend, condescend, transcend."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "descend (third-person singular simple present descends, present participle descending, simple past and past participle descended)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass from a higher to a lower place; to move downwards; to come or go down in any way, for example by falling, flowing, walking, climbing etc.",
                  "examples": [
                    "Rudy felt a gust of fear rise in his chest, and he looked again in the mirror, but the hangar and stable were now beyond the rise, out of sight, he was descending so fast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, poetic) To enter mentally; to retire.",
                  "examples": [
                    "[He] with holiest meditations fed, Into himself descended."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with on or upon) To make an attack, or incursion, as if from a vantage ground; to come suddenly and with violence.",
                  "examples": [
                    "more aircraft descending on us than had done during previous visits from the snoopers in their usual ones and twos."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come down to a lower, less fortunate, humbler, less virtuous, or worse, state or rank; to lower or abase oneself",
                  "examples": [
                    "He descended from his high estate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass from the more general or important to the specific or less important matters to be considered.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come down, as from a source, original, or stock",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to be derived (from)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to proceed by generation or by transmission; to happen by inheritance.",
                  "examples": [
                    "The beggar may descend from a prince.",
                    "A crown descends to the heir."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, astronomy) To move toward the south, or to the southward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, music) To fall in pitch; to pass from a higher to a lower tone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To go down upon or along; to pass from a higher to a lower part of",
                  "examples": [
                    "they descended the river in boats; to descend a ladder"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}