{
  "word": "wood",
  "etymologies": [
    {
      "description": [
        "From Middle English wode, from Old English wudu, widu (“wood, forest, grove; tree; timber”), from Proto-West Germanic *widu, from Proto-Germanic *widuz (“wood”), from Proto-Indo-European *h₁weydʰh₁- (“to separate”).",
        "Cognate with Dutch wede (“wood, twig”), Middle High German wite (“wood”), Danish ved (“wood”), Swedish ved (“firewood”), Icelandic viður (“wood”). Further cognates include Irish fiodh (“a wood, tree”), Irish fid (“tree”) and Welsh gwŷdd (“trees”); all from Proto-Celtic *widus (“wood”). Unrelated to Dutch woud (“forest”), German Wald (“forest”) (see English wold)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wood (countable and uncountable, plural woods)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The substance making up the central part of the trunk and branches of a tree. Used as a material for construction, to manufacture various items, etc. or as fuel.",
                  "examples": [
                    "This table is made of wood.",
                    "There was lots of wood on the beach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The wood of a particular species of tree.",
                  "examples": [
                    "Teak is much used for outdoor benches, but a number of other woods are also suitable, such as ipé, redwood, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, often as plurale tantum) A forested or wooded area.",
                  "examples": [
                    "A wood beyond this moor was viewed as a border area in the seventeenth century.",
                    "He got lost in the woods beyond Seattle.",
                    "Synonyms: woods, forest, woodland; see also Thesaurus:forest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Firewood.",
                  "examples": [
                    "We need more wood for the fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, golf) A type of golf club, the head of which was traditionally made of wood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A woodwind instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) An erection of the penis.",
                  "examples": [
                    "That girl at the strip club gave me wood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, uncountable, slang) Chess pieces.",
                  "examples": [
                    "[…]  White has nothing but a lot of frozen wood on the board while Black operates on the Q-side."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wood (third-person singular simple present woods, present participle wooding, simple past and past participle wooded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or plant with trees.",
                  "examples": [
                    "Their be ii good bellys, a chales, and a few veſtments of litil valure, the ſtuff beſide is not worth xl s. lead ther ys non except in ii gutters the which the p’or hath convey’d in to ye town, but that is ſuar yt is metely wodey’d in hege rowys."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, intransitive) To hide behind trees.",
                  "examples": [
                    "Immediatly, the other boate lying ready with their shot to skoure the place for our hand weapons to lande upon, which was presently done, although the land was very high and steepe, the Savages forthwith quitted the shoare, and betooke themselves to flight: wee landed, and having faire and easily followed for a smal time after them, who had wooded themselves we know not where  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To supply with wood, or get supplies of wood for.",
                  "examples": [
                    "to wood a steamboat or a locomotive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take or get a supply of wood.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English wood, from Old English wōd (“mad, insane”). See the full etymology at wode."
      ],
      "adjectives": [
        {
          "description": "wood (comparative wooder, superlative woodest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Mad, insane, crazed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Back-formation from peckerwood."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wood (plural woods)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, sometimes offensive, chiefly prison slang, of a person) A peckerwood.",
                  "examples": [
                    "He further stated that \"I can't remember ever seeing a wood [white inmate] assault a nigger without being provoked\"."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}