{
  "word": "consort",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French, ultimately from Latin cōnsors."
      ],
      "adjectives": [
        {
          "description": "consort (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(postpositive) of a title, by virtue of one's (living) spouse; often contrasted with regnant and dowager",
                  "examples": [
                    "Queen Elizabeth The Queen Mother took on nearly as many duties as queen dowager, after her husband's death, as she had had when she was queen consort during his reign."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "consort (countable and uncountable, plural consorts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The spouse of a monarch.",
                  "examples": [
                    "The consort of the queen has passed from this troubled sphere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A husband, wife, companion or partner.",
                  "examples": [
                    "the snow-white gander, invariably accompanied by his darker consort"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, sometimes humorous) An informal, usually well-publicized sexual companion of a monarch, aristocrat, celebrity, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ship accompanying another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Association or partnership.",
                  "examples": [
                    "Take it singly, and it carries an air of levity;  […] but, in consort with the rest, you see, has a meaning quite different."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group or company, especially of musicians playing the same type of instrument.",
                  "examples": [
                    "Lord, place me in thy consort."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Harmony of sounds; concert, as of musical instruments.",
                  "examples": [
                    "To make a sad consort, / Come, let us join our mournful song with theirs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "consort (third-person singular simple present consorts, present participle consorting, simple past and past participle consorted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To associate or keep company (with).",
                  "examples": [
                    "If there bee any lasie fellow, any that cannot away with worke, any that would wallow in pleasures, hee is hastie to be priested. And when hee is made one, and has gotten a benefice, he consorts with his neighbour priests, who are altogether given to pleasures; and then both hee, and they, live, not like Christians, but like epicures; drinking, eating, feasting, and revelling, till the cow come home, as the saying is."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be in agreement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}