{
  "word": "tamper",
  "etymologies": [
    {
      "description": [
        "tamp +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tamper (plural tampers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing that tamps.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool used to tamp something down, such as tobacco in a pipe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A railway vehicle used to tamp down ballast.",
                  "examples": [
                    "Synonyms: ballast tamper, tamping machine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An envelope of neutron-reflecting material in a nuclear weapon, used to delay the expansion of the reacting material and thus produce a longer-lasting and more energetic explosion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle French temprer (“to temper, mix, meddle”). Doublet of temper."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "tamper (third-person singular simple present tampers, present participle tampering, simple past and past participle tampered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make unauthorized or improper alterations, sometimes causing deliberate damage; to meddle (with something).",
                  "examples": [
                    "tamper detection",
                    "The alarm had been tampered with and didn’t go off when it should have.",
                    "The election monitors found that a large number of ballots had been tampered with.",
                    "Synonym: interfere"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To try to influence someone, usually in an illegal or devious way; to try to deal (with someone).",
                  "examples": [
                    "Prosecutors argued that he would tamper with witnesses if bail was granted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To meddle (with something) in order to corrupt or pervert it.",
                  "examples": [
                    "[…]  No Art used to inflame him, no Coquetry practised to tempt or intice him, and no Prudery or Affectation to tamper with his Passions; but, on the contrary, artless and unpractised in the Wiles of the World, all her Endeavours, and even all her Wishes, tended only to render herself as un-amiable as she could in his Eyes:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To involve oneself (in a plot, scheme, etc.).",
                  "examples": [
                    "[…]  he was beheaded upon the Defeat of the Conspiracy for having but thus far tampered in it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To attempt to practise or administer something (especially medicine) without sufficient knowledge or qualifications.",
                  "examples": [
                    "Certainly it is a scurvy strong troublesom purge, therefore ill to be tamperd with by the unskilful  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada, in professional sports) To discuss future contracts with a player, against league rules.",
                  "examples": [
                    "Synonym: (UK) tap up"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}