{
  "word": "octothorpe",
  "etymologies": [
    {
      "description": [
        "Origin disputed. There is no known usage before it was adopted by Bell Labs in the late 1960s or early 1970s, so most sources agree it was coined by someone at Bell Labs, but accounts from Bell Labs personnel conflict on the details. The derivation as a traditional term from octo- (“eight”) and thorpe (“field, hamlet or small village”) lacks any evidence, but there is near universal agreement that the first element refers to the number eight. Eight is derived from the number of ends of the lines. Thorpe could be reference to Jim Thorpe, as one proponent was a fan of the athlete.",
        "In the 1970's, my Bell Laboratory's office was next to the office of Don Macpherson, who was the originator of the term \"octothorp\" to describe the \"#\" button on the new Touchtone Dial.  Don was assigned to train the employees of the Mayo Clinic in Minnesota on use of the new features of the first 101ESS customer switching system.  This was the first switch that served phones with a 12 pushbutton dial. The two new buttons were labled \"*\" and \"#\".  To train Mayo Clinic users, Don needed names for these buttons, and called them \"Snowflake\" and \"Octothorp.\"  Don told me that \"octothorp\" was coined to describe an \"eight pointed symbol.\"  While the term \"Snowflake\" quickly disappeared, \"Octothorp\" has survived as one of the names for the \"#\" button along with \"numbersign\", \"pound\", and other names such as the now prominant \"hashtag.\"  To my recollection, Ralph Carlson's account is substantially correct.  The three of us were members of the same group at Bell Labs in Holmdel, NJ, in the late 1970s.  W. W. Hough, Bell Labs engineer retired 12/31/1989"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "octothorpe (plural octothorpes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, typography) The hash or square symbol (#), used mainly in telephony and computing.",
                  "examples": [
                    "Synonyms: hash, hashtag, number sign, octothorn, pound sign"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}