{
  "word": "quitclaim",
  "etymologies": [
    {
      "description": [
        "From Middle English quiteclaymen, from Anglo-Norman quiteclamer, from clamer quite (“to claim quit”). Compare claim quit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quitclaim (plural quitclaims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A renunciation of claims.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A deed that is a renunciation of claims to a parcel of real property and a transfer of one's claims to another.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quitclaim (third-person singular simple present quitclaims, present participle quitclaiming, simple past and past participle quitclaimed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To relinquish or release (a claim, title etc.); to transfer (an interest in property). [from 14th c.]",
                  "examples": [
                    "I hereby give, grant, bargain, sell, release, convey, transfer, and quitclaim all my right, title, interest, benefit, and use whatever in, of, and concerning this chattel, otherwise known as an orange, or citrus orantium, together with all the appurtenances thereto of skin, pulp, pip, rind, seeds, and juice for his own use and behoof, to himself and his heirs in fee simple forever, free from all liens, encumbrances, easements, limitations, restraints, or conditions whatsoever, any and all prior deeds, transfers or other documents whatsoever."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}