{
  "word": "clack",
  "etymologies": [
    {
      "description": [
        "From Middle English clacken, clakken, claken, from Old English *clacian (“to slap, clap, clack”), from Proto-Germanic *klakōną (“to clap, chirp”). Cognate with Scots clake, claik (“to utter cries\", also \"to bedaub, sully with a sticky substance”), Dutch klakken (“to clack, crack”), Low German klakken (“to slap on, daub”), Norwegian klakke (“to clack, strike, knock”), Icelandic klaka (“to twitter, chatter, wrangle, dispute”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clack (plural clacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An abrupt, sharp sound, especially one made by two hard objects colliding repetitively; a sound midway between a click and a clunk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything that causes a clacking noise, such as the clapper of a mill, or a clack valve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chatter; prattle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) The tongue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clack (third-person singular simple present clacks, present participle clacking, simple past and past participle clacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a sudden, sharp noise, or succession of noises; to click.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to make a sudden, sharp noise, or succession of noises; to click.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To chatter or babble; to utter rapidly without consideration.",
                  "examples": [
                    "There is a generation of men, whose unweighed custome makes them clack out any thing their heedleſs fancy ſprings"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) To cut the sheep's mark off (wool), to make the wool weigh less and thus yield less duty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dated form of cluck.",
                  "examples": [
                    "Only the chickens clacked at the Saturday quiet and fat mouse-minded cats licked whiskers on the empty steps."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}