{
  "word": "earwig",
  "etymologies": [
    {
      "description": [
        "From Middle English erwigge, from Old English ēarwicga, from ēare (“ear”) +‎ wicga (“insect”), so named from a popular belief that they crawl into the ear and cause injury."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "earwig (plural earwigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various insects of the order Dermaptera that have elongated bodies, large membranous wings folded underneath short leathery forewings and a pair of large pincers protruding from the rear of the abdomen.",
                  "examples": [
                    "Nuthatches search the crevices of bark at other times during the year for insects, including beetles, earwigs, flies and bugs, and they open galls (swellings in plants) to extract grubs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who whispers insinuations; a secret counsellor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flatterer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "earwig (third-person singular simple present earwigs, present participle earwigging, simple past and past participle earwigged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill the mind of with prejudice by insinuations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attempt to influence by persistent confidential argument or talk.",
                  "examples": [
                    "In the interim, rest assured that Mr. Atherstone is by no means your friend, for he was perpetually earwigging poor Sir Rowland."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, UK, slang) To eavesdrop.",
                  "examples": [
                    "The nameless earwigging writer scrawled in his notebook that “MS and CT also considered that such low life would have a greater pride and satisfaction in life if they could themselves be cooked and served still bleating to rich diners.″"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, slang) To eavesdrop on.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}