{
  "word": "gall",
  "etymologies": [
    {
      "description": [
        "From Middle English galle, from Old English galla, ġealla, from Proto-West Germanic *gallā, from Proto-Germanic *gallǭ.",
        "The figurative senses (e.g., impudence, brazenness, chutzpah) are related to the literal sense (i.e., bile) via the lasting linguocultural effects of humorism, which governed Western medicine for many centuries before the advent of scientific medicine.",
        "Related to Dutch gal, German Galle, Swedish galle, galla, Ancient Greek χολή (kholḗ). Also remotely related with yellow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gall (countable and uncountable, plural galls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The gall bladder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A feeling of exasperation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Impudence or brazenness; temerity, chutzpah.",
                  "examples": [
                    "“Durn ye!” he cried. “I’ll lam ye! Get offen here. I knows ye. Yer one o’ that gang o’ bums that come here last night, an’ now you got the gall to come back beggin’ for food, eh? I’ll lam ye!” and he raised the gun to his shoulder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A sore on a horse caused by an ill-fitted or ill-adjusted saddle; a saddle sore.",
                  "examples": [
                    "Riding a horse with bruised or broken skin can cause a gall, which frequently results in the white saddle marks seen on the withers and backs of some horses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A pit on a surface being cut caused by the friction between the two surfaces exceeding the bond of the material at a point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy, obsolete, uncountable) Bile, especially that of an animal; the greenish, profoundly bitter-tasting fluid found in bile ducts and gall bladders, structures associated with the liver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Great misery or physical suffering, likened to the bitterest-tasting of substances.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, obsolete, countable) A sore or open wound caused by chafing, which may become infected, as with a blister.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gall (third-person singular simple present galls, present participle galling, simple past and past participle galled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bother or trouble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To harass, to harry, often with the intent to cause injury.",
                  "examples": [
                    "The disposition for these detachments is as follows – Morgans corps, to gain the enemy’s right flank; Maxwells brigade to hang on their left. Brigadier Genl. Scott is now marching with a very respectable detachment destined to gall the enemys left flank and rear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To chafe, to rub or subject to friction; to create a sore on the skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To exasperate.",
                  "examples": [
                    "Metrinko was hungry, but he was galled by how self-congratulatory his captors seemed, how generous and noble and proudly Islamic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause pitting on a surface being cut from the friction between the two surfaces exceeding the bond of the material at a point.",
                  "examples": [
                    "Improper cooling and a dull milling blade on titanium can gall the surface."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To scoff; to jeer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French galle, from Latin galla (“oak-apple”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gall (plural galls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, phytopathology) A blister or tumor-like growth found on the surface of plants, caused by burrowing of insect larvae into the living tissues, especially that of the common oak gall wasp Cynips quercusfolii.",
                  "examples": [
                    "Even so, Redi retained a belief that in certain other cases—the origin of parasites inside the human or animal body or of grubs inside of oak galls—there must be spontaneous generation. Bit by bit the evidence grew against such views. In 1670 Jan Swammerdam, painstaking student of the insect’s life cycle, suggested that the grubs in galls were enclosed in them for the sake of nourishment and must come from insects that had inserted their semen or their eggs into the plants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A bump-like imperfection resembling a gall.",
                  "examples": [
                    "But first for your Line. First note, that you are to take care that your hair be round and clear, and free from galls, or scabs, or frets: for a well- chosen, even, clear, round hair, of a kind of glass-colour, will prove as strong as three uneven scabby hairs that are ill-chosen, and full of galls or unevenness. You shall seldom find a black hair but it is round, but many white are flat and uneven; therefore, if you get a lock of right, round, clear, glass-colour hair, make much of it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gall (third-person singular simple present galls, present participle galling, simple past and past participle galled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To impregnate with a decoction of gallnuts in dyeing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}