{
  "word": "cony",
  "etymologies": [
    {
      "description": [
        "From Middle English cony, back formation from conies (plural) (also as Middle English conyng, conig, konyn, etc.), from Anglo-Norman conis, the plural of conil, from Vulgar Latin *cuniclus (“rabbit”), from Latin cuniculus (“rabbit”), from Ancient Greek κύνικλος (kúniklos). The original pronunciation was /ˈkʌni/ (for the spelling, compare honey and money), but the similarity to cunt (and particularly homophony with cunny) led through taboo avoidance both to the word's displacement in the main by rabbit and bunny and to the spelling pronunciation /ˈkəʊni/ becoming standard. Compare Galician coello, Portuguese coelho, Italian coniglio, and Spanish conejo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cony (plural conies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rabbit, especially the European rabbit, Oryctolagus cuniculus (formerly known as Lepus cuniculus).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) Rabbit fur.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Locally for other rabbit-like or hyrax-like animals, such as the Cape hyrax (das, dassie) or the pika (Ochotona princeps, formerly Lagomys princeps).",
              "entries": [
                {
                  "meaning": "Used in the Old Testament as a translation of Hebrew שָׁפָן‎ (shafán), thought to be the rock hyrax (Procavia capensis, syn. Hyrax syriacus).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A simpleton; one who may be taken in by a cony-catcher.",
                  "examples": [
                    "It is a most simple animal; whence are derived our usual phrases of cony and cony catcher."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An edible West Indian fish, a grouper given in different sources as: Epinephelus apua, the hind of Bermuda; nigger-fish, Epinephelus punctatus; Cephalopholis fulva.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Several species of tropical west Atlantic groupers of family Epinephelidae, such as the mutton hamlet, graysby, Cuban coney, and rooster hind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) The burbot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A woman; a sweetheart.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}