{
  "word": "hill",
  "etymologies": [
    {
      "description": [
        "From Middle English hil, from Old English hyll (“hill”), from Proto-Germanic *hulliz (“hill”), from Proto-Indo-European *kl̥Hnís (“top, hill, rock”) (compare also Proto-Germanic *halluz (“stone, rock”)).",
        "Cognate with Middle Dutch hille, hulle (“hill”), Low German hull (“hill”), Old Norse hóll (“hill”), Latin collis (“hill”), Lithuanian kalnas, Albanian kallumë (“big pile, tall heap”), Russian холм (xolm, “hill”), Old English holm (“rising land, island”). More at holm."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hill (plural hills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An elevated landmass smaller than a mountain.",
                  "examples": [
                    "The park is sheltered from the wind by a hill to the east."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sloping road.",
                  "examples": [
                    "You need to pick up speed to get up the hill that's coming up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A heap of earth surrounding a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A single cluster or group of plants growing close together, and having the earth heaped up about them.",
                  "examples": [
                    "a hill of corn or potatoes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The pitcher’s mound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The raised portion of the surface of a vinyl record.",
                  "examples": [
                    "Antonym: dale"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hill (third-person singular simple present hills, present participle hilling, simple past and past participle hilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form into a heap or mound.",
                  "examples": [
                    "Spread, heaped up, stacked with good things; and redolent of citrons and grapes, hilling round tall vases of wine;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To heap or draw earth around plants.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}