{
  "word": "boy",
  "etymologies": [
    {
      "description": [
        "From Middle English boy, boye (“servant, commoner, knave, boy”), from Old English *bōia (“boy”), from Proto-West Germanic *bōjō, from Proto-Germanic *bōjô (“younger brother, young male relation”), from Proto-Germanic *bō- (“brother, close male relation”), from Proto-Indo-European *bʰā-, *bʰāt- (“father, elder brother, brother”).",
        "Cognate with Scots boy (“boy”), West Frisian boai (“boy”), Middle Dutch boi, booi (“boy”), Low German Boi (“boy”), and probably to the Old English proper name Bōia. Also related to West Flemish boe (“brother”), Norwegian dialectal boa (“brother”), Dutch boef (“rogue, knave”), Bavarian Bua (“young boy, lad”), German Bube (\"boy; knave; jack\"; > English bub), Icelandic bófi (“rogue, crook, bandit, knave”). See also bully."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boy (countable and uncountable, plural boys)",
          "definitionGroups": [
            {
              "group": "A young male. [from 15th c.]",
              "entries": [
                {
                  "meaning": "(particularly) A male child or adolescent, as distinguished from infants or adults.",
                  "examples": [
                    "\"He is not quite a baby, Alfred,\" said Ellen, \"though he is only a big stupid boy. We have made him miserable enough. Let us leave him alone.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(diminutive) A son of any age.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(endearing, diminutive) A male of any age, particularly one rather younger than the speaker. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A male of low station, (especially as pejorative) a worthless male, a wretch; a mean and dishonest male, a knave. [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(now rare and usually offensive outside some Commonwealth nations) A male servant, slave, assistant, or employee, [from 14th c.] particularly:",
              "entries": [
                {
                  "meaning": "A younger such worker.",
                  "examples": [
                    "I resolved to continue in the Cave, with my two Servants, my Maid, and a Boy, whom I had brought from France."
                  ]
                },
                {
                  "meaning": "(historical or offensive) A non-white male servant regardless of age, [from 17th c.] particularly as a form of address.",
                  "examples": [
                    "My Boy Stephen Grauener."
                  ]
                },
                {
                  "meaning": "(obsolete) A male camp follower.",
                  "examples": [
                    "If any water be rough and boysterous, or the chanell verye broade, it manye times drowneth the carriages and the boyes and nowe and then slouthfull and lyther souldiours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now offensive) Any non-white male, regardless of age. [from 19th c.]",
                  "examples": [
                    "A Hottentot... expects to be called by his name if addressed by any one who knows it; and by those to whom it is not known he expects to be called Hottentot... or boy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male animal, especially, in affectionate address, a male dog. [from 15th c.]",
                  "examples": [
                    "C'mere, boy! Good boy! Who's a good boy?",
                    "Are you getting a boy cat or a girl cat?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, military) A former low rank of various armed services; a holder of this rank.",
                  "examples": [
                    "Wounded... 1 Boy, 1st class, severely."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, uncountable) Heroin. [from 20th c.]",
                  "examples": [
                    "[…]  drove by a corner, saw what I thought—no, what I knew—were dealers and asked if they knew where I could get some boy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(somewhat childish) A male (tree, gene, etc).",
                  "examples": [
                    "Are there “boy” trees and “girl” trees? Yes. A number of species, among them the yew, holly and date-bearing palm, have their male and female flowers on different trees. The male holly, for instance, must be planted fairly close to the female ..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "boy (third-person singular simple present boys, present participle boying, simple past and past participle boyed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To act as a boy (in allusion to the former practice of boys acting women's parts on the stage).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}