{
  "word": "debacle",
  "etymologies": [
    {
      "description": [
        "From French débâcle, from débâcler (“to unbar; unleash”) from prefix dé- (“un-”) + bâcler (“to dash, bind, bar, block”) [perhaps from unattested Middle French and Old French *bâcler, *bacler (“to hold in place, prop a door or window open”)], from Vulgar Latin *bacculare, from Latin baculum (“rod, staff used for support”), from Proto-Indo-European *bak-.",
        "Also attested in Old French desbacler (“to clear a harbour by getting ships unloaded to make room for incoming ships with lading”) and in Occitan baclar (“to close”).",
        "The hypothesis of a derivation from Middle Dutch bakkelen (“to freeze artificially, lock in place”), from bakken (“to stick, stick hard, glue together”) has been discredited by the lack of attestation of bakkelen in Middle Dutch and by it having only the meaning \"freeze superficially\" in Dutch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "debacle (plural debacles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An event or enterprise that ends suddenly and disastrously, often with humiliating consequences. [from early 19th c.]",
                  "examples": [
                    "The BP Prudhoe Bay debacle [the Prudhoe Bay oil spill] thus provides but the latest in a long line of reasons why leasing this region of the NPR-A is a bad idea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecology) A breaking up of a natural dam, usually made of ice, by a river and the ensuing rush of water.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}