{
  "word": "cestus",
  "etymologies": [
    {
      "description": [
        "From Latin caestus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cestus (plural cestuses or cestus or cesti)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A leather fighting glove, frequently weighted with metal.",
                  "examples": [
                    "It is against Massachusetts law to carry on your person or in a vehicle any stiletto, dagger, ballistic knife, dirk knife, doubl-edged knife, switchblade knife, slungshot, blowgun, blackjack, metallic knuckles, nunchaku (also referred to as “klackers” or “kung fu sticks” in Massachusetts law), shuriken or similar pointed star-like objects intended to injure a person when thrown, armband with metallic spikes, points or studs, cestus weighted with metal or other substance and worn on the hand, manriki gusari or similar length of chain with weighted ends, or billy club."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin cestus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cestus (plural cesti)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A girdle, especially that of Aphrodite (or Venus) which gave the wearer the power to excite love.",
                  "examples": [
                    "With pasture slopes, and flocks just visible;",
                    "Then, further still, soft wavy wastes of forest,",
                    "In all the varied tints of sylvan verdure,",
                    "Descending to the plain; then, wide and boundless,",
                    "The plain itself, with towns and cultured tracts,",
                    "And its fair river gleaming in the light,",
                    "With all its sweepy windings, seen and lost,",
                    "And seen again, till through the pale grey tint",
                    "Of distant space, it seem'd a loosen'd cestus",
                    "From virgin's tunic blown; and still beyond,",
                    "The earth's extended vastness from the sight",
                    "Wore like the boundless ocean."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}