{
  "word": "sear",
  "etymologies": [
    {
      "description": [
        "From Middle English sere, seer, seere, from Old English sēar, sīere (“dry, sere, sear, withered, barren”), from Proto-West Germanic *sauʀ(ī), from Proto-Germanic *sauzaz (“dry”), from Proto-Indo-European *sh₂ews- (“dry, parched”) (also reconstructed as *h₂sews-).",
        "Cognate with Dutch zoor (“dry, rough”), Low German soor (“dry”), German sohr (“parched, dried up”), dialectal Norwegian søyr (“the desiccation and death of a tree”), Lithuanian saũsas (“dry”), Homeric Ancient Greek αὖος (aûos, “dry”). Doublet of sere and sare."
      ],
      "adjectives": [
        {
          "description": "sear (comparative searer or more sear, superlative searest or most sear)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dry; withered, especially of vegetation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English seren, seeren, from Old English sēarian (“to become sere, to grow sear, wither, pine away”), from Proto-West Germanic *sauʀēn (“to dry out, become dry”); compare also Proto-Germanic *sauzijaną (“to make dry”). Related to Old High German sōrēn (“to wither, wilt”). See Etymology 1 for more cognates. The use in firearms terminology may relate to French serrer (“to grip”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sear (plural sears)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A scar produced by searing",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Part of a gun that retards the hammer until the trigger is pulled.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sear (third-person singular simple present sears, present participle searing, simple past and past participle seared)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To char, scorch, or burn the surface of (something) with a hot instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wither; to dry up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To make callous or insensible.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To mark permanently, as if by burning.",
                  "examples": [
                    "The events of that day were seared into her memory."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}