{
  "word": "region",
  "etymologies": [
    {
      "description": [
        "From Middle English regioun, from Anglo-Norman regiun, from Latin regiō, from regō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "region (plural regions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any considerable and connected part of a space or surface; specifically, a tract of land or sea of considerable but indefinite extent; a country; a district; in a broad sense, a place without special reference to location or extent but viewed as an entity for geographical, social or cultural reasons.",
                  "examples": [
                    "the equatorial regions",
                    "the temperate regions",
                    "the polar regions",
                    "the upper regions of the atmosphere"
                  ]
                }
              ]
            },
            {
              "group": "An administrative subdivision of a city, a territory, a country.",
              "entries": [
                {
                  "meaning": "(historical) Such a division of the city of Rome and of the territory about Rome, of which the number varied at different times; a district, quarter, or ward.",
                  "examples": []
                },
                {
                  "meaning": "An administrative subdivision of the European Union.",
                  "examples": []
                },
                {
                  "meaning": "A subnational region of Chile; equivalent to province.",
                  "examples": []
                },
                {
                  "meaning": "(Ontario) Ellipsis of regional municipality; a county-level municipality.",
                  "examples": []
                },
                {
                  "meaning": "Ellipsis of administrative region.",
                  "examples": []
                },
                {
                  "meaning": "A subprovincial region of Quebec; the primary level subdivision; a prefecture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The inhabitants of a region or district of a country.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A place in or a part of the body in any way indicated.",
                  "examples": [
                    "the abdominal regions"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Place; rank; station; dignity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The space from the earth's surface out to the orbit of the moon: properly called the elemental region.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}