{
  "word": "kern",
  "etymologies": [
    {
      "description": [
        "From Middle English curn, cooren, variant forms of Middle English corn, see English corn and also Dutch kern, Old High German kerno, cherno, Middle High German kerne, kern, German Kern (“core, kernel”), Old Norse kjarni, Icelandic kjarni, Danish kjerne, Swedish kärna (“core, kernel”); see also kernel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kern (countable and uncountable, plural kerns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialect) A corn; grain; kernel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialect) The last handful or sheaf reaped at the harvest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialect) The harvest home.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialect) A doll or figurine raised in celebration of a successful harvest; kern-baby.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French carne (“corner; projecting angle; quill of a pen”), from Latin cardinem (“hinge”) or from Etymology 1. The verb is a back-formation from kerned, which is from the noun. Doublet of cardo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kern (plural kerns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hot metal printing, typography) Any part of a letter which extends into the space used by another letter.",
                  "examples": [
                    "A few types have a portion of the face letter projecting over the body, as in the letter f ; this projection is called the kern, and in combination with other letters the projecting part generally extends over the next letter, as in fe. In those combinations, wherein the kern would come in contact with another letter, compound types are cast, as in the case of ff, fi, fl, ffi, ffl."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "kern (third-person singular simple present kerns, present participle kerning, simple past and past participle kerned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography, chiefly proportional font printing) To adjust the horizontal space between selected pairs of letters (characters or glyphs); to perform such adjustments to a portion of text, according to preset rules.",
                  "examples": [
                    "If you need to kern anything beyond the most commonly used pairs, you can use applications software such as Adobe PageMaker to customize pairs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English kerne, from Middle Irish ceithern. Doublet of quaternion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kern (plural kerns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or historical) A light-armed foot soldier of the ancient militia of Ireland and Scotland; in archaic contexts often used as a term of contempt.",
                  "examples": [
                    "There he entertained Shan O'Neil, a famous, turbulent chief from Ireland, who late in this year visited Elizabeth's Court, where his train of kerns and gallowglasses, clothed in linen kilts dyed with saffron, made a great impression."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or Ireland) A boor; a low person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, UK) An idler; a vagabond.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kern (plural kerns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of quern",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kern (plural kerns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A churn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}