{
  "word": "honeycomb",
  "etymologies": [
    {
      "description": [
        "From Middle English hony combe, from Old English huniġcamb; equivalent to honey +‎ comb. The Oxford English Dictionary (s.v. \"honeycomb\") suggests that the arrangement of plates of wax (with honey) \"hanging parallel to each other from the roof of the hive suggests a comb with its teeth\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "honeycomb (plural honeycombs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A structure of hexagonal cells made by bees primarily of wax, to hold their larvae and for storing the honey to feed the larvae and to feed themselves during winter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any structure resembling a honeycomb.",
                  "examples": [
                    "The wood porch was a honeycomb of termite tunnels before we replaced it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) Voids left in concrete resulting from failure of the mortar to effectively fill the spaces among coarse aggregate particles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) Manufactured material used to manufacture light, stiff structural components using a sandwich design.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(solar cell) The texture of the surface of a solar cell, intended to increase its surface area and capture more sunlight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A space-filling packing of polytopes in 3- or higher-dimensional space.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "honeycomb (third-person singular simple present honeycombs, present participle honeycombing, simple past and past participle honeycombed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To riddle something with holes, especially in such a pattern.",
                  "examples": [
                    "Termites will honeycomb a porch made of untreated pine."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}