{
  "word": "console",
  "etymologies": [
    {
      "description": [
        "Borrowed from French console (“bracket”, noun), from consoler (“to console, to comfort”, verb).",
        "Sense of “bracket” either due to a bracket alleviating the load, or due to brackets being decorated with the Christian figure of a consolateur (“consoler”), itself perhaps a pun on the first sense (alleviating load).",
        "Originally used for the bracket itself, then for wall-mounted tables (mounted with a bracket), then for free-standing tables placed against a wall. Use for control system dates at least to 1880s for an “organ console”; use for electrical or electronic control systems dates at least to 1930s in radio, television, and system control, particularly as “mixer console” or “control console”, attached to an equipment rack. This was popularized in computers by mainframes such as the IBM 704 (1954) in terms such as “operator’s console” or “console typewriter”, and then generalized to any attached equipment, particularly for user interaction. The automotive sense harks back to earlier use as “support”."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "console (plural consoles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stand-alone cabinet designed to stand on the floor; especially, one integrated with home entertainment equipment, such as a TV or stereo system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A desk-like cabinet, table, or stand upon which controls, instruments, and displays are mounted.",
                  "examples": []
                }
              ]
            },
            {
              "group": "An instrument with displays and an input device that is used to monitor and control an electronic system.",
              "entries": [
                {
                  "meaning": "The keyboard and screen of a computer or other electronic device.",
                  "examples": []
                },
                {
                  "meaning": "(video games) A consumer device dedicated to playing video games, with the ability to change games.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) A storage tray or container mounted between the seats of an automobile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) An ornamental member jutting out of a wall to carry a superincumbent weight, often S-shaped.",
                  "examples": [
                    "Coordinate term: corbel",
                    "Hyponym: ancon",
                    "Hypernym: bracket"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French consoler, from Latin cōnsōlor (“I console, I offer solace”), root from Proto-Indo-European *selh₂- (“mercy, comfort”) (whence also solace)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "console (third-person singular simple present consoles, present participle consoling, simple past and past participle consoled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To comfort (someone) in a time of grief, disappointment, etc.",
                  "examples": [
                    "I am much consoled by the reflection that the religion of Christ has been attacked in vain by all the wits and philosophers, and its triumph has been complete."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}