{
  "word": "excess",
  "etymologies": [
    {
      "description": [
        "From Middle English exces (“excess, ecstasy”), from Old French exces, from Latin excessus (“a going out, loss of self-possession”), from excedere, excessum (“to go out, go beyond”). See exceed."
      ],
      "adjectives": [
        {
          "description": "excess (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "More than is normal, necessary or specified.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "excess (countable and uncountable, plural excesses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of surpassing or going beyond a limit; the state of being beyond sufficiency, necessity, or duty; more than what is usual or proper.",
                  "examples": [
                    "The excess of heavy water was given away to the neighbouring country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The degree or amount by which one thing or number exceeds another; remainder.",
                  "examples": [
                    "The difference between two numbers is the excess of one over the other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of eating or drinking more than enough.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) Spherical excess, the amount by which the sum of the three angles of a spherical triangle exceeds two right angles. The spherical excess is proportional to the area of the triangle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, insurance) A condition on an insurance policy by which the insured pays for a part of the claim.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "excess (third-person singular simple present excesses, present participle excessing, simple past and past participle excessed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, transitive) To declare (an employee) surplus to requirements, such that he or she might not be given work.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}