{
  "word": "runner",
  "etymologies": [
    {
      "description": [
        "From Middle English rennere, rynner, urnare, equivalent to run +‎ -er. Cognate with Old Norse rennari (“runner; messenger”). Displaced earlier Middle English runel (“runner”), from Old English rynel (“runner”; also “messenger, courier”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "runner (plural runners)",
          "definitionGroups": [
            {
              "group": "Agent noun of run; one who runs.",
              "entries": [
                {
                  "meaning": "A person who moves, on foot, at a fast pace, especially an athlete.",
                  "examples": [
                    "The first runner to cross the finish line wins the race."
                  ]
                },
                {
                  "meaning": "Any entrant, person or animal (especially a horse), for a race or any competition; a candidate for an election.",
                  "examples": [
                    "The mare is the stables' runner for the 5.15 race at Epsom.",
                    "The judge said she would not be a runner in the upcoming elections."
                  ]
                },
                {
                  "meaning": "Somebody who controls or manages (e.g. a system).",
                  "examples": [
                    "[…]  at least half of which would be put into the pool for the winner, the rest kept for the runners of the system to cover costs and more than likely make a fair profit."
                  ]
                },
                {
                  "meaning": "A person or vessel who runs blockades or engages in smuggling. (Especially used in combination, e.g. gunrunner).",
                  "examples": [
                    "The modus operandi used by the idol and antique runners is to order consignments of fakes."
                  ]
                },
                {
                  "meaning": "(cricket) A player who runs for a batsman who is too injured to run; he is dressed exactly as the injured batsman, and carries a bat.",
                  "examples": []
                },
                {
                  "meaning": "(baseball, softball) A baserunner.",
                  "examples": [
                    "The runner was out at second."
                  ]
                },
                {
                  "meaning": "(Australian rules football) A person (from one or the other team) who runs out onto the field during the game to take verbal instructions from the coach to the players. A runner mustn't interfere with play, and may have to wear an identifying shirt to make clear his or her purpose on the field.",
                  "examples": []
                },
                {
                  "meaning": "Anyone sent on an errand or with communications, especially for a bank (or, historically, a foot soldier responsible for carrying messages during war).",
                  "examples": []
                },
                {
                  "meaning": "A person hired by a gambling establishment to locate potential customers and bring them in.",
                  "examples": [
                    "Synonyms: lugger, picker-up, roper, steerer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, usually in the phrase 'do a runner') A quick escape away from a scene.",
                  "examples": [
                    "He did a runner after robbing the drugstore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who runs away; a deserter or escapee.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Canada, Ireland, Scotland) A type of soft-soled shoe originally intended for runners.",
                  "examples": [
                    "Synonyms: sneaker, trainer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Part of a shoe that is stitched to the bottom of the upper so it can be glued to the sole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of an apparatus that moves quickly.",
                  "examples": [
                    "After the cycle completes, the runner travels back quickly to be in place for the next cycle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "A mechanical part intended to guide or aid something else to move (using wheels or sliding).",
              "entries": [
                {
                  "meaning": "A smooth strip on which a sledge runs.",
                  "examples": []
                },
                {
                  "meaning": "The blade of an ice skate.",
                  "examples": []
                },
                {
                  "meaning": "The channel or strip on which a drawer is opened and closed.",
                  "examples": []
                },
                {
                  "meaning": "Part of a mechanism which allows something to be pulled out for maintenance.",
                  "examples": []
                },
                {
                  "meaning": "The curved base of a rocking chair.",
                  "examples": [
                    "Synonym: rocker"
                  ]
                },
                {
                  "meaning": "In saddlery, a loop of metal through which a rein is passed.",
                  "examples": []
                },
                {
                  "meaning": "In molding, a channel cut in a mold.",
                  "examples": []
                },
                {
                  "meaning": "The rotating-stone of a grinding-mill.",
                  "examples": []
                },
                {
                  "meaning": "The movable piece to which the ribs of an umbrella are attached.",
                  "examples": []
                },
                {
                  "meaning": "A tool in which lenses are fastened for polishing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An automobile; a working or driveable automobile.",
                  "examples": [
                    "The car salesman told me that the used Volvo was a nice little runner.",
                    "Is that old Mercedes on the forecourt a runner? / No, it has no gearbox."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strip of fabric used to decorate or protect a table or dressing table.",
                  "examples": [
                    "The red runner makes the table so festive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, narrow carpet for a high traffic area such as a hall or stairs.",
                  "examples": [
                    "How about we put down a clear runner in the front hall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A part of a cigarette that is burning unevenly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A long stolon sent out by a plant (such as strawberry), in order to root new plantlets, or a plant that propagates by using such runners.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) A short sling with a carabiner on either end, used to link the climbing rope to a bolt or other protection such as a nut or friend.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) A competitor in a poker tournament.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A restaurant employee responsible for taking food from the kitchens to the tables.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A leaping food fish (Elagatis pinnulatis) of Florida and the West Indies; the skipjack, shoemaker, or yellowtail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports slang) An employee of a sports agent who tries to recruit possible player clients for the agent.",
                  "examples": [
                    "This week hundreds of NFL agents gathered to hear an honorable man talk about a noble pipedream. It was a discussion about a significant step to end one of the cornerstones of corruption in college football: runners. Not the backs getting their 40 times tested at the scouting combine but the slimeball trolls who work on behalf of agents to help recruit — a generous word — football prospects by illegally giving them cash (or cars or money for family members or rent for a nice house) so the player then signs with the agent upon turning pro."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, sailing) A rope to increase the power of a tackle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A speedrunner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An idea or plan that has potential to be adopted or put into operation.",
                  "examples": [
                    "This idea isn't a runner. Let's not waste any more time on it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated) A trusty (prisoner granted special privileges).",
                  "examples": [
                    "In our prisons you might find a condemned man working as a runner, a trusty, which is about as far from segregation as you can get."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A running gag",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}