{
  "word": "nod",
  "etymologies": [
    {
      "description": [
        "From Middle English nodden, probably from an unrecorded Old English *hnodian (“to nod, shake the head”), from Proto-Germanic *hnudōną (“to beat, rivet, pound, push”), from Proto-Indo-European *kendʰ-, from *ken- (“to scratch, scrape, rub”). Compare Old High German hnotōn (“to shake”), hnutten (“to shake, rattle, vibrate”) (> modern dialectal German notteln, nütteln (“to rock, move back and forth”)), Icelandic hnjóða (“to rivet, clinch”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nod (plural nods)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of inclining the head up and down, as to indicate agreement, or as a cursory greeting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reference or allusion to something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A nomination.",
                  "examples": [
                    "For the fifth time in her career she received a Grammy nod, she has yet to win the award."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Approval.",
                  "examples": [
                    "The plan is expected to get the nod from councillors at the next meeting."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nod (third-person singular simple present nods, present participle nodding, simple past and past participle nodded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To incline the head up and down, as to indicate agreement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To briefly incline the head downwards as a cursory greeting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To sway, move up and down.",
                  "examples": [
                    "By every wind that nods the mountain pine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To gradually fall asleep.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To signify by a nod.",
                  "examples": [
                    "They nodded their assent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a mistake by being temporarily inattentive or tired",
                  "examples": [
                    "Even Homer nods."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, soccer) To head; to strike the ball with one's head.",
                  "examples": [
                    "Jones nods the ball back to his goalkeeper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To allude to something.",
                  "examples": [
                    "Though the title nods to the Italian neo-realist classic Bicycle Thieves—and Cyril, much like the father and son in that movie, spends much of his time tracking down the oft-stolen possession—The Kid With A Bike isn’t about the bike as something essential to his livelihood, but as his sole connection to the freedom and play of childhood itself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To fall asleep while under the influence of opiates.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}