{
  "word": "welcome",
  "etymologies": [
    {
      "description": [
        "From Middle English welcome, wolcume, wulcume, wilcume, from Old English wilcuma (“a wished-for guest”; compare also wilcume (“welcome!”, interjection)), from Proto-West Germanic *willjakwemō, from Proto-Germanic *wiljakwemô (“a wished-for arrival or guest”), possibly from *wiljakwemaną (“to be welcome”), equivalent to will (“desire”) +‎ come (“comer, arrival”). The component wil- was replaced by wel- when the sense “guest” of the second component was no longer understood, likely under influence from the adverb well. Cognate with Scots walcome, West Frisian wolkom, Dutch welkom (earlier willecome), German willkommen, German Low German willkamen, Danish velkommen, Norwegian Bokmål velkommen, Norwegian Nynorsk velkomen, velkommen, Swedish välkommen, Icelandic velkominn, Faroese vælkomin, and Old French wilecome (whence Middle French willecomme (“welcome”)), from Germanic.",
        "The verb is from Middle English welcomen, wolcumen, wilcumen, from Old English wellcumian, wylcumian, wilcumian (“to welcome, receive gladly”).",
        "Similar constructions are found in Romance languages, such as Italian benvenuto, Spanish bienvenido,  French bienvenu, Catalan benvingut, Portuguese bem-vindo and Romanian bun venit, meaning “[may you have fared] well [in] coming [here]”. These do not derive from a Classical Latin root, as no similar construction in Latin is found to exist, but are instead presumed to be the result of a calque from, considering the ruling elite of the Germanic kingdoms which succeeded the Western Roman Empire, a Germanic language into Proto-Romance (Vulgar Latin; see Latin *bene venūtus, and compare perdōnō and compāniō for similar historical calques)."
      ],
      "adjectives": [
        {
          "description": "welcome (comparative more welcome, superlative most welcome)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Whose arrival is a cause of joy; received with gladness; admitted willingly to the house, entertainment, or company.",
                  "examples": [
                    "a welcome visitor",
                    "Refugees welcome to education!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Producing gladness.",
                  "examples": [
                    "a welcome present;  welcome news"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free to have or enjoy gratuitously.",
                  "examples": [
                    "You are welcome to the use of my library."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "welcome (plural welcomes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of greeting someone’s arrival, especially by saying \"Welcome!\"; reception.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The utterance of such a greeting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Kind reception of a guest or newcomer.",
                  "examples": [
                    "We entered the house and found a ready welcome."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being a welcome guest.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "welcome (third-person singular simple present welcomes, present participle welcoming, simple past and past participle welcomed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To affirm or greet the arrival of someone, especially by saying \"Welcome!\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To accept something willingly or gladly.",
                  "examples": [
                    "We welcome suggestions for improvement."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}