{
  "word": "greenhouse",
  "etymologies": [
    {
      "description": [
        "From green +‎ house (\"house for growing greens\"), in reference to the produce grown within."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "greenhouse (plural greenhouses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A building used to grow plants, particularly one with large glass windows or plastic sheeting to trap heat from sunlight even in intemperate seasons or climates.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK military slang, dated) The glass of a plane's cockpit.",
                  "examples": [
                    "In the slang of the Royal Air Force man, the cockpit of his plane is the ‘pulpit’ or ‘office’, the glass covering over it the ‘greenhouse’."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A structure that shields the operating table to protect against bacteria.",
                  "examples": [
                    "Figure 2.6 shows the diagram Charnley published of the airflow in the 'greenhouse'; it can be seen that reasonable downward unidirectional airflow was achieved close to the operating table."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climatology) A hot state in global climate.",
                  "examples": [
                    "Synonym: hothouse",
                    "Antonym: icehouse"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "greenhouse (third-person singular simple present greenhouses, present participle greenhousing, simple past and past participle greenhoused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place (plants) in a greenhouse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To nurture in order to promote growth.",
                  "examples": [
                    "It's almost impossible to make judgements when you're being playful – as by definition it's spontaneous activity – so your baby ideas get nurtured and greenhoused better."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}