{
  "word": "flavor",
  "etymologies": [
    {
      "description": [
        "From Middle English flavour meaning “smell, odour”, usually pleasing, borrowed from Old French flaour (“smell, odour”), from Vulgar Latin *flātor (“odour, that which blows”), from Latin flātor (“blower”), from flō, flāre (“to blow, puff”), ultimately from Proto-Indo-European *bʰleh₁- (“to blow”), from Proto-Indo-European *bʰel- (“to make a loud noise”). Doublet of blow and bleat."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flavor (countable and uncountable, plural flavors) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality produced by the sensation of taste or, especially, of taste and smell in combined effect.",
                  "examples": [
                    "The flavor of this apple pie is delicious."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A substance used to produce a taste. Flavoring.",
                  "examples": [
                    "Flavor was added to the pudding."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A variety (of taste) attributed to an object.",
                  "examples": [
                    "What flavor of bubble gum do you enjoy?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The characteristic quality of something.",
                  "examples": [
                    "the flavor of an experience"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A kind or type.",
                  "examples": [
                    "Debian is one flavor of the Linux operating system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(particle physics) One of the six types of quarks (top, bottom, strange, charmed, up, and down) or three types of leptons (electron, muon, and tauon).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The quality produced by the sensation of smell; odour; fragrance.",
                  "examples": [
                    "the flavor of a rose"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flavor (third-person singular simple present flavors, present participle flavoring, simple past and past participle flavored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling, transitive) To add flavoring to something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}