{
  "word": "brand",
  "etymologies": [
    {
      "description": [
        "From Middle English brand, from Old English brand (“fire; flame; burning; torch; sword”), from Proto-Germanic *brandaz (“flame; flaming; fire-brand; torch; sword”), from Proto-Indo-European *bʰrenu- (“to bubble forth; brew; spew forth; burn”). Cognate with Scots brand, West Frisian brân (“fire”), Dutch brand, German Brand, Swedish brand (“blaze, fire”), Icelandic brandur, French brand (< Germanic). Parallel to e.g. Proto-Slavic *gorěti (“to burn”) from Proto-Indo-European *bʰrenu- (“to bubble forth; brew; spew forth; burn”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brand (plural brands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A conflagration; a flame.",
                  "examples": [
                    "Goe to prepare the maryages what neede the torchis light? be holde the towres of troy do shyne with brandes that blase full bright."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or poetic) A piece of burning wood or peat, or a glowing cinder.",
                  "examples": [
                    "To burn something to brands and ashes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Northern England) A torch used for signaling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A sword.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mark or scar made by burning with a hot iron, especially to mark cattle or to classify the contents of a cask.",
                  "examples": [
                    "Hyponym: badge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A branding iron.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The symbolic identity, represented by a name and/or a logo, which indicates a certain product or service to the public.",
                  "examples": [
                    "Synonyms: trademark, logo, brand name, marque, tradename, proprietary name"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specific product, service, or provider so distinguished.",
                  "examples": [
                    "Some brands of breakfast cereal contain a lot of sugar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any specific type or variety of something; a distinct style or manner.",
                  "examples": [
                    "I didn’t appreciate his particular brand of flattery.",
                    "New Orleans brand sausage; Danish brand ham"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The public image or reputation and recognized, typical style of an individual or group.",
                  "examples": [
                    "Synonyms: repute, name, good name"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mark of infamy; stigma.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any minute fungus producing a burnt appearance in plants.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brand (third-person singular simple present brands, present participle branding, simple past and past participle branded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To burn the flesh with a hot iron, either as a marker (for criminals, slaves etc.) or to cauterise a wound.",
                  "examples": [
                    "When they caught him, he was branded and then locked up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark (especially cattle) with a brand as proof of ownership.",
                  "examples": [
                    "The ranch hands had to brand every new calf by lunchtime."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make an indelible impression on the memory or senses.",
                  "examples": [
                    "Her face is branded upon my memory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stigmatize, label (someone).",
                  "examples": [
                    "He was branded a fool by everyone that heard his story."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, marketing) To associate a product or service with a trademark or other name and related images.",
                  "examples": [
                    "They branded the new detergent \"Suds-O\", with a nature scene inside a green O on the muted-colored recycled-cardboard box."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}