{
  "word": "stump",
  "etymologies": [
    {
      "description": [
        "From Middle English stumpe, stompe (“stump”), from or akin to Middle Low German stump (“stump”), from Proto-Germanic *stumpaz (“stump, blunt, part cut off”). Cognate with Middle Dutch stomp (“stump”), Old High German stumph (“stump”) (German Stumpf), Old Norse stumpr (“stump”). More at stop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stump (plural stumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The remains of something that has been cut off; especially the remains of a tree, the remains of a limb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) The place or occasion at which a campaign takes place; the husting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A place or occasion at which a person harangues or otherwise addresses a group in a manner suggesting political oration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) One of three small wooden posts which together with the bails make the wicket and that the fielding team attempt to hit with the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(drawing) An artists’ drawing tool made of rolled paper used to smudge or blend marks made with charcoal, Conté crayon, pencil or other drawing media.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden or concrete pole used to support a house.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, humorous) A leg.",
                  "examples": [
                    "to stir one's stumps"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pin in a tumbler lock which forms an obstruction to throwing the bolt except when the gates of the tumblers are properly arranged, as by the key.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pin or projection in a lock to form a guide for a movable piece.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stump (third-person singular simple present stumps, present participle stumping, simple past and past participle stumped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To stop, confuse, or puzzle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To baffle; to make unable to find an answer to a question or problem.",
                  "examples": [
                    "This last question has me stumped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To campaign.",
                  "examples": [
                    "Synonym: campaign",
                    "He’s been stumping for that reform for months."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, colloquial) To travel over (a state, a district, etc.) giving speeches for electioneering purposes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cricket, of a wicket keeper) To get a batsman out stumped.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cricket) To bowl down the stumps of (a wicket).",
                  "examples": [
                    "A herd of boys with clamour bowled, / And stumped the wicket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To walk heavily or clumsily, plod, trudge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce to a stump; to truncate or cut off a part of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike unexpectedly; to stub, as the toe against something fixed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}