{
  "word": "usufruct",
  "etymologies": [
    {
      "description": [
        "From Late Latin ūsufrūctus, from Latin ūsus-frūctus, ūsus et frūctus (“use and enjoyment”). Cognate with French usufruit, Italian usufrutto, usofrutto, Occitan usufrug, Portuguese usufruto, Spanish usufructo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "usufruct (plural usufructs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The legal right to use and derive profit or benefit from property that belongs to another person, as long as the property is not damaged.",
                  "examples": [
                    "Every American college president, it appears, is in duty bound to write and utter at least one book upon the nature, aims and usufructs of the Higher Education."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "usufruct (third-person singular simple present usufructs, present participle usufructing, simple past and past participle usufructed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, also figuratively) To use and derive profit or benefit from property that belongs to another person.",
                  "examples": [
                    "The use of the property of an orphan by a guardian who carries out his guardianship, is allowed for the latter's daily subsistence. Such use should be just and reasonable.  […]  According to al-Sha'bá, such just and reasonable use is like usufructing the milk of cattle, having services from servants and riding animals or vehicles, as long as such usufruction does not impair or damage the property itself."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}