{
  "word": "complexion",
  "etymologies": [
    {
      "description": [
        "From Middle English complexion (“temperament”), from Old French complexion (French complexion), from Medieval Latin complexiō (“complexion, constitution”), from complector, past participle complexus (“to entwine, encompass”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "complexion (plural complexions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, medicine) The combination of humours making up one's physiological \"temperament\", being either hot or cold, and moist or dry.",
                  "examples": [
                    "“Indeed, sir,” answered the lady, with some warmth, “I cannot think there is anything easier than to cheat an old woman with a profession of love, when her complexion is amorous; and, though she is my aunt, I must say there never was a more liquorish one than her ladyship.  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality, colour, or appearance of the skin on the face.",
                  "examples": [
                    "a rugged complexion",
                    "a sunburnt complexion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The outward appearance of something.",
                  "examples": [
                    "It was a little unfortunate that the fib unfibbed gave their consultations something the complexion of that close understanding which exists between penitent and confessor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Outlook, attitude, or point of view.",
                  "examples": [
                    "But the purely marginal jottings, done with no eye to the Memorandum Book, have a distinct complexion, and not only a distinct purpose, but none at all; this it is which imparts to them a value."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(loanword, especially in scientific works translated from German) An arrangement.",
                  "examples": [
                    "Second there is the level at which the energy or velocity components of each molecule are specified. He calls this a Komplexion, which we translate literally as complexion."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "complexion (third-person singular simple present complexions, present participle complexioning, simple past and past participle complexioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give a colour to.",
                  "examples": [
                    "From the pale refinement of her genteel heroine to the sallow complexioning of poor white trash, Stowe colors her narrative with the hues of the body."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}