{
  "word": "octave",
  "etymologies": [
    {
      "description": [
        "From Latin octavus (“eighth”). Doublet of octavo, ochava, and oitava."
      ],
      "adjectives": [
        {
          "description": "octave (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Consisting of eight; eight in number.",
                  "examples": [
                    "Boccace […]  is said to have invented the octave rhye"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "octave (plural octaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) An interval of twelve semitones spanning eight degrees of the diatonic scale, representing a doubling or halving in pitch frequency.",
                  "examples": [
                    "The melody jumps up an octave at the beginning, then later drops back down an octave.",
                    "The singer was known for astounding clarity over her entire five-octave range.",
                    "The octave has a pitch ratio of 2:1."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The pitch an octave higher than a given pitch.",
                  "examples": [
                    "The bass starts on a low E, and the tenor comes in on the octave."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A coupler on an organ which allows the organist to sound the note an octave above the note of the key pressed (cf sub-octave)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetry) A poetic stanza consisting of eight lines; usually used as one part of a sonnet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) The eighth defensive position, with the sword hand held at waist height, and the tip of the sword out straight at knee level.",
                  "examples": [
                    "If they always do a lateral parry quarte, and never a semicircular octave, that gives you an opening."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The day that is one week after a feast day in the Latin rite of the Catholic Church.",
                  "examples": [
                    "It was extended to the entire Church by 1814, and then in 1913 the feast was transferred to September 15, the octave day of the Birth of Mary and the day after the Exaltation of the Cross."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) An eight-day period beginning on a feast day in the Latin rite of the Catholic Church.",
                  "examples": [
                    "Of an Octave the Office is said. or at least commemorated, (when any Sunday or Feast intervene), for eight successive days.# A small cask of wine, one eighth of a pipe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, obsolete) An octonion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(signal processing) Any of a number of coherent-noise functions of differing frequency that are added together to form Perlin noise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) The subjective vibration of a planet.",
                  "examples": [
                    "Mercury then joins its higher octave and generous counterpart Jupiter early next week, and it opens gates of opportunity."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "octave (third-person singular simple present octaves, present participle octaving, simple past and past participle octaved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of octavate",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}