{
  "word": "tie",
  "etymologies": [
    {
      "description": [
        "From Middle English teye (“cord, chain”), from Old English tēag, tēah (“cord, chain”), from Proto-West Germanic *taugu, from Proto-Germanic *taugō, ultimately from Proto-Indo-European *dewk-. Compare Danish tov, Icelandic taug."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tie (plural ties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A knot; a fastening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A knot of hair, as at the back of a wig.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A necktie (item of clothing consisting of a strip of cloth tied around the neck). See also bow tie, black tie.",
                  "examples": [
                    "Synonym: necktie"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lace-up shoe.",
                  "examples": [
                    "Oxford ties; Derby ties",
                    "Coordinate term: court shoe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A twist tie, a piece of wire embedded in paper, strip of plastic with ratchets, or similar object which is wound around something and tightened.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strong connection between people or groups of people.",
                  "examples": [
                    "Synonym: bond",
                    "the sacred ties of friendship or of duty",
                    "the ties of allegiance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) A structural member firmly holding two pieces together.",
                  "examples": [
                    "Hyponym: tiebar",
                    "Ties work to maintain structural integrity in windstorms and earthquakes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, US) A horizontal wooden or concrete structural member that supports and ties together rails.",
                  "examples": [
                    "Synonym: (British) sleeper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The situation in which two or more participants in a competition are placed equally.",
                  "examples": [
                    "Synonym: draw",
                    "It's two outs in the bottom of the ninth, tie score."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The situation at the end of all innings of a match where both sides have the same total of runs (different from a draw).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, US) An equalizer, a run, goal, point, etc which causes participants in a competition to be placed equally or have the same score(s).",
                  "examples": [
                    "[…]  game in the championships shouldering a vast disadvantage and was in due course defeated by Egyetértés, one of the newcomers in the first league. Eger, the other novice in the championships, also took off successfully scoring a tie with the Ruha ETO."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, Britain) A meeting between two players or teams in a competition.",
                  "examples": [
                    "The FA Cup third round tie between Liverpool and Cardiff was their first meeting in the competition since 1957."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A curved line connecting two notes of the same pitch denoting that they should be played as a single note with the combined length of both notes.",
                  "examples": [
                    "Coordinate term: slur"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetic transcription) A curved line connecting two letters (⁀), used in the IPA to denote a coarticulation, as for example /d͡ʒ/.",
                  "examples": [
                    "Wikipedia: tie (typography)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics) One or more equal values or sets of equal values in the data set.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surveying) A bearing and distance between a lot corner or point and a benchmark or iron off site.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A connection between two vertices.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tiewig.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English teien, teiȝen, from Old English tīġan, tīeġan, from Proto-West Germanic *taugijan, from Proto-Germanic *taugijaną, from Proto-Indo-European *dewk- (“to tug, draw”). Cognate with Icelandic teygja."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "tie (third-person singular simple present ties, present participle tying, simple past and past participle tied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To twist (a string, rope, or the like) around itself securely.",
                  "examples": [
                    "Tie this rope in a knot for me, please.",
                    "Tie the rope to this tree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form (a knot or the like) in a string or the like.",
                  "examples": [
                    "Tie a knot in this rope for me, please."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attach or fasten (one thing to another) by string or the like.",
                  "examples": [
                    "Tie him to the tree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sometimes figurative) To secure (something) by string or the like.",
                  "examples": [
                    "Tie your shoes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To have the same score or position as another in a competition or ordering.",
                  "examples": [
                    "They tied for third place.",
                    "They tied the game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, transitive) To have the same score or position as (another) in a competition or ordering.",
                  "examples": [
                    "He tied me for third place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To unite (musical notes) with a line or slur in the notation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated, colloquial) To believe; to credit.",
                  "examples": [
                    "[…]  It seems they have sort of betrothal teas — can you tie it?\"\"Heavens!\" said Mary  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming, transitive) In the Perl programming language, to extend (a variable) so that standard operations performed upon it invoke custom functionality instead.",
                  "examples": [
                    "So, a class for tying a hash to an ISAM implementation might provide an extra method to traverse a set of keys sequentially (the “S” of ISAM), since your typical DBM implementation can't do that."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}