{
  "word": "team",
  "etymologies": [
    {
      "description": [
        "From Middle English tem, teem, teme, from Old English tēam (“child-bearing, offspring, brood, set of draught animals”), from Proto-West Germanic *taum, from Proto-Germanic *taumaz (“that which draws or pulls”), from Proto-Germanic *taugijaną, *tugōną, *teuhōną, *teuhaną (“to lead, bring, pull, draw”), from Proto-Indo-European *dewk- (“to pull, lead”).",
        "Cognate with Scots team, teem (“a chain, harness”), West Frisian team (“bridle, team”), Dutch toom (“bridle, reins, flock of birds”), German Zaum (“bridle”), Norwegian tømme (“bridle, rein”), Swedish töm (“leash, rein”). More at teem, tie, tow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "team (plural teams)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of draught animals, such as two horses in front of a carriage.",
                  "examples": [
                    "The adjacent alleys were choked with tethered wagons, the teams reversed and nuzzling gnawed corn-ears over the tail-boards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any group of people involved in the same activity, especially sports or work.",
                  "examples": [
                    "We need more volunteers for the netball team.",
                    "The IT manager leads a team of three software developers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A group of animals moving together, especially young ducks.",
                  "examples": [
                    "she will wonder to have a teeme of ducklings about her"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, law, obsolete) A royalty or privilege granted by royal charter to a lord of a manor, of having, keeping, and judging in his court, his bondmen, neifes, and villains, and their offspring, or suit, that is, goods and chattels, and appurtenances thereto.",
                  "examples": [
                    "TEAM, Theam, Tem, Them. Sax. [from tyman, to propagate, to teem.] In old English law. Literally, an offspring, race or generation. A royalty or privilege granted by royal charter to a lord of a manor, of having, keeping and judging in his court, his bondmen, neifes and villeins, and their offspring or suit. They who had a jurisdiction of this kind, were said to have a court of Theme... constantly used in the old books in connection with toll, in the expression Toll & Team."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people who favor one side of a binary debate that is divided and lacks a well-established clear consensus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "team (third-person singular simple present teams, present participle teaming, simple past and past participle teamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form a group, as for sports or work.",
                  "examples": [
                    "They teamed to complete the project."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, by extension) To go together well; to harmonize.",
                  "examples": [
                    "Rich, creamy avocado is cut back by the citrus sharpness of grapefruit in this Israeli-inspired salad. It's brilliant for a brunchy breakfast, and teams well with grilled salmon, tuna, or mackerel for dinner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey or haul with a team.",
                  "examples": [
                    "to team lumber"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form together into a team.",
                  "examples": [
                    "to team oxen"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give work to a gang under a subcontractor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "team",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of teem.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}