{
  "word": "stot",
  "etymologies": [
    {
      "description": [
        "From Old English stot, stotte (“a hack, jade, or worthless horse”), in turn from Old Norse stútr. Compare Swedish stut (“a bull”), Danish stud (“an ox”). Compare stoat."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stot (plural stots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An inferior horse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ox or bull.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional) A heifer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Likely derived from Middle Dutch stoten (“to push”) or Middle Low German stôten, from Old Saxon stōtan, from Proto-West Germanic *stautan, from Proto-Germanic *stautaną (“to push, jolt, bump”), from Proto-Indo-European *(s)tewd-, from *(s)tew- (“to push, hit”).",
        "Also compare Middle English steten (“to thrust, strike, push, knock down”), Old Norse stauta and steyta (whence Danish støde), Gothic 𐍃𐍄𐌰𐌿𐍄𐌰𐌽 (stautan), Old Saxon stotan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stot (plural stots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Northern England) A bounce or rebound",
                  "examples": [
                    "Instead of dropping the golden cones safely into his bag he let them dribble out of his hands so that, in the expectancy before the violence of the storm, the tiny stots from one transfigured branch to another could be clearly heard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, of quadrupeds) A leap using all four legs at once.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stot (third-person singular simple present stots, present participle stotting or stottin, simple past and past participle stotted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Scotland and Northern England) To bounce, rebound or ricochet.",
                  "examples": [
                    "‘I've plenty of money in my bank – and I have my cheque book here – could one of you cash a cheque for five pounds? – I promise it won't stot.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland and Northern England) To make bounce, rebound or ricochet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland and Northern England) To stumble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, zoology, of quadrupeds) To leap using all four legs at once.",
                  "examples": [
                    "Synonym: pronk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To strike, push, shove. [–16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}