{
  "word": "gorge",
  "etymologies": [
    {
      "description": [
        "From Middle English gorge (“esophagus, gullet; throat; bird's crop; food in a hawk's crop; food or drink that has been eaten”), a borrowing from Old French gorge (“throat”) (modern French gorge (“throat; breast”)), from Vulgar Latin *gorga, *gurga, from Latin gurges (“eddy, whirlpool; gulf; sea”), possibly from Proto-Indo-European *gʷerh₃- (“to devour, swallow; to eat”). The English word is cognate with Galician gorxa (“throat”), Italian gorga, gorgia (“gorge, ravine; (obsolete) throat”), Occitan gorga, gorja, Portuguese gorja (“gullet, throat; gorge”), Spanish gorja (“gullet, throat; gorge”). Doublet of gour."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gorge (plural gorges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The front aspect of the neck; the outside of the throat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, literary) The inside of the throat; the esophagus, the gullet; (falconry, specifically) the crop or gizzard of a hawk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Food that has been taken into the gullet or the stomach, particularly if it is regurgitated or vomited out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A choking or filling of a channel or passage by an obstruction; the obstruction itself.",
                  "examples": [
                    "an ice gorge in a river"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A concave moulding; a cavetto.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture, military, fortification) The rearward side of an outwork, a bastion, or a fort, often open, or not protected against artillery; a narrow entry passage into the outwork of an enclosed fortification.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A primitive device used instead of a hook to catch fish, consisting of an object that is easy to swallow but difficult to eject or loosen, such as a piece of bone or stone pointed at each end and attached in the middle to a line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) A deep, narrow passage with steep, rocky sides, particularly one with a stream running through it; a ravine.",
                  "examples": [
                    "Synonym: canyon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanical engineering) The groove of a pulley.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Middle English gorgen (“to eat greedily; to gorge”), a borrowing from Old French gorger, gorgier (modern French gorger (“to eat greedily; to gorge”)), from gorge (“throat”); see further at etymology 1.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gorge (plural gorges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of gorging.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gorge (third-person singular simple present gorges, present participle gorging, simple past and past participle gorged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, reflexive) To stuff the gorge or gullet with food; to eat greedily and in large quantities. [+ on (object)]",
                  "examples": [
                    "They gorged themselves on chocolate and cake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To swallow, especially with greediness, or in large mouthfuls or quantities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill up to the throat; to glut, to satiate.",
                  "examples": [
                    "Synonyms: sate, stuff"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill up (an organ, a vein, etc.); to block up or obstruct; (US, specifically) of ice: to choke or fill a channel or passage, causing an obstruction.",
                  "examples": [
                    "Synonym: engorge"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of gorge(ous); originally British slang."
      ],
      "adjectives": [
        {
          "description": "gorge (comparative more gorge, superlative most gorge)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Gorgeous.",
                  "examples": [
                    "Oh, look at him: isn’t he gorge?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}