{
  "word": "parcel",
  "etymologies": [
    {
      "description": [
        "From Middle English parcel, from Old French parcelle (“a small piece or part, a parcel, a particle”), from Late Latin particella, diminutive of Latin particula (“particle”), diminutive of partem (“part, piece”). Doublet of particle."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "parcel (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Part or half; in part; partially.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "parcel (plural parcels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A package wrapped for shipment.",
                  "examples": [
                    "Synonym: package",
                    "I saw a brown paper parcel on my doorstep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An individual consignment of cargo for shipment, regardless of size and form.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An individual item appearing on an invoice or receipt (only in the phrase bill of parcels).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A division of land bought and sold as a unit.",
                  "examples": [
                    "Synonym: plot",
                    "I own a small parcel of land between the refinery and the fish cannery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A group of birds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An indiscriminate or indefinite number, measure, or quantity; a collection; a group.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small amount of food that has been wrapped up, for example a pastry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A portion of anything taken separately; a fragment of a whole; a part.",
                  "examples": [
                    "A certain piece of land is part and parcel of another piece."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "parcel (third-person singular simple present parcels, present participle parceling or parcelling, simple past and past participle parceled or parcelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wrap something up into the form of a package.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wrap a strip around the end of a rope.",
                  "examples": [
                    "Worm and parcel with the lay; turn and serve the other way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To divide and distribute by parts or portions; often with off, out or into.",
                  "examples": [
                    "Then the great Hall was wholly broken down,And the broad woodland parcell’d into farms;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To add a parcel or item to; to itemize.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}