{
  "word": "muscle",
  "etymologies": [
    {
      "description": [
        "From Middle English muscle, muscule, muskylle, and in part from Middle French muscle, from Latin mūsculus (“a muscle”, literally “little mouse”) because of the mouselike appearance of some muscles, from mūs (“mouse”). Doublet of mussel. More at mouse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "muscle (countable and uncountable, plural muscles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A contractile form of tissue which animals use to effect movement.",
                  "examples": [
                    "Muscle consists largely of actin and myosin filaments.",
                    "Synonym: thew"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An organ composed of muscle tissue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, usually in the plural) A well-developed physique, in which the muscles are enlarged from exercise.",
                  "examples": [
                    "The fact that I was middle-aged, bald, married, and raising girls instead of chasing them didn't really bother me. Muscles are cool at any age."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figurative) Strength, force.",
                  "examples": [
                    "The lesson to be drawn from the events of 1914, to Roosevelt's mind, was that civilization needed muscle to defend it, not just solemn words."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figurative) Hired strongmen or bodyguards.",
                  "examples": [
                    "It was easy enough to dodge him, let him crash into the floorboards. Peltroc knew that his priority was the leader, not the hired muscle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "muscle (third-person singular simple present muscles, present participle muscling, simple past and past participle muscled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use force to make progress, especially physical force.",
                  "examples": [
                    "He muscled his way through the crowd."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}