{
  "word": "stool",
  "etymologies": [
    {
      "description": [
        "From Middle English stool, stole, stol, from Old English stōl (“chair, seat, throne”), from Proto-West Germanic *stōl, from Proto-Germanic *stōlaz (“chair”) (compare West Frisian stoel, Dutch stoel, German Stuhl, Swedish/Norwegian/Danish stol, Finnish tuoli, Estonian tool), from Proto-Indo-European *stoh₂los (compare Lithuanian stálas, Russian стол (stol, “table”), Russian стул (stul, “chair”), Serbo-Croatian stol (“table”), Slovene stol (“chair”), Albanian kështallë (“crutch”), Ancient Greek στήλη (stḗlē, “block of stone used as a prop or buttress to a wall”)), from *steh₂- (“to stand”). More at stand.",
        "The medical use derives from sense 2 (seat used for defecation)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stool (countable and uncountable, plural stools)",
          "definitionGroups": [
            {
              "group": "A seat, especially for one person and without armrests.",
              "entries": [
                {
                  "meaning": "A seat for one person without a back or armrests.",
                  "examples": []
                },
                {
                  "meaning": "A footstool.",
                  "examples": []
                },
                {
                  "meaning": "(now chiefly dialectal, Scotland) A seat with a back; a chair.",
                  "examples": []
                },
                {
                  "meaning": "(now chiefly dialectal, Scotland, literally and figuratively) A throne.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A close-stool; a seat used for urination and defecation: a chamber pot, commode, outhouse seat, or toilet.",
                  "examples": [
                    "Synonyms: see Thesaurus:chamber pot, Thesaurus:toilet, Thesaurus:bathroom"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) A plant that has been cut down until its main stem is close to the ground, resembling a stool, to promote new growth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly medicine) Feces, excrement.",
                  "examples": [
                    "I provided the doctor with stool samples.",
                    "Synonyms: see Thesaurus:feces"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly medicine) A production of feces or excrement, an act of defecation, stooling.",
                  "examples": [
                    "Synonyms: see Thesaurus:defecation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A decoy; a portable piece of wood to which a pigeon is fastened to lure wild birds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A small channel on the side of a vessel, for the deadeyes of the backstays.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialect) Material, such as oyster shells, spread on the sea bottom for oyster spat to adhere to.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stool (third-person singular simple present stools, present participle stooling, simple past and past participle stooled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly medicine) To produce stool: to defecate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) To cut down (a plant) until its main stem is close to the ground, resembling a stool, to promote new growth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Latin stolo. See stolon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stool (plural stools)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plant from which layers are propagated by bending its branches into the soil.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stool (third-person singular simple present stools, present participle stooling, simple past and past participle stooled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture) To ramify; to tiller, as grain; to shoot out suckers.",
                  "examples": [
                    "I worked very hard in the copse of young ash, with my billhook and a shearing-knife; cutting out the saplings where they stooled too close together, making spars to keep for thatching, wall-crooks to drive into the cob, stiles for close sheep hurdles, and handles for rakes, and hoes, and two-bills, of the larger and straighter stuff."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}