{
  "word": "acknowledge",
  "etymologies": [
    {
      "description": [
        "Recorded since 1553, a blend of Middle English knowlechen (“to discover, reveal, acknowledge”) and aknowen (“to recognize, acknowledge”); the latter from Old English oncnāwan, ācnāwan (“to know, recognize, acknowledge”), from on + cnāwan (“to know”). Notice the preservation of /k/ word-internally (regularly spelled with ck as in back) while being lost word-initially. The prefix might have been influenced by Anglo-Norman a- (“on-, to-”). See knowledge.",
        "For the formation compare Latin agnōscō and Russian призна́ть (priznátʹ), with cognate roots."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "acknowledge (third-person singular simple present acknowledges, present participle acknowledging, simple past and past participle acknowledged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To admit the knowledge of; to recognize as a fact or truth; to declare one's belief in",
                  "examples": [
                    "to acknowledge the being of a god"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To own or recognize in a particular quality, character or relationship; to admit the claims or authority of; to give recognition to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be grateful of (e.g. a benefit or a favour)",
                  "examples": [
                    "to acknowledge a favor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To report (the receipt of a message to its sender).",
                  "examples": [
                    "This is to acknowledge your kind invitation to participate in the upcoming debate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To own as genuine or valid; to assent to (a legal instrument) to give it validity; to avow or admit in legal form.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}