{
  "word": "rash",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Middle English rash, rasch (“hasty, headstrong, rash”) [and other forms], probably from Old English *ræsċ (“rash”) (found in derivatives such as ræsċan (“to move rapidly; to flicker; to flash; to glitter; to quiver”), ræsċettan (“to crackle; to sparkle”), etc.), from Proto-West Germanic *rask, *raskī, *rasku, from Proto-Germanic *raskaz, *raskuz, *raþskaz, *raþskuz (“rash; rapid”), from Proto-Indo-European *Hreth₂- (“to run, roll”). The Middle English word was probably influenced by the cognates listed below.",
        "The adverb is derived from Middle English rashe (“quickly, rapidly”), from rash, rasch (adjective) (see above)."
      ],
      "adjectives": [
        {
          "description": "rash (comparative rasher, superlative rashest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Acting too quickly without considering the consequences and risks; not careful; hasty.",
                  "examples": [
                    "Synonyms: foolhardy, heady, impulsive, precipitate; see also Thesaurus:reckless",
                    "Antonyms: prudent, unrash",
                    "rash words spoken in the heat of debate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England, archaic) Of corn or other grains: so dry as to fall out of the ear with handling.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete, rare)",
              "entries": [
                {
                  "meaning": "Requiring swift action; pressing; urgent.",
                  "examples": []
                },
                {
                  "meaning": "Taking effect quickly and strongly; fast-acting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "rash (comparative more rash, superlative most rash)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Synonym of rashly (“in a rash manner; hastily or without due consideration”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from Old French rasche, rache (“skin eruption, rash; (specifically) scabies, scurf”) (obsolete), from racher (“to scrape; to scratch”) (although this is only directly attested later than the noun), from Vulgar Latin *rāsicāre (“to scrape”), from Latin rāsus (“scraped, scratched; shaved”), the perfect passive participle of rādō (“to scrape, scratch; to shave; to rub, smooth; to brush along, graze”), ultimately from Proto-Indo-European *reh₁d- (“to scrape, scratch; to gnaw”). Doublet of rase and raze."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rash (plural rashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dermatology, medicine) An area of inflamed and irritated skin characterized by reddened spots that may be filled with fluid or pus; also, preceded by a descriptive word (rare or obsolete), an illness characterized by a type of rash.",
                  "examples": [
                    "He came out in a rash because of an allergy.",
                    "She applied rash cream on herself to reduce the irritation.",
                    "A wet cloth should help with the rash on your arm."
                  ]
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "An irregular distribution or sprinkling of objects resembling a rash (sense 1).",
                  "examples": []
                },
                {
                  "meaning": "An outbreak or surge in problems; a spate, string, or trend.",
                  "examples": [
                    "Synonym: epidemic",
                    "There has been a rash of vandalism lately."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; the word is similar to other words from Germanic or Romance languages listed in the table below, but the connection between the English word and those words is unclear. One suggestion is that they ultimately derive from the town of Arras in France, known for its cloth and wool industries (whence arras (“tapestry, wall hanging”)); compare German Rasch (“lightly woven silk or (usually) worsted fabric”) (said to be from Middle High German arrasch (“arras”), and ultimately from the name of the town), and the obsolete names for the fabric, Catalan drap de arraz, drap d'Arraç, Italian paño de ras (literally “cloth of Arras”). The Oxford English Dictionary states that even if rash did not originally derive from Arras, the name of the town could have influenced the English word."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rash (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Chiefly preceded by a descriptive word: a fabric with a smooth texture woven from silk, worsted, or a mixture of the two, intended as an inferior substitute for silk.",
                  "examples": [
                    "cloth rash    silk rash"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Imitative."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rash (plural rashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A soft crackling or rustling sound.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Late Middle English rashen, rassh (“to hasten, hurry, rush”) [and other forms], from Old English ræscan (“to move rapidly; to flicker; to flash; to glitter; to quiver”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rash (third-person singular simple present rashes, present participle rashing, simple past and past participle rashed) (chiefly Scotland, archaic or obsolete)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To forcefully move or push (someone or something) in a certain direction.",
                  "examples": []
                },
                {
                  "meaning": "To break (something) forcefully; to smash.",
                  "examples": []
                },
                {
                  "meaning": "To emit or issue (something) hastily.",
                  "examples": []
                },
                {
                  "meaning": "(rare) Usually followed by up: to prepare (something) with haste; to cobble together, to improvise.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To move forcefully, hastily, or suddenly; to dash, to rush.",
                  "examples": []
                },
                {
                  "meaning": "Of rain: to fall heavily.",
                  "examples": []
                },
                {
                  "meaning": "Chiefly followed by against, at, or upon: to collide or hit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably an aphetic form of arace (“to tear up by the roots; to draw away”) (obsolete), from Middle English aracen (“to remove (something) by force, pluck or pull out, tear out; to grab; to lacerate; to flay or skin (an animal); to erase, obliterate”) [and other forms], from Old French aracer, arachier (“to pull off (by physical force)”) [and other forms] (whence Anglo-Norman racher, aracher (“to pluck out, pull out”); modern French arracher (“to pull up, tear out, uproot; to extract, take out (a tooth); to peel, pull off, rip off; to buy, snap up; to fight over; to tear (oneself) away from”)), a variant of esrachier (“to eradicate, get rid of”), from Latin exrādīcāre, ērādīcāre, the present active infinitive of ērādīcō (“to root out; to annihilate, extirpate”), from ē- (a variant of ex- (prefix meaning ‘away; out’)) + rādīx (“root of a plant”) (ultimately from Proto-Indo-European *wréh₂ds (“root”)) + -ō (suffix forming regular first-conjugation verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rash (third-person singular simple present rashes, present participle rashing, simple past and past participle rashed) (transitive, archaic or obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chiefly followed by away, down, off, out, etc.: to pluck, pull, or rip (something) violently.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably a variant of race, raze (“to demolish; to destroy, obliterate; to scrape as if with a razor”), possibly modelled after rash (etymology 5 or etymology 6). Raze is derived from Middle English rasen, racen, rase (“to scrape; to shave; to erase; to pull; to strip off; to pluck or tear out; to root out (a tree, etc.); to pull away, snatch; to pull down; to knock down; to rend, tear apart; to pick clean, strip; to cleave, slice; to sever; to lacerate; to pierce; to carve, engrave; to dig; (figuratively) to expunge, obliterate; to alter”) [and other forms], from Anglo-Norman raser, rasere, rasser, Middle French, Old French raser (“to shave; to touch lightly, graze; to level off (grain, etc.) in a measure; to demolish, tear down; to erase; to polish; to wear down”), from Vulgar Latin *raso (“to shave; to scrape; to scratch; to touch lightly, graze”), from Latin rāsus (“scraped; shaved”); see further at etymology 2."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rash (third-person singular simple present rashes, present participle rashing, simple past and past participle rashed) (transitive, obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hack, slash, or slice (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Chiefly followed by out: to scrape or scratch (something); to obliterate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}