{
  "word": "provost",
  "etymologies": [
    {
      "description": [
        "From Middle English, from late Old English profost, from Late Latin prōpositus, variant of Latin praepositus (“[one] placed in command”). In some senses, via Anglo-Norman provolt &c.; via Anglo-Norman and Old French provost (modern French prévôt). As a Central European ecclesiastical office, via German Propst, Danish provst, &c."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "provost (plural provosts)",
          "definitionGroups": [
            {
              "group": "One placed in charge: a head, a chief, particularly:",
              "entries": [
                {
                  "meaning": "(religion, historical) A dean: the head of a cathedral chapter.",
                  "examples": []
                },
                {
                  "meaning": "(religion) The head of various other ecclesiastical bodies, even (rare, obsolete) muezzins.",
                  "examples": []
                },
                {
                  "meaning": "(religion) The minister of the chief Protestant church of a town or region in Germany, the Low Countries, and Scandinavia.",
                  "examples": []
                },
                {
                  "meaning": "(UK, higher education) The head of various colleges and universities.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A ruler.",
                  "examples": []
                },
                {
                  "meaning": "A mayor: the chief magistrate of a town, particularly (Scotland) the head of a burgh or (historical) the former chiefs of various towns in France, Flanders, or (by extension) other Continental European countries.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A senior deputy, a superintendent, particularly:",
              "entries": [
                {
                  "meaning": "(religion, historical) A prior: an abbot's second-in-command.",
                  "examples": []
                },
                {
                  "meaning": "(US, higher education) A senior deputy administrator; a vice-president of academic affairs.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A steward or seneschal: a medieval agent given management of a feudal estate or charged with collecting fees; (obsolete, sometimes as ~ of Paradise or ~ of Heaven) a title of the archangel Michael.",
                  "examples": []
                },
                {
                  "meaning": "(historical) Any manager or overseer in a medieval or early modern context.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A viceroy.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A governor.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A reeve.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) The head of various Roman offices, such as prefect and praetor.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A constable: a medieval or early modern official charged with arresting, holding, and punishing criminals.",
                  "examples": []
                },
                {
                  "meaning": "(military) An officer of the military police, particularly provost marshal or provost sergeant.",
                  "examples": []
                },
                {
                  "meaning": "(fencing, historical) An assistant fencing master.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, military slang, obsolete) A provost cell: a military cell or prison.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "provost (third-person singular simple present provosts, present participle provosting, simple past and past participle provosted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, transitive, used in passive, obsolete, military slang) To be delivered to a provost marshal for punishment.",
                  "examples": [
                    "Around the time of the Rebellions of 1837 and the First Anglo-Afghan War, British servicemen spoke of being provosted."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}