{
  "word": "saturnine",
  "etymologies": [
    {
      "description": [
        "From Middle English saturnine, satournine, satournyne, saturnin, saturnyn, saturnyne (“pertaining to or under the influence of the planet Saturn; line on the palm of the hand associated with Saturn”), from Old French saturnine, saturnin (modern French saturnin (“of, pertaining to, resembling or containing lead, plumbic”)), or directly from its etymon Medieval Latin Sāturnīnus, from Sāturnus (“the Roman god Saturn; the planet Saturn”) + -īnus (suffix meaning ‘of or pertaining to’); analysable as Saturn +‎ -ine. The English word is cognate with Italian saturnino (“saturnine”), Portuguese saturnino (“melancholy, saturnine; pertaining to the planet Saturn”), Spanish saturnino (“melancholy, saturnine; pertaining to the planet Saturn”).",
        "Sense 1 (“having a tendency to be cold, bitter, gloomy, etc.”) refers to the fact that individuals born under the astrological influence of the planet Saturn were believed to have that disposition."
      ],
      "adjectives": [
        {
          "description": "saturnine (comparative more saturnine, superlative most saturnine)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Of a person: having a tendency to be cold, bitter, gloomy, sarcastic, and slow to change and react.",
                  "examples": [
                    "Synonyms: dark, grim, sardonic; see also Thesaurus:cheerless",
                    "Antonyms: cheerful, jovial; see also Thesaurus:happy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Of a setting: depressing, dull, gloomy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable, chemistry, archaic) Of, pertaining to, or containing lead (which was symbolically associated with the planet Saturn by alchemists).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, pathology) Caused or affected by lead poisoning (saturnism).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, astrology, obsolete) Pertaining to the astrological influence of the planet Saturn; having the characteristics of a person under such influence (see sense 1).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}