{
  "word": "chapter",
  "etymologies": [
    {
      "description": [
        "From Middle English chapiter, from Old French chapitre, from Latin capitulum (“a chapter of a book, in Medieval Latin also a synod or council”), diminutive of caput (“a head”); see capital, capitulum, and chapiter, which are doublets of chapter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chapter (plural chapters)",
          "definitionGroups": [
            {
              "group": "(authorship) One of the main sections into which the text of a book is divided.",
              "entries": [
                {
                  "meaning": "A section of a work, a collection of works, or fragments of works, often manuscripts or transcriptions, created by scholars or advocates, not the original authors, to aid in finding portions of the texts.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Certain ecclesiastical bodies (under canon law)",
              "entries": [
                {
                  "meaning": "An assembly of monks, prebendaries and/or other clergymen connected with a cathedral, conventual or collegiate church, or of a diocese, usually presided over by the dean.",
                  "examples": []
                },
                {
                  "meaning": "A community of canons or canonesses.",
                  "examples": []
                },
                {
                  "meaning": "A bishop's council.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A section of a social body.",
              "entries": [
                {
                  "meaning": "An administrative division of an organization, usually local to a specific area.",
                  "examples": []
                },
                {
                  "meaning": "An organized branch of some society or fraternity, such as the Freemasons.",
                  "examples": [
                    "If the By-Law which admits honorary members is silent upon their rights, they may perhaps be determined by a consideration of which of these classes was intended by the Chapter in admitting them"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A meeting of certain organized societies or orders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chapter house",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sequence (of events), especially when presumed related and likely to continue.",
                  "examples": [
                    "\"You know that Mr. Armadale is alive,\" pursued the doctor, \"and you know that he is coming back to England. Why do you continue to wear your widow's dress?\" ¶ She answered him without an instant's hesitation, steadily going on with her work. ¶ \"Because I am of a sanguine disposition, like you. I mean to trust to the chapter of accidents to the very last. Mr. Armadale may die yet, on his way home.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A location or compartment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chapter (third-person singular simple present chapters, present participle chaptering, simple past and past participle chaptered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To divide into chapters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put into a chapter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, with \"out\") To use administrative procedure to remove someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take to task.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}