{
  "word": "sundry",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Middle English sondri, sondry, syndry (“individually; occasionally; separately; variously”) [and other forms], from Old English syndriġ (“alone, distinct, separate, single; sundry, various; concerning a single person, own, particular, peculiar, private; exceptional, remarkable, set apart, special; (distributive) one each”) [and other forms], from sundor (“differently; privately; separate, separately”) (from Proto-Germanic *sundraz (“alone, isolated; separate”), ultimately from Proto-Indo-European *senH- (“apart; for oneself; without”)) + -iġ (“suffix forming adjectives”). The English word is analysable as sunder +‎ -y.",
        "The noun and pronoun are derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "sundry",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "More than one or two but not very many; a number of, several.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of various types, especially when numerous; diverse, varied.",
                  "examples": [
                    "Synonym: manifold"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Consisting of an assortment of different kinds; miscellaneous.",
                  "examples": [
                    "Synonyms: see Thesaurus:assorted, Thesaurus:heterogeneous",
                    "Antonyms: see Thesaurus:homogeneous"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Chiefly preceded by a number or an adjective like many: of two or more similar people or things: not the same as other persons or things of the same nature; different, distinct, separate. (Contrast sense 5.2.)",
                  "examples": [
                    "Synonym: other"
                  ]
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "Relating to a single person or thing as opposed to more than one; individual, respective.",
                  "examples": [
                    "Synonyms: personal, single"
                  ]
                },
                {
                  "meaning": "Of a person or thing: not the same as something else; different. (Contrast sense 4.)",
                  "examples": []
                },
                {
                  "meaning": "(except Scotland) Not attached or connected to anything else; physically separate.",
                  "examples": [
                    "Synonyms: apart, detached, loose; see also Thesaurus:separate"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "sundry (plural sundries) (chiefly in the plural)",
          "definitionGroups": [
            {
              "group": "A minor miscellaneous item.",
              "entries": [
                {
                  "meaning": "A food item eaten as an accompaniment to a meal; a side dish; also, such an item eaten on its own as a light meal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia, cricket) Synonym of extra (“a run scored without the ball having hit the striker's bat”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English sondri, sondry, syndri (“individually; now and then, occasionally; physically apart, separately; variously”) [and other forms], from Old English syndrige [and other forms], from Old English syndriġ (adjective): see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "sundry (comparative more sundry, superlative most sundry) (chiefly Northern England, Scotland)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of asunder (“into separate parts or pieces”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Placed separately; apart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Individually, separately; sundrily.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}