{
  "word": "economy",
  "etymologies": [
    {
      "description": [
        "From Middle English yconomye, yconomy, borrowed via Old French [Term?] or Medieval Latin from Latin oeconomia, from Ancient Greek οἰκονομία (oikonomía, “management of a household, administration”), from οἶκος (oîkos, “house”) + νέμω (némō, “distribute, allocate”) (surface analysis eco- +‎ -nomy). The first recorded sense of the word economy, found in a work possibly composed in 1440, is “the management of economic affairs”, in this case, of a monastery."
      ],
      "adjectives": [
        {
          "description": "economy (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cheap to run; using minimal resources; representing good value for money; economical.",
                  "examples": [
                    "He bought an economy car.",
                    "Economy size."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "economy (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) In or via the part of a commercial passenger airplane reserved for those paying the lower standard fares.",
                  "examples": [
                    "Numerous web sites have tips on how to fly economy."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "economy (countable and uncountable, plural economies)",
          "definitionGroups": [
            {
              "group": "Effective management of a community or system, or especially its resources.",
              "entries": [
                {
                  "meaning": "(obsolete) The regular operation of nature in the generation, nutrition and preservation of animals or plants.",
                  "examples": [
                    "animal economy, vegetable economy"
                  ]
                },
                {
                  "meaning": "(obsolete) System of management; general regulation and disposition of the affairs of a state or nation, or of any department of government.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A system of rules, regulations, rites and ceremonies.",
                  "examples": [
                    "the Jewish economy"
                  ]
                },
                {
                  "meaning": "(obsolete) The disposition or arrangement of any work.",
                  "examples": [
                    "the economy of a poem"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The study of money, currency and trade, and the efficient use of resources.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Frugal use of resources.",
                  "examples": [
                    "economy of word"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The system of production and distribution and consumption. The overall measure of a currency system; as the national economy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) The method of divine government of the world. (See w:Economy (religion).)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) The part of a commercial passenger airplane or train reserved for those paying the lower standard fares; economy class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Management of one’s residency.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}