{
  "word": "galaxy",
  "etymologies": [
    {
      "description": [
        "From Middle English galaxye, galaxie, from Old French galaxie, from Latin galaxias, from Ancient Greek γαλαξίας (galaxías, “Milky Way”), from γάλα (gála, “milk”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "galaxy (plural galaxies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The Milky Way; the apparent band of concentrated stars which appears in the night sky over earth. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) Any of the collections of many millions or billions of stars, galactic dust, black holes, etc. existing as independent and coherent systems, of which there are billions in the known universe. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An assemblage of things or people seen as luminous or brilliant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion, design) Any print or pattern reminiscent of a galaxy, generally consisting of blending, semiopaque patches of vibrant color on a dark background.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "galaxy (third-person singular simple present galaxies, present participle galaxying, simple past and past participle galaxied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish with galaxies.",
                  "examples": [
                    "[…]  how he struggled at one time like a desperate man fiercly [sic] grappling with his mortal foe, and at another like a sanguine lover and noble minded youth, as the cliffy rocks impeded his progress, or dimmed the view he had caught of an aperture, through which the galaxied firmament was seen in its purity and holiness glowing with diamonds and saphires;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To gather together into a luminous whole.",
                  "examples": [
                    "Let all their Vertues then be Galaxied into this one indiſtinct Luſtre, they were Faithful Servants of Chriſt, and Sufferers for their being ſo."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}