{
  "word": "battle",
  "etymologies": [
    {
      "description": [
        "From Middle English batel, batell, batelle, batayle, bataylle, borrowed from Old French bataille, from Late Latin battālia, variant of battuālia (“fighting and fencing exercises”) from Latin battuō (“to strike, hit, beat, fight”), from a Gaulish root from Proto-Indo-European *bʰedʰ- (“to stab, dig”), or possibly from a Proto-Indo-European *bʰew- (“to hit, strike, beat”). Doublet of battalia and battel. Displaced native Old English ġefeoht."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "battle (plural battles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contest, a struggle.",
                  "examples": [
                    "the battle of life"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A general action, fight, or encounter, in which all the divisions of an army are or may be engaged; a combat, an engagement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, now rare) A division of an army; a battalion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, obsolete) The main body of an army, as distinct from the vanguard and rear; the battalia.",
                  "examples": [
                    "hovering aloofe in the fields he suffered Wyat his Van and main Battell (cutting off some of the Reare) to march undisturbed save with one shot, from Knights-Bridge to Charing Chrosse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, clipping of) battle buddy",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "battle (third-person singular simple present battles, present participle battling, simple past and past participle battled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To join in battle; to contend in fight",
                  "examples": [
                    "Scientists always battle over theories.",
                    "She has been battling against cancer for years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fight or struggle; to enter into a battle with.",
                  "examples": [
                    "She has been battling cancer for years."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Early Modern English batell, probably from Middle English *batel (“flourishing”), from Old English *batol (“improving, tending to be good”), from batian (“to get better, improve”) + -ol ( +‎ -le)."
      ],
      "adjectives": [
        {
          "description": "battle (comparative more battle, superlative most battle)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, chiefly Scotland, Northern England, agriculture) Improving; nutritious; fattening.",
                  "examples": [
                    "battle grass, battle pasture"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, chiefly Scotland, Northern England) Fertile; fruitful.",
                  "examples": [
                    "battle soil, battle land"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "battle (third-person singular simple present battles, present participle battling, simple past and past participle battled) (transitive, UK dialectal, chiefly Northern England, Scotland)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To feed or nourish (someone or something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To render (land, soil, etc.) fertile or fruitful.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}