{
  "word": "denotation",
  "etymologies": [
    {
      "description": [
        "From to denote (from Middle French denoter, from Latin dēnotāre (“denote, mark out”), itself from dē- (“completely”) + notāre (“to mark”) + -ation; equivalent to denote +‎ -ation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "denotation (countable and uncountable, plural denotations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of denoting, or something (such as a symbol) that denotes",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic, linguistics, semiotics) The primary, surface, literal, or explicit meaning of a signifier such as a word, phrase, or symbol; that which a word denotes, as contrasted with its connotation; the aggregate or set of objects of which a word may be predicated.",
                  "examples": [
                    "The denotations of the two expressions \"the morning star\" and \"the evening star\" are the same (i.e. both expressions denote the planet Venus), but their connotations are different."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, logic) The intension and extension of a word",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(semantics) Something signified or referred to; a particular meaning of a symbol",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer science) Any mathematical object which describes the meanings of expressions from the languages, formalized in the theory of denotational semantics",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(media studies) A first level of analysis: what the audience can visually see on a page. Denotation often refers to something literal, and avoids being a metaphor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}