{
  "word": "tin",
  "etymologies": [
    {
      "description": [
        "From Middle English tin, from Old English tin, from Proto-West Germanic *tin, from Proto-Germanic *tiną."
      ],
      "adjectives": [
        {
          "description": "tin (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of tin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of galvanised iron or built of corrugated iron.",
                  "examples": [
                    "[I]n fact he was a big noise, literally, in the Baptist Chapel, known locally as the Tin Tab[ernacle] - whereas my family were 'church' and Uncle Ezekiel was an infidel at that."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tin (countable and uncountable, plural tins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A malleable, ductile, metallic element, resistant to corrosion, with atomic number 50 and symbol Sn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New Zealand, Australia, South Africa, Ireland, Britain, countable) An airtight container, made of tin or another metal, used to preserve food, or hold a liquid or some other product.",
                  "examples": [
                    "a tin of baked beans; a tobacco tin; a tin of shoe polish",
                    "Several tins of paint were needed to paint the house.",
                    "empty tins, cans, and plastic containers are recycled in the blue bins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A metal pan used for baking, roasting, etc.",
                  "examples": [
                    "muffin tin",
                    "roasting tin",
                    "baking tin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, squash) The bottom part of the front wall, which is \"out\" if a player strikes it with the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated, uncountable) money, especially silver money.",
                  "examples": [
                    "The father is a cotton lord, and they all have loads of tin, you know"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) computer hardware.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tin (third-person singular simple present tins, present participle tinning, simple past and past participle tinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place into a metal can (ie. a tin; be it tin, steel, aluminum) in order to preserve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with tin.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive) To coat with solder",
              "entries": [
                {
                  "meaning": "To coat with solder, in preparation for soldering, to ensure a good solder joint",
                  "examples": []
                },
                {
                  "meaning": "To coat with solder, in order to consolidate braided wire, so as to make contact with all strands and reduce fragility of the fraying wire",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}