{
  "word": "bounty",
  "etymologies": [
    {
      "description": [
        "From Middle English bounte (“goodness, virtue; beauty; strength; chivalry, valour; excellence; kindness, mercy; good deed; generosity”) [and other forms], borrowed from Anglo-Norman bounté and Old French bonté, bontet, bunté (modern French bonté (“goodness, kindness”)), from Latin bonitās,."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bounty (countable and uncountable, plural bounties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Generosity; also (countable) an act of generosity.",
                  "examples": [
                    "Synonyms: liberality, munificence, bounteousness, (all uncountable; the last obsolete) bountihood",
                    "Antonyms: frugality, parsimony, sparingness, (all uncountable) stinginess"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something given liberally; a gift.",
                  "examples": [
                    "Synonyms: boon, gratuity"
                  ]
                }
              ]
            },
            {
              "group": "(countable) A reward for some specific act, especially one given by an authority or a government.",
              "entries": [
                {
                  "meaning": "(specifically) A monetary reward for capturing (or, in the past, killing) a person accused or convicted of a crime and who is at large; also, a similar reward for capturing or killing an animal which is dangerous or causing a nuisance.",
                  "examples": []
                },
                {
                  "meaning": "(military, historical) Money paid to a person when becoming a member of the armed forces, or as a reward for some service therein.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, figuratively) An abundance or wealth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bounty (third-person singular simple present bounties, present participle bountying, simple past and past participle bountied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To offer a monetary reward for the capturing or killing of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}