{
  "word": "procession",
  "etymologies": [
    {
      "description": [
        "From Middle English processioun, borrowed from Old French pourciession, from Latin prōcessiō (“a marching forward, an advance, in Late Latin a religious procession”), from prōcēdere, past participle prōcessus (“to move forward, advance, proceed”); see proceed."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "procession (plural processions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of progressing or proceeding.",
                  "examples": [
                    "From whence it came to pass in the primitive times , that the Latin fathers taught expressly the procession of the Spirit from the Father and the Son"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people or things moving along in an orderly, stately, or solemn manner; a train of persons advancing in order; a retinue.",
                  "examples": [
                    "a procession of mourners",
                    "the Lord Mayor's procession"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number of things happening in sequence (in space or in time).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical, obsolete, in the plural) Litanies said in procession and not kneeling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The rapid dismissal of a series of batsmen.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "procession (third-person singular simple present processions, present participle processioning, simple past and past participle processioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take part in a procession.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To honour with a procession.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law, US, North Carolina, Tennessee) To ascertain, mark, and establish the boundary lines of (lands).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}