{
  "word": "fast",
  "etymologies": [
    {
      "description": [
        "From Middle English fast, fest, from Old English fæst (“firm, secure”), from Proto-West Germanic *fast, from Proto-Germanic *fastuz; see it for cognates and further etymology.",
        "The development of “rapid” from an original sense of “secure” apparently happened first in the adverb and then transferred to the adjective; compare hard in expressions like “to run hard”. The original sense of “secure, firm” is now slightly archaic, but retained in the related fasten (“make secure”)."
      ],
      "adjectives": [
        {
          "description": "fast (comparative faster, superlative fastest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Firmly or securely fixed in place; stable. [from 9th c.]",
                  "examples": [
                    "That rope is dangerously loose. Make it fast!",
                    "Synonyms: firm, immobile, secure, stable, stuck, tight",
                    "Antonym: loose",
                    "Hyponyms: bedfast, chairfast, colorfast, fail-fast, lightfast, shamefast, soothfast, steadfast"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Firm against attack; fortified by nature or art; impregnable; strong.",
                  "examples": [
                    "out-lawes  […]  lurking in woods and fast places"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of people) Steadfast, with unwavering feeling. (Now mostly in set phrases like fast friend(s).) [from 10th c.]",
                  "examples": [
                    "I still hear you sayin', \"Dear one, hold me fast\""
                  ]
                }
              ]
            },
            {
              "group": "Moving with great speed, or capable of doing so; swift, rapid. [from 14th c.]",
              "entries": [
                {
                  "meaning": "(nuclear physics, of a neutron) Having a kinetic energy between 1 million and 20 million electron volts; often used to describe the energy state of free neutrons at the moment of their release by a nuclear fission or nuclear fusion reaction (i.e., before the neutrons have been slowed down by anything).",
                  "examples": [
                    "Plutonium-240 has a much higher fission cross-section for fast neutrons than for thermal neutrons."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a place, characterised by business, hustle and bustle, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Causing unusual rapidity of play or action.",
                  "examples": [
                    "a fast racket, or tennis court",
                    "a fast track",
                    "a fast billiard table",
                    "a fast dance floor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, of a piece of hardware) Able to transfer data in a short period of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Deep or sound (of sleep); fast asleep (of people). [16th–19th c.]",
                  "examples": [
                    "Synonyms: deep, sound",
                    "Antonym: light"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of dyes or colours) Not running or fading when subjected to detrimental conditions such as wetness or intense light; permanent. [from 17th c.]",
                  "examples": [
                    "All the washing has come out pink. That red tee-shirt was not fast.",
                    "Synonym: colour-fast"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Tenacious; retentive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Having an extravagant lifestyle or immoral habits. [from 18th c.]",
                  "examples": [
                    "a fast woman"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ahead of the correct time or schedule. [from 19th c.]",
                  "examples": [
                    "There must be something wrong with the hall clock. It is always fast.",
                    "Synonyms: ahead, (as in “the clock is gaining x minutes per hour/day”) gain",
                    "Antonyms: behind, slow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of photographic film) More sensitive to light than average. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "fast (comparative faster, superlative fastest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a firm or secure manner, securely; in such a way as not to be moved; safe, sound [from 10th c.].",
                  "examples": [
                    "Hold this rope as fast as you can."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of sleeping) Deeply or soundly [from 13th c.].",
                  "examples": [
                    "He is fast asleep.",
                    "Synonym: deeply",
                    "Antonym: lightly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Immediately following in place or time; close, very near [from 13th c.].",
                  "examples": [
                    "The horsemen came fast on our heels.",
                    "Fast by the sturdy batsman the ball unheeded sped. / That ain't my style, said Casey. Strike one, the umpire said."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Quickly, with great speed; within a short time [from 13th c.].",
                  "examples": [
                    "Do it as fast as you can.",
                    "Synonyms: quickly, rapidly, speedily, swiftly",
                    "Antonym: slowly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ahead of the correct time or schedule.",
                  "examples": [
                    "I think my watch is running fast.",
                    "Synonym: ahead",
                    "Antonym: behind"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "fast (plural fasts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, rail transport) A train that calls at only some stations it passes between its origin and destination, typically just the principal stations",
                  "examples": [
                    "Synonyms: express, express train, fast train",
                    "Antonyms: local, slow train, stopper"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English fasten, from Old English fæstan (verb), Old English fæsten (noun) from\nProto-Germanic *fastāną (“fast”), from the same root as Proto-Germanic *fastijaną (“fasten”), derived from *fastuz, and thereby related to Etymology 1.\nThe religious sense is presumably introduced in the Gothic church, from Gothic 𐍆𐌰𐍃𐍄𐌰𐌽 (fastan, “hold fast (viz. to the rule of abstinence)”). This semantic development is unique to Gothic, the term glosses Greek νηστεύω (nēsteúō), Latin ieiuno which do not have similar connotations of \"holding fast\".\nThe feminine noun Old High German fasta likely existed in the 8th century (shift to neuter Old High German fasten from the 9th century, whence modern German Fasten).\nThe Old English noun originally had the sense \"fortress, enclosure\" and takes the religious sense only in late Old English, perhaps influenced by Old Norse fasta.\nThe use for reduced nutrition intake for medical reasons or for weight reduction develops by the mid-1970s, back-formed from the use of the verbal noun fasting in this sense (1960s)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fast (plural fasts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or practice of fasting, religious abstinence from food",
                  "examples": [
                    "And is it not the Command of Christ, that in their Fast they should not appear unto men to fast?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the fasting periods in the liturgical year",
                  "examples": [
                    "And so may we enter the Fasts at hand, beginning Lent the 30th. day of the Month Mechir"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fast (third-person singular simple present fasts, present participle fasting, simple past and past participle fasted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To practice religious abstinence, especially from food.",
                  "examples": [
                    "Thou didst fast and weep for the child."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To reduce or limit one's nutrition intake for medical or health reasons, to diet.",
                  "examples": [
                    "The ideal would be to fast in a situation where you are not tempted by food"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) (academic) To cause a person or animal to abstain, especially from eating.",
                  "examples": [
                    "At 11 weeks of age, all mice were fasted overnight and underwent gallbladder ultrasonography to determine ejection fraction."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}