{
  "word": "acquiesce",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French acquiescer, from Latin acquiescere; ad + quiescere (“to be quiet”), from quies (“rest”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "acquiesce (third-person singular simple present acquiesces, present participle acquiescing, simple past and past participle acquiesced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with in (or sometimes with, to)) To rest satisfied, or apparently satisfied, or to rest without opposition and discontent (usually implying previous opposition or discontent); to accept or consent by silence or by omitting to object.",
                  "examples": [
                    "The representatives of the good people of this commonwealth in general assembly convened, having maturely considered the answers of sundry states in the Union, to their resolutions passed at the last session, respecting certain unconstitutional laws of Congress, commonly called the alien and sedition laws, would be faithless indeed to themselves, and to those they represent, were they silently to acquiesce in principles and doctrines attempted to be maintained in all those answers, that of Virginia only excepted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To concur upon conviction; to assent to; usually, to concur, not heartily but so far as to forbear opposition.",
                  "examples": [
                    "to acquiesce in an opinion"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}