{
  "word": "fodder",
  "etymologies": [
    {
      "description": [
        "From Middle English fodder, foder, from Old English fōdor (“feed; fodder”), from Proto-West Germanic *fōdr, from Proto-Germanic *fōdrą, from *fōdô (“food”), from Proto-Indo-European *peh₂- (“to guard, graze, feed”).",
        "Compare Saterland Frisian Fodder, West Frisian foer, Dutch voer (“pasture; fodder”), German Futter (“fodder; feed”), Danish foder, Swedish foder. More at food."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fodder (countable and uncountable, plural fodders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Food for animals; that which is fed to cattle, horses, and sheep, such as hay, cornstalks, vegetables, etc.",
                  "examples": [
                    "Synonyms: forage, provender",
                    "Coordinate term: feed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A load: various English units of weight or volume based upon standardized cartloads of certain commodities, generally around 1000 kg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, drafting, design) Tracing paper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Stuff; material; something that serves as inspiration or encouragement, especially for satire or humour.",
                  "examples": [
                    "According to the audio commentary on “Treehouse Of Horror III,” some of the creative folks at The Simpsons were concerned that the “Treehouse Of Horror” franchise had outworn its welcome and was rapidly running out of classic horror or science-fiction fodder to spoof."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cryptic crosswords) The text to be operated on (anagrammed, etc.) within a clue.",
                  "examples": [
                    "In (part of) Shelley's poem Ozymandias is a \"crumbling statue\". If this is the explanation then the clue is not a reverse cryptic in the same was[sic] as GEGS -> SCRAMBLED EGGS but a normal clue where where[sic] the fodder and anagrind are *both* indirect."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "People considered to have negligible value and easily available or expendable.",
                  "examples": [
                    "Innocent people who are arrested become fodder for the justice system.",
                    "cannon fodder"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fodder (third-person singular simple present fodders, present participle foddering, simple past and past participle foddered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) To feed animals (with fodder).",
                  "examples": [
                    "Straw will do well enough to fodder them with"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}