{
  "word": "culminate",
  "etymologies": [
    {
      "description": [
        "Recorded since 1647, from Medieval Latin culminatus, the past participle of culminare (“to crown”), from Latin culmen (“peak, the highest point”), older form columen (“top, summit”), from Proto-Italic *kolamen, from a Proto-Indo-European base *kol-, *kelH- (“to project, rise; peak, summit, top”), whence also English hill and holm."
      ],
      "adjectives": [
        {
          "description": "culminate (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Relating to the culmen",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "culminate (third-person singular simple present culminates, present participle culminating, simple past and past participle culminated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, astronomy) Of a heavenly body, to be at the highest point, reach its greatest altitude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To reach the (physical or figurative) summit, highest point, peak etc.",
                  "examples": [
                    "Synonym: peak"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To reach a climax; to come to a decisive point, especially an end or conclusion.",
                  "examples": [
                    "Their messy breakup culminated in a restraining order.",
                    "The class will culminate with a rigorous examination."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, of an offensive, etc) To reach a point at which continued progress is not possible.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To finalize, bring to a conclusion, form the climax of.",
                  "examples": [
                    "The announcement by Tony Windsor and Rob Oakeshott in Canberra culminated more than a fortnight of intensive political horse-trading."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}