{
  "word": "woad",
  "etymologies": [
    {
      "description": [
        "From Middle English wode, from Old English wād (“woad”), from Proto-West Germanic *waiʀd, from Proto-Germanic *waizdaz (“woad”), from Proto-Indo-European *woydʰ-. Cognate with Old Frisian wēd (“woad”), Dutch wede (“woad”), German Waid (“woad”), and with French guède, Italian guado (“woad”) (both borrowed from Frankish). See also weed."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "woad (usually uncountable, plural woads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The plant Isatis tinctoria.",
                  "examples": [
                    "Woad is one of those plants which yield the deep blue colouring matter so greatly valued in the arts — Indigo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable and uncountable) The blue dye made from the leaves of the plant.",
                  "examples": [
                    "To prevent this, it was enacted, that no wines of Gaſcony and Guienne, or woads of Tholouſe, should be imported into England, except in ships belonging to the King, or some of his ſubjects; and that all ſuch wines and woads imported in foreign bottoms ſhould be forfeited."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "woad (third-person singular simple present woads, present participle woading, simple past and past participle woaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To plant or cultivate woad.",
                  "examples": [
                    "Now as the tenants after woading, pay the ſame rent as before, one cannot wonder at landlords making use of such an easy method to raise money: but it is the tenants that quarrel most at it; they assert the land to be 7 sg. an acre the worse for it; here then lies the enquiry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dye with woad.",
                  "examples": [
                    "All woollen goods truly mathered, ſhall be marked with a red roſe, and a blue roſe, and all ſuch truly woaded throughout, with a blue roſe only; and if any perſon shall affix any ſuch mark falsely, he ſhall forfeit, for every piece ſo marked 4l. (ſee under)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}