{
  "word": "overkill",
  "etymologies": [
    {
      "description": [
        "From over- +‎ kill."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "overkill (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literally, military) A destructive capacity that exceeds that needed to destroy an enemy; especially with nuclear weapons.",
                  "examples": [
                    "[The] increase in nuclear missiles available to the West was operationally unnecessary and would only add to the existing nuclear overkill; mixed manning was a formula for military disaster;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literally) Destruction beyond what is necessary to kill, especially in murder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) An unnecessary excess of whatever is needed to achieve a goal.",
                  "examples": [
                    "24 hours of TV coverage of the US election verged on overkill.",
                    "Should I give you yet more homework, or would that be overkill?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(manufacturing) An unnecessary excess of disposal because of too high criteria of inspection.",
                  "examples": [
                    "Antonym: underkill"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "overkill (third-person singular simple present overkills, present participle overkilling, simple past and past participle overkilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To destroy something with more (nuclear) force than is required.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(manufacturing) To dispose of too many items because of too-high criteria of inspection.",
                  "examples": [
                    "Antonym: underkill"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To do something excessive to achieve a goal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}