{
  "word": "plenum",
  "etymologies": [
    {
      "description": [
        "From Latin plēnum, noun use of neuter of plēnus (“full”). The sense of \"legislative meeting\" is  a semantic loan from Russian пле́нум (plénum, “plenary session”), from the same Latin source."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plenum (plural plenums or plena)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A space that is completely filled with matter.",
                  "examples": [
                    "The key to understanding medieval interpretations of motion in hypothetically void space is to realize that medieval natural philosophers analyzed the same bodies in the void that they discussed in the plenum of their ordinary world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A state of fullness, a great quantity (of something).",
                  "examples": [
                    "He lay on the long stone slant down to the slapping waves, his denim shorts, sneakers, and socks under his head for a pillow, feeling the splendour of distance in all directions, the liquid silence, the plenum of aloneness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A legislative meeting (especially of the Communist Party) in which all members are present.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enclosed space having greater than atmospheric pressure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The space above a false ceiling used for cables, ducts etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A type of network cabling which satisfies plenum-ratings issued by the National Electrical Code. These cables produce less smoke and fumes in the event of fire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}