{
  "word": "migraine",
  "etymologies": [
    {
      "description": [
        "1777 re-spelling (following French) of late 14th century Middle English megrim, from 13th century Old French migraigne, from Vulgar Latin pronunciation of Latin hemicrania (“pain in one half of the head”), from Ancient Greek ἡμικρανία (hēmikranía), from ἡμι- (hēmi-, “hemi-, half”) + κρανίον (kraníon, “skull”) (whence also cranium), a calque of Egyptian gs-tp (“headache”), from gs (“half”) + tp (“head”), although the link between the Egyptian magical papyri and the Greek ἡμικρανία (hēmikranía) could be purely incidental.",
        "Cognate to megrim, hemicrania."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "migraine (countable and uncountable, plural migraines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pathology) A severe, disabling headache, usually affecting only one side of the head, and often accompanied by nausea, vomiting, photophobia and visual disturbances.",
                  "examples": [
                    "He had a headache so bad that he wished he was dead, but it was the sort of migraine that promised him he would continue to suffer but not die.",
                    "After consuming too much coffee every day for six weeks, she got severe migraines that would last up until 47 minutes after her first cup of coffee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pathology) A neurological condition characterised by such headaches.",
                  "examples": [
                    "Syncope is estimated to occur in bouts of headache in approximately 5% of adult patients with migraine."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}