{
  "word": "bake",
  "etymologies": [
    {
      "description": [
        "From Middle English baken, from Old English bacan (“to bake”), from Proto-West Germanic *bakan, from Proto-Germanic *bakaną (“to bake”), from Proto-Indo-European *bʰeh₃g- (“to roast, bake”).",
        "Cognate with West Frisian bakke (“to bake”), Dutch bakken (“to bake”), Low German backen (“to bake”), German backen (“to bake”), Norwegian Bokmål bake (“to bake”), Danish bage (“to bake”), Swedish baka (“to bake”), Ancient Greek φώγω (phṓgō, “roast”, verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bake (plural bakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of cooking food by baking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially UK, Australia, New Zealand) Any of various baked dishes resembling casserole.",
                  "examples": [
                    "If you happen to have small, heat-proof glass or ceramic pots in your kitchen (known as ramekins) then you can make this very easy pasta bake in fun-size, individual portions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any food item that is baked.",
                  "examples": [
                    "Baking parchment should not be confused with greaseproof paper — the former has a non-stick coating and will ensure that your bakes lift out of the tin or off the baking sheets easily, the latter will have the opposite effect!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A social event at which food (such as seafood) is baked, or at which baked food is served.",
                  "examples": [
                    "The central episode is the temporary burial of the novitiate; a shallow pit is excavated, and in this a fire is made, as for a fish bake;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Barbados, sometimes US and UK) A small, flat (or ball-shaped) cake of dough eaten in Barbados and sometimes elsewhere, similar in appearance and ingredients to a pancake but fried (or in some places sometimes roasted).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bake (third-person singular simple present bakes, present participle baking, simple past baked or (dialectal) book, past participle baked or (dialectal) baken)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive or ditransitive, with person as subject) To cook (something) in an oven (for someone).",
                  "examples": [
                    "I baked a delicious cherry pie.",
                    "She's been baking all day to prepare for the dinner.",
                    "He baked her a cake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with baked thing as subject) To be cooked in an oven.",
                  "examples": [
                    "The cake baked at 350°F."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be warmed to drying and hardening.",
                  "examples": [
                    "The clay baked in the sun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dry by heat.",
                  "examples": [
                    "They baked the electrical parts lightly to remove moisture."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To be hot.",
                  "examples": [
                    "It is baking in the greenhouse.",
                    "I'm baking after that workout in the gym."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To cause to be hot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To smoke marijuana.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To harden by cold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer graphics, transitive) To fix (lighting, reflections, etc.) as part of the texture of an object to improve rendering performance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, with \"in\" or \"into\") To incorporate into something greater.",
                  "examples": [
                    "Disagreements between pilots' unions are baked into the merger cake."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}