{
  "word": "windlass",
  "etymologies": [
    {
      "description": [
        "From Middle English wyndlas, wyndelas, wyndlasse, wyndelasse, probably an alteration (due to Middle English windel) of Middle English windas, wyndas, wyndace, from Anglo-Norman windase, windeis and Old Northern French windas (compare Old French guindas, Medieval Latin windasius, windasa), from Old Norse vindáss (“windlass”, literally “winding-pole”), from vinda (“to wind”) + áss (“pole”). Compare Icelandic vindilass."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "windlass (plural windlasses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various forms of winch, in which a rope or cable is wound around a cylinder, used for lifting heavy weights",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A winding and circuitous way; a roundabout course.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An apparatus resembling a winch or windlass, for bending the bow of an arblast, or crossbow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "windlass (third-person singular simple present windlasses, present participle windlassing, simple past and past participle windlassed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To raise with, or as if with, a windlass; to use a windlass.",
                  "examples": [
                    "A favoring breeze enabled us to sail all the way down the lake, and (having been windlassed across the haul-over) even down the canals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take a roundabout course; to work warily or by indirect means.",
                  "examples": [
                    "He could not expect to allure him forward, and therefore drives him as far back as he can; that so he may be the more sure of him at the rebound; as a skilful woodsman, that by windlassing presently gets a shoot, which, without taking a compass and thereby a commodious stand, he could never have obtained."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}