{
  "word": "lour",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English louren, lour, loure (“to frown or scowl; to be dark or overcast; to droop, fade, wither; to lurk, skulk”), probably from Old English *lūran, *lūrian, from Proto-Germanic *lūraną (“to lie in wait, lurk”). The English word is cognate with Danish lure (“to lie in ambush; to take a nap”), Middle Dutch loeren (modern Dutch loeren (“to lurk, spy on”)), Middle Low German lūren (“to lie in ambush”), German Low German luren (“to lurk”), Middle High German lūren (“to lie in ambush”) (modern German lauern (“to lie in ambush; to lurk”)), Icelandic lúra (“to take a nap”), Saterland Frisian luurje (“to lie in wait”), West Frisian loere (“to lurk”), and Swedish lura (“to lie in ambush; to deceive, fool, trick; to lure; to take a nap”); and is related to lurk.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lour (plural lours)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A frown, a scowl; an angry or sullen look.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Of the sky, the weather, etc.: a dark, gloomy, and threatening appearance.",
                  "examples": [
                    "Synonyms: gloom, gloominess"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lour (third-person singular simple present lours, present participle louring, simple past and past participle loured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To frown; to look sullen.",
                  "examples": [
                    "Synonyms: glower, scowl"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To be dark, gloomy, and threatening, as clouds; of the sky: to be covered with dark and threatening clouds; to show threatening signs of approach, as a tempest.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}