{
  "word": "translation",
  "etymologies": [
    {
      "description": [
        "From Middle English translacioun (“transfer, translation”), from Anglo-Norman translacioun, from Latin trānslātiō, from trānslāt-, the supine stem of trānsferō (“to transfer, transport, transform, translate”). Displaced native Old English wending."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "translation (countable and uncountable, plural translations)",
          "definitionGroups": [
            {
              "group": "(countable, uncountable) The act of translating, in its various senses:",
              "entries": [
                {
                  "meaning": "The conversion of text from one language to another.",
                  "examples": [
                    "This old text needs translation into modern English before it is published."
                  ]
                },
                {
                  "meaning": "(translation studies) The discipline or study of translating written language (as opposed to interpretation, which concerns itself with spoken language).",
                  "examples": []
                },
                {
                  "meaning": "The conversion of something from one form or medium to another.",
                  "examples": []
                },
                {
                  "meaning": "(physics, mathematics) A motion or compulsion to motion in a straight line without rotation or other deformation.",
                  "examples": []
                },
                {
                  "meaning": "(mathematics) A relation between two mathematical figures such as a straight line where the coordinates of each point in one figure is a constant added to the coordinates of a corresponding point in the other figure.",
                  "examples": []
                },
                {
                  "meaning": "(genetics) The process whereby a strand of mRNA directs assembly of amino acids into proteins within a ribosome.",
                  "examples": []
                },
                {
                  "meaning": "(physics) A transfer of motion occurring within a gearbox.",
                  "examples": []
                },
                {
                  "meaning": "The automatic retransmission of a telegraph message.",
                  "examples": []
                },
                {
                  "meaning": "The conveyance of something from one place to another, especially:",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) An ascension to Heaven without death.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A transfer of a bishop from one diocese to another.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) A transfer of a holy relic from one shrine to another.",
                  "examples": []
                },
                {
                  "meaning": "(medicine) A transfer of a disease from one body part to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The product or end result of an act of translating, in its various senses.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}