{
  "word": "society",
  "etymologies": [
    {
      "description": [
        "1530s; borrowed from Middle French societé, from Old French societé, from Latin societās, societātem (“fellowship, association, alliance, union, community”), from socius (“associated, allied; partner, companion, ally”), from Proto-Indo-European *sokʷ-yo- (“companion”), from Proto-Indo-European *sekʷ- (“to follow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "society (countable and uncountable, plural societies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A long-standing group of people sharing cultural aspects such as language, dress, norms of behavior and artistic forms.",
                  "examples": [
                    "This society has been known for centuries for its colorful clothing and tight-knit family structure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A group of people who meet from time to time to engage in a common interest; an association or organization.",
                  "examples": [
                    "It was then that they decided to found a society of didgeridoo-playing unicyclists."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The sum total of all voluntary interrelations between individuals.",
                  "examples": [
                    "The gap between Western and Eastern societies seems to be narrowing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The people of one’s country or community taken as a whole.",
                  "examples": [
                    "Our global society develops in fits and starts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) High society.",
                  "examples": [
                    "Smith was first introduced into society at the Duchess of Grand Fenwick's annual rose garden party."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, law) A number of people joined by mutual consent to deliberate, determine and act toward a common goal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}