{
  "word": "oncome",
  "etymologies": [
    {
      "description": [
        "From Middle English oncomen, from Old English oncuman, ancuman (“to arrive, come upon, happen”), from Proto-Germanic *anakwemaną (“to come to, come at, arrive”), equivalent to on- +‎ come. Cognate with Dutch aankomen (“to arrive”), German ankommen (“to arrive”), Swedish ankomma (“to arrive”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "oncome (third-person singular simple present oncomes, present participle oncoming, simple past oncame, past participle oncome)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare) To arrive; come to; come on.",
                  "examples": [
                    "This said, and shaking his long dark spear, then forward he hurl'd it Into the fullround buckler of Priamides Alexander; Right thro' his glittering shield oncame the redoubtable warspear, On still advanced, throughpiercing his breastplate's various-art-work [...]"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English oncome (“an attack”), equivalent to on- +‎ come. Compare Old English ancuman (“to arrive, come upon, happen”). More at ancome, income."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "oncome (plural oncomes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Advent, arrival, approach; onset",
                  "examples": [
                    "I see the dawn or rather I feel the oncome of it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The commencement or initial stages of a business, especially of one which requires great exertion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The setting about of an action; development; progress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attack; an attack or onset of a disease, fit, or episode.",
                  "examples": [
                    "On inquiry it was found that this neurosis corresponded in time with the oncome of the catamenia."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) A mysterious disease or ailment.",
                  "examples": [
                    "This woman had acquired a considerable reputation among the ignorant by the pretended cures which she performed, especially in oncomes, as the Scotch call them, or mysterious diseases, which baffle the regular physician."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) A heavy fall of rain or snow; cloudburst.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a chimney) The lower edge of a fire-clay lining piece.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}