{
  "word": "balderdash",
  "etymologies": [
    {
      "description": [
        "Unknown, possibly from the early English drink of wine mixed with beer or water or other substances that was sold cheaply."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "balderdash (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Senseless talk or writing; nonsense.",
                  "examples": [
                    "Where, you cried in the name of Wonder, have you been able to gather together such an old fashioned Bundlement of Scientific Balderdash?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A worthless mixture, especially of liquors.",
                  "examples": [
                    "Indeede Beere, by a Mixture of Wine, it enjoyes approbation amongst some few (that hardly understand wherefore) but then it is no longer Beere, but hath lost both Name and Nature, and is called Balderdash (an Utopian denomination) [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Obscene language or writing.",
                  "examples": [
                    "Trugge, therefore, (who has a foul mouth of his own, when he pleases) talked balderdash to Mrs. Sudberry, through the key-hole, which she did not answer, for, indeed, she seems a civil spoken woman, truly [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "balderdash (third-person singular simple present balderdashes, present participle balderdashing, simple past and past participle balderdashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To mix or adulterate.",
                  "examples": [
                    "That which is made by the peasants, both red and white, is generally genuine: but the wine-merchants of Nice brew and balderdash, and even mix it with pigeons dung and quick-lime."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}