{
  "word": "old",
  "etymologies": [
    {
      "description": [
        "From Middle English olde, ald, from Old English ald, eald (“old, aged, ancient, antique, primeval”), from Proto-West Germanic *ald, from Proto-Germanic *aldaz (“grown-up”), originally a participle form, from Proto-Indo-European *h₂eltós (“grown, tall, big”).",
        "Cognate with Scots auld (“old”), North Frisian ool, ual, uul (“old”), Saterland Frisian oold (“old”), West Frisian âld (“old”), Dutch oud (“old”), Low German old (“old”), German alt (“old”), Swedish äldre (“older, elder”), Icelandic eldri (“older, elder”), Latin altus (“high, tall, grown big, lofty”). Related to eld."
      ],
      "adjectives": [
        {
          "description": "old (comparative older or elder, superlative (US, dialectal) oldermost or oldest or eldest)",
          "definitionGroups": [
            {
              "group": "Of an object, concept, relationship, etc., having existed for a relatively long period of time.",
              "entries": [
                {
                  "meaning": "Of a living being, having lived for most of the expected years.",
                  "examples": [
                    "a wrinkled old man"
                  ]
                },
                {
                  "meaning": "Of a perishable item, having existed for most of, or more than, its shelf life.",
                  "examples": [
                    "an old loaf of bread"
                  ]
                },
                {
                  "meaning": "Of a species or language, belonging to a lineage that is distantly related others",
                  "examples": [
                    "the ginkgo is one of the oldest living trees",
                    "Basque is the oldest language in Europe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having been used and thus no longer new or unused.",
                  "examples": [
                    "I find that an old toothbrush is good to clean the keyboard with."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having existed or lived for the specified time.",
                  "examples": [
                    "How old are they? She’s five years old and he's seven. We also have a young teen and a two-year-old child.",
                    "My great-grandfather lived to be a hundred and one years old."
                  ]
                }
              ]
            },
            {
              "group": "(heading) Of an earlier time.",
              "entries": [
                {
                  "meaning": "Former, previous.",
                  "examples": [
                    "My new car is not as good as my old one.  a school reunion for Old Etonians"
                  ]
                },
                {
                  "meaning": "That is no longer in existence.",
                  "examples": [
                    "The footpath follows the route of an old railway line."
                  ]
                },
                {
                  "meaning": "Obsolete; out-of-date.",
                  "examples": [
                    "That is the old way of doing things; now we do it this way."
                  ]
                },
                {
                  "meaning": "Familiar.",
                  "examples": [
                    "When he got drunk and quarrelsome they just gave him the old heave-ho."
                  ]
                },
                {
                  "meaning": "(UK) Being a graduate or alumnus of a school, especially a public school.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Tiresome after prolonged repetition.",
                  "examples": [
                    "Your constant pestering is getting old."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Said of subdued colors, particularly reds, pinks and oranges, as if they had faded over time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A grammatical intensifier, often used in describing something positive, and combined with another adjective.",
                  "examples": [
                    "We're having a good old time.",
                    "My next car will be a big old SUV.",
                    "My wife makes the best little old apple pie in Texas.",
                    "any old"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, of a person) Indicating affection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Excessive, abundant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "old (plural olds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with the, invariable plural only) People who are old; old beings; the older generation, taken as a group.",
                  "examples": [
                    "A civilised society should always look after the old in the community."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A person older than oneself, especially an adult in relation to a teenager.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, most often plural) One's parents.",
                  "examples": [
                    "I had to sneak out to meet my girlfriend and tell the olds I was going to the library."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, uncountable) A typically dark-coloured lager brewed by the traditional top-fermentation method.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}