{
  "word": "phenomenon",
  "etymologies": [
    {
      "description": [
        "From Late Latin phaenomenon (“appearance”), from Ancient Greek φαινόμενον (phainómenon, “thing appearing to view”), neuter present middle participle of φαίνω (phaínō, “I show”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "phenomenon (plural phenomena or (nonstandard) phenomenons or phenomenon)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing or being, event or process, perceptible through senses; or a fact or occurrence thereof.",
                  "examples": [
                    "The Indians, making a hasty inference from a trivial phenomenon, arrived unawares at a probably correct conclusion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A knowable thing or event (eg by inference, especially in science)",
                  "examples": [
                    "An electromagnetic phenomenon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind or type of phenomenon (sense 1 or 2)",
                  "examples": [
                    "A volcanic eruption is an impressive phenomenon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Appearance; a perceptible aspect of something that is mutable.",
                  "examples": [
                    "I verily believe that in the Moon there are no rains, for if Clouds should gather in any part thereof, as they do about the Earth, they would thereupon hide from our sight some of those things, which we with the Telescope behold in the Moon, and in a word, would some way or other change its Phœnomenon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fact or event considered very unusual, curious, or astonishing by those who witness it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wonderful or very remarkable person or thing.",
                  "examples": [
                    "But, all the same, you're a phenomenon, and as queer a phenomenon as you are a blackguard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, chiefly Kantian idealism) An experienced object whose constitution reflects the order and conceptual structure imposed upon it by the human mind (especially by the powers of perception and understanding).",
                  "examples": [
                    "Every \"phenomenon\" must be, at any rate, partly subjective or dependent on the subject."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}