{
  "word": "cavalier",
  "etymologies": [
    {
      "description": [
        "First attested in  1589. Borrowed from Middle French cavalier (“horseman”), itself borrowed from Old Italian cavaliere (“mounted soldier, knight”), borrowed from Old Occitan cavalier, from Late Latin caballārius (“horseman”), from Latin caballus (“horse”), probably from Gaulish caballos 'nag', variant of cabillos (compare Welsh ceffyl, Breton kefel, Irish capall), akin to German (Swabish) Kōb 'nag' and Old Church Slavonic кобꙑла (kobyla) 'mare'.",
        "Previous English forms include cavalero and cavaliero."
      ],
      "adjectives": [
        {
          "description": "cavalier (comparative more cavalier, superlative most cavalier)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not caring enough about something important.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "High-spirited.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Supercilious.",
                  "examples": [
                    "Synonyms: haughty, disdainful, curt, brusque"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Of or pertaining to the party of King Charles I of England (1600–1649).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cavalier (plural cavaliers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A military man serving on horse, (chiefly) early modern cavalry officers who had abandoned the heavy armor of medieval knights.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A gallant: a sprightly young dashing military man.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A gentleman of the class of such officers, particularly:",
              "entries": [
                {
                  "meaning": "(historical) A courtesan or noble under Charles I of England, particularly a royalist partisan during the English Civil War which ended his reign.",
                  "examples": [
                    "Antonym: Roundhead"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Someone with an uncircumcised penis.",
                  "examples": [
                    "Antonym: roundhead"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A defensive work rising from a bastion, etc., and overlooking the surrounding area.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Cavalier King Charles Spaniel, a small breed of spaniel of English origin with a silky, smooth coat and commonly a smooth undocked tail.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cavalier (third-person singular simple present cavaliers, present participle cavaliering, simple past and past participle cavaliered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) Of a man: to act in a gallant and dashing manner toward (women).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}