{
  "word": "monkey",
  "etymologies": [
    {
      "description": [
        "Uncertain. May be either derived from Middle English monk, or borrowed from Middle Low German Moneke, name of the son of Martin the Ape in Reynard the Fox (which may represent an unattested colloquial *moneke, which in turn is possibly a diminutive from Middle French monne, from Old Spanish mona, shortening of mamona, variant of maimón, from Arabic مَيْمُون‎ (maymūn, “baboon”)). Compare Old French Monequin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "monkey (plural monkeys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(properly) A member of the clade Simiiformes other than those in the clade Hominoidea containing humans and apes, generally (but not universally) distinguished by small size, tails, and cheek pouches.",
                  "examples": [
                    "He had been visiting an area zoo when a monkey swung from its tree perch, swiped his glasses and hurled them into a hippo hole."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(inexact, sometimes proscribed) Any simian primate other than hominids, any monkey or ape.",
                  "examples": [
                    "Chimpanzees are known to form bands to hunt and kill other monkeys."
                  ]
                }
              ]
            },
            {
              "group": "(figurative, generally derogatory) A human considered to resemble monkeys in some way, including:",
              "entries": [
                {
                  "meaning": "(informal, sometimes offensive) A naughty or mischievous person, especially a child.",
                  "examples": [
                    "Stop misbehaving, you cheeky little monkey!"
                  ]
                },
                {
                  "meaning": "(slang) The person in the motorcycle sidecar in sidecar racing.",
                  "examples": []
                },
                {
                  "meaning": "(derogatory) Synonym of idiot: a person of minimal intelligence.",
                  "examples": []
                },
                {
                  "meaning": "(derogatory) Synonym of uggo: an unattractive person, especially one whose face supposedly resembles a monkey's.",
                  "examples": []
                },
                {
                  "meaning": "(slang, derogatory) Synonym of puppet: a person dancing to another's tune, a person controlled or directed by another.",
                  "examples": [
                    "No, no, no, not you. I want to talk to the organ grinder, not the monkey."
                  ]
                },
                {
                  "meaning": "(slang, usually derogatory) A menial employee who does a repetitive job supposedly requiring minimal intelligence.",
                  "examples": [
                    "code monkey... grease monkey... phone monkey... powder monkey..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory, ethnic slur, offensive) A black, a black person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A small trading vessel of the sixteenth century.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, nautical) The vessel in which a mess receives its full allowance of grog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The weight of a pile driver or drop hammer.",
                  "examples": [
                    "Someone handed me a monkey of grog. I forced myself to sip it, not down it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fluid consisting of hydrochloric acid and zinc, used in the process of soldering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Synonym of five hundred, especially (Britain) 500 pounds sterling or (US, dated) 500 dollars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(blackjack) Synonym of face card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A person's temper, said to be \"up\" when they are angry.",
                  "examples": [
                    "I was out rather late one night, when the foreman of my department, who owed me a grudge, abused me like a dog, and told me I might consider myself dismissed, and that I should be paid my wages in the morning. I don't know how I kept my hands off him, for my monkey was up;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A drug habit; an addiction; a compulsion.",
                  "examples": [
                    "Monkey: a habit, as in \"I have a monkey on my back.\" Usually used when one is sick from lack of drugs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance) A dance popularized by Major Lance in 1963, now usually only its upper-body dance move involving exaggerated drumming motions.",
                  "examples": [
                    "Do the Monkey, yeah,Do the Monkey, yeah,Ah, twist them hips,Let your backbone slip,Now move your feet,Get on the beat..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "monkey (third-person singular simple present monkeys, present participle monkeying, simple past and past participle monkeyed or monkied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To meddle; to mess (with).",
                  "examples": [
                    "Please don't monkey with the controls if you don't know what you're doing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mimic; to ape.",
                  "examples": [
                    "He winked at Liza, who monkeyed him, holding her own eye shut."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}