{
  "word": "hurtle",
  "etymologies": [
    {
      "description": [
        "From Middle English hurtlen, hurtelen, equivalent to hurt +‎ -le."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hurtle (plural hurtles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fast movement in literal or figurative sense.",
                  "examples": [
                    "But the war woke me up, I began to move left, and recent events have accelerated that move until it is now a hurtle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A clattering sound.",
                  "examples": [
                    "There came a hurtle of wings, a flash of bright feathers, and a great pigeon with slate-grey plumage and a neck bright as an opal, lit on a swaying finial."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hurtle (third-person singular simple present hurtles, present participle hurtling, simple past and past participle hurtled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move rapidly, violently, or without control.",
                  "examples": [
                    "The car hurtled down the hill at 90 miles per hour.",
                    "Pieces of broken glass hurtled through the air."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To meet with violence or shock; to clash; to jostle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To make a threatening sound, like the clash of arms; to make a sound as of confused clashing or confusion; to resound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hurl or fling; to throw hard or violently.",
                  "examples": [
                    "He hurtled the wad of paper angrily at the trash can and missed by a mile."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To push; to jostle; to hurl.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}