{
  "word": "tongue",
  "etymologies": [
    {
      "description": [
        "From Middle English tonge, tunge, tung, from Old English tunge, from Proto-West Germanic *tungā, from Proto-Germanic *tungǭ (“tongue”) (compare West Frisian tonge, Dutch tong, Luxembourgish Zong, Zazaki Zon, German Zunge, Yiddish צונג‎ (tsung), Danish tunge, Norwegian Bokmål tunge, Swedish tunga, Gothic 𐍄𐌿𐌲𐌲𐍉 (tuggō)), from Proto-Indo-European *dn̥ǵʰwéh₂s.",
        "Cognate with Old Irish tengae, Latin lingua, Tocharian A käntu, Tocharian B kantwo, Lithuanian liežùvis, Russian язык (jazyk), Polish język, Old Armenian լեզու (lezu), Avestan 𐬵𐬌𐬰𐬎𐬎𐬁‎ (hizuuā), Ashkun žū, Kamkata-viri dić, Sanskrit जिह्वा (jihvā́). Doublet of language and lingua."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tongue (plural tongues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The flexible muscular organ in the mouth that is used to move food around, for tasting and that is moved into various positions to modify the flow of air from the lungs in order to produce different sounds in speech.",
                  "examples": [
                    "Synonyms: glossa, lingua"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) This organ, as taken from animals used for food (especially cows).",
                  "examples": [
                    "cold tongue with mustard"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any similar organ, such as the lingual ribbon, or odontophore, of a mollusk; the proboscis of a moth or butterfly; or the lingua of an insect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metonymically) A language.",
                  "examples": [
                    "Synonyms: idiom, language, lingo (colloquial)",
                    "He was speaking in his native tongue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Speakers of a language, collectively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Voice (the distinctive sound of a person's speech); accent (distinctive manner of pronouncing a language).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Manner of speaking, often habitually.",
                  "examples": [
                    "Al maters wel pondred and wel to be regarded,How ſhuld a fals lying tung then be rewarded?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metonymically) A person speaking in a specified manner (most often plural).",
                  "examples": [
                    "I know that we must keep apart for a long while; cruel tongues would force us apart, if nothing else did."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The power of articulate utterance; speech generally.",
                  "examples": [
                    "Parrots imitating Human Tongue"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Discourse; fluency of speech or expression.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) Discourse; fluency of speech or expression.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Honourable discourse; eulogy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion, often in the plural) Glossolalia.",
                  "examples": [
                    "Synonym: speaking in tongues"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a shoe, the flap of material that goes between the laces and the foot (so called because it resembles a tongue in the mouth).",
                  "examples": [
                    "I caught a glimpse of a brown boot, the tongue flapping, the sole tied on with string."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any large or long physical protrusion on an automotive or machine part or any other part that fits into a long groove on another part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A projection, or slender appendage or fixture.",
                  "examples": [
                    "the tongue of a buckle, or of a balance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, narrow strip of land, projecting from the mainland into a sea or lake.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The pole of a vehicle; especially, the pole of an ox cart, to the end of which the oxen are yoked.",
                  "examples": [
                    "Far to the right, where the main pile sloped out, his cart reared tongue upward, like a plow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The clapper of a bell.",
                  "examples": [
                    "[...] the bell clanged so loud that he could hear the iron tongue clapping against the metal sides each time it swung to and fro [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An individual point of flame from a fire.",
                  "examples": [
                    "Then up a steep and dark and narrow stair",
                    "We wound, until the torches’ fiery tongue",
                    "Amid the gushing day beamless and pallid hung."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small sole (type of fish).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A short piece of rope spliced into the upper part of standing backstays, etc.; also, the upper main piece of a mast composed of several pieces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A reed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A division of formation; A layer or member of a formation that pinches out in one direction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tongue (third-person singular simple present tongues, present participle tonguing, simple past and past participle tongued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, transitive, intransitive) On a wind instrument, to articulate a note by starting the air with a tap of the tongue, as though by speaking a 'd' or 't' sound (alveolar plosive).",
                  "examples": [
                    "Playing wind instruments involves tonguing on the reed or mouthpiece."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To manipulate with the tongue, as in kissing or oral sex.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To protrude in relatively long, narrow sections.",
                  "examples": [
                    "a soil horizon that tongues into clay"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To join by means of a tongue and groove.",
                  "examples": [
                    "to tongue boards together"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To talk; to prate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To speak; to utter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To chide; to scold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}