{
  "word": "illegal",
  "etymologies": [
    {
      "description": [
        "Borrowed from French illégal, from Medieval Latin illegalis, from Latin legalis. In senses relating to immigration, via clipping from illegal alien or illegal immigrant."
      ],
      "adjectives": [
        {
          "description": "illegal (comparative more illegal, superlative most illegal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Contrary to or forbidden by law, especially criminal law.",
                  "examples": [
                    "This is illegal, you know!",
                    "Nearly 40 million people live in UK areas with illegal air pollution",
                    "their illegal mining operations in Asia, Africa and elsewhere, are protected by officials and police paid to look the other way – and powerful customers in the construction industry who prefer not to ask too many questions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Breaching certain enacted statutes of positive law; not lawful, not legal (cf. immoral, unethical)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Forbidden by established rules.",
                  "examples": [
                    "Synonym: unethical",
                    "Moving a pawn backward is an illegal move in chess."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philately, of an issue printed for collectors) Totally fictitious, and often issued on behalf of a non-existent territory or country.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person, sometimes offensive) Being or doing something illegally.",
                  "examples": [
                    "illegal immigrant",
                    "illegal logger",
                    "illegal pilot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, sometimes offensive) Being an illegal immigrant; residing in a country illegally.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "illegal (plural illegals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An illegal act or technique.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, in the plural, as illegals) Contraband, esp. illegal substances such as drugs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, offensive) An illegal immigrant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(espionage) A spy working abroad illegally and undercover, without visible ties to his or her country’s authorities.",
                  "examples": [
                    "Anna Chapman, whose glamorous appearance won her more publicity in the Western media than all the other illegals combined, was so successfully deceived by a US sting operation that she handed over her SVR laptop to an FBI agent posing as a Russian."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}