{
  "word": "police",
  "etymologies": [
    {
      "description": [
        "From Middle French police, from Latin polītīa (“state, government”), from Ancient Greek πολιτεία (politeía). Doublet of policy and polity."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "police pl (normally plural, singular police)",
          "definitionGroups": [
            {
              "group": "A public agency charged with enforcing laws and maintaining public order, usually being granted special privileges to do so, particularly [from 18th c.]",
              "entries": [
                {
                  "meaning": "(Canada, US and historical) A department of local (usually municipal) government responsible for general law enforcement.",
                  "examples": [
                    "The Cook County Sheriff's Department has jurisdiction across most of Chicago but focuses on the unincorporated area and tasks like prisoner transport, leaving the rest to the Chicago Police Department."
                  ]
                },
                {
                  "meaning": "(UK) A branch of the Home Office responsible for general law enforcement within a specific territory.",
                  "examples": [
                    "Scotland Yard is, technically speaking, only the metropolitan police for Greater London but because of their importance they have special jurisdiction for some crimes across the United Kingdom."
                  ]
                },
                {
                  "meaning": "(Australia, New Zealand) Any of the formally enacted law enforcement agencies at various levels of government.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually plural only) The staff of such a department or agency, particularly its officers; (regional, chiefly US, Caribbean, Jamaica, Scotland, countable) an individual police officer. [from 19th c.]",
                  "examples": [
                    "Pearlman: Very clever, Lester. You got it all figured, huh?Freamon: Me? I'm just a police."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, usually ironic and mildly derogatory) People who try to enforce norms or standards as if granted authority similar to the police.",
                  "examples": [
                    "Who called the fashion police?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, slang) Cleanup of a military facility, as a formal duty.",
                  "examples": [
                    "Q.  […]  What did you do that day? — A. I was cleaning up around quarters.Q. You had been on guard and went on police duty? You were policing, cleaning up around the barracks? — A. Yes, sir."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, now rare) Synonym of administration, the regulation of a community or society. [from 17th c.]",
                  "examples": [
                    "The notion of ‘police’ – that is, rational administration – was seen as a historical force which could bring civilized improvement to societies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Alternative form of policy. [15th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Alternative form of polity, civilization, a regulated community. [16th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "police (third-person singular simple present polices, present participle policing, simple past and past participle policed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enforce the law and keep order among (a group).",
                  "examples": [
                    "Extra security was hired to police the crowd at the big game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, military, slang) To clean up an area.",
                  "examples": [
                    "This comes to him through the company housekeeping, for in the field each organization takes care of itself, cooks its own food, makes its own beds, does its own policing (cleaning up);  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To enforce norms or standards upon.",
                  "examples": [
                    "to police a person's identity"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}