{
  "word": "telltale",
  "etymologies": [
    {
      "description": [
        "From tell +‎ tale."
      ],
      "adjectives": [
        {
          "description": "telltale (comparative more telltale, superlative most telltale)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Revealing something, especially something not intended to be known.",
                  "examples": [
                    "His eye was blinking, a telltale signal that he was lying.",
                    "He blushed when he approached, a telltale sign that he was happy to see him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "telltale (plural telltales)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who divulges private information with intent to hurt others.",
                  "examples": [
                    "Synonyms: blabbermouth, gossip, rumormonger, squealer, talebearer, tattletale; see also Thesaurus:gossiper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An indicator, such as a warning light, that serves to warn of a hazard or problem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something that serves to reveal something else.",
                  "examples": [
                    "The telltale was the lipstick on his shirt collar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A movable piece of ivory, lead, or other material, connected to the bellows of an organ, whose position indicates when the wind is exhausted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A length of yarn or ribbon attached to a sail or shroud etc to indicate the direction of the flow of the air relative to the boat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A mechanical attachment to the steering wheel, which, in the absence of a tiller, shows the position of the helm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A compass in the cabin of a vessel, usually placed where the captain can see it at all hours, and thus inform himself of the vessel's course.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A machine or contrivance for indicating or recording something, particularly for keeping a check upon employees (factory hands, watchmen, drivers, etc.) by revealing to their employers what they have done or omitted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bird, the tattler.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A story or fable that has a moral or message.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}