{
  "word": "unicorn",
  "etymologies": [
    {
      "description": [
        "From Middle English unicorne, unikorn, from Anglo-Norman unicorne, Old French unicorne, and their source, Latin ūnicornis, from ūnus (“one”) + cornū (“horn”). Other senses from either rarity (e.g., possessing multiple skills) or by physical resemblance to having a horn (e.g., howitzer). The finance sense was coined by American investor Aileen Lee and first used in a 2013 article."
      ],
      "adjectives": [
        {
          "description": "unicorn (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having one horn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "unicorn (plural unicorns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mythical beast resembling a horse or deer with a single, straight, spiraled horn projecting from its forehead.",
                  "examples": [
                    "Hyponyms: pegacorn, unipeg, unisus",
                    "Meronym: alicorn",
                    "Holonym: blessing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) In various Bible translations, used to render the Latin unicornis or rhinoceros (representing Hebrew רְאֵם‎): a reem or wild ox.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any large beetle having a horn-like prominence on the head or prothorax, especially the Hercules beetle, Dynastes tityus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A caterpillar, Schizura unicornis, with a large thorn-like spine on the back near its head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The kamichi, or unicorn bird.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A howitzer.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Someone or something that is rare and hard to find.",
              "entries": [
                {
                  "meaning": "(sexual slang) A single, usually bisexual woman who participates in swinging or polyamory.",
                  "examples": []
                },
                {
                  "meaning": "(business) A person with multidisciplinary expertise, especially three or more skills in a young field such as UX design or data science (e.g., domain knowledge, statistics, and software engineering).",
                  "examples": [
                    "Synonym: purple squirrel"
                  ]
                },
                {
                  "meaning": "(finance) A startup company whose valuation has exceeded one billion U.S. dollars, which is solely backed by venture capitalists, and which has yet to have an IPO.",
                  "examples": [
                    "Coordinate term: decacorn"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive) Being many (especially pastel) colours; multicoloured.",
                  "examples": [
                    "unicorn smoothies"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A 15th-century Scottish gold coin worth 18 shillings, bearing the image of a unicorn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "unicorn (third-person singular simple present unicorns, present participle unicorning, simple past and past participle unicorned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sexual slang) To participate in a sexual threesome as a bisexual addition to an established heterosexual couple.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) To exceed a valuation of one billion U.S. dollars, while solely backed by venture capitalists.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}