{
  "word": "touch",
  "etymologies": [
    {
      "description": [
        "From Middle English touchen, tochen, from Old French tochier (“to touch”) (whence Modern French toucher; compare French doublet toquer (“to offend, bother, harass”)), from Vulgar Latin *tuccō (“to knock, strike, offend”), from Frankish *tukkōn (“to knock, strike, touch”), from Proto-Germanic *tukkōną (“to tug, grab, grasp”), from Proto-Indo-European *dewk- (“to draw, pull, lead”). Displaced native Middle English rinen, from Old English hrīnan (whence Modern English rine)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "touch (countable and uncountable, plural touches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of touching, especially with the hand or finger.",
                  "examples": [
                    "Suddenly, in the crowd, I felt a touch at my shoulder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The faculty or sense of perception by physical contact.",
                  "examples": [
                    "With the lights out, she had to rely on touch to find her desk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The style or technique with which one plays a musical instrument.",
                  "examples": [
                    "He performed one of Ravel's piano concertos with a wonderfully light and playful touch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The particular or characteristic mode of action, or the resistance of the keys of an instrument to the fingers.",
                  "examples": [
                    "a heavy touch, or a light touch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distinguishing feature or characteristic.",
                  "examples": [
                    "Clever touches like this are what make her such a brilliant writer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A little bit; a small amount.",
                  "examples": [
                    "Move it left just a touch and it will be perfect.",
                    "I'd like to see a touch more enthusiasm in the project."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a sports field beyond the touchlines or goal-lines.",
                  "examples": [
                    "He got the ball, and kicked it straight out into touch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A relationship of close communication or understanding.",
                  "examples": [
                    "He promised to keep in touch while he was away.",
                    "lose touch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to perform a task well; aptitude.",
                  "examples": [
                    "I used to be a great chess player but I've lost my touch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Act or power of exciting emotion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An emotion or affection.",
                  "examples": [
                    "a true, natural, and a sensible touch of mercy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Personal reference or application.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single stroke on a drawing or a picture.",
                  "examples": [
                    "Never give the least touch with your pencil till you have well examined your design."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A brief essay.",
                  "examples": [
                    "Print my preface in such form as, in the booksellers' phrase, will make a sixpenny touch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A touchstone; hence, stone of the sort used for touchstone.",
                  "examples": [
                    "a neat new monument of touch and alabaster"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Examination or trial by some decisive standard; test; proof; tried quality.",
                  "examples": [
                    "equity, the true touch of all laws"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shipbuilding) The broadest part of a plank worked top and but, or of one worked anchor-stock fashion (that is, tapered from the middle to both ends); also, the angles of the stern timbers at the counters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The children's game of tag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bell-ringing) A set of changes less than the total possible on seven bells, i.e. less than 5,040.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An act of borrowing or stealing something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, plumbing, dated) Tallow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Form; standard of performance.",
                  "examples": [
                    "Jackson Hately, Isaac Cumming and Nick Shipley have been in great touch in the NEAFL."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football) A disposal of the ball during a game, i.e. a kick or a handball.",
                  "examples": [
                    "With just six touches, small forward Daniel Rioli was uncharacteristically quiet against Melbourne, although he did lay five tackles."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "touch (third-person singular simple present touches, present participle touching, simple past and past participle touched)",
          "definitionGroups": [
            {
              "group": "Primarily physical senses.",
              "entries": [
                {
                  "meaning": "(transitive) To make physical contact with; to bring the hand, finger or other part of the body into contact with. [from 14th c.]",
                  "examples": [
                    "I touched his face softly."
                  ]
                },
                {
                  "meaning": "(transitive) To come into (involuntary) contact with; to meet or intersect. [from 14th c.]",
                  "examples": [
                    "Sitting on the bench, the hem of her skirt touched the ground."
                  ]
                },
                {
                  "meaning": "(intransitive) To come into physical contact, or to be in physical contact. [from 14th c.]",
                  "examples": [
                    "They stood next to each other, their shoulders touching."
                  ]
                },
                {
                  "meaning": "(intransitive) To make physical contact with a thing. [from 14th c.]",
                  "examples": [
                    "Please can I have a look, if I promise not to touch?"
                  ]
                },
                {
                  "meaning": "(transitive) To physically disturb; to interfere with, molest, or attempt to harm through contact. [from 14th c.]",
                  "examples": [
                    "If you touch her, I'll kill you."
                  ]
                },
                {
                  "meaning": "(transitive) To make intimate physical contact with a person.",
                  "examples": []
                },
                {
                  "meaning": "(transitive or reflexive) To sexually excite with the fingers; to finger or masturbate. [from 20th c.]",
                  "examples": [
                    "Her parents had caught her touching herself when she was fifteen."
                  ]
                },
                {
                  "meaning": "(transitive) To cause to be briefly in contact with something.",
                  "examples": [
                    "He quickly touched his knee to the worn marble.",
                    "The demonstrator nearly touched the rod on the ball.",
                    "She touched her lips to the glass."
                  ]
                },
                {
                  "meaning": "(transitive) To physically affect in specific ways implied by context. [from 15th c.]",
                  "examples": [
                    "Frankly, this wood's so strong that sandpaper won't touch it."
                  ]
                },
                {
                  "meaning": "(transitive) To consume, or otherwise use. [from 15th c.]",
                  "examples": [
                    "Are you all right? You've hardly touched your lunch."
                  ]
                },
                {
                  "meaning": "(intransitive) Of a ship or its passengers: to land, to make a short stop (at). [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(transitive, now historical) To lay hands on (someone suffering from scrofula) as a form of cure, as formerly practised by English and French monarchs. [from 17th c.]",
                  "examples": [
                    "But in fact the English kings of the seventeenth century usually began to touch form the day of their accession, without waiting for any such consecration."
                  ]
                },
                {
                  "meaning": "(intransitive, obsolete) To fasten; to take effect; to make impression.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) To bring (a sail) so close to the wind that its weather leech shakes.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, nautical) To be brought, as a sail, so close to the wind that its weather leech shakes.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) To keep the ship as near (the wind) as possible.",
                  "examples": [
                    "to touch the wind"
                  ]
                }
              ]
            },
            {
              "group": "Primarily non-physical senses.",
              "entries": [
                {
                  "meaning": "(transitive) To imbue or endow with a specific quality. [from 14th c.]",
                  "examples": [
                    "My grandfather, as many people know, was touched with greatness."
                  ]
                },
                {
                  "meaning": "(transitive, archaic) To deal with in speech or writing; to mention briefly, to allude to. [from 14th c.]",
                  "examples": [
                    "Next to sorrow still I may annex such accidents as procure fear; for besides those terrors which I have before touched, […] there is a superstitious fear […] which much trouble many of us."
                  ]
                },
                {
                  "meaning": "(intransitive) To deal with in speech or writing; briefly to speak or write (on or upon something). [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To concern, to have to do with. [14th–19th c.]",
                  "examples": [
                    "And now it seemed he was engaged in something which touched them closely, but must be hidden from their knowledge."
                  ]
                },
                {
                  "meaning": "(transitive) To affect emotionally; to bring about tender or painful feelings in. [from 14th c.]",
                  "examples": [
                    "Stefan was touched by the song's message of hope."
                  ]
                },
                {
                  "meaning": "(transitive, dated) To affect in a negative way, especially only slightly. [from 16th c.]",
                  "examples": [
                    "He had been drinking over lunch, and was clearly touched."
                  ]
                },
                {
                  "meaning": "(transitive, Scottish history) To give royal assent to by touching it with the sceptre. [from 17th c.]",
                  "examples": [
                    "The bill was finally touched after many hours of deliberation."
                  ]
                },
                {
                  "meaning": "(transitive, slang) To obtain money from, usually by borrowing (from a friend). [from 18th c.]",
                  "examples": [
                    "I was running short, so I touched old Bertie for a fiver."
                  ]
                },
                {
                  "meaning": "(transitive, always passive) To disturb the mental functions of; to make somewhat insane; often followed with \"in the head\". [from 18th c.]",
                  "examples": [
                    "You must be touched if you think I'm taking your advice."
                  ]
                },
                {
                  "meaning": "(transitive, in negative constructions) To be on the level of; to approach in excellence or quality. [from 19th c.]",
                  "examples": [
                    "There was his mistress, Maria Morano. I don't think I've ever seen anything to touch her, and when you work for the screen [as I do] you're apt to have a pretty exacting standard of female beauty."
                  ]
                },
                {
                  "meaning": "(transitive) To come close to; to approach.",
                  "examples": [
                    "On Sunday afternoon it was as dark as night, with barely room for two riders abreast on a gradient that touches 20%."
                  ]
                },
                {
                  "meaning": "(transitive, computing) To mark (a file or document) as having been modified.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To try; to prove, as with a touchstone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mark or delineate with touches; to add a slight stroke to with the pencil or brush.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To infect; to affect slightly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strike; to manipulate; to play on.",
                  "examples": [
                    "to touch an instrument of music"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perform, as a tune; to play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To influence by impulse; to impel forcibly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}