{
  "word": "gnome",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek γνώμη (gnṓmē, “thought, opinion”), from the base of γιγνώσκειν (gignṓskein, “to know”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gnome (plural gnomae or gnomai or gnomes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief reflection or maxim; a pithy saying.",
                  "examples": [
                    "Synonyms: adage, apothegm, maxim, paroemia, proverb, sententia"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French gnome (“gnome”), from New Latin gnomus, used by Paracelsus as a synonym for pygmaeus (“pygmy”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gnome (plural gnomes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(magic, alchemy, Rosicrucianism) An elemental (spirit or corporeal creature associated with a classical element) associated with earth.",
                  "examples": [
                    "He adopts the Rosycrusian fancy of Gnomes, spirits which inhabit the earth, and who by their power form the ores of metals, and all the wonders met with in the inmost recesses of the globe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mythology, fantasy) One of a race of imaginary human-like beings, usually depicted as short and typically bearded males, who inhabit the inner parts of the earth and act as guardians of mines, mineral treasure, etc.; in modern fantasy literature and games, when distinguished from dwarves, gnomes are usually even smaller than dwarves and more focussed on engineering than mining.",
                  "examples": [
                    "There were not one but four gnomes standing at his feet. “I nearly trod on you,” Daniel said. “What are you doing here?”",
                    "The gnomes just stood, looking up at him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person of small stature or misshapen features, or of strange appearance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The northern pygmy owl, Glaucidium gnoma, a small owl of the western United States.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small statue of a dwarf-like character, often bearded, placed in a garden.",
                  "examples": [
                    "My mother-in-law, who swears she is a good Lutheran but is also the most powerful Witch I have ever met, also has at least a dozen small lawn gnomes peeking out from beside her shrubs, next to the lilac bushes, and hanging out with the roses. My husband has already started our collection; as of this writing, four gnomes and one moss-covered rabbit hang out in the shrubbery by the front door, two gnomes live in the dining room, and one guards the perpetual pile of to-do paperwork that lives next to the computer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy, meteorology) An upper atmospheric optical phenomenon associated with thunderstorms, a compact blue starter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often derogatory) A banker, especially a secretive international one.",
                  "examples": [
                    "the gnomes of Zurich"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}