{
  "word": "mushroom",
  "etymologies": [
    {
      "description": [
        "From Middle English muscheron, musseron, from Anglo-Norman musherum, moscheron, from Old French moisseron, of obscure origin: probably derived from Old French mosse, moise (“moss”), as the use first applied to a type of fungus which grows in moss, from Frankish *mosa (“moss”) or Old Dutch mosa (“moss”), akin to Old High German mos (“moss, bog”), Old High German mios (“moss, mire”), Old English mēos (“moss”), Old English mōs (“bog, marsh”), Old Norse mosi (“moss”), Old Norse myrr (“bog, mire”), from Proto-Germanic *musą, *musô, *miuziz (“mosses, bog”), from Proto-Indo-European *mews- (“mosses, mold, mildew”). Displaced native Old English swamm. More at mire. Alternatively, the Old French may be of pre-Roman origin. See Ancient Greek μύκης (múkēs, “mushroom”)."
      ],
      "adjectives": [
        {
          "description": "mushroom (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having characteristics like those of a mushroom, for example in shape or appearance, speed of growth, or texture.",
                  "examples": [
                    "mushroom cloud"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mushroom (plural mushrooms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the fleshy fruiting bodies of fungi typically produced above ground on soil or on their food sources (such as decaying wood).",
                  "examples": [
                    "Synonyms: (archaic) mushrump, shroom",
                    "Some mushrooms are edible and taste good, while others are poisonous and taste foul."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fungus producing such fruiting bodies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Champignon or Agaricus bisporus, the mushroom species most commonly used in cooking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the mushroom-shaped pegs in bar billiards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A concrete column with a thickened portion at the top, used to support a slab.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, figurative) One who rises suddenly from a low condition in life; an upstart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Something that grows very quickly or seems to appear suddenly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ellipsis of mushroom cloud.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mushroom (third-person singular simple present mushrooms, present participle mushrooming, simple past and past participle mushroomed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To grow quickly to a large size.",
                  "examples": [
                    "The town’s population mushroomed from 10,000 to 110,000 in five years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To gather mushrooms.",
                  "examples": [
                    "We used to go mushrooming in the forest every weekend."
                  ]
                }
              ]
            },
            {
              "group": "To form the shape of a mushroom.",
              "entries": [
                {
                  "meaning": "(ballistics, of a bullet) To form the shape of a mushroom when striking a soft target.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}