{
  "word": "bunch",
  "etymologies": [
    {
      "description": [
        "From Middle English bunche, bonche (“hump, swelling”), of uncertain origin.",
        "Perhaps a variant of *bunge (compare dialectal bung (“heap, grape bunch”)), from Proto-Germanic *bunkō, *bunkô, *bungǭ (“heap, crowd”), from Proto-Indo-European *bʰenǵʰ-, *bʰéng̑ʰus (“thick, dense, fat”). Cognates include Saterland Frisian Bunke (“bone”), West Frisian bonke (“bone, lump, bump”), Dutch bonk (“lump, bone”), Low German Bunk (“bone”), German Bunge (“tuber”), Danish bunke (“heap, pile”), Faroese bunki (“heap, pile”); Hittite [Term?] (/panku/, “total, entire”), Tocharian B pkante (“volume, fatness”), Lithuanian búožė (“knob”), Ancient Greek παχύς (pakhús, “thick”), Sanskrit बहु (bahú, “thick; much”)).",
        "Alternatively, perhaps from a variant or diminutive of bump (compare hump/hunch, lump/lunch, etc.); or from dialectal Old French bonge (“bundle”) (compare French bongeau, bonjeau, bonjot), from West Flemish bondje, diminutive of West Flemish bond (“bundle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bunch (plural bunches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of similar things, either growing together, or in a cluster or clump, usually fastened together.",
                  "examples": [
                    "a bunch of grapes",
                    "a bunch of bananas",
                    "a bunch of keys",
                    "a bunch of yobs on a street corner"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling) The peloton; the main group of riders formed during a race.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An informal body of friends.",
                  "examples": [
                    "He still hangs out with the same bunch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, informal) A considerable amount.",
                  "examples": [
                    "a bunch of trouble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An unmentioned amount; a number.",
                  "examples": [
                    "A bunch of them went down to the field."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(forestry) A group of logs tied together for skidding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology, mining) An unusual concentration of ore in a lode or a small, discontinuous occurrence or patch of ore in the wallrock.",
                  "examples": [
                    "The ore may be disseminated throughout the matrix in minute particles, as gold in quartz; in parallel threads, strings, and plates, as with copper; in irregular pockets or bunches"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textiles) The reserve yarn on the filling bobbin to allow continuous weaving between the time of indication from the midget feeler until a new bobbin is put in the shuttle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(smoking) An unfinished cigar, before the wrapper leaf is added.",
                  "examples": [
                    "Two to four filler leaves are laid end to end and rolled into the two halves of the binder leaves, making up what is called the bunch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A protuberance; a hunch; a knob or lump; a hump.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bunch (third-person singular simple present bunches, present participle bunching, simple past and past participle bunched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To gather into a bunch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To gather fabric into folds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form a bunch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be gathered together in folds",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To protrude or swell",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}