{
  "word": "constitutional",
  "etymologies": [
    {
      "description": [
        "From constitution +‎ -al (suffix meaning ‘of or pertaining to’ forming adjectives). Constitution is derived from Middle English constitucioun, constitucion (“edict, law, ordinance, regulation, rule, statute; body of laws or rules, or customs; body of fundamental principles; principle or rule (of science); creation”) from Old French constitucion (modern French constitution), a learned borrowing from Latin cōnstitūtiō, cōnstitūtiōnem (“character, constitution, disposition, nature; definition; point in dispute; order, regulation; arrangement, system”), from cōnstituō (“to establish, set up; to confirm; to decide, resolve”) (from con- (prefix indicating a being or bringing together of several objects) + statuō (“to set up, station; to establish; to determine, fix”) (ultimately from Proto-Indo-European *steh₂- (“to stand (up)”))) + -tiō (suffix forming nouns relating to actions or the results of actions), -tiōnem (accusative singular of -tiō)."
      ],
      "adjectives": [
        {
          "description": "constitutional (comparative more constitutional, superlative most constitutional)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Belonging to, or inherent in, the constitution or structure of one's body or mind.",
                  "examples": [
                    "a constitutional infirmity   constitutional ardour or dullness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "For the benefit of one's constitution or health.",
                  "examples": [
                    "a constitutional walk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to the constitution or composition of something; essential, fundamental.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(law)",
              "entries": [
                {
                  "meaning": "Relating to a legal or political constitution (“the basic law of a nation or institution; the formal or informal system of primary principles and laws that regulates a government or other institution”).",
                  "examples": [
                    "a constitutional right   constitutional reforms",
                    "Brexit has rocked the foundations of the nation and plunged everyone into a state of heightened constitutional anxiety.",
                    "Some are already speculating that a constitutional crisis is brewing."
                  ]
                },
                {
                  "meaning": "In compliance with or valid under a legal or political constitution.",
                  "examples": [
                    "Antonyms: anticonstitutional, nonconstitutional, unconstitutional",
                    "The Supreme Court ruled against the applicant and found the statute constitutional."
                  ]
                },
                {
                  "meaning": "(also politics) Of a monarch: having a purely ceremonial role, or possessing powers limited by a constitution rather than plenary or unlimited powers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "constitutional (plural constitutionals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A walk that is taken regularly for good health and wellbeing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) An act of defecation.",
                  "examples": [
                    "morning constitutional"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}