{
  "word": "stick",
  "etymologies": [
    {
      "description": [
        "From Middle English stikke (“stick, rod, twig”), from Old English sticca (“rod, twig”), from Proto-West Germanic *stikkō, from Proto-Germanic *stikkô, from Proto-Indo-European *(s)teyg- (“to pierce, prick, be sharp”). Cognate with Saterland Frisian Stikke (“stick”), West Flemish stik (“stick”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stick (countable and uncountable, plural sticks)",
          "definitionGroups": [
            {
              "group": "An elongated piece of wood or similar material, typically put to some use, for example as a wand or baton.",
              "entries": [
                {
                  "meaning": "A small, thin branch from a tree or bush; a twig; a branch.",
                  "examples": [
                    "Synonyms: branch, twig, (dialectal) rice, kindling, (uncountable) brush",
                    "The beaver's dam was made out of sticks."
                  ]
                },
                {
                  "meaning": "A relatively long, thin piece of wood, of any size.",
                  "examples": [
                    "I found several good sticks in the brush heap.",
                    "What do you call a boomerang that won't come back? A stick."
                  ]
                },
                {
                  "meaning": "(US) A timber board, especially a two by four (inches).",
                  "examples": [
                    "Synonym: two by four",
                    "I found enough sticks in dumpsters at construction sites to build my shed."
                  ]
                },
                {
                  "meaning": "A cane or walking stick (usually wooden, metal or plastic) to aid in walking.",
                  "examples": [
                    "Synonyms: cane, walking stick",
                    "I don’t need my stick to walk, but it’s helpful."
                  ]
                },
                {
                  "meaning": "A cudgel or truncheon (usually of wood, metal or plastic), especially one carried by police or guards.",
                  "examples": [
                    "As soon as the fight started, the guards came in swinging their sticks."
                  ]
                },
                {
                  "meaning": "(carpentry) The vertical member of a cope-and-stick joint.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) A mast or part of a mast of a ship; also, a yard.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) A piece (of furniture, especially if wooden).",
                  "examples": [
                    "Synonyms: piece, item",
                    "We were so poor we didn't have one stick of furniture."
                  ]
                }
              ]
            },
            {
              "group": "Any roughly cylindrical (or rectangular) unit of a substance.",
              "entries": [
                {
                  "meaning": "a stick of butter(chiefly Canada, US) A small rectangular block, with a length several times its width, which contains by volume one half of a cup of shortening (butter, margarine or lard).",
                  "examples": [
                    "The recipe calls for half a stick of butter."
                  ]
                },
                {
                  "meaning": "a stick of gumA standard rectangular strip of chewing gum.",
                  "examples": [
                    "Don’t hog all that gum, give me a stick!"
                  ]
                },
                {
                  "meaning": "(slang) A cigarette (usually a tobacco cigarette, less often a marijuana cigarette).",
                  "examples": [
                    "Synonyms: joint, reefer",
                    "Cigarettes are taxed at one dollar per stick."
                  ]
                }
              ]
            },
            {
              "group": "Material or objects attached to a stick or the like.",
              "entries": [
                {
                  "meaning": "A bunch of something wrapped around or attached to a stick.",
                  "examples": [
                    "My parents bought us each a stick of cotton candy."
                  ]
                },
                {
                  "meaning": "(archaic) A scroll that is rolled around (mounted on, attached to) a stick.",
                  "examples": []
                },
                {
                  "meaning": "(military) The structure to which a set of bombs in a bomber aircraft are attached and which drops the bombs when it is released. The bombs themselves and, by extension, any load of similar items dropped in quick succession such as paratroopers or containers.",
                  "examples": [
                    "Synonym: train"
                  ]
                }
              ]
            },
            {
              "group": "A tool, control, or instrument shaped somewhat like a stick.",
              "entries": [
                {
                  "meaning": "(US, colloquial) A manual transmission, a vehicle equipped with a manual transmission, so called because of the stick-like, i.e. twig-like, control (the gear shift) with which the driver of such a vehicle controls its transmission.",
                  "examples": [
                    "Synonyms: stickshift, gearstick",
                    "I grew up driving a stick, but many people my age didn’t."
                  ]
                },
                {
                  "meaning": "the stick-shift lever in a manual transmission car(US, colloquial, uncountable) Vehicles, collectively, equipped with manual transmissions.",
                  "examples": [
                    "I grew up driving stick, but many people my age didn't."
                  ]
                },
                {
                  "meaning": "(aviation) The control column of an aircraft; a joystick. (By convention, a wheel-like control mechanism with a handgrip on opposite sides, similar to the steering wheel of an automobile, can also be called the \"stick\", although \"yoke\" or \"control wheel\" is more commonly seen.)",
                  "examples": []
                },
                {
                  "meaning": "(aviation, uncountable) Use of the stick to control the aircraft.",
                  "examples": []
                },
                {
                  "meaning": "(computing) A memory stick.",
                  "examples": []
                },
                {
                  "meaning": "(slang) A handgun.",
                  "examples": [
                    "2007 September 18,  “Johnny, I Hardly Knew Ya”, in  The Meanest of Times‎[1], performed by Dropkick Murphys, traditional:A stick in the hand, a drop in the eye.",
                    "2013 April 8,  “Off the Record”, in  Topic of Discussion‎[2], performed by Yungen:You think you’re real now you’ve got a couple sticks? My favourite younger, he got stabbed in my bits. And if he died fam, I promise I’d have quit."
                  ]
                },
                {
                  "meaning": "(dated, letterpress typography) A composing stick, the tool used by compositors to assemble lines of type.",
                  "examples": []
                },
                {
                  "meaning": "(jazz, slang) The clarinet.",
                  "examples": [
                    "Synonyms: licorice stick, liquorice stick"
                  ]
                }
              ]
            },
            {
              "group": "(sports) A stick-like item:",
              "entries": [
                {
                  "meaning": "two hockey sticks, for the goalie at righta lacrosse stick(sports, generically) A long thin implement used to control a ball or puck in sports like hockey, polo, and lacrosse.",
                  "examples": [
                    "Tripping with the stick is a violation of the rules."
                  ]
                },
                {
                  "meaning": "(horse racing) The short whip carried by a jockey.",
                  "examples": []
                },
                {
                  "meaning": "(boardsports) A board as used in board sports, such as a surfboard, snowboard, or skateboard.",
                  "examples": []
                },
                {
                  "meaning": "(golf) The pole bearing a small flag that marks the hole.",
                  "examples": [
                    "Synonyms: pin, flagstick",
                    "His wedge shot bounced off the stick and went in the hole."
                  ]
                },
                {
                  "meaning": "(US, slang, uncountable) The cue used in billiards, pool, snooker, etc.",
                  "examples": [
                    "His stroke with that two-piece stick is a good as anybody's in the club."
                  ]
                },
                {
                  "meaning": "The game of pool, or an individual pool game.",
                  "examples": [
                    "He shoots a mean stick of pool."
                  ]
                }
              ]
            },
            {
              "group": "(sports, uncountable) Ability; specifically:",
              "entries": [
                {
                  "meaning": "(golf) The long-range driving ability of a golf club.",
                  "examples": []
                },
                {
                  "meaning": "(baseball) The potential hitting power of a specific bat.",
                  "examples": []
                },
                {
                  "meaning": "(baseball) General hitting ability.",
                  "examples": []
                },
                {
                  "meaning": "(field hockey or ice hockey) The potential accuracy of a hockey stick, implicating also the player using it.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(slang, dated) A person or group of people. (Perhaps, in some senses, because people are, broadly speaking, tall and thin, like pieces of wood.)",
              "entries": [
                {
                  "meaning": "A thin or wiry person; particularly a flat-chested woman.",
                  "examples": []
                },
                {
                  "meaning": "(magic) An assistant planted in the audience.",
                  "examples": [
                    "Synonyms: plant, shill"
                  ]
                },
                {
                  "meaning": "(gambling) A shill or house player.",
                  "examples": [
                    "A shill is also called a stick, and the role of the shill or stick is to make the customer relax and feel at ease."
                  ]
                },
                {
                  "meaning": "A stiff, stupidly obstinate person.",
                  "examples": []
                },
                {
                  "meaning": "(military aviation, from joystick) A fighter pilot.",
                  "examples": []
                },
                {
                  "meaning": "(military, South Africa) A small group of (infantry) soldiers.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Encouragement or punishment, or (resulting) vigour or other improved behavior.",
              "entries": [
                {
                  "meaning": "A negative stimulus or a punishment. (This sense derives from the metaphor of using a stick, a long piece of wood, to poke or beat a beast of burden to compel it to move forward. Compare carrot.)",
                  "examples": []
                },
                {
                  "meaning": "(slang, uncountable) Corporal punishment; beatings.",
                  "examples": []
                },
                {
                  "meaning": "(slang) Vigor; spirit; effort, energy, intensity.",
                  "examples": [
                    "He really gave that digging some stick. = he threw himself into the task of digging",
                    "She really gave that bully some stick. = she berated him (this sense melts into the previous sense, \"punishment\")",
                    "Give it some stick!"
                  ]
                },
                {
                  "meaning": "(slang) Vigorous driving of a car; gas.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A measure.",
              "entries": [
                {
                  "meaning": "(obsolete) An English Imperial unit of length equal to 2 inches.",
                  "examples": []
                },
                {
                  "meaning": "(archaic, rare) A quantity of eels, usually 25.",
                  "examples": [
                    "Synonyms: stich, broach"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stick (third-person singular simple present sticks, present participle sticking, simple past and past participle sticked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(carpentry) To cut a piece of wood to be the stick member of a cope-and-stick joint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, printing, slang, dated) To compose; to set, or arrange, in a composing stick.",
                  "examples": [
                    "to stick type"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish or set with sticks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stiken (“to stick, pierce, stab, remain embedded, be fastened”), from Old English stician (“to pierce, stab, remain embedded, be fastened”), from Proto-Germanic *stikōną (“to pierce, prick, be sharp”), from Proto-Indo-European *(s)tig-, *(s)teyg- (“to pierce, prick, be sharp”).",
        "See also the related Proto-Germanic *stikaną, whence West Frisian stekke, Low German steken, Dutch steken, German stechen; compare also Danish stikke, Swedish sticka.",
        "Cognate with the first etymology (same PIE root, different paths through Germanic and Old English), to stitch, and to etiquette, via French étiquette – see there for further discussion."
      ],
      "adjectives": [
        {
          "description": "stick (comparative sticker, superlative stickest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Likely to stick; sticking, sticky.",
                  "examples": [
                    "A non-stick pan. A stick plaster.",
                    "A sticker type of glue. The stickest kind of gum."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "stick (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(motor racing) The traction of tires on the road surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) The amount of fishing line resting on the water surface before a cast; line stick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thrust with a pointed instrument; a stab.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stick (third-person singular simple present sticks, present participle sticking, simple past and past participle stuck or (archaic) sticked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become or remain attached; to adhere.",
                  "examples": [
                    "The tape will not stick if it melts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To jam; to stop moving.",
                  "examples": [
                    "The lever sticks if you push it too far up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tolerate, to endure, to stick with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To persist.",
                  "examples": [
                    "His old nickname stuck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of snow, to remain frozen on landing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To remain loyal; to remain firm.",
                  "examples": [
                    "Just stick to your strategy, and you will win."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, intransitive) To hesitate, to be reluctant; to refuse (in negative phrases).",
                  "examples": [
                    "Some stick not to say, that the Parson and Attorney forg’d a Will, for which they were well Paid  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, intransitive) To be puzzled (at something), have difficulty understanding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, intransitive) To cause difficulties, scruples, or hesitation.",
                  "examples": [
                    "[…]  this is the Difficulty that seemeth chiefly to stick with the most reasonable of those, who, from a mere Scruple of Conscience, refuse to join with us upon the Revolution Principle  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attach with glue or as if by gluing.",
                  "examples": [
                    "Stick the label on the jar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place, set down (quickly or carelessly).",
                  "examples": [
                    "Stick your bag over there and come with me."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To press (something with a sharp point) into something else.",
              "entries": [
                {
                  "meaning": "(transitive, now only in dialects) To stab.",
                  "examples": [
                    "In certain of their sacrifices they had a lamb, they sticked him, they killed him, and made sacrifice of him: this lamb was Christ the Son of God, he was killed, sticked, and made a sweet-smelling sacrifice for our sins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fix on a pointed instrument; to impale.",
                  "examples": [
                    "to stick an apple on a fork"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To adorn or deck with things fastened on as by piercing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, gymnastics) To perform (a landing) perfectly.",
                  "examples": [
                    "Once again, the world champion sticks the dismount."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, transitive) To propagate plants by cuttings.",
                  "examples": [
                    "Stick cuttings from geraniums promptly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, joinery) To run or plane (mouldings) in a machine, in contradistinction to working them by hand. Such mouldings are said to be stuck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, transitive) To bring to a halt; to stymie; to puzzle.",
                  "examples": [
                    "to stick somebody with a hard problem"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, dated) To impose upon; to compel to pay; sometimes, to cheat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, slang) To have sexual intercourse with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, blackjack, chiefly UK) To stand pat: to cease taking any more cards and finalize one's hand.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly a metaphorical use of the first etymology (\"twig, branch\"), possibly derived from the Yiddish schtick."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stick (plural sticks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, uncountable) Criticism or ridicule.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}