{
  "word": "silhouette",
  "etymologies": [
    {
      "description": [
        "Borrowed from French silhouette, from the name of Étienne de Silhouette (1709-1767), a French politician. His surname, in turn, is (gallicized) Basque, from Ziloeta or Zilhoeta, modern Basque Zulueta, from the local plural (see -ak) stern of zulo (“hole, cave”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "silhouette (plural silhouettes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An illustrated outline filled in with a solid color(s), usually only black, and intended to represent the shape of an object without revealing any other visual details; a similar appearance produced when the object being viewed is situated in relative darkness with brighter lighting behind it; a profile portrait in black, such as a shadow appears to be. [mid 19th c.]",
                  "examples": [
                    "I could see a silhouette of a figure looking out from the window, but I couldn't tell if it was a man or a woman."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "silhouette (third-person singular simple present silhouettes, present participle silhouetting, simple past and past participle silhouetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To represent by a silhouette; to project upon a background, so as to be like a silhouette. [late 19th c.]",
                  "examples": [
                    "Scores of coconut-shell fires blazed with their characteristic glaring white flame, throwing grotesque shadows on the brown thatched huts, dancing fairylike shimmerings among the domes of coconut fronds, casting ghostly reaches of light through the adjacent graveyards, and silhouetting the forms of pareu-clad natives at work cleaning their fish or laying them on the live coals to broil."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}