{
  "word": "world",
  "etymologies": [
    {
      "description": [
        "From Middle English world, weoreld, from Old English weorold (“world”), from Proto-West Germanic *weraldi, from Proto-Germanic *weraldiz (“lifetime, human existence, world”, literally “age/era of man”), equivalent to wer (“man”) +‎ eld (“age”).",
        "Cognate with Scots warld (“world”), Saterland Frisian Waareld (“world”), West Frisian wrâld (“world”), Afrikaans wêreld (“world”), Dutch wereld (“world”), Low German Werld (“world”), German Welt (“world”), Norwegian Bokmål verden (“world”), Norwegian Nynorsk verd (“world”), Swedish värld (“world”), Icelandic veröld (“the world”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "world (countable and uncountable, plural worlds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with \"the\" or a plural possessive pronoun) The subjective human experience, regarded collectively; human collective existence; existence in general.",
                  "examples": [
                    "In retrospect, the process of economic globalization has meant the end of the world as we knew it.",
                    "There will always be lovers, till the world’s end.",
                    "Synonym: (proper noun with alternative capitalization) World"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with \"the\" or a singular possessive pronoun) The subjective human experience, regarded individually.",
                  "examples": [
                    "The period immediately following my divorce seemed like the end of my world.",
                    "He was my world! [said of a slain companion]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metonymically, with \"the\") A majority of people.",
                  "examples": [
                    "Running after God is the only life worth living. Even though the world believes that living for God is boring, we believe that there is nothing more exciting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The Universe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, with \"the\") The Earth.",
                  "examples": [
                    "Synonyms: the earth, Earth, the globe, God's green earth, Sol III",
                    "People are dying of starvation all over the world.",
                    "“As the world turns, we know the bleakness of winter, the promise of spring, the fullness of summer and the harvest of autumn–the cycle of life is complete.” - quotation attributed to Irna Phillips."
                  ]
                }
              ]
            },
            {
              "group": "(countable) A planet, especially one which is inhabited or inhabitable.",
              "entries": [
                {
                  "meaning": "(by extension) Any other astronomical body which may be inhabitable, such as a natural satellite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very large extent of country.",
                  "examples": [
                    "the New World"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fiction) A realm, such as a planet, containing one or multiple societies of beings, especially intelligent ones.",
                  "examples": [
                    "the world of Narnia; the Wizarding World of Harry Potter; a zombie world"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An individual or group perspective or social setting.",
                  "examples": [
                    "Synonym: circle",
                    "In the world of boxing, good diet is all-important.",
                    "Welcome to my world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The part of an operating system distributed with the kernel, consisting of the shell and other programs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A subdivision of a game, consisting of a series of stages or levels that usually share a similar environment or theme.",
                  "examples": [
                    "Have you reached the boss at the end of the ice world?",
                    "There's a hidden warp to the next world down this pipe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tarot) The twenty-second trump or major arcana card of the tarot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, singular or plural, followed by \"of\") A great amount.",
                  "examples": [
                    "Taking a break from work seems to have done her a world of good.",
                    "You're going to be in a world of trouble when your family finds out.",
                    "That new wallpaper has made worlds of difference downstairs.",
                    "This movie isn't even billed as a comedy, but it's worlds funnier than the comedy I saw last month."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Age, era.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "world (third-person singular simple present worlds, present participle worlding, simple past and past participle worlded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To consider or cause to be considered from a global perspective; to consider as a global whole, rather than making or focussing on national or other distinctions; compare globalise.",
                  "examples": [
                    "There are by now many feminisms (Tong, 1989; Humm, 1992). [...] They are in shifting alliance or contest with postmodern critiques, which at times seem to threaten the very category 'women' and its possibilities for a feminist politics. These debates inform this attempt at worlding women—moving beyond white western power centres and their dominant knowledges (compare Spivak, 1985), while recognising that I, as a white settler-state woman, need to attend to differences between women, too."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make real; to make worldly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}