{
  "word": "darken",
  "etymologies": [
    {
      "description": [
        "From Middle English derkenen, dirkenen, from Old English *deorcnian, *diercnian (“to darken”), from Proto-West Germanic *dirkinōn (“to darken”), equivalent to dark +‎ -en.",
        "Cognate with Scots derken, durken (“to darken”), Old High German tarchanjan, terchinen (“to darken”), Middle High German terken, derken (“to darken”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "darken (third-person singular simple present darkens, present participle darkening, simple past and past participle darkened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make dark or darker by reducing light.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become dark or darker (having less light).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(impersonal) To get dark (referring to the sky, either in the evening or as a result of cloud).",
                  "examples": [
                    "He looked up. It was darkening here as well. Sky getting red, the edge of the quarry dark and jagged against it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make dark or darker in colour.",
                  "examples": [
                    "She puts on lipstick and darkens her eyebrows, which are now very scanty  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become dark or darker in colour.",
                  "examples": [
                    "The lovely hair had lost its rose-gold glimmer, and had darkened to rose-brown  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To render gloomy, darker in mood.",
                  "examples": [
                    "It was a pleasure seeing you again. I’m only sorry I had to darken the pleasure with my private problems."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become gloomy, darker in mood.",
                  "examples": [
                    "His countenance darkened while he spoke  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To blind, impair the eyesight.",
                  "examples": [
                    "When your letter came to me, I was so darkened by an inflammation in my eye, that I could not for some time read it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be blinded, lose one’s eyesight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cloud, obscure, or perplex; to render less clear or intelligible.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make foul; to sully; to tarnish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}