{
  "word": "credence",
  "etymologies": [
    {
      "description": [
        "From Middle English credence, from Old French credence, from Medieval Latin crēdentia (“belief, faith”), from Latin crēdēns, present active participle of crēdō (“loan, confide in, trust, believe”). Compare French croyance, French créance, Italian credenza, Portuguese crença, Romanian credință, Spanish creencia."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "credence (countable and uncountable, plural credences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Acceptance of a belief or claim as true, especially on the basis of evidence.",
                  "examples": [
                    "Based on the scientific data, I give credence to this hypothesis."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, uncountable) Credential or supporting material for a person or claim.",
                  "examples": [
                    "He presented us with a letter of credence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion, countable) A small table or credenza used in certain Christian religious services.",
                  "examples": [
                    "Synonym: (more common in Catholicism) credence table"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A cupboard, sideboard, or cabinet, particularly one intended for the display of rich vessels or plate on open shelves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A subjective probability estimate of a belief or claim.",
                  "examples": [
                    "My credence in the proposition is around 90%."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "credence (third-person singular simple present credences, present participle credencing, simple past and past participle credenced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To give credence to; to believe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}