{
  "word": "bear",
  "etymologies": [
    {
      "description": [
        "From Middle English bere, from Old English bera, from Proto-West Germanic *berō, from Proto-Germanic *berô (compare West Frisian bear, Dutch beer, German Bär, Danish bjørn)."
      ],
      "adjectives": [
        {
          "description": "bear (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, investments) Characterized by declining prices in securities markets or by belief that the prices will fall.",
                  "examples": [
                    "The great bear market starting in 1929 scared a whole generation of investors."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bear (plural bears)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "A large, generally omnivorous mammal (a few species are purely carnivorous or herbivorous), related to the dog and raccoon, having shaggy hair, a very small tail, and flat feet; a member of the family Ursidae.",
              "entries": [
                {
                  "meaning": "(cooking, uncountable) The meat of this animal.",
                  "examples": [
                    "We had barbecued bear for dinner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A rough, unmannerly, uncouth person. [1579]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) An investor who sells commodities, securities, or futures in anticipation of a fall in prices. [1744]",
                  "examples": [
                    "Antonym: bull"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(CB radio, slang, US) A state policeman (short for Smokey Bear). [1970s]",
                  "examples": [
                    "'The bear's pulling somebody off there at 74,' reported someone else."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gay slang) A large, hairy man, especially one who is homosexual. [c. 1970]",
                  "examples": [
                    "I have everything it takes to be a bear: broad shoulders, full beard, semibald pate, and lots of body hair. But I don't want to be a fetish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A portable punching machine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A block covered with coarse matting, used to scour the deck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) The fifteenth Lenormand card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, US) Something difficult or tiresome; a burden or chore.",
                  "examples": [
                    "That window can be a bear to open."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bear (third-person singular simple present bears, present participle bearing, simple past and past participle beared)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, transitive) To endeavour to depress the price of, or prices in.",
                  "examples": [
                    "to bear a railroad stock",
                    "to bear the market"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English beren (“carry, bring forth”), from Old English beran (“to carry, bear, bring”), from Proto-West Germanic *beran, from Proto-Germanic *beraną, from Proto-Indo-European *bʰéreti, from *bʰer- (“to bear, carry”).",
        "Akin to Old High German beran (“carry”), Dutch baren, Norwegian Bokmål bære, Norwegian Nynorsk bera, German gebären, Gothic 𐌱𐌰𐌹𐍂𐌰𐌽 (bairan), Sanskrit भरति (bhárati), Latin ferre, and Ancient Greek φέρειν (phérein), Albanian bie (“to bring, to bear”), Russian брать (bratʹ, “to take”), Persian بردن‎ (bordan, “to take, to carry”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bear (third-person singular simple present bears, present participle bearing, simple past bore or (archaic) bare, past participle borne or bore or (see usage notes) born)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(chiefly transitive) To carry or convey, literally or figuratively.",
              "entries": [
                {
                  "meaning": "(transitive, of weapons, flags or symbols of rank, office, etc.) To carry upon one's person, especially visibly; to be equipped with.",
                  "examples": [
                    "the right to bear arms"
                  ]
                },
                {
                  "meaning": "(transitive, of garments, pieces of jewellery, etc.) To wear.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, rarely intransitive, of a woman or female animal) To carry (offspring in the womb), to be pregnant (with).",
                  "examples": [
                    "The scan showed that the ewe was bearing twins."
                  ]
                },
                {
                  "meaning": "(transitive) To have or display (a mark or other feature).",
                  "examples": [
                    "She still bears the scars from a cycling accident.",
                    "The stone bears a short inscription.",
                    "This bears all the hallmarks of a terrorist attack."
                  ]
                },
                {
                  "meaning": "(transitive) To display (a particular heraldic device) on a shield or coat of arms; to be entitled to wear or use (a heraldic device) as a coat of arms. [1400]",
                  "examples": [
                    "The shield bore a red cross."
                  ]
                },
                {
                  "meaning": "(transitive) To present or exhibit (a particular outward appearance); to have (a certain look). [1200]",
                  "examples": [
                    "He bore the look of a defeated man."
                  ]
                },
                {
                  "meaning": "(transitive) To have (a name, title, or designation). [1225]",
                  "examples": [
                    "The school still bears the name of its founder."
                  ]
                },
                {
                  "meaning": "(transitive) To possess or enjoy (recognition, renown, a reputation, etc.); to have (a particular price, value, or worth). [1393]",
                  "examples": [
                    "The dictator bears a terrible reputation for cruelty."
                  ]
                },
                {
                  "meaning": "(transitive, of an investment, loan, etc.) To have (interest or a specified rate of interest) stipulated in its terms. [1686]",
                  "examples": [
                    "The bond bears a fixed interest rate of 3.5%."
                  ]
                },
                {
                  "meaning": "(transitive, of a person or animal) To have (an appendage, organ, etc.) as part of the body; (of a part of the body) to have (an appendage).",
                  "examples": [
                    "Only the male Indian elephant bears tusks."
                  ]
                },
                {
                  "meaning": "(transitive) To carry or hold in the mind; to experience, entertain, harbour (an idea, feeling, or emotion).",
                  "examples": [
                    "to bear a grudge, to bear ill will"
                  ]
                },
                {
                  "meaning": "(transitive, rare) To feel and show (respect, reverence, loyalty, etc.) to, towards, or unto a person or thing.",
                  "examples": [
                    "The brothers had always borne one another respect."
                  ]
                },
                {
                  "meaning": "(transitive) To possess inherently (a quality, attribute, power, or capacity); to have and display as an essential characteristic.",
                  "examples": [
                    "to bear life"
                  ]
                },
                {
                  "meaning": "(transitive, of a thing) To have (a relation, correspondence, etc.) to something else. [1556]",
                  "examples": [
                    "The punishment bears no relation to the crime."
                  ]
                },
                {
                  "meaning": "(transitive) To give (written or oral testimony or evidence); (figurative) to provide or constitute (evidence or proof), give witness.",
                  "examples": [
                    "His achievements bear testimony to his ability.",
                    "The jury could see he was bearing false witness."
                  ]
                },
                {
                  "meaning": "(transitive) To have (a certain meaning, intent, or effect).",
                  "examples": [
                    "This word no longer bears its original meaning."
                  ]
                },
                {
                  "meaning": "(reflexive, transitive) To behave or conduct (oneself).",
                  "examples": [
                    "She bore herself well throughout the ordeal."
                  ]
                },
                {
                  "meaning": "(transitive, rare) To possess and use, to exercise (power or influence); to hold (an office, rank, or position).",
                  "examples": [
                    "Every man should bear rule in his own house."
                  ]
                },
                {
                  "meaning": "(intransitive, obsolete) To carry a burden or burdens. [1450]",
                  "examples": []
                },
                {
                  "meaning": "(transitive, obsolete, rare) To take or bring (a person) with oneself; to conduct. [1590]",
                  "examples": []
                }
              ]
            },
            {
              "group": "To support, sustain, or endure.",
              "entries": [
                {
                  "meaning": "(transitive) To support or sustain; to hold up.",
                  "examples": [
                    "This stone bears most of the weight."
                  ]
                },
                {
                  "meaning": "(now transitive outside certain set patterns such as 'bear with'; formerly also intransitive) To endure or withstand (hardship, scrutiny, etc.); to tolerate; to be patient (with).",
                  "examples": [
                    "Synonyms: brook, endure; see also Thesaurus:tolerate",
                    "The pain is too much for me to bear.",
                    "I would never move to Texas — I can't bear heat.",
                    "This reasoning will not bear much analysis.",
                    "Please bear with me as I try to find the book you need."
                  ]
                },
                {
                  "meaning": "(transitive) To sustain, or be answerable for (blame, expense, responsibility, etc.).",
                  "examples": [
                    "The hirer must bear the cost of any repairs."
                  ]
                },
                {
                  "meaning": "(transitive) To admit or be capable of (a meaning); to suffer or sustain without violence, injury, or change.",
                  "examples": [
                    "In all criminal cases the most favourable interpretation should be put on words that they can possibly bear."
                  ]
                },
                {
                  "meaning": "(transitive) To warrant, justify the need for.",
                  "examples": [
                    "This storm definitely bears monitoring."
                  ]
                }
              ]
            },
            {
              "group": "To support, keep up, or maintain.",
              "entries": [
                {
                  "meaning": "(transitive) To afford, to be something to someone, to supply with something.",
                  "examples": [
                    "[…]  admitted to that equal sky, / His faithful dog shall bear him company."
                  ]
                },
                {
                  "meaning": "(transitive) To carry on, or maintain; to have.",
                  "examples": [
                    "[…]  and he finds the Pleasure, and Credit of bearing a Part in the Conversation, and of having his Reasons sometimes approved and hearken'd to."
                  ]
                }
              ]
            },
            {
              "group": "To press or impinge upon.",
              "entries": [
                {
                  "meaning": "(intransitive, usually with on, upon, or against) To push, thrust, press.",
                  "examples": [
                    "The rope has frayed where it bears on the rim of the wheel."
                  ]
                },
                {
                  "meaning": "(intransitive, figuratively) To take effect; to have influence or force; to be relevant.",
                  "examples": [
                    "to bring arguments to bear",
                    "How does this bear on the question?"
                  ]
                },
                {
                  "meaning": "(intransitive, military, usually with on or upon) Of a weapon, to be aimed at an enemy or other target.",
                  "examples": [
                    "The cannons were wheeled around to bear upon the advancing troops."
                  ]
                }
              ]
            },
            {
              "group": "To produce, yield, give birth to.",
              "entries": [
                {
                  "meaning": "(transitive, ditransitive) To give birth to (someone or something) (may take the father of the direct object as an indirect object).",
                  "examples": [
                    "In Troy she becomes Paris’ wife, bearing him several children, all of whom die in infancy."
                  ]
                },
                {
                  "meaning": "(transitive, less commonly intransitive) To produce or yield something, such as fruit or crops.",
                  "examples": [
                    "This year our apple trees bore a good crop of fruit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, originally nautical) To be, or head, in a specific direction or azimuth (from somewhere).",
                  "examples": [
                    "Carry on past the church and then bear left at the junction.",
                    "By my readings, we're bearing due south, so we should turn about ten degrees east.",
                    "Great Falls bears north of Bozeman."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To gain or win.",
                  "examples": [
                    "She was  […]  found not guilty, through bearing of friends and bribing of the judge."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bear (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of bere (“barley”).",
                  "examples": [
                    "There are several plots of those species of barley called big, which is six-rowed barley; or bear, which is four-rowed, cultivated."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Middle English bere (“pillowcase”), of obscure origin, but compare Old English hlēor-bera (“cheek-cover”). Possibly cognate to Low German büre, whence German Bühre, which in turn has been compared to French bure."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bear (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pillowcase; a fabric case or covering as for a pillow.",
                  "examples": [
                    "And, according to this, one of my Neighbours made a Bag, like a Pillow-bear, of  the ordinary six-penny yard Cloth, and boiled his Hops in it half an Hour; then he took them out, and put in another Bag of the like Quantity of fresh Hops,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}