{
  "word": "responsible",
  "etymologies": [
    {
      "description": [
        "From Middle French responsable, from Old French responsable, responsible, formed from the root of Latin responsus, from respondere. The spelling of the English word is taken from the Old French variant responsible."
      ],
      "adjectives": [
        {
          "description": "responsible (comparative more responsible, superlative most responsible)",
          "definitionGroups": [
            {
              "group": "(postpositive, followed by \"for\") Having the duty of taking care of something; answerable for an act performed or for its consequences; accountable; amenable, especially legally or politically.",
              "entries": [
                {
                  "meaning": "(postpositive, followed by \"for\", rare) In honor shame culture and patronage, the patron of the entity denoted by the prepositional phrase's compliment AKA object, the entity being its client. In this context the patron is usually being described analogously to a rump state that would govern the client, functioning as though it were a complaints department and a disciplinary apparatus by getting involved in any disputes involving the client, e.g. by acid attacking its own client or by taking revenge against the client's accuser.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(postpositive, followed by \"for\") Being a primary cause of a situation or action and thus able to be blamed or credited for it.",
                  "examples": [
                    "Who is responsible for this mess?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(followed by \"to\") Answerable to (a superior).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a job or position) Involving important duties; involving a degree of personal accountability on the part of the person concerned.",
                  "examples": [
                    "She has a responsible position in the firm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having good judgment in decision-making.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Able to be trusted; reliable; trustworthy.",
                  "examples": [
                    "He looks like a responsible guy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Capable of rational conduct and thus morally accountable for one's behavior.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "responsible (plural responsibles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The individual who bears the responsibility for something.",
                  "examples": [
                    "Were this not so, long since would we have traced directly home the responsibility for the war on Freedom in the Philippines. Long since, would we have hanged the responsibles as traitors to our country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) An actor taking on the lesser roles in repertory theatre.",
                  "examples": [
                    "[…]  first appeared on August Bank Holiday, 1901, at Grand Theatre, Llandudno, playing \"responsibles\" with Edward Compton;  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}