{
  "word": "universalist",
  "etymologies": [
    {
      "description": [
        "universal +‎ -ist"
      ],
      "adjectives": [
        {
          "description": "universalist (comparative more universalist, superlative most universalist)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Universal in scope.",
                  "examples": [
                    "In this connection, she notes (1984, p. 42) that in Vata (a language of the Kru family, spoken in the Ivory Coast) the normal word-order is [[VP XP✽ V]], where XP✽ represents one or more Complements of the head V of VP, and where V is positioned at the right periphery of V-bar. She notes that in Vata, a finite Clause containing an Auxiliary will have the AUX positioned in I between the subject NP and the VP, with the V positioned at the end of the VP, as in [...] But if I contains no Auxiliary (i.e. is empty), the Verb of the VP will move from V into I, and hence no longer be positioned at the end of VP, but rather in the characteristic I position between NP and VP: cf. [...] Here, the movement of the Verb out of VP-final position ([...]) into I produces an obvious change in the linear ordering of constituents, thus lending clear empirical support to the V MOVEMENT analysis. And Koopman goes on to suggest that given that we have clear empirical motivation for positing a rule of V MOVEMENT for languages such as Vata, universalist considerations argue in favor of adopting the V MOVEMENT analysis rather than the AFFIX MOVEMENT analysis for English, in default of any evidence to the contrary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion, US, paganism, Germanic paganism) Following a form of neopaganism, especially Germanic neopaganism, that is supportive of minorities and marginalized groups.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "universalist (plural universalists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A proponent of universalism.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}