{
  "word": "temporize",
  "etymologies": [
    {
      "description": [
        "From Middle French temporiser (“to wait one's time, temporize”) + English -ize (suffix forming verbs). Temporiser is derived from Medieval Latin temporizāre, from Latin temporāre (“to delay, put off”) + -izāre (suffix forming the present active infinitive of verbs). Temporāre is derived from tempor-, the inflected stem of tempus (“age, time, period; season of the year; due, opportune, or proper time”) (ultimately from Proto-Indo-European *temp-, *ten- (“to extend, stretch (in the sense of a stretch of time)”), or *temh₁- (“to cut (in the sense of a section of time)”)) + -āre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "temporize (third-person singular simple present temporizes, present participle temporizing, simple past and past participle temporized) (American spelling, Oxford British English)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To deliberately act evasively or prolong a discussion in order to gain time or postpone a decision, sometimes so that a compromise can be reached or simply to make a conversation more temperate; to stall for time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, by extension) To discuss, to negotiate; to reach a compromise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dentistry) To apply a temporary piece of dental work that will later be removed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To comply with the occasion or time; to humour, or yield to, current circumstances or opinion; also, to trim (“fluctuate between parties, so as to appear to favour each”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To delay, especially until a more favourable time; to procrastinate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}