{
  "word": "drag",
  "etymologies": [
    {
      "description": [
        "From Middle English draggen (“to drag”), early Middle English dragen (“to draw, carry”), confluence of Old English dragan (“to drag, draw, draw oneself, go, protract”) and Old Norse draga (“to draw, attract”); both from Proto-Germanic *draganą (“to draw, drag”), from Proto-Indo-European *dʰregʰ- (“to draw, drag”).",
        "Verb sense influenced due to association with the noun drag (“that which is hauled or dragged”), related to Low German dragge (“a drag-anchor, grapnel”). Cognate with Danish drægge (“to dredge”), Danish drage (“to draw, attract”), Swedish dragga (“to drag, drag anchor, sweep”), Swedish draga (“to draw, go”), Icelandic draga (“to drag, pull”). Doublet of draw."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drag (countable and uncountable, plural drags)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, uncountable) Resistance of a fluid to something moving through it.",
                  "examples": [
                    "When designing cars, manufacturers have to take drag into consideration."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by analogy with above) Any force acting in opposition to the motion of an object.",
                  "examples": [
                    "A high thrust-to-weight ratio helps a rocket to overcome the effects of gravity drag."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, foundry) The bottom part of a sand casting mold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A device dragged along the bottom of a body of water in search of something, e.g. a dead body, or in fishing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) A systematic search for someone over a wide area, especially by the authorities; a dragnet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, music) A double drum-stroke played at twice the speed of the context in which it is placed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) A puff on a cigarette or joint.",
                  "examples": [
                    "Synonyms: lug, pull",
                    "He got high after just one drag of the joint.",
                    "Give me a drag on that roach!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) Someone or something that is annoying or frustrating, or disappointing; an obstacle to progress or enjoyment.",
                  "examples": [
                    "Travelling to work in the rush hour is a real drag."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) A long open horse-drawn carriage with transverse or side seats. [from mid-18th c.]",
                  "examples": [
                    "Alcee Arobin and Mrs. Highcamp called for her one bright afternoon in Arobin's drag."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) Street, as in 'main drag'. [from mid-19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The scent-path left by dragging a fox, or some other substance such as aniseed, for training hounds to follow scents.",
                  "examples": [
                    "to run a drag"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, snooker) A large amount of backspin on the cue ball, causing the cue ball to slow down.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heavy harrow for breaking up ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of sledge for conveying heavy objects; also, a kind of low car or handcart.",
                  "examples": [
                    "a stone drag"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metallurgy) The bottom part of a flask or mould, the upper part being the cope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(masonry) A steel instrument for completing the dressing of soft stone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The difference between the speed of a screw steamer under sail and that of the screw when the ship outruns the screw; or between the propulsive effects of the different floats of a paddle wheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything towed in the water to retard a ship's progress, or to keep her head up to the wind; especially, a canvas bag with a hooped mouth (drag sail), so used.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pulled load.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A skid or shoe for retarding the motion of a carriage wheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Motion affected with slowness and difficulty, as if clogged.",
                  "examples": [
                    "Had a drag in his walk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, music) Witch house music.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The last position in a line of hikers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards) A push somewhat under the centre of the cue ball, causing it to follow the object ball a short way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for guiding wood to the saw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A mailcoach.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A prison sentence of three months.",
                  "examples": [
                    "The copper knew I did that job, and had me up on suspicion some time after, and gave me a drag (three months) over it. The next bit I did was a 'sixer' (six months), and I escaped from prison in about three weeks after I got it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "drag (third-person singular simple present drags, present participle dragging, simple past and past participle dragged or (dialectal) drug)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pull along a surface or through a medium, sometimes with difficulty.",
                  "examples": [
                    "Let's drag this load of wood over to the shed.",
                    "The misbehaving child was dragged out of the classroom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move onward heavily, laboriously, or slowly; to advance with weary effort; to go on lingeringly.",
                  "examples": [
                    "Time seems to drag when you're waiting for a bus."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act or proceed slowly or without enthusiasm; to be reluctant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To draw along (something burdensome); hence, to pass in pain or with difficulty.",
                  "examples": [
                    "have dragged a lingering life"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To serve as a clog or hindrance; to hold back.",
                  "examples": [
                    "A propeller is said to drag when the sails urge the vessel faster than the revolutions of the screw can propel her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graphical user interface) To operate a pointing device by moving it with a button held down; to move, copy, etc. (an item) in this way.",
                  "examples": [
                    "Drag the file into the window to open it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly of a vehicle) To unintentionally rub or scrape on a surface.",
                  "examples": [
                    "The car was so low to the ground that its muffler was dragging on a speed bump."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) To hit or kick off target.",
                  "examples": [
                    "Arsenal were struggling for any sort of rhythm and Aaron Lennon dragged an effort inches wide as Tottenham pressed for a second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fish with a dragnet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To search for something, as a lost object or body, by dragging something along the bottom of a body of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To break (land) by drawing a drag or harrow over it; to harrow.",
                  "examples": [
                    "Synonym: harrow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To search exhaustively, as if with a dragnet.",
                  "examples": [
                    "while I dragged my brains for such a song"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To roast, say negative things about, or call attention to the flaws of (someone).",
                  "examples": [
                    "Synonyms: criticize; see also Thesaurus:criticize",
                    "You just drag him 'cause he's got more money than you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, music) To play at a slower tempo than one is supposed to or than the other musicians one is playing with, or to inadvertently gradually decrease tempo while one is playing.",
                  "examples": [
                    "Antonym: rush"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from English drag (“to pull along a surface”) because of the sensation of long skirts trailing on the floor, or from Yiddish טראָגן‎ (trogn, “to wear”)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drag (usually uncountable, plural drags)",
          "definitionGroups": [
            {
              "group": "(uncountable, slang) Women's clothing worn by men for the purpose of entertainment. [from late 19th c.]",
              "entries": [
                {
                  "meaning": "(uncountable, slang, by analogy) Men's clothing worn by women for the purpose of entertainment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) A men's party attended in women's clothing. [from early 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Any type of clothing or costume associated with a particular occupation or subculture.",
                  "examples": [
                    "corporate drag"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "drag (third-person singular simple present drags, present participle dragging, simple past and past participle dragged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perform as a drag queen or drag king.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}