{
  "word": "coach",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French coche, from German Kutsche, from Hungarian kocsi. According to historians, the coach was named after the small Hungarian town of Kocs, which made a livelihood from cart building and transport between Vienna and Budapest.",
        "The meaning \"instructor/trainer\" is from Oxford University slang (c. 1830) for a \"tutor\" who \"carries\" one through an exam; the athletic sense is from 1861."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "coach (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) Via the part of a commercial passenger airplane or train reserved for those paying the lower standard fares; via the economy section.",
                  "examples": [
                    "John flew coach to Vienna, but first-class back home."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "coach (plural coaches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wheeled vehicle, generally drawn by horse power.",
                  "examples": [
                    "Synonym: carriage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, UK, Australia) A passenger car, either drawn by a locomotive or part of a multiple unit.",
                  "examples": [
                    "Synonym: carriage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally Oxford University slang) A trainer or instructor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Australia) A long-distance, or privately hired, bus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The forward part of the cabin space under the poop deck of a sailing ship; the fore-cabin under the quarter deck.",
                  "examples": [
                    "The commanders all came on board and the council sat in the coach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) The part of a commercial passenger airplane or train reserved for those paying the lower standard fares; the economy section.",
                  "examples": [
                    "We couldn't afford the good tickets, so we spent the flight crammed in coach."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) The lower-fare service whose passengers sit in this part of the airplane or train; economy class.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "coach (third-person singular simple present coaches, present participle coaching, simple past and past participle coached)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, sports) To train.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To instruct; to train.",
                  "examples": [
                    "She has coached many opera stars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To study under a tutor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel in a coach (sometimes coach it).",
                  "examples": [
                    "Affecting genteel fashions, coaching it to all quarters"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey in a coach.",
                  "examples": [
                    "The needy poet sticks to all he meets, Coached, carted, trod upon, now loose, now fast. And carried off in some dog's tail at last"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}