{
  "word": "hoist",
  "etymologies": [
    {
      "description": [
        "Alteration of earlier hoise (“to hoist”), apparently based on the past tense forms, from Middle Dutch hisen (“to hoist”). Compare modern Dutch hijsen (“to hoist”), German hissen (“to hoist”), Danish hejse (“to hoist”). Compare also French hisser (“to hoist”), Catalan hissar (“to hoist”), Italian issare (“to hoist”), Sicilian jisari (“to hoist”), all borrowed from a Germanic source."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hoist (plural hoists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hoisting device, such as pulley or crane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of hoisting; a lift.",
                  "examples": [
                    "Give me a hoist over that wall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The triangular vertical position of a flag, as opposed to the flying state, or triangular vertical position of a sail, when flying from a mast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The position of a flag (on a mast) or of a sail on a ship when lifted up to its highest level.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The position of a main fore-and-aft topsail on a ship and fore fore-and-aft topsail on a ship.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hoist (third-person singular simple present hoists, present participle hoisting, simple past and past participle hoisted or hoist)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise; to lift; to elevate (especially, to raise or lift to a desired elevation, by means of tackle or pulley, said of a sail, a flag, a heavy package or weight).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports, often figurative) To lift a trophy or similar prize into the air in celebration of a victory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, historical) To lift someone up to be flogged.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be lifted up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing theory) To extract (code) from a loop construct as part of optimization.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To steal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To rob.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}