{
  "word": "typhoon",
  "etymologies": [
    {
      "description": [
        "English texts mention typhon, tiphon as a Greek word for \"whirlwind\" since at least the 1550s, referring to Ancient Greek τυφῶν (tuphôn), τυφώς (tuphṓs, “whirlwind”) (the latter attested since Aeschylus), Τυφῶν (Tuphôn, “Typhon, father of the winds”). (French typhon (“whirlwind”) is said to be attested since 1504.)",
        "However, the first use of the English word to mean a whirlwind or storm dates to 1588, in the spelling Touffon, in the sense \"giant storm in the Pacific\"; this sense first appears in Europe in the mid 16th century in Portuguese tufão (attested since at least 1560), whence it entered English. Portuguese sailors likely got the word from Arabic طُوفَان‎ (ṭūfān) (compare Persian طوفان‎ (tufân), Hindi तूफ़ान (tūfān)), and some spellings of the English word (like tufan) seem to derive from that Arabic word.",
        "The Arabic word's origin is sometimes thought to be Sinitic 大風／大风 (\"big wind\", Mandarin dàfēng, Cantonese daai6 fung1 /taːi̯²² fʊŋ⁵⁵/, Hakka thai-fûng /tʰai̯⁵⁵ fuŋ²⁴/), and some English forms like tyfoong, tyfung are from or were modified based on Chinese. However, the Arabic word may be entirely Semitic from the native root ط و ف‎ (ṭ-w-f) in the sense of the wind circling around, or it might derive from Greek. (Some sources even suggest the term originated in Greek and travelled via Arabic to Chinese before making its way back into Arabic and back to Europe.) Over time, the spelling of the word in English was influenced by the Greek word."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "typhoon (plural typhoons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A weather phenomenon in the northwestern Pacific that is precisely equivalent to a hurricane, which results in wind speeds of 64 knots (118 km/h) or above. Equivalent to a cyclone in the Indian Ocean and Indonesia/Australia.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "typhoon (third-person singular simple present typhoons, present participle typhooning, simple past and past participle typhooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To swirl like a hurricane.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}