{
  "word": "slay",
  "etymologies": [
    {
      "description": [
        "From Middle English sleen, slayn, from Old English slēan (“to strike, beat, smite, stamp, forge, sting, slay, kill, impact”), from Proto-West Germanic *slahan, from Proto-Germanic *slahaną (“to fight, strike, kill”), from Proto-Indo-European *slak- (“to hit, strike, throw”).",
        "Cognate with Dutch slaan (“to beat, hit, strike”), Low German slaan (“hit, strike”), German schlagen (“to beat, hit, strike”), Danish, Norwegian and Swedish slå (“to knock, beat, strike”), Icelandic slá (“to strike”). Related to slaughter, onslaught."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "slay (third-person singular simple present slays, present participle slaying, simple past slew or slayed, past participle slain or slayed or (obsolete) yslain)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now literary) To kill; to murder.",
                  "examples": [
                    "The knight slew the dragon.",
                    "Our foes must all be slain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) To eradicate or stamp out.",
                  "examples": [
                    "You must slay these thoughts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, hyperbolic, colloquial) To defeat; to overcome (in a competition or contest).",
                  "examples": [
                    "The Yankees were actually slayed by two former Yankees because Rich Gossage pitched one scoreless inning in relief of Eckersley to notch his first victory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To delight or overwhelm, especially with laughter.",
                  "examples": [
                    "Ha ha! You slay me!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive, intransitive) To amaze, stun, or otherwise incapacitate by excellence; to excel at something.",
                  "examples": [
                    "Synonym: kill",
                    "Your outfit slays!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To have sex with.",
                  "examples": [
                    "The Online Slang Dictionary offers nearly 200 words referring to sexual intercourse. Many of the terms and phrases connote violence, such as: “bang,” “beat,” “chopped up,” “cut,” “hit,” “hit raw,” “hit that,” “kick it,” “nail,” “pound,” “ram,” “slap and tickle,” “slay,” “smack,” “smash,” and “spank”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See sley"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slay (plural slays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of sley",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}