{
  "word": "skill",
  "etymologies": [
    {
      "description": [
        "From Middle English skill, skille (also schil, schile), from Old English scille and Old Norse skil (“a distinction, discernment, knowledge”), from Proto-Germanic *skilją (“separation, limit”), from Proto-Indo-European *(s)kelH- (“to split, cut”). Cognate with Danish skel (“a separation, boundary, divide”), Swedish skäl (“reason”), Dutch verschil (“difference”) and schillen (“to separate the outer layer (schil) from the product”, verb)."
      ],
      "adjectives": [
        {
          "description": "skill (comparative skiller, superlative skillest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang) Great, excellent. [1980s–1990s]",
                  "examples": [
                    "Well, unfortunately for you, my dearest Waggipoos, I'm much more skill than you!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "skill (countable and uncountable, plural skills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Capacity to do something well; technique, ability. Skills are usually acquired or learned, as opposed to abilities, which are often thought of as innate.",
                  "examples": [
                    "Synonyms: ability, talent; see also Thesaurus:skill",
                    "Where did you pick up that skill?",
                    "With great skill, she navigated through the tricky passage.",
                    "Doing that coaching course not only taught me useful skills on the field, but also some important life skills."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Discrimination; judgment; propriety; reason; cause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Knowledge; understanding.",
                  "examples": [
                    "'I kenna whatna man ye are,' he says, 'but ye have the skill of lassies' hearts. Tell me truly, is there no way to win her to common love?'"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Display of art; exercise of ability; contrivance; address.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English skilen (also schillen), partly from Old English scilian (“to separate, part, divide off”); and partly from Old Norse skilja (“to divide, separate”); both from Proto-Germanic *skilōną, *skiljaną (“to divide, limit”), from Proto-Indo-European *(s)kelH- (“to split, cut”). Cognate with Danish skille (“to separate, discard”), Swedish skilja (“to distinguish, differentiate, part”), Icelandic skilja (“to understand”), Low German schelen (“to make a difference; to be squint-eyed”), Dutch schelen (“to make a difference”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "skill (third-person singular simple present skills, present participle skilling, simple past and past participle skilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set apart; separate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly dialectal) To discern; have knowledge or understanding; to know how (to).",
                  "examples": [
                    "I cannot skill of these Thy ways  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dialectal, Scotland, Northern England, rare) To know; to understand.",
                  "examples": [
                    "As for the virginals I have none here that skill of them, except the young lord."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have knowledge or comprehension; discern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have personal or practical knowledge; be versed or practised; be expert or dextrous.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To make a difference; signify; matter.",
                  "examples": [
                    "So then the whole scripture of God, being true, whence soever this be delivered and gathered, it skilleth not  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) To spend acquired points in exchange for skills.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}