{
  "word": "necessity",
  "etymologies": [
    {
      "description": [
        "From Middle English necessite, from Old French necessite, from Latin necessitās (“unavoidableness, compulsion, exigency, necessity”), from necesse (“unavoidable, inevitable”); see necessary."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "necessity (countable and uncountable, plural necessities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality or state of being necessary, unavoidable, or absolutely requisite.",
                  "examples": [
                    "I bought a new table out of necessity. My old one was ruined."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The condition of being needy; desperate need; lack.",
                  "examples": [
                    "For it is in vain for a man to think to seek God in his necessity and exigence, if he seek not God in his ordinances, and do not joy in them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something necessary; a requisite; something indispensable.",
                  "examples": [
                    "A tent is a necessity if you plan on camping."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something which makes an act or an event unavoidable; an irresistible force; overruling power.",
                  "examples": [
                    "After eating a full meal, the human body's necessity for food will compel the person to eat again in the future."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The negation of freedom in voluntary action; the subjection of all phenomena, whether material or spiritual, to inevitable causation; necessitarianism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Greater utilitarian good; used in justification of a criminal act.",
                  "examples": [
                    "doctrine of necessity"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, in the plural) Indispensable requirements (of life).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}