{
  "word": "confess",
  "etymologies": [
    {
      "description": [
        "From Middle English confessen, from Anglo-Norman confesser, from Old French confesser, from Latin confessus (Old French confés), past participle of cōnfiteor (“I confess, I admit”) from con- + fateor (“I admit”). Displaced Middle English andetten (“to confess, admit”) (from Old English andettan). Doublet of confiteor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "confess (third-person singular simple present confesses, present participle confessing, simple past and past participle confessed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To admit to the truth, particularly in the context of sins or crimes committed.",
                  "examples": [
                    "I confess to spray-painting all over that mural!",
                    "I confess that I am a sinner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To acknowledge faith in; to profess belief in.",
                  "examples": [
                    "Whosoever, therefore, shall confess me before men, him will I confess, also, before my Father which is in heaven."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) To unburden (oneself) of sins to God or a priest, in order to receive absolution.",
                  "examples": [
                    "Our beautiful votary took an opportunity of confessing herself to this celebrated father."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) To hear or receive such a confession of sins from.",
                  "examples": [
                    "He  […]  heard mass, and the prince, his son, with him, and the most part of his company were confessed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To disclose or reveal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}