{
  "word": "drizzle",
  "etymologies": [
    {
      "description": [
        "Perhaps a back-formation from dryseling, a dissimilated variant of Middle English drysning (“a falling of dew”), from Old English drysnan (“to extinguish”), related to Old English drēosan (“to fall, to decline”), making it cognate to modern English droze and drowse. Compare also dialectal Swedish drösla."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drizzle (countable and uncountable, plural drizzles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Light rain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, weather) Very small, numerous, and uniformly dispersed water drops, mist, or sprinkle. Unlike fog droplets, drizzle falls to the ground.",
                  "examples": [
                    "No longer pouring, the rain outside slowed down to a faint drizzle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Water.",
                  "examples": [
                    "Stop drinking all of my drizzle!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baking) A cake onto which icing, honey or syrup has been drizzled in an artistic manner.",
                  "examples": [
                    "Drizzle is not normally good news. Not when it's falling from the sky, not when it's replacing a decent helping of sauce, and especially not when it's found on a menu in close proximity to the words \"balsamic vinegar\". Deliciously sticky, sweet and sour lemon drizzle cake is the one, and very honourable, exception."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "drizzle (third-person singular simple present drizzles, present participle drizzling, simple past and past participle drizzled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(impersonal) To rain lightly.",
                  "examples": [
                    "We had planned a picnic for Joe's birthday, but it ended up drizzling all day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To shed slowly in minute drops or particles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking, transitive) To pour slowly and evenly, especially oil or honey in cooking.",
                  "examples": [
                    "The recipe says to toss the salad and then drizzle olive oil on it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking, transitive) To cover by pouring in this manner.",
                  "examples": [
                    "The recipe says to toss the salad and then drizzle it in olive oil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To urinate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To carry out parfilage, the process of unravelling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}