{
  "word": "oyster",
  "etymologies": [
    {
      "description": [
        "From Middle English oystre, from Old English ostre, reinforced or superseded by Anglo-Norman oistre, which is from Old French oistre, uistre (compare modern French huître); both lines (Old English and Old French) from Latin ostrea, from Ancient Greek ὄστρεον (óstreon)."
      ],
      "adjectives": [
        {
          "description": "oyster (comparative more oyster, superlative most oyster)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a pale beige colour tinted with grey or pink, like that of an oyster.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "oyster (plural oysters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of certain marine bivalve mollusks, especially those of the family Ostreidae (the true oysters), usually found adhering to rocks or other fixed objects in shallow water along the seacoasts, or in brackish water in the mouth of rivers.",
                  "examples": [
                    "He was a bold man that first ate an oyster."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The delicate morsel of dark meat contained in a small cavity of the bone on each side of the lower part of the back of a fowl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pale beige color tinted with grey or pink, like that of an oyster.",
                  "examples": [
                    "oyster:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, by analogy) A person who keeps secrets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang) A shoplifter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "oyster (third-person singular simple present oysters, present participle oystering, simple past and past participle oystered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fish for oysters.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}