{
  "word": "loss",
  "etymologies": [
    {
      "description": [
        "From Middle English los, from Old English los (“damage, destruction, loss”), from Proto-Germanic *lusą (“dissolution, break-up, loss”), from Proto-Indo-European *lews- (“to cut, sunder, separate, loose, lose”). Cognate with Icelandic los (“dissolution, looseness, break-up”), Old English lor, forlor (“loss, ruin”), Middle High German verlor (“loss, ruin”). More at lose."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loss (countable and uncountable, plural losses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The result of no longer possessing an object, a function, or a characteristic due to external causes or misplacement.",
                  "examples": [
                    "Antonym: gain",
                    "loss of limb; weight loss; loss of cognitive functions; loss of appetite.",
                    "In other areas, glacier loss creates serious risk of a dry period across the Third Pole, Wang said."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The destruction or ruin of an object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something that has been destroyed or ruined.",
                  "examples": [
                    "It was a terrible crash; both cars were total losses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Defeat; an instance of being defeated.",
                  "examples": [
                    "Antonyms: win, victory",
                    "The match ended in their first loss of the season."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The death of a person or animal.",
                  "examples": [
                    "We mourn his loss.",
                    "The battle was won, but losses were great."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The condition of grief caused by losing someone or something, especially someone who has died.",
                  "examples": [
                    "Her daughter's sense of loss eventually led to depression."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(financial, countable) The sum an entity loses on balance.",
                  "examples": [
                    "Antonym: profit",
                    "The sum of expenditures and taxes minus total income is a loss, when this difference is positive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) Electricity of kinetic power expended without doing useful work.",
                  "examples": [
                    "The inefficiency of many old-fashioned power plants exceeds 60% loss before the subsequent losses during transport over the grid."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Pronunciation spelling of lost, representing African-American Vernacular English."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "loss",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Alternative spelling of lost",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}