{
  "word": "transcendental",
  "etymologies": [
    {
      "description": [],
      "adjectives": [
        {
          "description": "transcendental (comparative more transcendental, superlative most transcendental)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) Concerned with the a priori or intuitive basis of knowledge, independent of experience.",
                  "examples": [
                    "The best way to demonstrate the possibility of something is to show its actuality, for actuality implies possibility. At least since Kant, transcendental philosophies have been on the scene. However, such simple demonstration of the possibility of transcendental philosophy has not been effective and is not likely to be so — so strong is the presumption that transcendental philosophy just could not be possible, or, if it was possible earlier, it is not possible now."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Superior; surpassing all others; extraordinary; transcendent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mystical or supernatural.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(algebra, number theory, field theory, of a number or an element of an extension field) Not algebraic (i.e., not the root of any polynomial that has positive degree and rational coefficients).",
                  "examples": [
                    "The theory of transcendental numbers was originated by Liouville in his famous memoir† of 1844 in which he obtained, for the first time, a class, très-étendue, as it was described in the title of the paper, of numbers that satisfy no algebraic equation with integer coefficients."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(algebra, field theory, of an extension field) That contains elements that are not algebraic.",
                  "examples": [
                    "Suppose that \n  \n    \n      \n        F\n        <\n        E\n      \n    \n    {\\displaystyle F<E}\n  \n is purely transcendental. Show that any simple extension of \n  \n    \n      \n        F\n      \n    \n    {\\displaystyle F}\n  \n contained in \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle E}\n  \n (but not equal to \n  \n    \n      \n        F\n      \n    \n    {\\displaystyle F}\n  \n) is transcendental over \n  \n    \n      \n        F\n      \n    \n    {\\displaystyle F}\n  \n."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "transcendental (plural transcendentals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A transcendentalist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, metaphysics, Platonism, Christian theology, usually in the plural) Any one of the three transcendental properties of being: truth, beauty or goodness, which respectively are the ideals of science, art and religion and the principal subjects of the study of logic, aesthetics and ethics.",
                  "examples": [
                    "In deference to Christian usage we can say that the transcendentals constitute the Logos within which everything has its being and according to which everything is made."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}