{
  "word": "aggravate",
  "etymologies": [
    {
      "description": [
        "From Latin aggravatus, past participle of aggravare (“to add to the weight of, make worse, oppress, annoy”), from ad (“to”) + gravare (“to make heavy”), from gravis (“heavy”). See grave and compare aggrieve and aggrege."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "aggravate (third-person singular simple present aggravates, present participle aggravating, simple past and past participle aggravated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make (an offence) worse or more severe; to increase in offensiveness or heinousness. [from 16th c.]",
                  "examples": [
                    "The defense made by the prisoner's counsel did rather aggravate than extenuate his crime."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) To make worse; to exacerbate. [from 16th c.]",
                  "examples": [
                    "[…]  to aggravate the horrors of the scene"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) To give extra weight or intensity to; to exaggerate, to magnify. [from 16th c.]",
                  "examples": [
                    "He aggravated the story."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To pile or heap (something heavy or onerous) on or upon someone. [16th–18th c.]",
                  "examples": [
                    "In order to lighten the crown still further, they aggravated responsibility on ministers of state."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly colloquial) To exasperate; to provoke or irritate. [from 16th c.]",
                  "examples": [
                    "Ben Bella was aggravated by having to express himself in French because the Egyptians were unable to understand his Arabic."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}