{
  "word": "dildo",
  "etymologies": [
    {
      "description": [
        "Unclear; possibly an alteration of English diddle; compare the use of dildo2, like diddle, as an expressive nonsense syllable in often sexual songs. Compare the spelling dil doul, found in e.g. The Maids Complaint for want of a Dil Doul, a song in the library of Samuel Pepys. Unlikely to be related to Italian diletto (“delight”) or Latin dīlātō (“I open up, spread”), often cited etymologies."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dildo (plural dildos or dildoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artificial phallus (penis) for sexual use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) An idiot, a bore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, vulgar, slang) Any device or implement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A columnar cactus of the West Indies (Pilosocereus royenii).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dildo (third-person singular simple present dildoes, present participle dildoing, simple past and past participle dildoed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To penetrate with a dildo or with another object as if it were a dildo.",
                  "examples": [
                    "Venus  […]  is Dildo'd by Cauda Draconis."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Related to other nonsense syllables like dido and diddle(-diddle), which similarly developed sexual senses. Found since at least the 1500s, often in contexts where allusion is being made to the sexual sense (above). Possibly influenced by Middle English dildoun (“darling, pet”), early modern English dildin (“sweetheart”); compare Old Norse dilla (“to lull”), dillindo (“lullaby”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}