{
  "word": "languid",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French languide (“fatigued, weak; apathetic, indifferent”) (modern French languide), or from its etymon Latin languidus (“faint, weak; dull; slow, sluggish; ill, sick, unwell; (figuratively) inactive, inert, listless”), from langueō (“to be faint or weak; (figuratively) to be idle, inactive, or listless”) (from Proto-Indo-European *(s)leg-, *(s)leh₁g- (“to weaken”)) + -idus (suffix meaning ‘tending to’ forming adjectives). Doublet of languish."
      ],
      "adjectives": [
        {
          "description": "languid (comparative more languid, superlative most languid)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person or animal, or their body functions: flagging from weakness, or inactive or weak, especially due to illness or tiredness; faint, listless.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person or their movement: showing a dislike for physical effort; leisurely, unhurried.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person or their actions, character, etc.: lacking drive, emotion, or enthusiasm; apathetic, listless, spiritless, unenthusiastic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a colour: not bright; dull, muted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of an idea, writing, etc.: dull, uninteresting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a period of time: characterized by lack of activity; pleasant and relaxed; unstressful.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a thing: lacking energy, liveliness, or strength; inactive, slow-moving, weak.",
                  "examples": [
                    "languid breathing    languid movements"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant of languet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "languid (plural languids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of languet (“a flat plate in (or opposite and below the mouth of) the pipe of an organ”)",
                  "examples": [
                    "Synonym: (rare) language"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}