{
  "word": "stovepipe",
  "etymologies": [
    {
      "description": [
        "stove +‎ pipe.  The firearms sense is due to the trapped cartridge case resembling a stovepipe of the stove sense."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stovepipe (plural stovepipes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sheet-metal tubing used as a chimney for a stove or furnace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A channel for information which is compartmentalized in such a manner that some parties who might be interested in its use or be able to utilize it are restricted from accessing it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(clothing) A stovepipe hat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) A type of malfunction affecting breechloading firearms, where a spent cartridge casing fails to eject completely, instead becoming stuck in the firearm's ejection port, usually oriented vertically or nearly so.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stovepipe (third-person singular simple present stovepipes, present participle stovepiping, simple past and past participle stovepiped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(idiomatic) To collect or store information in a compartmentalized manner, so that some parties who might be interested in its use or ability to utilize it are restricted from accessing it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) Of a cartridge case, to become wedged vertically in the ejection port of a breechloading firearm, rather than ejecting completely from the weapon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}