{
  "word": "rabbit",
  "etymologies": [
    {
      "description": [
        "From Middle English rabet, rabette, from Middle French *robotte, *rabotte or Anglo-Latin rabettus, from dialectal Old French rabotte, probably a diminutive of Middle Dutch or West Flemish robbe, perhaps related to robbe (“seal”), itself of uncertain origin; possibly some imitative verb, maybe robben, rubben (“to rub”) is used here to allude to a characteristic of the animal. See rub.",
        "Related forms include Middle French rabouillet (“baby rabbit”) and in French rabot (“plane”)), coming via Walloon Old French (reflected nowadays as Walloon robète (“rabbit”)), from Middle Dutch robbe (\"rabbit; seal\"; whence Modern Dutch rob (“seal\", also \"rabbit”)); also Middle Low German robbe, rubbe (“rabbit”), and the later Low German Rubbe (“seal”), West Frisian robbe (“seal”), Saterland Frisian Rubbe (“seal”), North Frisian rob (“seal”), borrowed into German Robbe (“seal”).",
        "Meant \"young rabbit\" until the 19th c., when it came to replace the original general term coney, owing to the latter's resemblance to and use as a euphemism for cunny, \"vulva\" (cf. ass and donkey)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rabbit (countable and uncountable, plural rabbits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mammal of the family Leporidae, with long ears, long hind legs and a short, fluffy tail.",
                  "examples": [
                    "The pioneers survived by eating the small game they could get: rabbits, squirrels and occasionally a raccoon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The meat from this animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The fur of a rabbit typically used to imitate another animal's fur.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A runner in a distance race whose goal is mainly to set the pace, either to tire a specific rival so that a teammate can win or to help another break a record; a pacesetter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A very poor batsman; selected as a bowler or wicket-keeper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing theory) A large element at the beginning of a list of items to be bubble sorted, and thus tending to be quickly swapped into its correct position. Compare turtle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rarebit; Welsh rabbit or a similar dish: melted cheese served atop toast.",
                  "examples": [
                    "CHEESE TOASTED, OR RABBIT."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pneumatically-controlled tool used to insert small samples of material inside the core of a nuclear reactor.",
                  "examples": [
                    "This rabbit is constructed such that only that fraction of the beam that passes through the 15g-in. diameter target container reaches the Faraday cup behind the rabbit."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rabbit (third-person singular simple present rabbits, present participle rabbitting or rabbiting, simple past and past participle rabbitted or rabbited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hunt rabbits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, intransitive) To flee.",
                  "examples": [
                    "The informant seemed skittish, as if he was about to rabbit.",
                    "When the three friends heard someone behind them yell, \"police, freeze!\" they each  rabbited in a different direction."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Cockney rhyming slang rabbit and pork, to talk."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rabbit (third-person singular simple present rabbits, present participle rabbiting, simple past and past participle rabbited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, intransitive) To talk incessantly and in a childish manner; to babble annoyingly.",
                  "examples": [
                    "Synonym: rabbit on",
                    "Stop your infernal rabbiting! Use proper words or nobody will listen to you!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Perhaps a corruption of rabate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rabbit",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Confound; damn; drat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}