{
  "word": "province",
  "etymologies": [
    {
      "description": [
        "From Middle English provynce, from Anglo-Norman province, Middle French province, from Latin prōvincia (“territory brought under Roman domination; official duty, office, charge, province”), from Proto-Indo-European *prōw- (“right judge, master”). Cognate with Gothic 𐍆𐍂𐌰𐌿𐌾𐌰 (frauja, “lord, master”), Old English frēa (“ruler, lord, king, master”). Replaced Old English boldġetæl. See also frow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "province (plural provinces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A region of the earth or of a continent; a district or country. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An administrative subdivision of certain countries, including Canada and China. [from 14th c.]",
                  "examples": [
                    "All of Fort McMurray, with the exception of Parson’s Creek, was under a mandatory evacuation order on Tuesday, said Robin Smith, press secretary for the regional municipality of Wood Buffalo in the Canadian province [of Alberta]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman history) An area outside Italy which is administered by a Roman governor. [from 14th c.]",
                  "examples": [
                    "He reminded his audience of events in 88BC, when the same Mithridates invaded the Roman province of Asia, on the western coast of Turkey."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) An area under the jurisdiction of an archbishop, typically comprising a number of adjacent dioceses. [from 14th c.]",
                  "examples": [
                    "In 1309, neither the Archbishop of Canterbury nor his suffragans would attend in Parliament while the Archbishop of York had the cross borne erect before him in the province of Canterbury."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism) An area under the jurisdiction of a provincial within a monastic order.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, chiefly with definite article) The parts of a country outside its capital city. [from 17th c.]",
                  "examples": [
                    "To-day the first part of the new Indian Constitution comes into force with the granting of a large measure of autonomy to the provinces."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area of activity, responsibility or knowledge; the proper concern of a particular person or concept. [from 17th c.]",
                  "examples": [
                    "Just as money is the province of the economy and truth the province of science and scholarship, so love is the province of the family (Niklas Luhmann)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}