{
  "word": "sex",
  "etymologies": [
    {
      "description": [
        "From Middle English sexe (“gender”), from Old French sexe (“genitals; gender”), from Latin sexus (“gender; gender traits; males or females; genitals”), from Proto-Italic *seksus, from Proto-Indo-European *séksus, from *sek- (“to cut, cut off, sever”), thus meaning \"section, division\" (into male and female).",
        "Usage for women influenced by Middle French le sexe (“women”) (attested in 1580). Usage for third and additional sexes calqued from French troisième sexe, referring to masculine women in 1817 and homosexuals in 1847. First used by Lord Byron and others in English in reference to Catholic clergy. Usage for sexual intercourse first attested in 1900 (in the writings of H.G. Wells)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sex (countable and uncountable, plural sexes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A category into which sexually-reproducing organisms are divided on the basis of their reproductive roles in their species.",
                  "examples": [
                    "The effect of the medication is dependent upon age, sex, and other factors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Another category, especially of humans and especially based on sexuality or gender roles.",
                  "examples": [
                    "\"But now another sex, in arms, is brought, / And, realms to guard, are eunuchs able thought!\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The members of such a category, taken collectively.",
                  "examples": [
                    "It was a weaknessIn me, but incident to all our sex."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The distinction and relation between these categories, especially in humans; gender.",
                  "examples": [
                    "A lot of women now like men to pay for them on dates... We've dealt with the outdated view of sex underpinning this."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or literary, uncountable, with \"the\") Women; the human female gender and those who belong to it.",
                  "examples": [
                    "The sex of Venice are undoubtedly of a distinguished beauty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Sexual activity, usually sexual intercourse unless preceded by a modifier.",
                  "examples": [
                    "If you want to have sex, you've got to trustAt the core of your heart, the other creature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, euphemistic or slang) Genitalia: a penis or vagina.",
                  "examples": [
                    "Another ha's gon through with the bargain... One that will find the way to her Sex, before you'le come to kissing her hand."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sex (third-person singular simple present sexes, present participle sexing, simple past and past participle sexed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, transitive) To determine the sex of (an animal).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, colloquial, transitive) To have sex with.",
                  "examples": [
                    "Sex with Ivory had gotten better than sexing his wife. Herschel laughed with Ivory, cried with Ivory. They dreamt aloud together. Unlike Nikki, Ivory believed in him. Every man needed a woman who believed in him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, colloquial, intransitive) To have sex.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From sect."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sex (plural sexes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Alternative form of sect.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}