{
  "word": "succeed",
  "etymologies": [
    {
      "description": [
        "From Old French succeder, from Latin succedere (“to go under, go from under, come under, approach, follow, take the place of, receive by succession, prosper, be successful”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "succeed (third-person singular simple present succeeds, present participle succeeding, simple past and past participle succeeded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To follow something in sequence or time.",
                  "examples": [
                    "Autumn succeeds summer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To replace or supplant someone in order vis-à-vis an office, position,  or title.",
                  "examples": [
                    "The king's eldest son succeeds his father on the throne.",
                    "After a contentious election, Jones succeeded Smith as president of the republic.",
                    "Synonym: take the place of"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come after or follow; to be subsequent or consequent; (often with to).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive) To come in the place of another person, thing, or event; to come next in the usual, natural, or prescribed course of things; to follow; hence, to come next in the possession of anything; (often with to).",
              "entries": [
                {
                  "meaning": "(intransitive) To ascend the throne after the removal or death of the occupant.",
                  "examples": [
                    "Princess Buttercup succeeded to the throne as queen after King Willoughby died."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To prevail in obtaining an intended objective or accomplishment; to prosper as a result or conclusion of a particular effort.",
                  "examples": [
                    "The persecution of any righteous practice has never succeeded in the face of history; in fact, it can expedite the collapse of the persecutory regime.",
                    "She succeeded in her efforts to repair the tank."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To prosper or attain success and beneficial results in general.",
                  "examples": [
                    "voted most likely to succeed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To turn out, fare, do (well or ill).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To support; to prosper; to promote or give success to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To descend, as an estate or an heirloom, in the same family; to devolve; (often with to).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, rare) To fall heir to; to inherit.",
                  "examples": [
                    "Else let my brother die, / If not a feodary, but only he / Owe and succeed thy weakness.}}"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete, rare) To go down or near (with to).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}