{
  "word": "elk",
  "etymologies": [
    {
      "description": [
        "From Middle English elk, from Old English eolc, eolh (“elk”), from Proto-Germanic *elhaz, *algiz (“elk”) (compare Low German Elk, German Elch,  Danish elg,  Norwegian elg, Swedish älg), from Proto-Indo-European *h₁élḱis, *h₁ólḱis (compare Polish łoś, Russian лось (losʹ), Vedic Sanskrit ऋश्य (ṛ́śya, “antelope”), variant of *h₁elh₁én (compare German Elen, Tocharian A yäl, Tocharian B ylem (“gazelle”), Lithuanian élnis (“stag”), Armenian եղնիկ (ełnik, “doe, hind”)), from *h₁el- (“deer”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "elk (plural elk or elks)",
          "definitionGroups": [
            {
              "group": "Any of various large species of deer such as the red deer, moose or wapiti (see usage notes).",
              "entries": [
                {
                  "meaning": "Any of the subspecies of the moose (Alces alces, alternatively named Eurasian elk to avoid confusion with the wapiti), that occurs only in Europe and Asia.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Europe, Commonwealth) Any moose (Alces alces), the largest member of the deer family.",
                  "examples": []
                },
                {
                  "meaning": "(Canada, US) common wapiti (Cervus canadensis), the second largest member of the deer family, once thought to be a subspecies of red deer.",
                  "examples": []
                },
                {
                  "meaning": "(British India) Sambar (Cervus unicolor).",
                  "examples": [
                    "In a narrow defile  […]  a male elk, (cervus alces, Lin.) of noble appearance, followed by twenty-two females, passed majestically under their platform, each as large as a common-sized horse."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "elk (plural elks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Alternative form of elke (the common swan (Cygnus cygnus, syn. Cygnus ferus))",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}