{
  "word": "notch",
  "etymologies": [
    {
      "description": [
        "Recorded since 1577, probably a rebracketing of an + otch, which noun stems from Middle French oche (“notch”), itself from the Old French verb ochier (“to notch”), of uncertain origin, but possibly related to French hocher and English nick (“small cut, notch”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "notch (plural notches)",
          "definitionGroups": [
            {
              "group": "A V-shaped cut.",
              "entries": [
                {
                  "meaning": "Such a cut, used for keeping a record.",
                  "examples": [
                    "The notches in that tribe's warrior axe handles stand for killed enemies."
                  ]
                },
                {
                  "meaning": "(US slang) Woman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An indentation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mountain pass; a defile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A discontinuous change in a taxation schedule.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A level or degree.",
                  "examples": [
                    "This car is a notch better than the other.",
                    "Can you speak a notch louder, please?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A portion of a mobile phone that overlaps the edge of the screen, used to house camera, sensors etc. while maximizing screen space.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "notch (third-person singular simple present notches, present participle notching, simple past and past participle notched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut a notch in (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To record (a score or similar) by making notches on something.",
                  "examples": [
                    "The tribe's hunters notch their kills by notches on each's axe's handle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To join by means of notches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To achieve (something); to add to one's score or record of successes.",
                  "examples": [
                    "Synonym: notch up",
                    "The team notched a pair of shutout wins on Sunday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fit (an arrow) to a bow by means of the notch cut at the end of the arrow; to nock.",
                  "examples": [
                    "Notching an arrow on the string of his tried and unerring bow, he raised his sinewy arms  […]"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}