{
  "word": "candle",
  "etymologies": [
    {
      "description": [
        "From Middle English candel, from Old English candel (“candle”), borrowed from Latin candēla (“candle”), from Latin candeō (“be white, bright, shining”, verb); see candid. Doublet of candela and chandelle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "candle (plural candles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light source consisting of a wick embedded in a solid, flammable substance such as wax, tallow, or paraffin.",
                  "examples": [
                    "light a candle",
                    "blow out the candles on the birthday cake",
                    "snuff out the candle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The protruding, removable portion of a filter, particularly a water filter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A unit of luminous intensity, now replaced by the SI unit candela.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(forestry) A fast-growing, light-colored, upward-growing shoot on a pine tree in the spring. As growth slows in summer, the shoot darkens and is no longer conspicuous.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "candle (third-person singular simple present candles, present participle candling, simple past and past participle candled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(embryology, transitive) To observe the growth of an embryo inside (an egg), using a bright light source.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pottery, transitive) To dry (greenware) prior to the firing cycle, setting the kiln at 200° Celsius until all water is removed from the greenware.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To check (an item, such as an envelope) by holding it between a light source and the eye.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}