{
  "word": "caption",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin captiō, from the past participle of capiō (“I take, I seize”) (English capture). Compare Middle English capcioun (“seizure, capture”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "caption (plural captions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) The descriptive heading or title, of a document or part thereof.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A title or brief explanation attached to an illustration, cartoon, user interface element, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cinematography, television) A piece of text appearing on screen as a subtitle or other part of a film or broadcast, describing dialogue (and sometimes other sound) for viewers who cannot hear.",
                  "examples": [
                    "(theater, performance production) By analogy, text in a similar system used in a performance venue for transcription of a live event."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The section on an official paper (for example, as part of a seizure or capture) that describes when, where, and what was taken, found or executed, and who authorized the act.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, law) A seizure or capture, especially of tangible property (chattel).",
                  "examples": [
                    "The caption and asportation must be felonious."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "caption (third-person singular simple present captions, present participle captioning, simple past and past participle captioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To add captions to a text or illustration.",
                  "examples": [
                    "Only once the drawing is done will the letterer caption it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To add captions to a film or broadcast.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}