{
  "word": "lute",
  "etymologies": [
    {
      "description": [
        "From Middle French lut (modern luth), from Old French leüt, probably from Old Occitan laüt, from Arabic اَلْعُود‎ (al-ʕūd, “wood”) (probably representing an Andalusian Arabic or North African pronunciation). Doublet of oud, lavta, and laouto."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lute (plural lutes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fretted stringed instrument of European origin, similar to the guitar, having a bowl-shaped body or soundbox; any of a wide variety of chordophones with a pear-shaped body and a neck whose upper surface is in the same plane as the soundboard, with strings along the neck and parallel to the soundboard.",
                  "examples": [
                    "Coordinate term: guitar"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lute (third-person singular simple present lutes, present participle luting, simple past and past participle luted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To play on a lute, or as if on a lute.",
                  "examples": [
                    "Knaves are men / That lute and flute fantastic tenderness."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old French lut, ultimately from Latin lutum (“mud”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lute (countable and uncountable, plural lutes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Thick sticky clay or cement used to close up a hole or gap, especially to make something air-tight.",
                  "examples": [
                    "He employed a mixture of flour and white of egg spread upon a linen cloth to cement cracked glass vessels, and used other lutes for similar purposes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A packing ring, as of rubber, for fruit jars, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(brickmaking) A straight-edged piece of wood for striking off superfluous clay from earth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lute (third-person singular simple present lutes, present participle luting, simple past and past participle luted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fix or fasten something with lute.",
                  "examples": [
                    "To protect everything till it dried, a man  […]  luted a big blue paper cap from a cracker, with meringue-cream, low down on Jevon's forehead."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}