{
  "word": "condemn",
  "etymologies": [
    {
      "description": [
        "From Middle English condempnen, from Old French condamner, from Latin condemnāre (“to sentence, condemn, blame”), from com- + damnāre (“to harm, condemn, damn”), from damnum (“damage, injury, loss”). Displaced native Middle English fordemen (from Old English fordeman (“condemn, sentence, doom”) > Modern English fordeem."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "condemn (third-person singular simple present condemns, present participle condemning, simple past and past participle condemned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strongly criticise or denounce; to excoriate the perpetrators of.",
                  "examples": [
                    "The president condemned the terrorists."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To judicially pronounce (someone) guilty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To judicially announce a verdict upon a finding of guilt; To sentence",
                  "examples": [
                    "The judge condemned him to death.",
                    "She was condemned to life in prison."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To confer eternal divine punishment upon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adjudge (a building) as being unfit for habitation.",
                  "examples": [
                    "The house was condemned after it was badly damaged by fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adjudge (building or construction work) as of unsatisfactory quality, requiring the work to be redone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adjudge (food or drink) as being unfit for human consumption.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To declare something to be unfit for use, or further use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To determine and declare (property) to be assigned to public use. See eminent domain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To declare (a vessel) to be forfeited to the government, to be a prize, or to be unfit for service.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}