{
  "word": "collate",
  "etymologies": [
    {
      "description": [
        "From Latin collātum, past participle of cōnferō. Not related to collateral."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "collate (third-person singular simple present collates, present participle collating, simple past and past participle collated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To examine diverse documents and so on, to discover similarities and differences.",
                  "examples": [
                    "The young attorneys were set the task of collating the contract submitted by the other side with the previous copy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assemble something in a logical sequence.",
                  "examples": [
                    "Detest your own age. Build a better one. And to set that on foot read incredibly dull essays upon Marlowe to your friends. For which purpose one must collate editions in the British Museum."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sort multiple copies of printed documents into sequences of individual page order, one sequence for each copy, especially before binding.",
                  "examples": [
                    "Collating was still necessary because they had to insert foldout sheets and index tabs into the documents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To bestow or confer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Christianity) To admit a cleric to a benefice; to present and institute in a benefice, when the person presenting is both the patron and the ordinary; followed by to.",
                  "examples": [
                    ""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}