{
  "word": "sideline",
  "etymologies": [
    {
      "description": [
        "side +‎ line"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sideline (plural sidelines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A line at the side of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is additional or extra or that exists around the edges or margins of a main item.",
                  "examples": [
                    "She started the business as a sideline to her regular work and it ended up becoming the greater source of income.",
                    "Soup need not be just a sideline to a meal; if you like, it can be the main course."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A line for hobbling an animal by connecting the fore and the hind feet of the same side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A line defining the side boundary of a playing field. Used in Canadian football, field lacrosse and basketball.",
                  "examples": [
                    "Synonym: (in rugby union, rugby league and association football) touchline"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) Usually in the plural: the area outside the playing field beyond each sideline.",
                  "examples": [
                    "The coach stood on the sidelines and bellowed commands at the team."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The outside or perimeter of any activity.",
                  "examples": [
                    "She installed the whole fixture while he simply watched from the sidelines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) A secondary road, especially a byroad at right angles to a main road.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sideline (third-person singular simple present sidelines, present participle sidelining, simple past and past participle sidelined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, transitive) To place on the sidelines; to bench or to keep someone out of play.",
                  "examples": [
                    "The coach sidelined the player until he regained his strength."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove or keep out of circulation or out of the focus.",
                  "examples": [
                    "The illness sidelined him for weeks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}