{
  "word": "skulk",
  "etymologies": [
    {
      "description": [
        "From Middle English skulke, skulken, of North Germanic origin; compare Danish skulke (“shirk”), Swedish skolka (“play truant”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skulk (plural skulks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of foxes.",
                  "examples": [
                    "A skulk of foxes, a cowardice of curs are tonight’s traffic whispering in the yards and lanes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A group of people seen as being fox-like (e.g. cunning, dishonest, or having nefarious plans).",
                  "examples": [
                    "[…]  a skulk of priests flapped out of the Church of San Geronimo, and women kneeling at novena put away their beads  […]"
                  ]
                }
              ]
            },
            {
              "group": "The act of skulking.",
              "entries": [
                {
                  "meaning": "The act of moving in a stealthy or furtive way.",
                  "examples": [
                    "A part of their company, who had been sent out on a skulk, had not returned, and great anxiety was felt lest they had fallen into an ambush and been captured."
                  ]
                },
                {
                  "meaning": "A stealthy or furtive gait or way of moving.",
                  "examples": [
                    "His gait was something between a slouch and a skulk."
                  ]
                },
                {
                  "meaning": "The act of avoiding an obligation or responsibility.",
                  "examples": [
                    "[They took] good care  […]  to swing their hammocks as far abaft as possible, for the twofold purpose of having a skulk in their watch below at night, and to keep clear of the sprays, which usually pour down the gratings  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, chiefly nautical, military) One who avoids an obligation or responsibility.",
                  "examples": [
                    "Synonyms: shirk, shirker, skulker."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "skulk (third-person singular simple present skulks, present participle skulking, simple past and past participle skulked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To stay where one cannot be seen, conceal oneself (often in a cowardly way or with the intent of doing harm).",
                  "examples": [
                    "Synonym: hide"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move in a stealthy or furtive way; to come or go while trying to avoid detection.",
                  "examples": [
                    "Synonyms: sneak, steal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To avoid an obligation or responsibility.",
                  "examples": [
                    "Synonym: shirk"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}