{
  "word": "medicine",
  "etymologies": [
    {
      "description": [
        "From Middle English medicin, from Middle French medicine, from Old French medecine, from Latin medicīna (“the healing art, medicine, a physician's shop, a remedy, medicine”), feminine of medicīnus (“of or belonging to physic or surgery, or to a physician or surgeon”), from medicus (“a physician, surgeon”).",
        "The extended sense of \"Indigenous magic\" is a calque of Ojibwe mashkiki (“medicine”)  or mide (or cognates in related languages) when used in compounds such as Grand Medicine Society, medicine lodge, medicine dance, medicine bag, medicine wheel, medicine man, Medicine Line, and bad medicine or place names such as Medicine Hat, Medicine Creek, etc."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "medicine (countable and uncountable, plural medicines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, countable) A substance which specifically promotes healing when ingested or consumed in some way; a pharmaceutical drug.",
                  "examples": [
                    "This medicine has fewer adverse effects than others in its drug class.",
                    "Using a weekly pill organizer is a good way to help remind yourself to take your medicine each day, and it also tells you whether you already took today's pills (it's not unusual to forget doing a habitual task)!",
                    "Synonym: medication",
                    "Hypernym: drug"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(broadly, countable) Any treatment or cure.",
                  "examples": [
                    "A legislative remedy might be some harsh medicine; is that cure worse than the ill?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The study of the cause, diagnosis, prognosis and treatment of disease or illness.",
                  "examples": [
                    "She's studying medicine at university because she wants to be a doctor in the future."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(uncountable) The profession and practice of physicians, including surgeons.",
              "entries": [
                {
                  "meaning": "(mainly historical, uncountable) The profession and practice of nonsurgical physicians as sometimes distinguished from that of surgeons.",
                  "examples": [
                    "the evolving relationship of medicine to surgery in the nineteenth century",
                    "Coordinate term: surgery"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Ritual magic used, as by a medicine man, to promote a desired outcome in healing, hunting, or warfare; traditional medicine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Among the Native Americans, any object supposed to give control over natural or magical forces, to act as a protective charm, or to cause healing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Black magic, superstition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A philter or love potion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A physician.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Recreational drugs, especially alcoholic drinks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "medicine (third-person singular simple present medicines, present participle medicining, simple past and past participle medicined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, obsolete) To treat with medicine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}