{
  "word": "chocolate",
  "etymologies": [
    {
      "description": [
        "Via Spanish chocolate from a Nahuatl word, widely given as chocolātl (with the second element being a reflex of Classical Nahuatl ātl (“water”)), although such a word does not appear in Nahuatl until the mid-18th century according to Karttunen. Dakin and Wichmann propose chicolātl as the original form (saying it survives in several modern Nahuatl dialects) and say the chicol- element refers to a special wooden stick used to prepare chocolate. Another theory is that the prefix came from Yucatec Maya chocol (“hot”)."
      ],
      "adjectives": [
        {
          "description": "chocolate (comparative more chocolate, superlative most chocolate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of or containing chocolate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a dark reddish-brown colour/color.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Black (relating to any of various ethnic groups having dark pigmentation of the skin).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "chocolate (countable and uncountable, plural chocolates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly uncountable) A food made from ground roasted cocoa beans.",
                  "examples": [
                    "Chocolate is a very popular treat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly uncountable) A drink made by dissolving this food in boiling milk or water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A single, small piece of confectionery made from chocolate.",
                  "examples": [
                    "He bought her some chocolates as a gift. She ate one chocolate and threw the rest away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A dark, reddish-brown colour/color, like that of chocolate (also called chocolate brown).",
                  "examples": [
                    "As he cooked it the whole thing turned a rich, deep chocolate.",
                    "chocolate:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) A black person; (uncountable) blackness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chocolate (third-person singular simple present chocolates, present participle chocolating, simple past and past participle chocolated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare, chiefly in the past participle) To add chocolate to; to cover (food) in chocolate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, biology) To treat blood agar by heating in order to lyse the red blood cells in the medium.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}