{
  "word": "charade",
  "etymologies": [
    {
      "description": [
        "From French charade, charrade (“prattle, idle conversation; a kind of riddle”), probably from Occitan charrada (“conversation; chatter”), from charrar (“to chat; to chatter”) + -ada. As a round of the game, originally a clipping of acting charade but now usually understood and formed as a back-formation from charades."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "charade (plural charades)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literature, archaic) A genre of riddles where the clues to the answer are descriptions or puns on its syllables, with a final clue to the whole.",
                  "examples": [
                    "CHARADE, a trifling species of composition, or quasi-literary form of amusement, which may perhaps be best defined as a punning enigma propounded in a series of descriptions. A word is taken of two or more syllables, each forming a distinct word; each of these is described in verse or prose, as aptly and enigmatically as possible; and the same process is applied to the whole word. The neater and briefer the descriptive parts of the problem, the better the charade will be. In selecting words for charades, special attention should be paid to the absolute quality of the syllables composing them, inaccuracy in trifles of this sort depriving them of what little claim to merit they may possess. The brilliant rhythmic trifles of W. Mackworth Praed are well known. Of representative prose charades, the following specimens are perhaps as good as could be selected:—“My first, with the most rooted antipathy to a Frenchman, prides himself, whenever they meet, upon sticking close to his jacket; my second has many virtues, nor is its least that it gives its name to my first; my whole may I never catch!” “My first is company; my second shuns company; my third collects company; and my whole amuses company.” The solutions are Tar-tar and Co-nun-drum."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) A single round of the game charades, an acted form of the earlier riddles.",
                  "examples": [
                    "Synonyms: acted charade, (obsolete) dumb charade"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A play resembling the game charades, particularly due to poor acting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deception or pretense, originally an absurdly obvious one but now in general use.",
                  "examples": [
                    "Synonyms: farce, sham; see also Thesaurus:fake",
                    "This whole charade is absurd."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "charade (third-person singular simple present charades, present participle charading, simple past and past participle charaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act out a charade (of); to gesture; to pretend.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}