{
  "word": "clodhopper",
  "etymologies": [
    {
      "description": [
        "Compound of clod +‎ hopper (agentive form of the verb hop). Perhaps affected by analogy with grasshopper. Attested in the sense of \"peasant\" since the seventeenth century; the extended sense of \"boot\" or \"shoe\" dates from the nineteenth century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clodhopper (plural clodhoppers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strong shoe for heavy-duty use, a boot.",
                  "examples": [
                    "...who had got on his \"hill shoes,\" as he calls a pair of clodhoppers as thick as a ploughman's, and stuck round with nails."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Any kind of shoe.",
                  "examples": [
                    "We had to walk slow because of his wooden clod-hoppers, and that was the way I wanted it now"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military slang) United States Navy ankle length work shoes, distinct from dress shoes or combat boots.",
                  "examples": [
                    "Smiling Jim Mead of New York tries on his GI clodhopper boots. He decided to return them \"because we couldn't make any altitude with those aboard.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A peasant or yokel.",
                  "examples": [
                    "'Nephew Jack,' he cried, looking at me when I was thinking what to say, and finding only emptiness, 'you are a heavy lout, sir; a bumpkin, a clodhopper; and I shall leave you nothing, unless it be my boots to grease.'"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A clumsy or foolish person.",
                  "examples": [
                    "All guess-work exploits shrivel up a good yard, or sometimes two, when brought to the measure, and the champion of the county dwindles into a clumsy clod-hopper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wheatear; any of various passerine birds.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}