{
  "word": "seat",
  "etymologies": [
    {
      "description": [
        "From Middle English sete, from Old English sǣte and possibly (or simply cognate with) Old Norse sæti (“seat”), both from Proto-Germanic *sētiją (“seat”); compare Old English set (“seat”). Compare also Old High German gisazi (German Gesäß), Middle Dutch gesaete. Sense of \"residence, abode, established place\" likely derived from cognate Old English sǣte (“house”), related to Old High German sāza (“sedan, seat, domicile”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "seat (plural seats)",
          "definitionGroups": [
            {
              "group": "Something to be sat upon.",
              "entries": [
                {
                  "meaning": "A place in which to sit.",
                  "examples": [
                    "There are two hundred seats in this classroom."
                  ]
                },
                {
                  "meaning": "The horizontal portion of a chair or other furniture designed for sitting.",
                  "examples": [
                    "He sat on the arm of the chair rather than the seat, which always annoyed his mother.",
                    "the seat of a saddle"
                  ]
                },
                {
                  "meaning": "A piece of furniture made for sitting; e.g. a chair, stool or bench; any improvised place for sitting.",
                  "examples": [
                    "She pulled the seat from under the table to allow him to sit down."
                  ]
                },
                {
                  "meaning": "(aviation, military, slang) An ejection seat.",
                  "examples": [
                    "Hey, fighter boy, our radar's putting out enough energy to launch your seat from this distance!"
                  ]
                },
                {
                  "meaning": "The part of an object or individual (usually the buttocks) directly involved in sitting.",
                  "examples": [
                    "Instead of saying \"sit down\", she said \"place your seat on this chair\"."
                  ]
                },
                {
                  "meaning": "The part of a piece of clothing (usually pants or trousers) covering the buttocks.",
                  "examples": [
                    "The seat of these trousers is almost worn through."
                  ]
                },
                {
                  "meaning": "(engineering) A part or surface on which another part or surface rests.",
                  "examples": [
                    "The seat of the valve had become corroded."
                  ]
                }
              ]
            },
            {
              "group": "A location or site.",
              "entries": [
                {
                  "meaning": "(figurative) A membership in an organization, particularly a representative body.",
                  "examples": [
                    "Our neighbor has a seat at the stock exchange and in congress."
                  ]
                },
                {
                  "meaning": "The location of a governing body.",
                  "examples": [
                    "Washington D.C. is the seat of the U.S. government."
                  ]
                },
                {
                  "meaning": "(certain Commonwealth countries) An electoral district, especially for a national legislature.",
                  "examples": []
                },
                {
                  "meaning": "A temporary residence, such as a country home or a hunting lodge.",
                  "examples": [
                    "A man of fortune, who lives in London, may, in plays, operas, routs, assemblies, French cookery, French sauces, and French wines, spend as much yearly, as he could do, were he to live in the most hospitable manner at his seat in the country."
                  ]
                },
                {
                  "meaning": "The place occupied by anything, or where any person, thing or quality is situated or resides; a site.",
                  "examples": [
                    "Where thou dwellest, even where Satan's seat is."
                  ]
                },
                {
                  "meaning": "(law, England & Wales) One of a series of departmental placements given to a trainee solicitor as part of their training contract.",
                  "examples": []
                },
                {
                  "meaning": "(historical) Any of several autonomous regions in the medieval Kingdom of Hungary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The starting point of a fire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Posture, or way of sitting, on horseback.",
                  "examples": [
                    "She had so good a seat and hand she might be trusted with any mount."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "seat (third-person singular simple present seats, present participle seating, simple past and past participle seated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put an object into a place where it will rest; to fix; to set firm.",
                  "examples": [
                    "Be sure to seat the gasket properly before attaching the cover."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with a place to sit.",
                  "examples": [
                    "This classroom seats two hundred students.",
                    "The waiter seated us and asked what we would like to drink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To request or direct one or more persons to sit.",
                  "examples": [
                    "Please seat the audience after the anthem and then introduce the first speaker."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, legislature) To recognize the standing of a person or persons by providing them with one or more seats which would allow them to participate fully in a meeting or session.",
                  "examples": [
                    "Only half the delegates from the state were seated at the convention because the state held its primary too early.",
                    "You have to be a member to be seated at the meeting. Guests are welcome to sit in the visitors section."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assign the seats of.",
                  "examples": [
                    "to seat a church"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to occupy a post, site, or situation; to station; to establish; to fix; to settle.",
                  "examples": [
                    "They had seated themselves in Nova Guiana."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To rest; to lie down.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To settle; to plant with inhabitants.",
                  "examples": [
                    "to seat a country"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put a seat or bottom in.",
                  "examples": [
                    "to seat a chair"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}