{
  "word": "grabble",
  "etymologies": [
    {
      "description": [
        "grab +‎ -le"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grabble (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A method of fishing using a line with several hooks fastened to it along with a lead weight so that the hooks sit on the bottom.",
                  "examples": [
                    "To lay / fish (up)on the grabble"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grabble (third-person singular simple present grabbles, present participle grabbling, simple past and past participle grabbled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To search with one's hands and fingers; to attempt to grasp something.",
                  "examples": [
                    "Synonyms: fumble, grope, grubble, root, rummage; see also Thesaurus:feel around"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To search in a similar way using an implement.",
                  "examples": [
                    "[…]  he proposes to spend the Afternoon at the Out-side of the Rock, in viewing the Sea, and looking for Oysters; so takes in his Hand his long Staff to grabble in Holes  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch (someone) with one's hands or fingers, sometimes in a sexual way.",
                  "examples": [
                    "Synonyms: feel up, fondle, grope; see also Thesaurus:fondle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pick (something or someone) up hastily, roughly or clumsily.",
                  "examples": [
                    "Synonyms: grab, seize, snatch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attempt to grab; to grasp at (something).",
                  "examples": [
                    "Synonyms: clutch, grip; see also Thesaurus:grasp"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pull, lift or dig (something) (out of the ground) by searching with one's hands and fingers.",
                  "examples": [
                    "Synonym: grub"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To lift (something) out in a similar way using an implement.",
                  "examples": [
                    "[…]  set all these togither on the fire, & boile them till the wine and water be consumed, and that the flesh and bones be separated a sunder, that you may with a paire of tongs grabble out the bones from the rest, thus let it be taken off and pressed through a piece of canuas, and keepe it to your use."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, now Southeastern US) To catch fish by reaching into the water with one's hand.",
                  "examples": [
                    "Synonym: noodle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete) To fish on the grabble.",
                  "examples": [
                    "It was just after such a day that I grabbled fifty of the best salmon I ever saw—all fresh run from the sea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To utter inarticulate sounds, often quickly and loudly; to say (something) quickly, idly or foolishly.",
                  "examples": [
                    "Synonyms: babble, gabble, gibber, jabber"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To lie prostrate; to sprawl on the ground.",
                  "examples": [
                    "Synonym: grovel"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}