{
  "word": "scaffold",
  "etymologies": [
    {
      "description": [
        "From Middle English scaffold, scaffalde, from Anglo-Norman schaffaut, eschaffaut, eschafal, eschaiphal, escadafaut (“platform to see a tournament”) (Modern French échafaud), from Old French es- (“indicating movement away or separation”) (from Latin ex- (“out, away”)) + chafaud, chafaut, chafault, caafau, caafaus, cadefaut (“scaffold for executing a criminal”), from Vulgar Latin *catafalcum (“viewing stage”), possibly from Ancient Greek κατα- (kata-, “back; against”) + Latin -falicum (from fala, phala (“wooden gallery or tower; siege tower”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scaffold (plural scaffolds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A structure made of scaffolding for workers to stand on while working on a building.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An elevated platform on which a criminal is executed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An elevated platform on which dead bodies are ritually disposed of, as by some Native American tribes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metalworking) An accumulation of adherent, partly fused material forming a shelf or dome-shaped obstruction above the tuyeres in a blast furnace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) A structure that provides support for some other material.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scaffold (third-person singular simple present scaffolds, present participle scaffolding, simple past and past participle scaffolded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set up a scaffolding; to surround a building with scaffolding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sustain; to provide support for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dispose of the bodies of the dead on a scaffold or raised platform, as by some Native American tribes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}