{
  "word": "division",
  "etymologies": [
    {
      "description": [
        "From Middle English divisioun, from Old French division, from Latin dīvīsiō, dīvīsiōnem, noun of process form from perfect passive participle dīvīsus (“divided”), from dīvidō (“divide”). Doublet of divisio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "division (countable and uncountable, plural divisions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act or process of dividing anything.",
                  "examples": [
                    "Synonyms: split, lith",
                    "Antonyms: combination, fusion, merger, unification"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Each of the separate parts of something resulting from division.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(arithmetic, uncountable) The process of dividing a number by another.",
                  "examples": [
                    "Antonym: multiplication"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(arithmetic) A calculation that involves this process.",
                  "examples": [
                    "I've got ten divisions to do for my homework."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A formation, usually made up of two or three brigades.",
                  "examples": [
                    "Hyponyms: square division, triangular division"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A usually high-level section of a large company or conglomerate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(taxonomy) A rank below kingdom and above class, particularly used of plants or fungi, also (particularly of animals) called a phylum; a taxon at that rank.",
                  "examples": [
                    "Magnolias belong to the division Magnoliophyta."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A disagreement; a difference of viewpoint between two sides of an argument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(government) A method by which a legislature is separated into groups in order to take a better estimate of vote than a voice vote.",
                  "examples": [
                    "The House of Commons has voted to approve the third reading of the bill without a division. The bill will now progress to the House of Lords."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A florid instrumental variation of a melody in the 17th and 18th centuries, originally conceived as the dividing of each of a succession of long notes into several short ones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A set of pipes in a pipe organ which are independently controlled and supplied.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A concept whereby a common group of debtors are only responsible for their proportionate sum of the total debt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Any of the four major parts of a COBOL program source code.",
                  "examples": [
                    "Hyponyms: identification division, environment division, data division, procedure division"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Eton College) A lesson; a class.",
                  "examples": [
                    "Synonym: (informal) div"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A parliamentary constituency.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}