{
  "word": "silk",
  "etymologies": [
    {
      "description": [
        "From Middle English silk, sylk, selk, selc, from Old English sioloc, seoloc, seolc (“silk”). The immediate source is uncertain; it probably reached English via the Baltic trade routes (cognates in Old Norse silki (> Danish silke, Swedish silke (“silk”)), Russian шёлк (šolk), obsolete Lithuanian zilkaĩ), all ultimately from Late Latin sēricus, from Ancient Greek σηρικός (sērikós), ultimately from an Oriental language (represented now by e.g. Chinese 絲／丝 (sī, “silk”)). Compare Seres. Doublet of seric."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "silk (countable and uncountable, plural silks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly uncountable) A fine fiber excreted by the silkworm or other arthropod (such as a spider).",
                  "examples": [
                    "The thread made of silk was barely visible."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fine, soft cloth woven from silk fibers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything which resembles silk, such as the filiform styles of the female flower of maize, or the seed covering of bombaxes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The gown worn by a Senior (i.e. Queen's/King's) Counsel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A Queen's Counsel, King's Counsel or Senior Counsel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(circus arts, in the plural) A pair of long silk sheets suspended in the air on which a performer performs tricks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horse racing, usually in the plural) The garments worn by a jockey displaying the colors of the horse's owner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "silk (third-person singular simple present silks, present participle silking, simple past and past participle silked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove the silk from (corn).",
                  "examples": [
                    "While we shucked and silked the corn, we talked, sang old nursery rhymes  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}