{
  "word": "yammer",
  "etymologies": [
    {
      "description": [
        "From Middle English ȝameren, ȝaumeren, yemeren, ȝomeren, from Old English ġeōmrian (“to lament”), from Proto-West Germanic *jāmarōn, from Proto-Germanic *jēmarōną (“to show misery or sadness”), from Proto-Germanic *jēmaraz (“miserable, sorrowful, sad”), from Proto-Indo-European *yem- (“to hold, match, defeat”). Reinforced by cognate Middle Dutch jammeren (modern Dutch jammeren), from the same ultimate origin. Cognate also with Scots yammer, Saterland Frisian jammerje, West Frisian jammerje, German Low German jammern, German jammern, Danish jamre, Norwegian jamre. Compare also Old Norse amra (“to howl, wail, yammer”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "yammer (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or noise of yammering.",
                  "examples": [
                    "The house is just as he had imagined it would be: rubbishy furniture, a clutter of ornaments (porcelain shepherdesses, cowbells, an ostrich-feather flywhisk), the yammer of the radio, the cheeping of birds in cages, cats everywhere underfoot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loud noise.",
                  "examples": [
                    "The ungodly scream of Jap wings in the wind, and the blood-chilling snarl and yammer of their aerial machine gun and aerial cannon fire was enough to make the very ground shake and tremble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who yammers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "yammer (third-person singular simple present yammers, present participle yammering, simple past and past participle yammered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To complain peevishly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To talk loudly and persistently.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To repeat on and on, usually loudly or in complaint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare) To make an outcry; to clamor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}