{
  "word": "intimate",
  "etymologies": [
    {
      "description": [
        "From Latin intimare (“to put or bring into, to impress, to make familiar”), from intimus (“inmost, innermost, most intimate”), superlative of intus (“within”), from in (“in”); see interior."
      ],
      "adjectives": [
        {
          "description": "Adjective, noun Verb",
          "definitionGroups": []
        },
        {
          "description": "intimate (comparative more intimate, superlative most intimate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Closely acquainted; familiar.",
                  "examples": [
                    "an intimate friend",
                    "He and his sister deeply valued their intimate relationship as they didn't have much else to live for."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or involved in a sexual relationship.",
                  "examples": [
                    "She enjoyed some intimate time alone with her husband."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Personal; private.",
                  "examples": [
                    "an intimate setting"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to details that require great familiarity to know.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Very finely mixed.",
                  "examples": [
                    "Black powder consists of an intimate mixture of potassium nitrate, charcoal, and sulfur."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "intimate (plural intimates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very close friend.",
                  "examples": [
                    "Only a couple of intimates had ever read his writing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in plural intimates) Women's underwear, sleepwear, or lingerie, especially offered for sale in a store.",
                  "examples": [
                    "You'll find bras and panties in the women's intimates section upstairs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "Adjective, noun Verb",
          "definitionGroups": []
        },
        {
          "description": "intimate (third-person singular simple present intimates, present participle intimating, simple past and past participle intimated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To suggest or disclose (something) discreetly.",
                  "examples": [
                    "The Kaiser beamed. Von Bulow had praised him. Von Bulow had exalted him and humbled himself. The Kaiser could forgive anything after that. \"Haven't I always told you,\" he exclaimed with enthusiasm, \"that we complete one another famously? We should stick together, and we will!\"     [...]     Von Bulow saved himself in time—but, canny diplomat that he was, he nevertheless had made one error: he should have begun by talking about his own shortcomings and Wilhelm's superiority—not by intimating that the Kaiser was a half-wit in need of a guardian."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, India) To notify.",
                  "examples": [
                    "I will intimate you when the details are available."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}