{
  "word": "blue",
  "etymologies": [
    {
      "description": [
        "From Middle English blewe, from Anglo-Norman blew (“blue”), from Middle French bleu, from Old French blöe, bleve, blef (“blue”), from Frankish *blāu (“blue”) (perhaps through a Medieval Latin blāvus, blāvius (“blue”)), from Proto-Germanic *blēwaz (“blue, dark blue”), from Proto-Indo-European *bʰlēw- (“yellow, blond, grey”). Cognate with dialectal English blow (“blue”), Scots blue, blew (“blue”), North Frisian bla, blö (“blue”), Saterland Frisian blau (“blue”), Dutch blauw (“blue”), German blau (“blue”), Danish, Norwegian and Swedish blå (“blue”), Icelandic blár (“blue”), Latin flāvus (“yellow”), Middle Irish blá (“yellow”). Doublet of blae.",
        "Possibly related also to English blee (“colour”), from Old English blēo (“colour”); but direct derivatives of Proto-Germanic *blēwaz (“blue, dark blue”) in Old English include: Old English blāw and blēo (“blue”), Old English blǣwen (“bluish, light-blue”), blǣhǣwen (“blue-coloured, bluish, violet or purple colour”, literally “blue-hued”). There seems to be a parallel connection in Germanic between words for blue and colour, dually exemplified by Proto-West Germanic *blīu (“colour, blee”) and *blāu (“blue”); and Proto-Germanic *hiwją (“colour, hue”) and *hēwijaz (“blue, purple”).",
        "The sense \"obscene, pornographic\" is apparently from the colour; various theories exist as to how it arose, including that it is from the colour of the envelopes used to contain missives of the censors and managers to vaudevillian performers on objectionable material from their acts that needed to be excised."
      ],
      "adjectives": [
        {
          "description": "blue (comparative bluer or more blue, superlative bluest or most blue)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having blue as its color.",
                  "examples": [
                    "the deep blue sea"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Depressed, melancholic, sad.",
                  "examples": [
                    "\"Will you play some of the 'Garden' now?\" she asked. \"I think I should like it. I'm just the least bit blue.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(health care) Having a bluish or purplish shade of the skin due to a lack of oxygen to the normally deep red blood cells.",
                  "examples": [
                    "The divers got them out of the car just in time – they were starting to turn blue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pale, without redness or glare; said of a flame.",
                  "examples": [
                    "The candle burns blue."
                  ]
                }
              ]
            },
            {
              "group": "(politics) Supportive of, run by (a member of), pertaining to, or dominated by a political party represented by the colour blue.",
              "entries": [
                {
                  "meaning": "(US politics) Supportive of, run by (a member of), pertaining to, or dominated by the Democratic Party. [late 20th c.]",
                  "examples": [
                    "I live in a blue constituency.  Congress turned blue in the mid-term elections."
                  ]
                },
                {
                  "meaning": "(Australian politics) Supportive of or related to the Liberal Party.",
                  "examples": [
                    "Illawarra turns blue in Liberal washout"
                  ]
                },
                {
                  "meaning": "(UK politics) Supportive of or related to the Conservative Party.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) Of the higher-frequency region of the part of the electromagnetic spectrum which is relevant in the specific observation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of steak) Extra rare; left very raw and cold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a dog or cat) Having a coat of fur of a slaty gray shade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Severe or overly strict in morals; gloomy.",
                  "examples": [
                    "blue and sour religionists;  blue laws"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, of women) literary; bluestockinged.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(particle physics) Having a color charge of blue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Risqué; obscene; profane; pornographic.",
                  "examples": [
                    "His material is too blue for prime-time",
                    "The air was blue with oaths.",
                    "a blue movie"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) Drunk.",
                  "examples": [
                    "My wine I drank and oft got blue / On brandy, gin and whisky too— / Until my reputation gay, / Along with care, was cast away —"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "blue (countable and uncountable, plural blues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable and uncountable) The colour of the clear sky or the deep sea, between green and purple in the visible spectrum, and one of the primary additive colours for transmitted light; the colour obtained by subtracting red and green from white light using magenta and cyan filters; or any colour resembling this.",
                  "examples": [
                    "blue:",
                    "other blue:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything coloured blue, especially to distinguish it from similar objects differing only in color.",
                  "examples": [
                    "I don't like red Smarties. Have you got a blue?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blue dye or pigment.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(uncountable) Blue clothing.",
              "entries": [
                {
                  "meaning": "(in the plural) A blue uniform. See blues.",
                  "examples": []
                },
                {
                  "meaning": "A member of a sports team that wears blue colours; (in the plural) a nickname for the team as a whole. See also blues.",
                  "examples": [
                    "Come on, you blues!"
                  ]
                },
                {
                  "meaning": "(baseball, slang) An umpire, in reference to the typical dark blue color of the umpire's uniform. Sometimes perceived by umpires as derogatory when used by players or coaches while disputing a call.",
                  "examples": [
                    "He was safe! Terrible call, blue!"
                  ]
                },
                {
                  "meaning": "Sporting colours awarded by a university or other institution for sporting achievement, such as representing one's university, especially and originally at Oxford and Cambridge Universities in England. See also full blue, half blue.",
                  "examples": [
                    "He excelled at rowing and received a blue in the sport at Oxford."
                  ]
                },
                {
                  "meaning": "A person who has received such sporting colours.",
                  "examples": [
                    "He was a blue in rugby at Cambridge."
                  ]
                },
                {
                  "meaning": "(slang) A member of law enforcement.",
                  "examples": [
                    "He dialed Kathy to be sure she was okay and see if the blues arrived. She was crying when she picked up the phone.“Kathy, honey, I'm here. It'll be okay. Are the police there?”"
                  ]
                },
                {
                  "meaning": "(now historical) A bluestocking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sky, literally or figuratively.",
                  "examples": [
                    "The balloon floated up into the blue.",
                    "His request for leave came out of the blue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ocean; deep waters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The far distance; a remote or distant place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dog or cat with a slaty gray coat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker) One of the colour balls used in snooker, with a value of five points.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Any of the butterflies of the subfamily Polyommatinae in the family Lycaenidae, most of which have blue on their wings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bluefish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, colloquial) An argument or brawl.",
                  "examples": [
                    "\"I had a blue with Dad,\" said Fay. \"He wanted to drive us, I wanted to walk.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A liquid with an intense blue colour, added to a laundry wash to prevent yellowing of white clothes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several processes to protect metal against rust.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A type of firecracker.",
                  "examples": [
                    "Lord Lyttelton's Life by Dr Johnson  […]  which a whole tribe of Blues, with Mrs Montagu at their Head, have Vowed to execrate and revenge  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(particle physics) One of the three color charges for quarks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A member or supporter of the Conservative Party.",
                  "examples": [
                    "He is a true blue."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blue (third-person singular simple present blues, present participle blueing or bluing, simple past and past participle blued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ergative) To make or become blue; to turn blue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, metallurgy) To treat the surface of steel so that it is passivated chemically and becomes more resistant to rust.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, laundry) To brighten by treating with blue (laundry aid).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Australia, slang) To fight, brawl, or argue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; possibly from blew (past tense of blow)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "blue (third-person singular simple present blues, present participle blueing or bluing, simple past and past participle blued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, dated) To spend (money) extravagantly; to blow.",
                  "examples": [
                    "They was willing to blue the lot and have nothing left when they got home except debts on the never-never."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}