{
  "word": "accretion",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin accrētiō, from ad (“to”) + crēscō (“grow”). First attested in the 1610s. Compare crescent, increase, accrue, and so on."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "accretion (countable and uncountable, plural accretions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of increasing by natural growth; especially the increase of organic bodies by the internal accession of parts; organic growth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of increasing, or the matter added, by an accession of parts externally; an extraneous addition.",
                  "examples": [
                    "an accretion of earth",
                    "A mineral augments not by growth, but by accretion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something added externally to promote the external growth of an item.",
                  "examples": [
                    ""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Concretion; coherence of separate particles.",
                  "examples": [
                    "the accretion of particles to form a solid mass"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A growing together of parts naturally separate, as of the fingers or toes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) The gradual increase of land by deposition of water-borne sediment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The adhering of property to something else, by which the owner of one thing becomes possessed of a right to another; generally, gain of land by the washing up of sand or sail from the sea or a river, or by a gradual recession of the water from the usual watermark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Gain to an heir or legatee; failure of a coheir to the same succession, or a co-legatee of the same thing, to take his share percentage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrophysics) The formation of planets and other bodies by collection of material through gravity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}