{
  "word": "harrow",
  "etymologies": [
    {
      "description": [
        "From Middle English harwe, harow, from Old English *hearwa (perhaps ultimately cognate with harvest), or from Old Norse harfr/herfi; compare Danish harve (“harrow”), Dutch hark (“rake”). Akin to Latin carpere. According to the OED, the verb senses are partly derived from the noun sense, partly from a by-form of the verb harry, itself from Old English hergian."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "harrow (plural harrows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device consisting of a heavy framework having several disks or teeth in a row, which is dragged across ploughed land to smooth or break up the soil, to remove weeds or cover seeds; a harrow plow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An obstacle formed by turning an ordinary harrow upside down, the frame being buried.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "harrow (third-person singular simple present harrows, present participle harrowing, simple past and past participle harrowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drag a harrow over; to break up with a harrow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To traumatize or disturb; to frighten or torment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To break or tear, as if with a harrow; to wound; to lacerate; to torment or distress; to vex.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English harrow, harrowe, haro, from Old French haro, harou, harau, harol, from Frankish *harot, *hara (“here; hither”), from *hēr. Akin to Old Saxon herod, Old High German herot, Middle Dutch hare."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}