{
  "word": "powder",
  "etymologies": [
    {
      "description": [
        "From Middle English poudre, pouder, pouldre, borrowed from Old French poudre, poldre, puldre, from Latin pulverem, accusative singular of Latin pulvis (“dust, powder”). Compare pollen (“fine flour”), polverine, pulverize."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "powder (countable and uncountable, plural powders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fine particles which are the result of reducing a dry substance by pounding, grinding, or triturating, or the result of decay; dust.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cosmetics) A mixture of fine dry, sweet-smelling particles applied to the face or other body parts, to reduce shine or to alleviate chaffing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An explosive mixture used in gunnery, blasting, etc.; gunpowder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Ellipsis of powder snow.; light, dry, fluffy snow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ellipsis of powder blue.; the colour powder blue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "powder (third-person singular simple present powders, present participle powdering, simple past and past participle powdered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce to fine particles; to pound, grind, or rub into a powder.",
                  "examples": [
                    "In desperation, they dried fruits and vegetables in an old food dehydrator they had, then used their coffee grinder to powder the produce..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sprinkle with powder, or as if with powder.",
                  "examples": [
                    "to powder one's hair"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use powder on the hair or skin.",
                  "examples": [
                    "If she is grave, and reads steadily on, she dismisses me, whether I am dressed or not; but at all times she never forgets to send me away while she is powdering, with a consideration not to spoil my clothes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To turn into powder; to become powdery.",
                  "examples": [
                    "Ample evidence is brought forward to show that the higher incidence of chronic interstitial nephritis in Queensland is due to lead paint on the verandahs and railings of the houses, which powders easily during the long Australian summer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To sprinkle with salt; to corn, as meat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To depart suddenly; to \"take a powder\".",
                  "examples": [
                    "Miss Gibson appeared in the empty hall, her eyes wide and shocked. The little man who had started all the trouble with his singing telegram had powdered."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}