{
  "word": "distinctive",
  "etymologies": [
    {
      "description": [
        "From Latin distinctus, perfect passive participle of distinguere (“to push apart, to divide”), + -ive (forming adjectives signifying relation or tendency to). Cognate with French distinctif and Medieval Latin distinctivus."
      ],
      "adjectives": [
        {
          "description": "distinctive (comparative more distinctive, superlative most distinctive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Distinguishing, used to or enabling the distinguishing of some thing.",
                  "examples": [
                    "a product in distinctive packaging"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Discriminating, discerning, having the ability to distinguish between things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic, typical.",
                  "examples": [
                    "his distinctive bass voice"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Distinguished, being distinct in character or position.",
                  "examples": [
                    "The refugees... at length ceased to exist as a distinctive body among the people."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Hebrew grammar, of accents) Used to separate clauses in place of stops.",
                  "examples": [
                    "These are the main distinctive accents, and by stopping at them... the reader will do justice to the sense."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, of sounds) Distinguishing a particular sense of word.",
                  "examples": [
                    "Normally we symbolize only phonemes (distinctive features) so far as we can determine them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "distinctive (plural distinctives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distinctive thing: a quality or property permitting distinguishing; a characteristic.",
                  "examples": [
                    "...the red umbrella, the distinctive of royalty here..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Hebrew grammar) A distinctive accent.",
                  "examples": [
                    "A distinctive of less power than Zakeph is Ṭiphḥâ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) A distinctive belief, tenet, or dogma of a denomination or sect.",
                  "examples": [
                    "Mennonites could go forth somewhat detached from the chauvinism of Western culture—but not so from the Mennonite distinctives."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}