{
  "word": "debut",
  "etymologies": [
    {
      "description": [
        "From French début, from Middle French, derivative of débuter (“to move, begin”), from dé- + but (“mark, goal”), from Old French but (“aim, goal, end, target”), from Old French butte (“mound, knoll, target”), from Frankish *but (“stump, log”), or from Old Norse bútr (“log, stump, butt”); both from Proto-Germanic *butą (“end, piece”), from Proto-Indo-European *bʰeud- (“to beat, push”). Cognate with Old English butt (“tree stump”). More at butt."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "debut (plural debuts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A performer's first performance to the public, in sport, the arts or some other area.",
                  "examples": [
                    "Hulking defenceman Gudbranson, who came to Vancouver in a trade with the Florida Panthers last May, scored in his debut for the Canucks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also attributive) The first public presentation of a theatrical play, motion picture, opera, musical composition, dance, or other performing arts piece.",
                  "examples": [
                    "Coordinate term: sophomore",
                    "Since making its debut two years ago, the program has gained cult status.",
                    "their long-anticipated debut album"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The first appearance of a debutante in society.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Philippines) The coming-of-age celebration of a woman's eighteenth birthday.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "debut (third-person singular simple present debuts, present participle debuting, simple past and past participle debuted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly US) to formally introduce, as to the public",
                  "examples": [
                    "Amalgamated Software Systems debuted release 3.2 in Spring of 2004."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) to make one's initial formal appearance",
                  "examples": [
                    "Release 3.2 debuted to mixed reviews in Spring of 2004."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}