{
  "word": "shill",
  "etymologies": [
    {
      "description": [
        "Unknown; attested as verb 1914, as noun 1916. Perhaps an abbreviation of shillaber, attested 1913. The word entered English via carny, originally denoting a carnival worker who pretends to be a member of the audience in an attempt to elicit interest in an attraction.",
        "Speculatively an extended form of German Schieber (“black marketeer, profiteer”) via *shi-la-ber.",
        "There are some suggestions that it originates in the surname Shilaber or Shillibeer, especially George Shillibeer, but proposed origins are dubious as the word is first attested in North America in the 20th century, while proposed models are 19th century British.",
        "American humorist Benjamin Penhallow Shillaber (1814–1890) was known to write under the name Mrs. Ruth Partington to lend credibility to some of his ideas.  This is one more possible origin of the word, although there is no specific evidence supporting a connection."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shill (plural shills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person paid to endorse a product while pretending to be impartial.",
                  "examples": [
                    "carnival barkers and their shills, fleecing the rubes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) Any person paid to endorse a product.",
                  "examples": [
                    "On the screen, there was that quack again, playing the shill for yet another drug company."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An accomplice at a confidence trick during an auction or gambling game.",
                  "examples": [
                    "The pitchman swept his cane in a slow acceleration over the heads of the crowd and then suddenly pointed the silver cap toward Billy and the shill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) A house player in a casino.",
                  "examples": [
                    "Synonym: stick"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shill (third-person singular simple present shills, present participle shilling, simple past and past participle shilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) To promote or endorse in return for payment, especially dishonestly.",
                  "examples": [
                    "Today there are even commercials in which real scientists, some of considerable distinction, shill for corporations. They teach that scientists too will lie for money. As Tom Paine warned, inuring us to lies lays the groundwork for many other evils."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put under cover; to sheal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, obsolete, dialect) To shell.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}