{
  "word": "hurry",
  "etymologies": [
    {
      "description": [
        "From Middle English horien (“to rush, impel”), probably a variation of hurren (“to vibrate rapidly, buzz”), from Proto-Germanic *hurzaną (“to rush”) (compare Middle High German hurren (“to hasten”), Norwegian hurre (“to whirl around”)), from Proto-Indo-European *ḱers- (“to run”) (compare Latin currō (“I run”), Tocharian A kursär/Tocharian B kwarsär (“league; course”)). Related to hurr, horse, rush.",
        "Alternative etymology derives hurry as a variant of harry, which see."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hurry (countable and uncountable, plural hurries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rushed action.",
                  "examples": [
                    "Why are you in such a big hurry?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Urgency.",
                  "examples": [
                    "There is no hurry on that paperwork."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) an incidence of a defensive player forcing the quarterback to act faster than the quarterback was prepared to, resulting in a failed offensive play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A tremolando passage for violins, etc., accompanying an exciting situation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hurry (third-person singular simple present hurries, present participle hurrying, simple past and past participle hurried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To do things quickly.",
                  "examples": [
                    "He's hurrying because he's late."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Often with up, to speed up the rate of doing something.",
                  "examples": [
                    "If you don't hurry (up) you won't finish on time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to be done quickly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hasten; to impel to greater speed; to urge on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To impel to precipitate or thoughtless action; to urge to confused or irregular activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) To put: to convey coal in the mine, e.g. from the working to the tramway.",
                  "examples": [
                    "Elizabeth Day, aged seventeen  […]  \"I have been nearly nine years in the pit. I trapped for two years when I first went, and have hurried ever since. I have hurried for my father until a year ago. I have to help to riddle and fill,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}