{
  "word": "scalp",
  "etymologies": [
    {
      "description": [
        "From Middle English scalp, skalp, scalpe (“crown of the head; skull”). Originally a northern word, and therefore probably from a North Germanic source, although the sense-development is unclear; compare Sylt North Frisian Skolp (“dandruff”), Old Norse skálpr (“sheath”), Old Swedish skalp, Middle Dutch schelpe (“shell”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scalp (plural scalps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now dialectal) The top of the head; the skull.",
                  "examples": [
                    "Synonym: skull"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of the head where the hair grows from, or used to grow from.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A part of the skin of the head, with the hair attached, formerly cut or torn off from an enemy by warriors in some cultures as a token of victory.",
                  "examples": [
                    "Some tribes used to collect scalps to prove how many of the enemy they had killed in battle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) The skin of the head of a stag with the horns attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A victory, especially at the expense of someone else.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A bed or stratum of shellfish.",
                  "examples": [
                    "Synonym: scaup"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) The top; the summit.",
                  "examples": [
                    "Synonym: summit"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scalp (third-person singular simple present scalps, present participle scalping, simple past and past participle scalped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the scalp (part of the head from where the hair grows), by brutal act or accident.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, slang) To resell, especially tickets, usually for an inflated price, often illegally.",
                  "examples": [
                    "Synonym: resell",
                    "Tickets were being scalped for $300."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) To bet on opposing competitors so as to make a profit from the bookmaker.",
                  "examples": [
                    "The only sure thing about scalping the Series today is that the scalper is paying the bookie a greater profit because he is making a greater number of bets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) On an open outcry exchange trading floor, to buy and sell rapidly for one's own account, aiming to buy from a seller and a little later sell to a buyer, making a small profit from the difference (roughly the amount of the bid/offer spread, or less).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To screen or sieve ore before further processing.",
                  "examples": [
                    "Synonym: sieve",
                    "scalped ore"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surgery) To remove the skin of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove the grass from.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To destroy the political influence of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(milling) To brush the hairs or fuzz from (wheat grains, etc.) in the process of high milling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}