{
  "word": "fardel",
  "etymologies": [
    {
      "description": [
        "A clipped form of Middle English ferthendel (literally “fourth part”), equivalent to fourth +‎ deal. Cognate with Dutch vierendeel (“a fourth part, quarter”), German Viertel (“a quarter, fourth”), Danish fjerdedel (“a quarter”), Swedish fjärdedel (“a fourth, quarter”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fardel (plural fardels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fourth part: a quarter of anything.",
                  "examples": [
                    "I... bought a Farthel of Bread and a Mutckin of Ale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An English unit of land area variously understood as the fourth part of an oxgang or of a yardland.",
                  "examples": [
                    "You must note, that two Fardells of Land make a Nooke of Land, and two Nookes make halfe a Yard of Land."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English fardel, from Old French fardel (“pack, bundle”), from Spanish fardel, diminutive of fardo (“pack, bundle”), from Arabic فَرْد‎ (fard, “one of a pair”), as applied to saddlebags."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fardel (plural fardels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A bundle or burden.",
                  "examples": [
                    "It doth also appear by the abbreviate of the accounts sent home out of the Indies, that there remained in the hands of the agent, master Starkey, 482 fardels of calicos, viz.: 8 canisters of pintados, and 117 fardels of checkered stuffs, 51 fardels of long malow girdles, […]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fardel (third-person singular simple present fardels, present participle fardelling or fardeling, simple past and past participle fardelled or fardeled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To make up in fardels; to bunch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}