{
  "word": "crayfish",
  "etymologies": [
    {
      "description": [
        "Alteration (by folk etymology, influenced by fish) of Middle English crevis, from Old French crevice (\"crayfish\"; > Modern French: écrevisse), from Frankish *krebitja (“crayfish”), diminutive of Frankish *krebit (“crab”), from Proto-Germanic *krabitaz (“crab, cancer”), from Proto-Indo-European *gerbʰ-, *gerebʰ- (“to scratch, crawl”). Akin to Old High German krebiz (\"edible crustacean, crab\"; > Modern German Krebs (“crab”)), Middle Low German krēvet (“crab”), Dutch kreeft (“crayfish, lobster”), Old English crabba (“crab”). More at crab."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crayfish (plural crayfishes or crayfish)",
          "definitionGroups": [
            {
              "group": "Any of numerous freshwater decapod crustaceans in superfamily Astacoidea or Parastacoidea, resembling the related lobster but usually much smaller.",
              "entries": [
                {
                  "meaning": "(New England, Michigan, Wisconsin, Minnesota) A freshwater crustacean (family Cambaridae), sometimes used as an inexpensive seafood or as fish bait.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, South Africa) A rock lobster (family Palinuridae).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A freshwater crayfish (family Parastacidae), such as the gilgie, marron, or yabby.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Singapore) The species Thenus orientalis of the slipper lobster family (Scyllaridae).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crayfish (third-person singular simple present crayfishes, present participle crayfishing, simple past and past participle crayfished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to catch crayfish",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of crawfish (to backpedal, desert, or withdraw)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}