{
  "word": "nexus",
  "etymologies": [
    {
      "description": [
        "From Latin nexus (“connection, nexus; act of binding, tying or fastening together; something which binds, binding, bond, fastening, joint; legal obligation”), from nectere + -tus (suffix forming verbal nouns). Nectere is the infinitive of nectō (“to attach, bind, connect, fasten, tie; to interweave; to relate; to unite; to bind by obligation, make liable, oblige; to compose, contrive, devise, produce”), from Proto-Indo-European *gned-, *gnod- (“to bind”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nexus (countable and uncountable, plural nexuses or nexusses or (rare) nexus)",
          "definitionGroups": [
            {
              "group": "A form or state of connection.",
              "entries": [
                {
                  "meaning": "(Canada, US, finance, law) The relationship between a vendor and a jurisdiction for the purpose of taxation, established for example by the vendor operating a physical store in that jurisdiction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A connected group; a network, a web.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A centre or focus of something.",
                  "examples": [
                    "Synonyms: hub, junction"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) In the work of the Danish linguist Otto Jespersen (1860–1943): a group of words expressing two concepts in one unit (such as a clause or sentence).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Rome, law, historical) A person who had contracted a nexum or obligation of such a kind that, if they failed to pay, their creditor could compel them to work as a servant until the debt was paid; an indentured servant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}