{
  "word": "cartoon",
  "etymologies": [
    {
      "description": [
        "In British English first, from French carton (“sketch, cardboard, card”), from Italian cartone (“cardboard, carton, box”), augmentative of carta (“paper”), from Latin carta (“papyrus, paper”), from Ancient Greek χάρτης (khártēs) (see there for further etymology). Doublet of carton."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cartoon (plural cartoons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comics) A humorous drawing, often with a caption, or a strip of such drawings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comics) A drawing satirising current public figures.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) An artist's preliminary sketch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) A full-sized drawing that serves as the template for a fresco, a tapestry, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(animation) An animated piece of film which is often but not exclusively humorous.",
                  "examples": [
                    "The matter of whether the world needs a fourth Ice Age movie pales beside the question of why there were three before it, but Continental Drift feels less like an extension of a theatrical franchise than an episode of a middling TV cartoon, lolling around on territory that’s already been settled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A diagram in a scientific concept.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cartoon (third-person singular simple present cartoons, present participle cartooning, simple past and past participle cartooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, comics, animation) To draw a cartoon, a humorous drawing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) To make a preliminary sketch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}