{
  "word": "principle",
  "etymologies": [
    {
      "description": [
        "From Middle English principle, from Old French principe, from Latin prīncipium (“beginning, foundation”), from prīnceps (“first”), surface etymology is from prīmus (“first”) + -ceps (“catcher”); the former ultimately from Proto-Indo-European *preh₂- (“before”); see also prince."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "principle (plural principles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fundamental assumption or guiding belief.",
                  "examples": [
                    "Synonym: premise"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rule used to choose among solutions to a problem.",
                  "examples": [
                    "The principle of least privilege holds that a process should only receive the permissions it needs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes pluralized) Moral rule or aspect.",
                  "examples": [
                    "Synonym: tenet",
                    "I don't doubt your principles.",
                    "You are clearly a person of principle.",
                    "It's the principle of the thing; I won't do business with someone I can't trust."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A rule or law of nature, or the basic idea on how the laws of nature are applied.",
                  "examples": [
                    "Bernoulli's Principle",
                    "The Pauli Exclusion Principle prevents two fermions from occupying the same state.",
                    "The principle of the internal combustion engine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fundamental essence, particularly one producing a given quality.",
                  "examples": [
                    "Cathartine is the bitter, purgative principle of senna."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A source, or origin; that from which anything proceeds; fundamental substance or energy; primordial substance; ultimate element, or cause.",
                  "examples": [
                    "The soul of man is an active principle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An original faculty or endowment.",
                  "examples": [
                    "those active principles whose direct and ultimate object is the communication either of enjoyment or suffering"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of principal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A beginning.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "principle (third-person singular simple present principles, present participle principling, simple past and past participle principled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To equip with principles; to establish, or fix, in certain principles; to impress with any tenet or rule of conduct.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}