{
  "word": "steep",
  "etymologies": [
    {
      "description": [
        "From Middle English steep, from Old English stēap (“high”), from Proto-Germanic *staupaz, from Proto-Indo-European *(s)tewb- (“to push, stick”).",
        "Compare Old Frisian stāp (\"high, towering\"; > Modern Saterland Frisian stiep (“steep”)), Dutch stoop (“grand; proud”), Middle High German stouf (“towering cliff, precipice”), Middle High German stief (“steep”)). The Proto-Indo-European root (and related) has many and varied descendants, including English stub; compare also Scots stap (“to strike, to forcibly insert”).",
        "The sense of “sharp slope” is attested circa 1200; the sense “expensive” is attested US 1856."
      ],
      "adjectives": [
        {
          "description": "steep (comparative steeper, superlative steepest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a near-vertical gradient; of a slope, surface, curve, etc. that proceeds upward at an angle near vertical.",
                  "examples": [
                    "a steep hill or mountain; a steep roof; a steep ascent; a steep barometric gradient"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) expensive",
                  "examples": [
                    "Twenty quid for a shave? That's a bit steep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Difficult to access; not easy reached; lofty; elevated; high.",
                  "examples": [
                    "Her ears and thoughts in steep amaze erected"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of the rake of a ship's mast, or a car's windshield) resulting in a mast or windshield angle that strongly diverges from the perpendicular",
                  "examples": [
                    "The steep rake of the windshield enhances the fast lines of the exterior."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "steep (plural steeps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The steep side of a mountain etc.; a slope or acclivity.",
                  "examples": [
                    "It ended precipitously in a dark and narrow ravine, formed on the other side by an opposite mountain, the lofty steep of which was crested by a city gently rising on a gradual slope"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stepen, from Old Norse steypa (“to make stoop, cast down, pour out, cast (metal)”), from Proto-Germanic *staupijaną (“to tumble, make tumble, plunge”), from Proto-Indo-European *(s)tewb- (“to push, hit”). Cognate with Danish støbe (“cast (metal)”), Norwegian støpe, støype, Swedish stöpa (“to found, cast (metal)”), Old English stūpian (“to stoop, bend the back, slope”). Doublet of stoop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "steep (countable and uncountable, plural steeps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A liquid used in a steeping process",
                  "examples": [
                    "Corn steep has many industrial uses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rennet bag.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "steep (third-person singular simple present steeps, present participle steeping, simple past and past participle steeped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, middle) To soak or wet thoroughly.",
                  "examples": [
                    "They steep skins in a tanning solution to create leather.",
                    "The tea is steeping."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To imbue with something; to be deeply immersed in.",
                  "examples": [
                    "a town steeped in history"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}