{
  "word": "carene",
  "etymologies": [
    {
      "description": [
        "From Latin carēnum or caroenum, from Ancient Greek κάροινον (károinon), q.v."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carene (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical cooking, rare, obsolete) Synonym of carenum: a reduction of must or sweet wine in ancient European cuisine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Medieval Latin carēna (“40-day fast; remission of such a fast”), from Late Latin quadragēna (“40-day period, Lent”) or quarantena (“40-day period”), from Latin quadrāgēnī (“40 each”), from quadrāgintā (“four tens, forty”). Doublet of quadragene and quarantine."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carene (plural carenes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Catholicism, historical, rare) A 40-day fast or period of similar abstinence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Catholicism, historical, rare) An indulgence from 40 days of fasting or similar abstinence, especially during Lent; (later) various equivalent indulgences against punishment in Purgatory.",
                  "examples": [
                    "You have with much labour, and some charge, purchased to your self so many Quadragenes or Lents of pardon; that is, you have bought off the penances of so many times forty dayes. It is well; but were you well advised, it may be your Quadragenes are not Carenes; that is, are not a quitting the severest penances of fasting so long in bread and water; for there is great difference in the manner of keeping a penitential Lent, and it may be you have purchased but some lighter thing; and then if your demerit arise to so many Carenes, and you purchased but mere Quadragenes, without a minute and table of particulars, you may stay longer in Purgatory than you expected... And they that read... will soon perceive that all this is but a handful of smoke, when you hold it, you hold it not."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French carène (“keel”), from Latin carīna (“keel”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carene (plural carenes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, obsolete) The lower portion of a marine animal's shell, covering its mantle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}