{
  "word": "charter",
  "etymologies": [
    {
      "description": [
        "From Middle English charter, chartre, borrowed from Old French chartre, from Latin chartula (diminutive of charta). See chart. Doublet of chartula."
      ],
      "adjectives": [
        {
          "description": "charter (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Leased or hired.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "charter (plural charters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A document issued by some authority, creating a public or private institution, and defining its purposes and privileges.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A similar document conferring rights and privileges on a person, corporation etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contract for the commercial leasing of a vessel, or space on a vessel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The temporary hiring or leasing of a vehicle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deed (legal contract).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A special privilege, immunity, or exemption.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, derogatory, in a noun phrase with another noun which is either an agent or action) a provision whose unintended consequence would be to encourage an undesirable activity",
                  "examples": [
                    "In what Derbyshire police say amounts to a \"thieves' charter,\" three judges ruled that because the car's identity had been changed it was impossible to trace the legal owner and therefore the person found in possession of it was entitled to keep it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "charter (third-person singular simple present charters, present participle chartering, simple past and past participle chartered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grant or establish a charter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lease or hire something by charter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Canada, law) (of a peace officer) To inform (an arrestee) of their constitutional rights under the Canadian Charter of Rights and Freedoms upon arrest.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}