{
  "word": "flock",
  "etymologies": [
    {
      "description": [
        "From Middle English flok, from Old English flocc (“flock, company, troop”), from Proto-West Germanic *flokk, from Proto-Germanic *flukkaz (“crowd, troop”). Cognate with Middle Low German vlocke (“crowd, flock”), Danish flok (“flock”), Swedish flock (“flock”), Norwegian flokk (“flock”), Faroese flokkur (“flock”), Icelandic flokkur (“flock, group”). Related also to Norman fliotchet (“flock, crowd”), from Old Norse. Perhaps related to Old English folc (“crowd, troop, band”). More at folk."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flock (plural flocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number of birds together in a group, such as those gathered together for the purpose of migration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large number of animals associated together in a group; commonly used of sheep, but (dated) also used for goats, farmed animals, and a wide variety of animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Those served by a particular pastor or shepherd.herd/flock",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large number of people.",
                  "examples": [
                    "Synonym: congregation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A religious congregation.",
                  "examples": [
                    "Synonym: congregation"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flock (third-person singular simple present flocks, present participle flocking, simple past and past participle flocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To congregate in or head towards a place in large numbers.",
                  "examples": [
                    "People flocked to the cinema to see the new film."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To flock to; to crowd.",
                  "examples": [
                    "Good fellows, trooping, flocked me so."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To treat a pool with chemicals to remove suspended particles.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English flok (“tuft of wool”), from Old French floc (“tuft of wool”), from Late Latin floccus (“tuft of wool”), probably from Frankish *flokko (“down, wool, flock”), from Proto-Germanic *flukkōn-, *flukkan-, *fluksōn- (“down, flock”), from Proto-Indo-European *plewk- (“hair, fibres, tuft”). Cognate with Old High German flocko (“down”), Middle Dutch vlocke (“flock”), Norwegian dialectal flugsa (“snowflake”). Non-Germanic cognates include Albanian flokë (“hair”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flock (countable and uncountable, plural flocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Coarse tufts of wool or cotton used in bedding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lock of wool or hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Very fine sifted woollen refuse, especially that from shearing the nap of cloths, formerly used as a coating for wallpaper to give it a velvety or clothlike appearance; also, the dust of vegetable fibre used for a similar purpose.",
                  "examples": [
                    "There was a neat hat-and-umbrella stand, and the stranger's weary feet fell soft on a good, serviceable dark-red drugget, which matched in colour the flock-paper on the walls."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flock (third-person singular simple present flocks, present participle flocking, simple past and past participle flocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To coat a surface with dense fibers or particles; especially, to create a dense arrangement of fibers with a desired nap.",
                  "examples": [
                    "the sampling and elution advantages of flocked swabs versus spun swabs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover a Christmas tree with artificial snow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}