{
  "word": "less",
  "etymologies": [
    {
      "description": [
        "Adverb From Middle English les, lesse, leasse, lasse, from Old English lǣs (“smaller, less”), from Proto-Germanic *laisiz, from Proto-Indo-European *leys- (“to shrink, grow thin, be gentle”). Cognate with Old Frisian lēs (“less”), Old Saxon lēs (“less”).",
        "Determiner and preposition from Middle English lees, lesse, leasse, lasse, from Old English lǣssa (“less”), from Proto-Germanic *laisizan-, from Proto-Germanic *laisiz (“smaller, lesser, fewer, lower”) (see above). Cognate with Old Frisian lessa (“less”).",
        "Verb from Middle English lessen, from the determiner.",
        "Noun from Middle English lesse, from the determiner."
      ],
      "adjectives": [
        {
          "description": "less (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Lesser; smaller.",
                  "examples": [
                    "This he said, thinking that Alan would be pleased; but the Highlandman’s vanity was ready to startle at a less matter than that."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "less (diminutive comparative)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "comparative degree of little",
                  "examples": [
                    "I slept even less last night than I did the night before.",
                    "I like him less each time I see him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used for constructing syntactic diminutive comparatives of adjectives and adverbs.",
                  "examples": [
                    "Randal is less welcome than Rachel but as her spouse we should invite them both.",
                    "This gadget is less useful than I expected.",
                    "I'm not any less happy for being on my own."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To a smaller extent or degree.",
                  "examples": [
                    "The grammar book was less than (that is, not at all) helpful.",
                    "That this is a positive one makes it no less a stereotype, and therefore unacceptable."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "less (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A smaller amount or quantity.",
                  "examples": [
                    "Less is better.",
                    "I have less to do today than yesterday."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [
        {
          "description": "less",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Minus; not including",
                  "examples": [
                    "It should then tax all of that as personal income, less the proportion of the car's annual mileage demonstrably clocked up on company business."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [
        {
          "description": "less (third-person singular simple present lesses, present participle lessing, simple past and past participle lessed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To make less; to lessen.",
                  "examples": [
                    "What he will make lesse, he lesseth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lesse, les, from Old English lǣs, as in þȳ lǣs þe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}