{
  "word": "assault",
  "etymologies": [
    {
      "description": [
        "From Middle English assaut, from Old French noun assaut, derived from the past participle of the verb assalir, from Late Latin assalīre, from Latin ad (“at, towards”) + salīre (“jump”). See also assail. Spelling Latinized around 1530 to add an l."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "assault (countable and uncountable, plural assaults)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A violent onset or attack with physical means, for example blows, weapons, etc.",
                  "examples": [
                    "The army made an assault on the enemy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A violent verbal attack, for example with insults, criticism, and the like",
                  "examples": [
                    "she launched a written assault on the opposition party"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(criminal law) An attempt to commit battery: a violent attempt, or willful effort with force or violence, to do hurt to another, but without necessarily touching the person, such as by raising a fist in a threatening manner, or by striking at the person and missing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(singular only, law) The crime whose action is such an attempt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tort law) An act that causes someone to apprehend imminent bodily harm (such as brandishing a weapon).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(singular only, law) The tort whose action is such an act.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) A non-competitive combat between two fencers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "assault (third-person singular simple present assaults, present participle assaulting, simple past and past participle assaulted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attack, physically or figuratively; to assail.",
                  "examples": [
                    "Tom was accused of assaulting another man outside a nightclub.",
                    "Loud music assaulted our ears as we entered the building."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To threaten or harass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}