{
  "word": "brunt",
  "etymologies": [
    {
      "description": [
        "From Middle English brunt, bront (“sudden onset, attack, charge, blow”), from Old Norse brundr or brundtíð (“oestrus, rut”) (from Proto-Germanic *brunstiz), or bruna (“to rush”, literally “to advance like wildfire”) (see brenna)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brunt (plural brunts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The full adverse effects; the chief consequences or negative results of a thing or event.",
                  "examples": [
                    "Unfortunately, poor areas such as those in New Orleans bore the brunt of Hurricane Katrina’s winds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The force or shock of an attack in war.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The major part of something; the bulk.",
                  "examples": [
                    "If you feel tired of walking, just think of the poor donkey who has carried the brunt of our load."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A violent attack or charge in battle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, by extension) A sudden harmful onset or attack (of disease, unbelief, persecution, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A spurt, a sudden effort or straining.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brunt (third-person singular simple present brunts, present participle brunting, simple past and past participle brunted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To bear the brunt of; to weather or withstand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To make a violent attack or charge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}