{
  "word": "budge",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French bouger, from Old French bougier, from Vulgar Latin *bullicāre (“to bubble; seethe; move; stir”), from Latin bullīre (“to boil; seethe; roil”). More at boil."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "budge (third-person singular simple present budges, present participle budging, simple past and past participle budged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move; to be shifted from a fixed position.",
                  "examples": [
                    "I’ve been pushing this rock as hard as I can, but it won’t budge an inch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move; to shift from a fixed position.",
                  "examples": [
                    "I’ve been pushing this rock as hard as I can, but I can’t budge it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To yield in one’s opinions or beliefs.",
                  "examples": [
                    "The Minister for Finance refused to budge on the new economic rules."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Minnesota, Wisconsin, Iowa, Indiana, western Canada) To cut or butt (in line); to join the front or middle rather than the back of a queue.",
                  "examples": [
                    "Hey, no budging! Don't budge in line!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To try to improve the spot of a decision on a sports field.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bouge, bougie, bugee, from Anglo-Norman bogé, from Anglo-Latin *bogea, bulgia, related to Latin bulga (“a leathern bag or knapsack”). Doublet of bulge."
      ],
      "adjectives": [
        {
          "description": "budge (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) austere or stiff, like scholastics",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "budge (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of fur prepared from lambskin dressed with the wool on, formerly used as an edging and ornament, especially on scholastic habits.",
                  "examples": [
                    "They are become so liberal, as to part freely with their own budge-gowns from off their backs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}