{
  "word": "wrangle",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English wranglen, wrangle (“to contend with (someone) in a test of strength; (figuratively) to make misleading arguments to entrap”); from a Middle Dutch or Middle Low German word related to Middle Dutch wrangen and Middle Low German wrangen (“to cause an uproar; to struggle, wrestle”) (whence Low German wrangeln (“to wrangle”)), related to Middle Dutch wringen (“to twist; to wrest; to wring; to struggle, wrestle”), ultimately from Proto-Germanic *wringaną (“to squeeze; to twist; to wring”).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wrangle (countable and uncountable, plural wrangles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An angry dispute; a noisy quarrel; an altercation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Angry disputation; noisy quarrelling.",
                  "examples": [
                    "Wrangle and bloodshed followed thence."
                  ]
                }
              ]
            },
            {
              "group": "(obsolete, countable)",
              "entries": [
                {
                  "meaning": "A contentious argument or response.",
                  "examples": []
                },
                {
                  "meaning": "A controversy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wrangle (third-person singular simple present wrangles, present participle wrangling, simple past and past participle wrangled)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To convince or influence (someone) by arguing or contending.",
                  "examples": []
                },
                {
                  "meaning": "Followed by out of: to elicit (something) from a person by arguing or bargaining.",
                  "examples": []
                },
                {
                  "meaning": "(archaic, rare)",
                  "examples": []
                },
                {
                  "meaning": "To speak or write (something) in an argumentative or contentious manner.",
                  "examples": []
                },
                {
                  "meaning": "To spend (time) arguing or quarrelling.",
                  "examples": []
                },
                {
                  "meaning": "(Western US) To herd (horses or other livestock).",
                  "examples": [
                    "Synonym: munge"
                  ]
                },
                {
                  "meaning": "(by extension, humorous) To manage or supervise (people).",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To gather and organize (data, facts, information, etc.), especially in a way which requires sentience rather than automated methods alone, as in data wrangling.",
                  "examples": [
                    "Synonym: munge"
                  ]
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "Followed by out of: to compel or drive (someone or something) away through arguing.",
                  "examples": []
                },
                {
                  "meaning": "Followed by out: to put forward arguments on (a case, a matter disagreed upon, etc.).",
                  "examples": []
                },
                {
                  "meaning": "(reflexive) To cause (oneself) grief through arguing or quarrelling.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "(also figuratively) To quarrel angrily and noisily; to bicker.",
                  "examples": [
                    "Synonyms: altercate, contend; see also Thesaurus:squabble"
                  ]
                },
                {
                  "meaning": "To make harsh noises as if quarrelling.",
                  "examples": [
                    "Synonym: jangle"
                  ]
                },
                {
                  "meaning": "(generally, also figuratively) To argue, to debate; also (dated), to debate or discuss publicly, especially about a thesis at a university.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}