{
  "word": "apply",
  "etymologies": [
    {
      "description": [
        "From Middle English aplien, applien, from Old French applier, (French appliquer), from Latin applicō (“join, fix, or attach to”); from ad + plicō (“fold, twist together”). See applicant, ply."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "apply (third-person singular simple present applies, present participle applying, simple past and past participle applied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lay or place; to put (one thing to another)",
                  "examples": [
                    "to apply cream to a rash"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put to use; to use or employ for a particular purpose, or in a particular case",
                  "examples": [
                    "Synonyms: appropriate, devote, use",
                    "to apply funds to the repayment of a debt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make use of, declare, or pronounce, as suitable, fitting, or relative",
                  "examples": [
                    "We need to apply the skills we've learned to solve this problem"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put closely; to join; to engage and employ diligently, or with attention",
                  "examples": [
                    "Synonyms: attach, incline"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To address; to refer; generally used reflexively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To submit oneself as a candidate (with the adposition \"to\" designating the recipient of the submission, and the adposition \"for\" designating the position).",
                  "examples": [
                    "I recently applied to the tavern for a job as a bartender.",
                    "Most of the colleges she applied to were ones she thought she had a good chance of getting into.",
                    "Many of them don't know it, but almost a third of the inmates are eligible to apply for parole or work-release programs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pertain or be relevant to a specified individual or group.",
                  "examples": [
                    "That rule only applies to foreigners."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To busy; to keep at work; to ply.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To visit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "apple +‎ -y."
      ],
      "adjectives": [
        {
          "description": "apply (comparative more apply, superlative most apply)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of appley",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}