{
  "word": "notary",
  "etymologies": [
    {
      "description": [
        "From Middle English notarie, from Old French notarie (French notaire), from Latin notārius."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "notary (plural notaries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, especially civil law) A lawyer of noncontentious private civil law who drafts, takes, and records legal instruments for private parties, and provides legal advice, but does not appear in court on his or her clients' behalf.",
                  "examples": [
                    "It is not known whether any Puebla residents did go to the capital to bid for properties in their state because in such cases the purchases would have been formalized before a notary in Mexico City, [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(common law) A public notary, a legal practitioner who prepares, attests to, and certifies documents, witnesses affidavits, and administers oaths.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, Canada, US) A notary public, a public officer who serves as an impartial witness to the signing of important documents, but who is not authorised to practise law.",
                  "examples": [
                    "The giving of legal advice by notaries and others who are not admitted to practice law is, in its opinion, dangerous to the welfare of the community, because such persons have not demonstrated their capacity [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}