{
  "word": "crest",
  "etymologies": [
    {
      "description": [
        "From Middle English creste, from Old French creste (modern French crête) and perhaps continuing Old English cræsta (“crest, tuft, plume”); both ultimately from Vulgar Latin *cresta, from Latin crista. Doublet of crista.",
        "The informal meaning “design, logo” (sense 11) stems from a misinterpretation of the heraldic sense 4, which specifically refers to the object placed on top of the helm."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crest (plural crests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The summit of a hill or mountain ridge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tuft, or other natural ornament, growing on an animal's head, for example the comb of a cockerel, the swelling on the head of a snake, the lengthened feathers of the crown or nape of bird, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The plume of feathers, or other decoration, worn on or displayed on a helmet; the distinctive ornament of a helmet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A bearing worn, not upon the shield, but usually on a helmet above it, sometimes (as for clerics) separately above the shield or separately as a mark for plate, in letterheads, and the like.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The upper curve of a horse's neck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ridge or top of a wave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The helm or head, as typical of a high spirit; pride; courage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ornamental finishing which surmounts the ridge of a roof, canopy, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The top line of a slope or embankment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A ridge along the surface of a bone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A design or logo, especially one of an institution, sports club, association or high-class family.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several birds in the family Regulidae, including the goldcrests and firecrests.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crest (third-person singular simple present crests, present participle cresting, simple past and past participle crested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Particularly with reference to waves, to reach a peak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reach the crest of (a hill or mountain)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish with, or surmount as, a crest; to serve as a crest for.",
                  "examples": [
                    "groves of clouds that crest the mountain's brow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mark with lines or streaks like waving plumes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}