{
  "word": "cream",
  "etymologies": [
    {
      "description": [
        "From Middle English creime, creme, from Old French creme, cresme, blend of Late Latin chrisma (“ointment”) (from Ancient Greek χρῖσμα (khrîsma, “unguent”)), and Late Latin crāmum (“skim”), from Gaulish *crama (compare Welsh cramen (“scab, skin”), Breton crammen), from Proto-Indo-European *(s)krama- (compare Middle Irish screm (“surface, skin”), Dutch schram (“abrasion”), Lithuanian kramas (“scurf”)). Doublet of crema and crème. Displaced native Old English rēam (“cream”) (> modern ream).\nFigurative sense of \"most excellent element or part\" appears from 1581. Verb meaning \"to beat, thrash, wreck\" is 1929, U.S. colloquial. The U.S. standard of identity is from 21 CFR 131.3(a)."
      ],
      "adjectives": [
        {
          "description": "cream (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cream-coloured; having a yellowish white colour.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cream (countable and uncountable, plural creams)",
          "definitionGroups": [
            {
              "group": "The butterfat/milkfat part of milk which rises to the top; this part when separated from the remainder.",
              "entries": [
                {
                  "meaning": "(standards of identity, US) The liquid separated from milk, possibly with certain other milk products added, and with at least eighteen percent of it milkfat.",
                  "examples": [
                    "You may have noticed that any time that filling is mentioned on Oreo packaging, it's called \"creme.\" This is no typo. Technically, the creamy filling inside an Oreo is not cream at all: The recipe used actually contains no dairy; as such, the FDA prohibits Nabisco from labeling the product as \"cream.\""
                  ]
                },
                {
                  "meaning": "(standards of identity, UK) The liquid separated from milk containing at least 18 percent milkfat (48% for double cream).",
                  "examples": []
                },
                {
                  "meaning": "(tea and coffee) A portion of cream, such as the amount found in a creamer.",
                  "examples": [
                    "I take my coffee with two cream and three sugar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A yellowish white colour; the colour of cream.",
                  "examples": [
                    "cream:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Frosting, custard, creamer, or another substance similar to the oily part of milk or to whipped cream.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The best part of something.",
                  "examples": [
                    "the cream of the crop",
                    "the cream of a collection of books or pictures"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A viscous aqueous oil/fat emulsion with a medicament added, used to apply that medicament to the skin. (compare with ointment)",
                  "examples": [
                    "You look really sunburnt; you should apply some cream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) Semen.",
                  "examples": [
                    "He rode me for ten—or was it fifteen?—minutes before one final fuckthrust that filled me completely with his cream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The chrism or consecrated oil used in anointing ceremonies.",
                  "examples": [
                    "there shall never harlot have happe, by the helpe of Oure Lord, to kylle a crowned Kynge that with Creyme is anoynted."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cream (third-person singular simple present creams, present participle creaming, simple past and past participle creamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To puree, to blend with a liquifying process.",
                  "examples": [
                    "Cream the vegetables with the olive oil, flour, salt and water mixture."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To turn a yellowish white colour; to give something the color of cream.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To obliterate, to defeat decisively.",
                  "examples": [
                    "We creamed the opposing team!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, vulgar, slang) To ejaculate (used of either gender).",
                  "examples": [
                    "Danny Zuko: You are supreme / The chicks’ll cream / For grease lightning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, vulgar, slang) To ejaculate in (clothing or a bodily orifice).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cooking) To rub, stir, or beat (butter) into a light creamy consistency.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To skim, or take off by skimming, as cream.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To take off the best or choicest part of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with, or as if with, cream.",
                  "examples": [
                    "creaming the fragrant cups"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To gather or form cream.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}