{
  "word": "geek",
  "etymologies": [
    {
      "description": [
        "Started as carnival slang, likely from the British dialectal term geck (“a fool, dupe, simpleton”) (1510s), apparently from Dutch gek or Low German geck, from an imitative verb found in North Sea Germanic and Scandinavian meaning \"to croak, cackle,\" and also \"to mock, cheat\" (Dutch gekken, German gecken, Danish gække, Norwegian gakke, Swedish gäcka). The root still survives in the Dutch adjective noun gek (“crazy\" or \"crazy person”). Compare gink and also Old Norse gikkr (“a pert, rude person; jester; fool”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "geek (plural geeks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A carnival performer specializing in bizarre and unappetizing behavior.",
                  "examples": [
                    "I once saw a geek bite the head off a live chicken."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A person who is intensely interested in a particular field or hobby and often having limited or nonstandard social skills. Often used with an attributive noun.",
                  "examples": [
                    "I was a complete computer geek in high school, but I get out a lot more now.",
                    "Most famous actors are really theater geeks at heart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, by extension) An expert in a technical field, particularly one having to do with computers.",
                  "examples": [
                    "My laptop’s locked up again. I need a geek.",
                    "Do you need a hardware geek or a software geek?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, colloquial) The subculture of geeks; an esoteric subject of interest that is marginal to the social mainstream; the philosophy, events, and physical artifacts of geeks; geekness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An unfashionable or socially undesirable person.",
                  "examples": [
                    "Why do you hang around with them? They’re just geeks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "geek (third-person singular simple present geeks, present participle geeking, simple past and past participle geeked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) To behave geekishly or in a socially awkward manner, especially when under the influence of drugs or other psycho-active substances, and exhibiting such marked characteristics as hyperactivity, repetitiveness, talkativeness, nervousness, irritability, or paranoia.",
                  "examples": [
                    "Hey, check out that guy...he's really geeking out pretty bad."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) To enthusiastically engage in or discuss geek-like interests.",
                  "examples": [
                    "It was our first time at a Star Trek convention and we had an amazing time wandering around and geeking out."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably related to keek. Compare German gucken (“look”), kieken (“look”) and the dialectal corruption of Dutch keek (“keek”) (from kijk (“look”)), kijken (“to look”). Australian use from Cornish dialect."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "geek (plural geeks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, colloquial) A look.",
                  "examples": [
                    "Then he says let′s have a geek at some of the elephant pictures instead."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "geek (third-person singular simple present geeks, present participle geeking, simple past and past participle geeked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cornwall) To look; to peep; to stare about intently.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}