{
  "word": "group",
  "etymologies": [
    {
      "description": [
        "From French groupe (“cluster, group”), from Italian gruppo, groppo (“a knot, heap, group, bag (of money)”), from Vulgar Latin *cruppo, Renaissance Latin grupus, from Proto-Germanic *kruppaz (“lump, round mass, body, crop”), from Proto-Indo-European *grewb- (“to crumple, bend, crawl”). Cognate with German Kropf (“crop, craw, bunch”), Old English cropp, croppa (“cluster, bunch, sprout, flower, berry, ear of corn, crop”), Dutch krop (“craw”), Icelandic kroppr (“hump, bunch”). Doublet of crop and croup."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "group (plural groups)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number of things or persons being in some relation to one another.",
                  "examples": [
                    "there is a group of houses behind the hill;  he left town to join a Communist group",
                    "A group of people gathered in front of the Parliament to demonstrate against the Prime Minister's proposals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(group theory) A set with an associative binary operation, under which there exists an identity element, and such that each element has an inverse.",
                  "examples": [
                    "Throughout this section, we shall assume the existence of finitely presented groups with unsolvable word problem."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry, archaic) An effective divisor on a curve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A (usually small) group of people who perform music together.",
                  "examples": [
                    "Did you see the new jazz group?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A small number (up to about fifty) of galaxies that are near each other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A column in the periodic table of chemical elements.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A functional group.",
                  "examples": [
                    "Nitro is an electron-withdrawing group."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology) A subset of a culture or of a society.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An air force formation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A collection of formations or rock strata.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A number of users with the same rights with respect to accession, modification, and execution of files, computers and peripherals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An element of an espresso machine from which hot water pours into the portafilter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A number of eighth, sixteenth, etc., notes joined at the stems; sometimes rather indefinitely applied to any ornament made up of a few short notes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A set of teams playing each other in the same division, while not during the same period playing any teams that belong to other sets in the division.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) A commercial organization.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "group (third-person singular simple present groups, present participle grouping, simple past and past participle grouped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put together to form a group.",
                  "examples": [
                    "group the dogs by hair colour"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come together to form a group.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}