{
  "word": "wallow",
  "etymologies": [
    {
      "description": [
        "From Middle English walowen, walewen, walwen, welwen, from Old English wealwian (“to roll”), from Proto-West Germanic *walwōn, variant of *walwijan, from Proto-Germanic *walwijaną (“to roll”), from Proto-Indo-European *welw-, from Proto-Indo-European *welH- (“to turn, wind, roll”). Cognate with Latin volvō (“roll, tumble”, verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wallow (plural wallows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of wallowing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pool of water or mud in which animals wallow, or the depression left by them in the ground.",
                  "examples": [
                    "Soon, the incessant wind would dry the stenchy wallow to corduroyed cement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of rolling walk.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wallow (third-person singular simple present wallows, present participle wallowing, simple past and past participle wallowed) (intransitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To roll oneself about in something dirty, for example in mud.",
                  "examples": [
                    "Pigs wallow in the mud."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move lazily or heavily in any medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To immerse oneself in, to occupy oneself with, metaphorically.",
                  "examples": [
                    "She wallowed in her misery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To live or exist in filth or in a sickening manner.",
                  "examples": [
                    "The floors are at times inches deep with dirt and scraps of clothing. The whole place wallows with putrefaction. In some of the rooms it would seem that there had not been a breath of fresh air for five years."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English walwen, from Old English wealwian (“to fade, wither”), of uncertain origin. Perhaps an alteration of Old English fealwian (“to grow pale, turn yellow, ripen, wither”). Alternatively, perhaps related to Middle English welken (“to fade, droop, wither”), modern English welk."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wallow (third-person singular simple present wallows, present participle wallowing, simple past and past participle wallowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal, of plants) To fade, fade away, wither, droop; fail to flourish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English walwe, walh, from Old English wealg, from Proto-West Germanic *walg, from Proto-Germanic *walgaz. Cognate with Dutch walg (“disgust”), dialectal Norwegian valg (“tasteless”). Doublet of waugh."
      ],
      "adjectives": [
        {
          "description": "wallow (comparative more wallow, superlative most wallow)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now dialectal) Tasteless, flat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}