{
  "word": "dyke",
  "etymologies": [
    {
      "description": [
        "A variant of dike, from Northern Middle English dik and dike (“ditch”), from Old Norse díki (“ditch”). Influenced by Middle Dutch dijc (“ditch; dam”) and Middle Low German dīk (“dam”). See also\nditch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dyke (plural dykes)  (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A long, narrow hollow dug from the ground to serve as a boundary marker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, narrow hollow dug from the ground to conduct water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) Any navigable watercourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) Any watercourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) Any small body of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any hollow dug into the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly Australia, slang) A place to urinate and defecate: an outhouse or lavatory.",
                  "examples": [
                    "In Cubbaroo's dim distant past  They built a double dyke.  Back to back in the yard it stood  An architectural dream in wood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An embankment formed by the creation of a ditch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A city wall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly Scotland) A low embankment or stone wall serving as an enclosure and boundary marker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) Any fence or hedge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An earthwork raised to prevent inundation of low land by the sea or flooding rivers.",
                  "examples": [
                    "The king of Texcuco advised the building of a great dike, so thick and strong as to keep out the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any impediment, barrier, or difficulty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A beaver's dam.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) A jetty; a pier.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A raised causeway.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect, mining) A fissure in a rock stratum filled with intrusive rock; a fault.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A body of rock (usually igneous) originally filling a fissure but now often rising above the older stratum as it is eroded away.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dyke (third-person singular simple present dykes, present participle dyking, simple past and past participle dyked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To dig, particularly to create a ditch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surround with a ditch, to entrench.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland) To surround with a low dirt or stone wall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To raise a protective earthwork against a sea or river.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To scour a watercourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To steep [fibers] within a watercourse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Attested since the 1940s (in Berrey and Van den Bark’s 1942 American Thesaurus of Slang) or 1930s.",
        "Semantic development from dyke (“ditch”) has been proposed, and some sources from the 1890s are said to record dyke as slang for \"vulva\" and hedge of the dyke as slang for \"pubic hair\", but Green's Dictionary of Slang says dyke in the latter phrase had no reference to lesbianism and Dictionary.com considers a connection unlikely.",
        "Bull dyke / bulldike is attested earlier, in reference to women since at least the 1920s (the 29 July 1892 Decatur Daily Review in Illinois mentions a woman who \"won the affections of Harvey Neal, alias 'Bulldyke'\", whose gender is unclear; compare dike (“well-dressed man”)), and bulldyker (and the practice of bulldyking) are also attested earlier, e.g. in Parke's 1906 Human Sexuality, in the speech of Philadelphians, and backcountry Black Americans. Compare bulldagger, attested since around the same time and used especially by Black women.",
        "Other linguists suggested that bull dyke(r) referred to strong Black women who dug dikes, or derived from bull + dick, perhaps in reference to Black men. It has also been suggested that dyke is a shortening of morphodyke, from morphodite, from hermaphrodite, although the derivation may go in the other direction instead, with morphodyke being a blend of morphodite with the already-extant word dyke."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dyke (plural dykes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, usually derogatory, offensive) A lesbian, particularly one with masculine or butch traits or behavior.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, usually derogatory, loosely, offensive) A non-heterosexual woman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}