{
  "word": "wrap",
  "etymologies": [
    {
      "description": [
        "From Middle English wrappen (“to wrap, fold”), of uncertain origin. Perhaps related to North Frisian wrappe (“to press into; stop up”), dialectal Danish vrappe (“to stuff, cram”), Middle Low German rincworpen (“to envelop, wrap”), Middle Low German wrempen (“to wrinkle, scrunch the face”), all perhaps tied to Proto-Indo-European *werp-, *werb- (“to turn, twist, bend”). Compare also similar-sounding and similar-meaning Middle English wlappen (“to wrap, lap, envelop, fold”), Middle Dutch lappen (“to wrap up”), Old Italian goluppare (“to wrap”) (from Germanic). Doublet of lap; related to envelop, develop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wrap (third-person singular simple present wraps, present participle wrapping, simple past and past participle wrapped or (archaic) wrapt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enclose (an object) completely in any flexible, thin material such as fabric or paper.",
                  "examples": [
                    "Christmas gifts are commonly known to be wrapped in paper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enclose or coil around an object or organism, as a form of grasping.",
                  "examples": [
                    "A snake wraps itself around its prey."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To conceal by enveloping or enfolding; to hide.",
                  "examples": [
                    "wise poets that wrap truth in tales"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive, video production) To finish shooting (filming) a video, television show, or movie.",
                  "examples": [
                    "To avoid going over budget, let's make sure we wrap by ten. (compare wrap up 2)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(lines, words, text, etc.) To break a continuous line (of text) onto the next line",
                  "examples": [
                    "I wrapped the text so that I wouldn't need to scroll to the right to read it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, transitive) To make functionality available through a software wrapper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To (cause to) reset to an original value after passing a maximum.",
                  "examples": [
                    "The row counter wraps back to zero when no more rows can be inserted."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English wrappe, from the verb (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wrap (countable and uncountable, plural wraps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Paper or sheeting that is wrapped around something to protect, contain, or conceal it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose piece of women's clothing that one wraps around the body; a shawl or scarf.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural, now rare) An outer garment worn as protection while riding, travelling etc.",
                  "examples": [
                    "‘I see you have had our Lowick Cicero here,’ she said, seating herself comfortably, throwing back her wraps, and showing a thin but well-built figure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of food consisting of various ingredients wrapped in a tortilla or pancake.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entertainment) The completion of all or a major part of a performance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wraparound mortgage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, radio) A complete news report ready for broadcast, incorporating spoken reporting and other material.",
                  "examples": [
                    "Synonym: package"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wrap (plural wraps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, informal) Alternative spelling of rap (“appraisal”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}