{
  "word": "slot",
  "etymologies": [
    {
      "description": [
        "Middle Low German slot or Middle Dutch slot, ultimately from Proto-Germanic *slutą. Cognate with German Schloss (“door-bolt”), Dutch slot.",
        "The verb is probably from Middle Dutch sluten (“to close, to lock”) (Modern Dutch sluiten (“to close”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slot (plural slots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broad, flat, wooden bar, a slat, especially as used to secure a door, window, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A metal bolt or wooden bar, especially as a crosspiece.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Northern England) An implement for barring, bolting, locking or securing a door, box, gate, lid, window or the like.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical) A channel opening in the stator or rotor of a rotating machine for ventilation and insertion of windings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, surfing) The barrel or tube of a wave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) The area between the last offensive lineman on either side of the center and the wide receiver on that side.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slot (third-person singular simple present slots, present participle slotting, simple past and past participle slotted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Scotland, Northern England) To bar, bolt or lock a door or window.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, UK, dialectal) To shut with violence; to slam.",
                  "examples": [
                    "to slot a door"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old French esclot, likely from Old Norse slóð (“track”). Compare sleuth."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slot (plural slots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A narrow depression, perforation, or aperture; especially, one for the reception of a piece fitting or sliding in it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of time within a schedule or sequence.",
                  "examples": [
                    "I've booked your haircut for the 2 p.m. slot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The allocated time for an aircraft's departure or arrival at an airport's runway.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(field hockey or ice hockey) A rectangular area directly in front of the net and extending toward the blue line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) In a flying display, the fourth position; after the leader and two wingmen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A space in memory or on disk etc. in which a particular type of object can be stored.",
                  "examples": [
                    "The game offers four save slots."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A slot machine designed for gambling.",
                  "examples": [
                    "I walked past the poker tables and went straight to the slots."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The vagina.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The track of an animal, especially a deer; spoor.",
                  "examples": [
                    "The Huntsman by his slot, or breaking earth, perceaves"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Antarctica) A crack or fissure in a glacier or snowfield; a chasm; a crevasse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) The inside of the \"rim\" or semicircular copy desk, occupied by the supervisor of the copy editors.",
                  "examples": [
                    "The slot is not a glamorous job. It hasn't been discovered by Shubert Alley or the fiction magazines. To the cub reporter, eager for by-lines and self-expression, the whole copy desk looks like a backwater."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slot (third-person singular simple present slots, present participle slotting, simple past and past participle slotted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put something (such as a coin) into a slot (narrow aperture)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To assign something or someone into a slot (gap in a schedule or sequence)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To create a slot (narrow aperture or groove), as for example by cutting or machining.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put something where it belongs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Rhodesia, in the context of the Rhodesian Bush War) To kill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Antarctica) To fall, or cause to fall, into a crevasse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football, rugby, informal) To kick the ball between the posts for a goal; to score a goal by doing this.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}