{
  "word": "tau",
  "etymologies": [
    {
      "description": [
        "From Middle English tau, taue, from Latin tau, from Ancient Greek ταῦ (taû) and Hebrew תָּו (tav).",
        "Sense 6 (“mathematical constant equal to 2π”) was used by Joseph M. Lindenberg in 1991, and popularized by the American educator and entrepreneur Michael Hartl in a 2010 paper which explains that τ resembles π; and that τ is the Greek equivalent of t, the first letter of turn, and 2π corresponds to one turn of a circle with a radius of one unit.",
        "Sense 8.1 (“short for tau lepton or tau particle”) was coined by the American physicist Martin Lewis Perl (1927–2014) after the first letter of Ancient Greek τρίτον (tríton, “third”), since the tau lepton or tauon was the third charged lepton discovered."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tau (plural taus)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The letter Τ/τ in the Greek, Hebrew, and ancient Semitic alphabets; being the nineteenth letter of the Classical and Modern Greek, and the twenty-first letter of the Old and Ancient Greek alphabets.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A Τ-shaped object or sign; a Saint Anthony's cross, sometimes regarded as a sacred symbol.",
              "entries": [
                {
                  "meaning": "(Christianity) A crosier with a Τ-shaped head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ankh symbol (☥).",
                  "examples": [
                    "Synonym: crux ansata"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) Chiefly written τ: used to designate the nineteenth star (usually according to brightness) in a constellation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A measurement of the sensitivity of the value of an option to changes in the implied volatility of the price of the underlying asset.",
                  "examples": [
                    "Synonyms: kappa, vega",
                    "Hypernym: Greeks (includes a list of coordinate terms)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, neologism) Chiefly written τ: an irrational and transcendental constant representing the ratio of the circumference of a Euclidean circle to its radius, equal to twice the value of pi (2π; approximately 6.2831853071).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(neurology) Short for tau protein (“a protein abundant especially in the neurons of the human central nervous system that stabilizes microtubules, and when misfolded is associated with forms of dementia such as Alzheimer's and Parkinson's diseases”).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(physics) Chiefly written τ.",
              "entries": [
                {
                  "meaning": "Short for tau lepton or tau particle (“an unstable elementary particle which is a type of lepton, having a mass almost twice that of a proton, a negative charge, and a spin of ½; it decays into hadrons (usually pions) or other leptons, and neutrinos; a tauon”).",
                  "examples": []
                },
                {
                  "meaning": "(historical) Short for tau meson, now known as a kaon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}