{
  "word": "rouge",
  "etymologies": [
    {
      "description": [
        "Borrowed from French rouge, from Latin rubeus. Doublet of rubious."
      ],
      "adjectives": [
        {
          "description": "rouge (comparative more rouge, superlative most rouge)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a reddish pink colour.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "rouge (countable and uncountable, plural rouges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Red or pink makeup to add colour to the cheeks; blusher.",
                  "examples": [
                    "Synonym: blush"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any reddish pink colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canadian football) A single point awarded when a team kicks the ball out of its opponent's end zone, or when a kicked ball becomes dead within the non-kicking team's end zone. Etymology uncertain; it is thought that in the early years of the sport, a red flag indicated that a single had been scored.",
                  "examples": [
                    "Synonym: single"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) In the Eton wall game, a scrummage, melée.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the Eton College field game, a scoring move accomplished by touching the ball down behind the opponents' goal-line (somewhat similar to the try in rugby).  Originally, the player who scored the rouge had a chance to kick a goal, and the rouge was used as a tie-breaker if an equal number of goals was scored by each side.  In the contemporary Eton College field game, a five-point score is awarded for kicking the ball so that it deflects off one of the opposing players and goes beyond the opposition's end of the pitch, and then touching the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) From 1862 to 1868, a similar scoring move in Sheffield rules football.  From 1862 to 1867, accomplished by touching the ball down after it had been kicked between two \"rouge flags\" either side of the goal.  From 1867-1868, awarded for kicking the ball between the rouge flags and under the crossbar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry, archaic) A red amorphous powder consisting of ferric oxide, used in polishing and as a cosmetic; crocus; jeweller's rouge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rouge (third-person singular simple present rouges, present participle rouging, simple past and past participle rouged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To apply rouge (makeup).",
                  "examples": [
                    "She rouged her face before setting out for the party."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}