{
  "word": "mellow",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Late Middle English melowe, melwe (“ripe, mellow; juicy; sweet”) [and other forms]; further etymology uncertain, possibly:",
        "The noun and verb are both derived from the adjective. The etymology of noun sense 3 (“close friend; lover”) is unknown, but may also be derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "mellow (comparative mellower or more mellow, superlative mellowest or most mellow)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively, of fruit) Soft or tender by reason of ripeness; having a tender pulp.",
                  "examples": [
                    "Synonyms: mellowy; see also Thesaurus:soft",
                    "a mellow apple"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively, of food or drink, or its flavour) Matured and smooth, and not acidic, harsh, or sharp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of soil) Soft and easily penetrated or worked; not hard or rigid; loamy.",
                  "examples": [
                    "Synonym: yielding"
                  ]
                }
              ]
            },
            {
              "group": "(chiefly poetic)",
              "entries": [
                {
                  "meaning": "(of leaves, seeds, plants, etc.) Mature; of crops: ready to be harvested; ripe.",
                  "examples": []
                },
                {
                  "meaning": "(of a place, or the climate or weather) Fruitful and warm.",
                  "examples": [
                    "Synonym: mellowy"
                  ]
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "(of colour, sound, style, etc.) Not coarse, brash, harsh, or rough; delicate, rich, soft, subdued.",
                  "examples": [
                    "Synonym: mellowy"
                  ]
                },
                {
                  "meaning": "Senses relating to a person or their qualities.",
                  "examples": [
                    "(cheerful): Synonyms: convivial, gay; see also Thesaurus:happy",
                    "(relaxed): Synonyms: casual, easy-breezy"
                  ]
                },
                {
                  "meaning": "Well-matured from age or experience; not impetuous or impulsive; calm, dignified, gentle.",
                  "examples": []
                },
                {
                  "meaning": "Cheerful, genial, jovial, merry; also, easygoing, laid-back, relaxed.",
                  "examples": [
                    "(cheerful): Synonyms: convivial, gay; see also Thesaurus:happy",
                    "(relaxed): Synonyms: casual, easy-breezy"
                  ]
                },
                {
                  "meaning": "Drunk, intoxicated; especially slightly or pleasantly so, or to an extent that makes one cheerful and friendly.",
                  "examples": [
                    "Synonyms: mellowish; see also Thesaurus:drunk"
                  ]
                },
                {
                  "meaning": "(chiefly US, slang) Pleasantly high or stoned, and relaxed after taking drugs; also, of drugs: slightly intoxicating and tending to produce such effects.",
                  "examples": [
                    "Synonyms: see Thesaurus:stoned"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly African-American Vernacular, slang) Pleasing in some way; excellent, fantastic, great.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mellow (plural mellows) (US, informal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The property of being mellow; mellowness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically) A comfortable or relaxed mood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular) Also main mellow: a close friend or lover.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mellow (third-person singular simple present mellows, present participle mellowing, simple past and past participle mellowed)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To cause (fruit) to become soft or tender, specifically by ripening.",
                  "examples": []
                },
                {
                  "meaning": "To cause (food or drink, for example, cheese or wine, or its flavour) to become matured and smooth, and not acidic, harsh, or sharp.",
                  "examples": []
                },
                {
                  "meaning": "(archaic except Britain, regional) To soften (land or soil) and make it suitable for planting in.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": [
                    "The fervour of early feeling is tempered and mellowed by the ripeness of age."
                  ]
                },
                {
                  "meaning": "To reduce or remove the harshness or roughness from (something); to soften, to subdue, to tone down.",
                  "examples": []
                },
                {
                  "meaning": "To cause (a person) to become calmer, gentler, and more understanding, particularly from age or experience.",
                  "examples": [
                    "The fervour of early feeling is tempered and mellowed by the ripeness of age."
                  ]
                },
                {
                  "meaning": "(chiefly passive) To cause (a person) to become slightly or pleasantly drunk or intoxicated.",
                  "examples": []
                },
                {
                  "meaning": "(also reflexive, originally US, informal) Followed by out: to relax (a person); in particular, to cause (a person) to become pleasantly high or stoned by taking drugs.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "(of food or drink, or its flavour) To mature and lose its harshness or sharpness.",
                  "examples": []
                },
                {
                  "meaning": "(archaic except Britain, regional, of soil) To be rendered soft and suitable for planting in.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": []
                },
                {
                  "meaning": "To lose harshness; to become gentler, subdued, or toned down.",
                  "examples": []
                },
                {
                  "meaning": "(originally US, informal, followed by out, of a person) To relax; in particular, to become pleasantly high or stoned by taking drugs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}