{
  "word": "trench",
  "etymologies": [
    {
      "description": [
        "Borrowed into Middle English from Old French trenche."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trench (plural trenches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, narrow ditch or hole dug in the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A narrow excavation as used in warfare, as a cover for besieging or emplaced forces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) A pit, usually rectangular with smooth walls and floor, excavated during an archaeological investigation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A trench coat.",
                  "examples": [
                    "I was the first person in my high school to wear a trench and fedora constantly, and Ben was one of the first to wear a black trench."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trench (third-person singular simple present trenches, present participle trenching, simple past and past participle trenched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually followed by upon) To invade, especially with regard to the rights or the exclusive authority of another; to encroach.",
                  "examples": [
                    "Shee is the Judge, Thou Executioner, Or if thou needs would'st trench upon her power, Thou mightst have yet enjoy'd thy crueltie, With some more thrift, and more varietie."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, infantry) To excavate an elongated pit for protection of soldiers and or equipment, usually perpendicular to the line of sight toward the enemy.",
                  "examples": [
                    "Advanc'd upon the field there stood a moundOf earth congested, wall'd , and trench'd around"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) To excavate an elongated and often narrow pit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have direction; to aim or tend.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut; to form or shape by cutting; to make by incision, hewing, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut furrows or ditches in.",
                  "examples": [
                    "to trench land for the purpose of draining it"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dig or cultivate very deeply, usually by digging parallel contiguous trenches in succession, filling each from the next.",
                  "examples": [
                    "to trench a garden for certain crops"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}