{
  "word": "separate",
  "etymologies": [
    {
      "description": [
        "From Latin sēparātus, perfect passive participle of sēparāre (“to separate”), from sē (“apart”) +‎ parō (“prepare”), ultimately from Proto-Indo-European *per- (“produce, procure, bring forward, bring forth”). Displaced Middle English scheden, from Old English scēadan (whence English shed)."
      ],
      "adjectives": [
        {
          "description": "separate (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Apart from (the rest); not connected to or attached to (anything else).",
                  "examples": [
                    "This chair can be disassembled into five separate pieces."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(followed by “from”) Not together (with); not united (to).",
                  "examples": [
                    "I try to keep my personal life separate from work."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "separate (plural separates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) Anything that is sold by itself, especially articles of clothing such as blouses, skirts, jackets, and pants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bibliography) A printing of an article from a periodical as its own distinct publication and distributed independently, often with different page numbers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "separate (third-person singular simple present separates, present participle separating, simple past and past participle separated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To divide (a thing) into separate parts.",
                  "examples": [
                    "Separate the articles from the headings.",
                    "Synonyms: partition, split; see also Thesaurus:divide"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disunite from a group or mass; to disconnect.",
                  "examples": [
                    "From the fine gold I separate the allay [alloy]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (things or people) to be separate.",
                  "examples": [
                    "If the kids get too noisy, separate them for a few minutes.",
                    "Synonyms: split up, tear apart"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To divide itself into separate pieces or substances.",
                  "examples": [
                    "The sauce will separate if you don't keep stirring.",
                    "Synonyms: break down, come apart, disintegrate, fall apart"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To set apart; to select from among others, as for a special use or service.",
                  "examples": [
                    "Separate me Barnabas and Saul for the work whereunto I have called them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}