{
  "word": "canine",
  "etymologies": [
    {
      "description": [
        "From Latin canīnus (“of dogs, dog-like”), from canis (“dog”). Compare French canin."
      ],
      "adjectives": [
        {
          "description": "canine (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, or pertaining to, a dog or dogs.",
                  "examples": [
                    "A lost dog sniffed around the flower beds wishing it had some canine company […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dog-like.",
                  "examples": [
                    "In many respects she made me an admirable wife. Her affection for me was canine—positively."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Of or pertaining to mammalian teeth which are cuspids or fangs.",
                  "examples": [
                    "Then his upper lip may be seen to be raised, especially at the corners, so that his huge canine teeth are exhibited."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, obsolete) Of an appetite: depraved or inordinate; used to describe eating disorders.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "canine (plural canines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any member of Caninae, the only living subfamily of Canidae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(formal) Any of certain extant canids regarded as similar to the dog or wolf (including coyotes, jackals, etc.) but distinguished from the vulpines, which are regarded as fox-like.",
                  "examples": [
                    "The canine ran across the room to the open window, put his front paws on the sill and pointed his nose at the sidewalk below."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In heterodont mammals, the pointy tooth between the incisors and the premolars; a cuspid.",
                  "examples": [
                    "He tried to push Kissu into his cage, but the cougar charged back out and sank his canines into Wilson's rump."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) A king and a nine as a starting hand in Texas hold 'em due to phonetic similarity.",
                  "examples": [
                    "You have been dealt King-9 unsuited (\"canine\") in your pocket."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}