{
  "word": "relativity",
  "etymologies": [
    {
      "description": [
        "From relative (“connected to or depending on something else”) +‎ -ity (suffix forming nouns from adjectives where the nouns refer to the properties, qualities, or states described by the adjectives). Sense 2.1 (“reliance of the nature of physical phenomena on the relative motion between an observer and the thing observed”) is a translation of German Relativität (“relativity”) used in the works of the German-American theoretical physicist Albert Einstein (1879–1955).",
        "Morphologically relative +‎ -ity"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "relativity (usually uncountable, plural relativities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The state of being relative to something else; the absence of universally applicable rules or standards; relativism; (countable) an instance of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(uncountable, physics) Short for principle of relativity (“the principle that the laws of physics should be the same for all observers”).",
              "entries": [
                {
                  "meaning": "(specifically) Also Einsteinian relativity: the reliance of the nature of physical phenomena (such as gravity, light, mass, and time) on the relative motion between an observer and the thing observed, as developed by Albert Einstein in two theories, special relativity and general relativity.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, chiefly in the plural) An evaluation of the similarities and differences between things; a comparison; hence, a difference in position or status between things; a disparity.",
              "entries": [
                {
                  "meaning": "(economics, specifically) The difference in pay or positions between different employees in a business (internal relativity), or between different businesses (external relativity); a differential.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}