{
  "word": "legion",
  "etymologies": [
    {
      "description": [
        "Attested (in Middle English, as legioun) around 1200, from Old French legion, from Latin legiō, legionem, from legō (“to gather, collect”); akin to legend, lecture.",
        "Generalized sense of “a large number” is due to an allusive phrase in Mark 5:9, \"my name is Legion: for we are many\" (KJV)."
      ],
      "adjectives": [
        {
          "description": "legion (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Numerous; vast; very great in number",
                  "examples": [
                    "Synonyms: multitudinous, numerous",
                    "Russia’s labor and capital resources are woefully inadequate to overcome the state’s needs and vulnerabilities, which are legion.",
                    "dissatisfied customers and their legion complaints"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "legion (plural legions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, Ancient Rome) The major unit or division of the Roman army, usually comprising 3000 to 6000 infantry soldiers and 100 to 200 cavalry troops.",
                  "examples": [
                    "Meronyms: cohort, maniple, century"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A combined arms major military unit featuring cavalry, infantry, and artillery, including historical units such as the British Legion, and present-day units such as the Spanish Legion and the French Foreign Legion.",
                  "examples": [
                    "Coordinate terms: combat team, regimental combat team, brigade combat team"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A large military or semi-military unit trained for combat; any military force; an army, regiment; an armed, organized and assembled militia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often Legion or the Legion) A national organization or association of former servicemen, such as the American Legion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large number of people; a multitude.",
                  "examples": [
                    "Synonyms: host, mass, multitude, sea, throng"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often plural) A great number.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, taxonomy) A group of orders inferior to a class; in scientific classification, a term occasionally used to express an assemblage of objects intermediate between an order and a class.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "legion (third-person singular simple present legions, present participle legioning, simple past and past participle legioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form into legions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}