{
  "word": "fantastic",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French fantastique, borrowed from Late Latin phantasticus, borrowed from Ancient Greek φᾰντᾰστῐκός (phantastikós, “imaginary, fantastic; fictional”), ultimately from Proto-Indo-European *bʰeh₂- (“to shine”). Equivalent to fantasy +‎ -tic. Doublet of fantastique."
      ],
      "adjectives": [
        {
          "description": "fantastic (comparative more fantastic, superlative most fantastic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Existing in or constructed from fantasy; of or relating to fantasy; fanciful.",
                  "examples": [
                    "He told fantastic stories of dragons and goblins.",
                    "His fantastic post-college plans had all collapsed within a year of graduation.",
                    "She had a fantastic view of her own importance that none of her colleagues shared."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not believable; implausible; seemingly only possible in fantasy.",
                  "examples": [
                    "The events were so fantastic that only the tabloids were willing to print them.",
                    "She entered the lab and stood gaping for a good ten minutes at the fantastic machinery at work all around her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Resembling fantasies in irregularity, caprice, or eccentricity; irregular; grotesque.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wonderful; marvelous; excellent; extraordinarily good or great (used especially as an intensifier).",
                  "examples": [
                    "\"I had a simply fantastic vacation, and I can't wait to tell you all about it!\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "fantastic (plural fantastics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A fanciful or whimsical person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}