{
  "word": "spare",
  "etymologies": [
    {
      "description": [
        "From Middle English spare, spar, from Old English spær (“sparing, scant”), from Proto-Germanic *sparaz, from Proto-Indo-European *sph₁rós, from the root *speh₁-.",
        "Compare Dutch spaar(zaam), German spar(sam) and spär(lich), Swedish spar(sam), Icelandic sparr (“sparing”); also Latin (pro)sperus (“lucky”), Old Church Slavonic споръ (sporŭ, “plentiful”), Albanian shperr (“earn money”), Persian سپار‎ (sepâr, “entrust; deposit”), Ancient Greek σπαρνός (sparnós, “rare”), Sanskrit स्फिर (sphirá, “thick”)."
      ],
      "adjectives": [
        {
          "description": "spare (comparative sparer, superlative sparest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Scant; not abundant or plentiful.",
                  "examples": [
                    "a spare diet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sparing; frugal; parsimonious; not spending much money.",
                  "examples": [
                    "He was spare,  […] but discreet of speech."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being more than what is necessary, or what must be used or reserved; not wanted, or not used; superfluous.",
                  "examples": [
                    "I have no spare time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Held in reserve, to be used in an emergency.",
                  "examples": [
                    "a spare anchor; a spare wheel or tyre"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not occupied or in current use.",
                  "examples": [
                    "We could rent out the spare room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lean; lacking flesh; meager; thin; gaunt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, informal) Very angry; frustrated or distraught.",
                  "examples": [
                    "When he found out that someone had broken the window, he went spare.",
                    "The poor girl is going spare, stuck in the house all day with the kids like that."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "spare (plural spares)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of sparing; moderation; restraint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Parsimony; frugal use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An opening in a petticoat or gown; a placket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which has not been used or expended.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spare part, especially a spare tire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A superfluous or second-best person.",
                  "examples": [
                    "an heir and a spare (dynastic context)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bowling) The right of bowling again at a full set of pins, after having knocked all the pins down in less than three bowls. If all the pins are knocked down in one bowl it is a double spare; in two bowls, a single spare.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bowling) The act of knocking down all remaining pins in second ball of a frame; this entitles the pins knocked down on the next ball to be added to the score for that frame.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) A free period; a block of school during which one does not have a class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Myanmar) assistant or extra hand (typically on buses and lorries)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English sparen, sparien, from Old English sparian (“to spare, show mercy to, refrain from injuring or destroying”), from Proto-Germanic *sparōną, *sparāną (“to save, keep, spare”), from Proto-Indo-European *sper- (“to be productive, earn”).",
        "Cognate with Scots spar, spare, spair (“to spare”), West Frisian sparje (“to save, spare”), Dutch sparen (“to save, spare”), German sparen (“to save, conserve, economise”), Swedish spara (“to save, save up”), Icelandic spara (“to save, conserve”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "spare (third-person singular simple present spares, present participle sparing, simple past and past participle spared)",
          "definitionGroups": [
            {
              "group": "To show mercy.",
              "entries": [
                {
                  "meaning": "(intransitive) To desist; to stop; to refrain.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To refrain from inflicting harm; to use mercy or forbearance.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To preserve (someone) from danger or punishment; to forbear to punish, injure, or harm (someone); to show mercy towards.",
                  "examples": []
                },
                {
                  "meaning": "(specifically) To refrain from killing (someone) or having (someone) killed.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To keep.",
              "entries": [
                {
                  "meaning": "(intransitive) To be frugal; to not be profuse; to live frugally; to be parsimonious.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To keep to oneself; to forbear to impart or give.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To save or gain, as by frugality; to reserve, as from some occupation, use, or duty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) (to give up): To deprive oneself of, as by being frugal; to do without; to dispense with; to give up; to part with.",
                  "examples": [
                    "Where angry Jove did never spare / One breath of kind and temperate air."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}