{
  "word": "race",
  "etymologies": [
    {
      "description": [
        "From Middle English race, from Old Norse rás (“a running, race”), from Proto-Germanic *rēsō (“a course”), from Proto-Indo-European *reh₁s- (“to flow, rush”). Akin to Old English rǣs (“a race, swift or violent running, rush, onset”), Middle Low German râs (“a strong current”), Dutch ras (“a strong whirling current”). Compare Danish ræs, Norwegian and Swedish ras, Norwegian rås."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "race (countable and uncountable, plural races)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contest between people, animals, vehicles, etc. where the goal is to be the first to reach some objective. Example: Several horses run in a horse race, and the first one to reach the finishing post wins",
                  "examples": [
                    "The race around the park was won by Johnny, who ran faster than the others.",
                    "We had a race to see who could finish the book the quickest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Swift progress; rapid motion; an instance of moving or driving at high speed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A race condition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A progressive movement toward a goal.",
                  "examples": [
                    "the race to cure cancer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fast-moving current of water, such as that which powers a mill wheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A water channel, esp. one built to lead water to or from a point where it is utilised.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Competitive action of any kind, especially when prolonged; hence, career; course of life.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bushings of a rolling element bearing which contacts the rolling elements.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "race (third-person singular simple present races, present participle racing, simple past and past participle raced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take part in a race (in the sense of a contest).",
                  "examples": [
                    "The drivers were racing around the track."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To compete against in a race (contest).",
                  "examples": [
                    "I raced him to the car, but he was there first, so he got to ride shotgun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move or drive at high speed; to hurry or speed.",
                  "examples": [
                    "As soon as it was time to go home, he raced for the door.",
                    "Her heart was racing as she peered into the dimly lit room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a motor) To run rapidly when not engaged to a transmission.",
                  "examples": [
                    "\"My mind is like a racing engine, tearing itself to pieces because it is not connected up with the work for which it was built.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "1560s, via Middle French race from Italian razza (early 14th century), of uncertain origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "race (countable and uncountable, plural races)",
          "definitionGroups": [
            {
              "group": "A group of sentient beings, particularly people, distinguished by common ancestry, heritage or characteristics:",
              "entries": [
                {
                  "meaning": "A large group of people distinguished from others on the basis of a common heritage (compare ethnic group). See Wikipedia's article on historical definitions of race.",
                  "examples": [
                    "We toiled not in the acquirement or establishment of them—they are a legacy bequeathed us, by a once hardy, brave, and patriotic, but now lamented and departed race of ancestors."
                  ]
                },
                {
                  "meaning": "A large group of people distinguished from others on the basis of common physical characteristics, such as skin color or hair type.",
                  "examples": [
                    "Race was a significant issue during apartheid in South Africa."
                  ]
                },
                {
                  "meaning": "A large group of sentient beings distinguished from others on the basis of a common heritage (compare species, subspecies).",
                  "examples": [
                    "A treaty was concluded between the race of elves and the race of men."
                  ]
                },
                {
                  "meaning": "A group or category distinguished from others on the basis of shared characteristics or qualities, for example social qualities.",
                  "examples": [
                    "The advent of the Internet has brought about a new race of entrepreneur.",
                    "Recent developments in artificial intelligence have brought about a new race of robots that can perform household chores without supervision."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A population geographically separated from others of its species that develops significantly different characteristics; a mating group.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Subspecies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(animal husbandry) A breed or strain of domesticated animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mycology, bacteriology, informal) An infraspecific rank, a pathotype, pathovar, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Peculiar flavour, taste, or strength, as of wine; that quality, or assemblage of qualities, which indicates origin or kind, as in wine; hence, characteristic flavour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Characteristic quality or disposition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, uncountable) Ancestry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "race (third-person singular simple present races, present participle racing, simple past and past participle raced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To assign a race to; to perceive as having a (usually specified) race.",
                  "examples": [
                    "To be raced as black in the U.S. translates symbolically into being considered inferior to whites, lazy, immoral, boisterous, violent, and sexually promiscuous."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle French [Term?], from Latin radix."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "race (plural races)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rhizome or root, especially of ginger.",
                  "examples": [
                    "I must have saffron to color the warden pies; mace; dates, none -- that's out of my note; nutmegs, seven; a race or two of ginger, but that I may beg; four pounds of prunes, and as many of raisins o' th' sun."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "race (third-person singular simple present races, present participle racing, simple past and past participle raced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete form of raze.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}