{
  "word": "tun",
  "etymologies": [
    {
      "description": [
        "From Middle English tunne, tonne (“cask, barrel”), from Old English tunne (“tun, cask, barrel”), from Proto-Germanic *tunnǭ, *tunnō (“tun, barrel, cask”), from Latin tunna, probably of Gaulish origin.",
        "Cognate with North Frisian tenn (“tun, barrel, cask”), Dutch ton (“tun, barrel, cask”), German Tonne (“tun, barrel, drum”), Danish tønde (“barrel”), Swedish tunna (“barrel, cask, tun”), Icelandic tunna (“barrel”). Compare also Old French tonne, French tonneau (“ton, barrel”), Medieval Latin tunna (“cask”), Middle Irish tunna (“cask”), Welsh tynell (“tun, barrel”). It is uncertain whether the Germanic or the Celtic forms are the original."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tun (plural tuns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large cask; an oblong vessel bulging in the middle, like a pipe or puncheon, and girt with hoops; a wine cask. (See a diagram comparing cask sizes.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(brewing) A fermenting vat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A traditional unit of liquid measure equal to 252 wine gallons or 2 pipes.",
                  "examples": [
                    "Again, by 28 Hen. VIII, cap. 14, it is re-enacted that the tun of wine should contain 252 gallons, a butt of Malmsey 126 gallons, a pipe 126 gallons, a tercian or puncheon 84 gallons, a hogshead 63 gallons, a tierce 41 gallons, a barrel 31.5 gallons, a rundlet 18.5 gallons."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of long ton: a unit of mass equal to 2240 pounds, 20 hundredweights of 112 pounds avoirdupois each.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Synonym of ton: any extremely or excessively large amount.",
                  "examples": [
                    "A Tun of Man in thy Large bulk is writ, / But sure thou'rt but a Kilderkin of wit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, humorous or derogatory) Synonym of drunkard: a person who drinks excessively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any shell belonging to Tonna and allied genera.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cryptobiotic state of a tardigrade, when its metabolism is temporarily suspended.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tun (third-person singular simple present tuns, present participle tunning, simple past and past participle tunned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put into tuns, or casks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Mayan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tun (plural tuns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of the ancient Maya Long Count Calendar system which corresponds to 18 winal cycles or 360 days.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}