{
  "word": "tiller",
  "etymologies": [
    {
      "description": [
        "From Middle English tilier; equivalent to till +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tiller (plural tillers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who tills; a farmer.",
                  "examples": [
                    "In France, Europe's most fertile and cultivated land, the tillers of it suffered more and more hunger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine that mechanically tills the soil.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English telȝre, telgra, from Old English telgor, telgra, telgre (\"twig, branch, shoot\") (also telga, telge (whence tillow)), from Proto-West Germanic *telguʀ, from Proto-Germanic *telguz (“twig, branch”), from Proto-Indo-European *delgʰ- (“to split, divide, cut, carve”). Cognate with Saterland Frisian Tälge (“sapling”), Dutch telg (“descendant, scion, offshoot, shoot”), Dutch Low Saxon telge (“twig, branch”), German Zelge (“twig, branch, bough”), Swedish telning (“branch, scion, sapling”), Icelandic tág (“willow-twig”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tiller (plural tillers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A young tree.",
                  "examples": [
                    "first you must provide you of a Ladder to ascend the top of your Pit : this they usually make of a curved Tiller fit to apply to the convex shape of the heap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shoot of a plant which springs from the root or bottom of the original stalk; a sapling; a sucker.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tiller (third-person singular simple present tillers, present participle tillering, simple past and past participle tillered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce new shoots from the root or from around the bottom of the original stalk; stool.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English teler, from Anglo-Norman telier (“beam used in weaving”), from Medieval Latin telarium, from Latin tēla (“web”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tiller (plural tillers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archery) The stock; a beam on a crossbow carved to fit the arrow, or the point of balance in a longbow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A bar of iron or wood connected with the rudderhead and leadline, usually forward, in which the rudder is moved as desired by the tiller (FM 55-501).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The handle of the rudder which the helmsman holds to steer the boat, a piece of wood or metal extending forward from the rudder over or through the transom. Generally attached at the top of the rudder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, by extension) A steering wheel, usually mounted on the lower portion of the captain's control column, which is used to steer the aircraft's nosewheel or tailwheel to provide steering during taxi.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A handle; a stalk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The rear-wheel steering control, aboard a tiller truck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect, obsolete) A small drawer; a till.",
                  "examples": [
                    "But search her cabinet, and thou shalt find Each tiller there with love-epistles lin'd"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}