{
  "word": "acre",
  "etymologies": [
    {
      "description": [
        "From Middle English acre, aker, from Old English æcer (“field where crops are grown”), from Proto-West Germanic *ak(k)r, from Proto-Germanic *akraz (“field”), from Proto-Indo-European *h₂éǵros (“field”).",
        "Cognate with Scots acre, aker, acker (“acre, field, arable land”), North Frisian ecir (“field, a measure of land”), West Frisian eker (“field”), Dutch akker (“field”), German Acker (“field, acre”), Norwegian åker (“field”) and Swedish åker (“field”), Icelandic akur (“field”), Latin ager (“land, field, acre, countryside”), Ancient Greek ἀγρός (agrós, “field”), Sanskrit अज्र (ájra, “field, plain”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "acre (plural acres)",
          "definitionGroups": [
            {
              "group": "An English unit of land area (symbol: a. or ac.) originally denoting a day's ploughing for a yoke of oxen, now standardized as 4,840 square yards or 4,046.86 square meters.",
              "entries": [
                {
                  "meaning": "(Chester, historical) An area of 10,240 square yards or 4 quarters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various similar units of area in other systems.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, usually in the plural) A wide expanse.",
                  "examples": [
                    "I like my new house - there’s acres of space!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, usually in the plural) A large quantity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A field.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The acre's breadth by the length, English units of length equal to the statute dimensions of the acre: 22 yds (≈20 m) by 220 yds (≈200 m).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A duel fought between individual Scots and Englishmen in the borderlands.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}