{
  "word": "mug",
  "etymologies": [
    {
      "description": [
        "Early 16th century (originally Scots and northern English, denoting \"earthenware, pot, jug\"), of unknown origin, perhaps from North Germanic (compare Swedish mugg (“mug, jug”), Norwegian mugge (“pitcher, open can for warm drinks”), Danish mugge), or Low German mokke, mukke (“mug”), German Low German Muck (“drinking cup”), Dutch mok (“mug”), also of unknown origin. Perhaps related to Old English muga (“stack”) and Old Norse múgr (“mass, heap (of corn)”). Compare also Middle English mug, mog (“a measure of salt”).",
        "\"Face\" sense possibly from grotesque faces on certain drinking vessels. \"Assault\" sense of verb possibly from hitting someone in the face."
      ],
      "adjectives": [
        {
          "description": "mug (comparative mugger, superlative muggest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Easily fooled, gullible.",
                  "examples": [
                    "\"Great heavens! Is it?\" Drummond helped himself to marmalade. \"And to think that I once pictured myself skewering Huns with it. Do you think anybody would be mug enough to buy it, James?\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Bermuda, slang) Uninteresting or unpleasant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mug (plural mugs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large cup for beverages, usually having a handle and used without a saucer.A mug",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, often derogatory) The face.",
                  "examples": [
                    "What an ugly mug."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) A gullible or easily-cheated person.",
                  "examples": [
                    "He's a gullible mug – he believed her again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, derogatory, slang) A stupid or contemptible person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A criminal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mug (third-person singular simple present mugs, present participle mugging, simple past and past participle mugged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, UK) To strike in the face.",
                  "examples": [
                    "Madgbury showed game, drove Abbot in a corner, but got well Mugg'd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assault for the purpose of robbery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To exaggerate a facial expression for communicative emphasis; to make a face, to pose, as for photographs or in a performance, in an exaggerated or affected manner.",
                  "examples": [
                    "The children weren't interested in sitting still for a serious photo; they mugged for the camera."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To photograph for identification; to take a mug shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, Singapore, slang) To learn or review a subject as much as possible in a short time; cram.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Informal variant of motherfucker."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mug (plural mugs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, African-American Vernacular) Motherfucker (usually in similes, e.g. \"like a mug\" or \"as a mug\")",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}