{
  "word": "tickle",
  "etymologies": [
    {
      "description": [
        "From Middle English tiklen, tikelen, of uncertain origin. Perhaps from a frequentative form of Middle English tikken (“to touch lightly”), thus equivalent to tick +‎ -le; or perhaps related to Old English tinclian (“to tickle”). Compare North Frisian tigele (“to tickle”) (Hallig dialect), and tiikle (“to tickle”) (Amrum dialect), German dialectal zicklen (“to excite; stir up”). Alternatively, compare Middle English kitlelen (\"to tickle\"; see kittle), of which tickle might ultimately be a metathetic alteration."
      ],
      "adjectives": [
        {
          "description": "tickle (comparative more tickle, superlative most tickle)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Changeable, capricious; insecure.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tickle (plural tickles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of tickling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An itchy feeling resembling the result of tickling.",
                  "examples": [
                    "I have a persistent tickle in my throat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, informal) A light tap of the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Newfoundland) A narrow strait.",
                  "examples": [
                    "Cow Head itself is a prominent headland connected to the settlement by a natural causeway, or ‘tickle’ as the Newfoundlanders prefer it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tickle (third-person singular simple present tickles, present participle tickling, simple past and past participle tickled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch repeatedly or stroke delicately in a manner which causes laughter, pleasure and twitching.",
                  "examples": [
                    "He tickled Nancy's tummy, and she started to giggle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To unexpectedly touch or stroke delicately in a manner which causes displeasure or withdrawal.",
                  "examples": [
                    "A stranger tickled Nancy's tummy, causing her to scream in fear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a body part) To feel as if the body part in question is being tickled.",
                  "examples": [
                    "My nose tickles, and I'm going to sneeze!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To appeal to someone's taste, curiosity etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause delight or amusement in.",
                  "examples": [
                    "He was tickled to receive such a wonderful gift."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To feel titillation.",
                  "examples": [
                    "He with secret joy thereforeDid tickle inwardly in every vein."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To catch fish in the hand (usually in rivers or smaller streams) by manually stimulating the fins.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To be excited or heartened.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}