{
  "word": "combo",
  "etymologies": [
    {
      "description": [
        "Clipping of combination  +‎ -o"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "combo (plural combos or comboes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small musical group.",
                  "examples": [
                    "The jazz combo played nightly at the little restaurant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A combination.",
                  "examples": [
                    "I need to open the safe but I forgot the combo.",
                    "I order the low priced combo platter: a taco, a burrito and a chimichanga."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) An action composed of a sequence of simpler actions, especially a composite attacking move in a fighting game.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(gaming) Effective combination of gameplay elements.",
              "entries": [
                {
                  "meaning": "Two or more gameplay elements (e.g. characters, items) which are powerful when used together.",
                  "examples": []
                },
                {
                  "meaning": "(especially collectible card games) A strategy aiming to win by playing a specific combination of cards (or similar), often in a single turn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, derogatory) A Caucasian man who marries or has a sexual relationship with an Aboriginal woman; a Caucasian man who lives among Aboriginal people and adopts Aboriginal culture",
                  "examples": [
                    "\" […]  Look at Ganger O'Cannon of Black Adder Creek, with his halfcaste wife and quadroon kids, a down-right family man—yet looked on as as much a combo as if he lived in a blacks' camp. Isn't that so?  […]  The casual comboes are respected, while men like O'Cannon and myself, who rear their kids, are utterly despised.  […] \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graphical user interface, informal) A combo box.",
                  "examples": [
                    "Combos and lists are two very powerful controls that allow the user to select from a predetermined set of values."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "combo (third-person singular simple present combos, present participle comboing, simple past and past participle comboed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To combine",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}