{
  "word": "admiral",
  "etymologies": [
    {
      "description": [
        "From Middle English amiral, from Old French amirail, amiral (modern French amiral), from a shortening of Arabic أَمِير اَلبَحْر‎ (ʔamīr al-baḥr, “commander of the fleet”, literally “sea commander”). Akin to amir, Amir, and emir. The -d- is probably from the influence of the otherwise unconnected admirable (Latin admīrābilis).",
        "First recorded in English in September 1300, in a description of Gerard Allard of Winchelsea as “Admiral of the Fleet of the Cinque Ports”."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "admiral (plural admirals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A naval officer of the highest rank; the commander of a country's naval forces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A naval officer of high rank, immediately below Admiral of the Fleet; the commander of a fleet or squadron.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flag officer in the United States Navy or Coast Guard of a grade superior to vice admiral and junior to admiral of the fleet (when that grade is used). An admiral is equal in grade or rank to a four-star general.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ship which carries the admiral, the flagship; also, the most considerable ship of a fleet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A prince or Saracen leader under the Sultan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various nymphalid butterflies of the genera Kaniska, Limenitis and Vanessa, especially a red admiral or white admiral.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}