{
  "word": "vespertine",
  "etymologies": [
    {
      "description": [
        "From Middle English vespertyne, from Latin vespertīnus (“evening”)."
      ],
      "adjectives": [
        {
          "description": "vespertine (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic) Of or related to the evening; that occurs in the evening.",
                  "examples": [
                    "The peripatetics issue forth to indulge in the usual vespertine locomotion; and stroll gently down the aristocratic Chesnut and up the sedate and solid-seeming Mulberry, or vice versa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology, of a planet or star) That sets after the sun.",
                  "examples": [
                    "But, owing to the vespertine configuration of Jupiter and Mars, as well as the masculine condition of the anterior parts of the triplicity, and the feminine condition of its latter parts, the said nations regard women with scorn and indifference."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, of an animal) That is principally active at dusk.",
                  "examples": [
                    "In both forms of this interesting plant, the medium-sized spider-like flowers are closed from morning until late afternoon when they open to attract vespertine insects."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Occurring in the evening.",
                  "examples": [
                    "Similarly, the flowers of the sphingophilous taxa correspond to the characteristics and habits of western American hawkmoths in many ways: in ... vespertine and nocturnal nectar production"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, of a plant) That opens or blooms in the evening.",
                  "examples": [
                    "Herbaceous; leaves alternate, pinnatifid, asperate; flowers large, terminal and solitary, vespertine, (or expanding towards sun-set,) not deciduous or marcescent after closing, but re-opening at the usual time for several days in succession, when closed involute in a cone; […] ."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}