{
  "word": "carpenter",
  "etymologies": [
    {
      "description": [
        "From Middle English carpenter, from Anglo-Norman carpenter (compare Old French charpentier), from Late Latin carpentārius (“a carpenter”), from Latin carpentārius (“a wagon-maker, carriage-maker”), from Latin carpentum (“a two-wheeled carriage, coach, or chariot, a cart”), from Gaulish carbantos, from Proto-Celtic *karbantos (“chariot, war chariot”), probably related to Proto-Celtic *karros (“wagon”). More at car.",
        "Displaced native Old English trēowwyrhta (literally “tree worker”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carpenter (plural carpenters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person skilled at carpentry, the trade of cutting and joining timber in order to construct buildings or other structures.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A senior rating in ships responsible for all the woodwork onboard; in the days of sail, a warrant officer responsible for the hull, masts, spars and boats of a ship, and whose responsibility was to sound the well to see if the ship was making water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A two-wheeled carriage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) A carpenter bee.",
                  "examples": [
                    "The large, stout African bees are carpenters (Xylocopa), making small tunnels in timber, housing few individuals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, Britain, regional) A woodlouse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "carpenter (third-person singular simple present carpenters, present participle carpentering, simple past and past participle carpentered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To work as a carpenter, cutting and joining timber.",
                  "examples": [
                    "Synonym: (rare) carpent"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}