{
  "word": "paper",
  "etymologies": [
    {
      "description": [
        "From Middle English paper, borrowed from Anglo-Norman paper, papier, from Latin papȳrus, from Ancient Greek πάπυρος (pápuros). Doublet of papyrus."
      ],
      "adjectives": [
        {
          "description": "paper (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of paper.",
                  "examples": [
                    "paper bag; paper plane"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Insubstantial (from the weakness of common paper)",
                  "examples": [
                    "paper tiger; paper gangster"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Planned (from plans being drawn up on paper)",
                  "examples": [
                    "paper rocket; paper engine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a title that is merely official, or given by courtesy or convention.",
                  "examples": [
                    "a paper baron; a paper lord"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "paper (countable and uncountable, plural papers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sheet material used for writing on or printing on (or as a non-waterproof container), usually made by draining cellulose fibres from a suspension in water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A newspaper or anything used as such (such as a newsletter or listing magazine).",
                  "examples": [
                    "\"I don't want to spoil any comparison you are going to make,\" said Jim, \"but I was at Winchester and New College.\" ¶ \"That will do,\" said Mackenzie. \"I was dragged up at the workhouse school till I was twelve. Then I ran away and sold papers in the streets, and anything else that I could pick up a few coppers by—except steal. […].\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Wallpaper.",
                  "examples": [
                    "There was a neat hat-and-umbrella stand, and the stranger's weary feet fell soft on a good, serviceable dark-red drugget, which matched in colour the flock-paper on the walls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Wrapping paper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rock paper scissors) An open hand (a handshape resembling a sheet of paper), that beats rock and loses to scissors. It loses to lizard and beats Spock in rock-paper-scissors-lizard-Spock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A written document, generally shorter than a book (white paper, term paper), in particular one written for the Government.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A written document that reports scientific or academic research and is usually subjected to peer review before publication in a scientific journal (as a journal article or the manuscript for one) or in the proceedings of a scientific or academic meeting (such as a conference, workshop, or symposium).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A scholastic essay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A set of examination questions to be answered at one session.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Money.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, uncountable) Any financial assets other than specie.",
                  "examples": [
                    "Why might not a Government annuity, the Principal of which was originally invested in Paper since the Cash suspension in 1797, be constituted the guarantee of Paper Money, emendating from that investiture and suspension, and the Parliament authority transferred to its security, as it has been to its creation, in preference to all others, while Paper continues our general Medium."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New Zealand) A university course.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A paper packet containing a quantity of items.",
                  "examples": [
                    "a paper of pins, tacks, opium, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A medicinal preparation spread upon paper, intended for external application.",
                  "examples": [
                    "cantharides paper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A substance resembling paper secreted by certain invertebrates as protection for their nests and eggs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Free passes of admission to a theatre, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, by extension) The people admitted by free passes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "paper (third-person singular simple present papers, present participle papering, simple past and past participle papered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply paper to.",
                  "examples": [
                    "to paper the hallway walls"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To document; to memorialize.",
                  "examples": [
                    "After they reached an agreement, their staffs papered it up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill (a theatre or other paid event) with complimentary seats.",
                  "examples": [
                    "Synonym: paper the house"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To submit official papers to (a law court, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give public notice (typically by displaying posters) that a person is wanted by the police or other authority.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sandpaper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enfold in paper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To paste the endpapers and flyleaves at the beginning and end of a book before fitting it into its covers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}