{
  "word": "esquire",
  "etymologies": [
    {
      "description": [
        "From Middle English esquier, from Old French escuyer, escuier, properly, a shield-bearer (compare modern French écuyer (“shield-bearer, armor-bearer, squire of a knight, esquire, equerry, rider, horseman”)), from Late Latin scutarius (“shield-bearer”), from Latin scutum (“shield”); probably akin to English hide (“to cover”). The term squire is the result of apheresis. Compare equerry, escutcheon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "esquire (plural esquires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually US, law) A lawyer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male member of the gentry ranking below a knight.",
                  "examples": [
                    "Esquires and gentlemen are confounded together by Sir Edward Coke, who observes that every esquire is a gentleman, and a gentleman is defined to be one qui arma gerit, who bears coat-armour, the grant of which was thought to add gentility to a man's family. It is indeed a matter somewhat unsettled what constitutes the distinction, or who is a real esquire; for no estate, however large, per se confers this rank upon its owner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An honorific sometimes placed after a man's name.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gentleman who attends or escorts a lady in public.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A squire; a youth who in the hopes of becoming a knight attended upon a knight",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A shield-bearer, but also applied to other attendants.",
                  "examples": [
                    "The office of the esquire consisted of several departments; the esquire for the body, the esquire of the chamber, the esquire of the stable, and the carving esquire; the latter stood in the hall at dinner, carved the different dishes, and distributed them to the guests."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "esquire (third-person singular simple present esquires, present participle esquiring, simple past and past participle esquired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To attend, wait on, escort.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Old French esquiere, esquierre, esquarre (“a square”)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "esquire (plural esquires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A bearing somewhat resembling a gyron, but extending across the field so that the point touches the opposite edge of the escutcheon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}