{
  "word": "provide",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English providen, from Latin prōvidēre (“to foresee, act with foresight”). Doublet of purvey."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "provide (third-person singular simple present provides, present participle providing, simple past and past participle provided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a living; earn money for necessities.",
                  "examples": [
                    "It is difficult to provide for my family working on minimum wage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act to prepare for something.",
                  "examples": [
                    "provide against disaster."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To establish as a previous condition; to stipulate.",
                  "examples": [
                    "The contract provides that the work be well done.",
                    "I'll lend you the money, provided that you pay it back by Monday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give what is needed or desired, especially basic needs.",
                  "examples": [
                    "Don't bother bringing equipment, as we will provide it.",
                    "We aim to provide the local community with more green spaces."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish (with), cause to be present.",
                  "examples": [
                    "Rome  […]  was generally well provided with corn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make possible or attainable.",
                  "examples": [
                    "He provides us with an alternative option."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Latinism) To foresee, to consider in advance.",
                  "examples": [
                    "We have not been covetous, honourable fathers, to change, neither is it now any new lust that alters our affection, or old lothing, but those needful jealousies of state, that warn wiser princes hourly to provide their safety, and do teach them how learned a thing it is to beware of the humblest enemy; much more of those great ones, whom their own employed favours have made fit for their fears."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To appoint to an ecclesiastical benefice before it is vacant. See provisor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}