{
  "word": "talc",
  "etymologies": [
    {
      "description": [
        "From Middle French talc, from Arabic طَلْق‎ (ṭalq), from Persian تلک‎ (talk)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "talc (countable and uncountable, plural talcs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Originally a large range of transparent or glistening foliated minerals. Examples include mica, selenite and the hydrated magnesium silicate that the term talc generally has referred to in modern times (see below). Also an item made of such a mineral and depending for its function on the special nature of the mineral (see next). Mediaeval writers adopted the term from the Arabic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A microscope slide made of a plate of mica, generally in use from the start of modern microscopy until the early nineteenth century, after which glass slides became the standard medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A soft mineral, composed of hydrated magnesium silicate, that has a soapy feel and a greenish, whitish, or grayish color, and usually occurs in foliated masses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Talcum powder.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "talc (third-person singular simple present talcs, present participle talcing, simple past and past participle talced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply talc to.",
                  "examples": [
                    "\"Generous talcing\" is applied not only to the naked bale, but to the inside of the wrapper, and after stenciling, to the interior of the package. This talcing is repeated, \"if necessary, dependent upon the number of handlings up to and into stores for steamer loading.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}