{
  "word": "butterfly",
  "etymologies": [
    {
      "description": [
        "From Middle English buterflie, butturflye, boterflye, from Old English buterflēoge, equivalent to butter +‎ fly. Cognate with Dutch botervlieg, German Butterfliege (“butterfly”). The name may have originally been applied to butterflies of a yellowish color, and/or reflected a belief that butterflies ate milk and butter (compare German Molkendieb (“butterfly”, literally “whey thief”) and Low German Botterlicker (“butterfly”, literally “butter-licker”)), or that they excreted a butter-like substance (compare Dutch boterschijte (“butterfly”, literally “butter-shitter”)). Compare also German Schmetterling from Schmetten (“cream”), German Low German Bottervögel (“butterfly”, literally “butter-fowl”). More at butter, fly.",
        "An alternate theory suggests that the first element may have originally been butor- (“beater”), a mutation of bēatan (“to beat”).",
        "Superseded non-native Middle English papilion (“butterfly”) borrowed from Old French papillon (“butterfly”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "butterfly (plural butterflies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flying insect of the order Lepidoptera, distinguished from moths by their diurnal activity and generally brighter colouring. [from 11th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, attributive) A use of surgical tape, cut into thin strips and placed across an open wound to hold it closed.",
                  "examples": [
                    "butterfly tape; butterfly bandage; butterfly strips"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(swimming) The butterfly stroke. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several plane curves that look like a butterfly; see Butterfly curve (transcendental) and Butterfly curve (algebraic).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A sensation of excited anxiety felt in the stomach.",
                  "examples": [
                    "I get terrible butterflies before an exam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Someone seen as being unserious and (originally) dressed  gaudily; someone flighty and unreliable. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A combination of four options of the same type at three strike prices giving limited profit and limited risk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alternate history) A random change in an aspect of the timeline seemingly unrelated to the primary point of divergence, resulting from the butterfly effect.",
                  "examples": [
                    "One potential butterfly could be JFK having another son the year after the POD instead of a daughter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A type of stretch in which one sits on the ground with the legs folded into a shape like that of a butterfly's wings, slightly rocking them up and down, resembling the wings fluttering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who changes partners frequently.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "butterfly (third-person singular simple present butterflies, present participle butterflying, simple past and past participle butterflied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut (food) almost entirely in half and spread the halves apart, in a shape suggesting the wings of a butterfly.",
                  "examples": [
                    "butterflied shrimp",
                    "Butterfly the chicken before you grill it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut strips of surgical tape or plasters into thin strips, and place across (a gaping wound) to close it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of the point of divergence of an alternate history scenario) To cause events after the point of divergence to not happen as they did in real history, and people conceived after the point of divergence to not exist in recognizable form, due to the random variations introduced by the butterfly effect.",
                  "examples": [
                    "Pearl Harbor not happening would've butterflied Taylor Swift."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}