{
  "word": "hotshot",
  "etymologies": [
    {
      "description": [],
      "adjectives": [
        {
          "description": "hotshot (comparative more hotshot, superlative most hotshot)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Highly skilled.",
                  "examples": [
                    "He was a hotshot lawyer, with an astounding win-loss record."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Displaying talent.",
                  "examples": [
                    "Keep up those hotshot baskets, the scouts are sure to take notice."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "hotshot (plural hotshots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Someone with exceptional skills in a certain field.",
                  "examples": [
                    "She sure was a hotshot on the keyboard, 93 words per minute!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of firefighter highly skilled in wildfire firefighting without external support, using basic tools that are backpacked in and manhandled about.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, rail transport) A fast freight train.",
                  "examples": [
                    "Indeed, development proceeded so rapidly thereafter that Mopac, for instance, was rebuilding a series of 10-year-old Woodard 2-8-4's into 4-8-4's by 1940 - not because they couldn't steam but because their 63-inch drivers couldn't roll the hotshots fast enough."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A dose of recreational drugs deliberately laced with poison.",
                  "examples": [
                    "I sniffed glue, transmission fluid, gasoline, whatever drug anybody gave me, I took.  […]  [Y]ears ago, I was in a drug rehabilitation program and found out that my brother was killed after somebody gave him a hotshot, drugs laced with poison."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hotshot (third-person singular simple present hotshots, present participle hotshotting, simple past and past participle hotshotted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To give (somebody) a dose of recreational drugs deliberately laced with poison.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}