{
  "word": "cousin",
  "etymologies": [
    {
      "description": [
        "From Middle English cosyn, from Old French cosin, from Latin cōnsōbrīnus (possibly via a Vulgar Latin form *cōsōbīnus > *cōsuīnus), from com- + sōbrīnus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cousin (plural cousins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The child of a person's uncle or aunt; a first cousin.",
                  "examples": [
                    "Synonym: first cousin",
                    "I think my cousin is a good man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A kinsman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any relation who is not a direct ancestor or descendant but part of one's extended family; one more distantly related than an uncle, aunt, granduncle, grandaunt, nephew, niece, grandnephew, grandniece, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A title formerly given by a king to a nobleman, particularly to those of the council. In English writs, etc., issued by the crown, it signifies any earl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Something kindred or related to something else.",
                  "examples": [
                    "Partnering, along with its less irritating cousin \"partnership\", crops up all over the place, being equally useful to the lazy jargoneer and the lazy policy-maker. It has been said that there is no noun which cannot be verbed; in the same way, there is now nothing, concrete or abstract, which cannot be partnered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(espionage, slang, chiefly in the plural) A member of the British intelligence services (from an American perspective) or of the American intelligence services (from a British perspective).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}