{
  "word": "penny",
  "etymologies": [
    {
      "description": [
        "From Middle English penny, peny, from Old English peniġ, penniġ, penning (“penny”), from Proto-West Germanic *panning, from Proto-Germanic *panningaz, of uncertain origin (see that page for theories). Doublet of pfennig."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "penny (plural pennies or pence or (obsolete) pens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) In the United Kingdom and Ireland, a unit of currency worth 1⁄240 of a pound sterling or Irish pound before decimalisation, or a copper coin worth this amount. Abbreviation: d.",
                  "examples": [
                    "Thanks to that penny he had just spent so recklessly [on a newspaper] he would pass a happy hour, taken, for once, out of his anxious, despondent, miserable self. It irritated him shrewdly to know that these moments of respite from carking care would not be shared with his poor wife, with careworn, troubled Ellen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the United Kingdom, a unit of currency worth 1⁄100 of a pound sterling, or a copper coin worth this amount. Abbreviation: p.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) In Ireland, a coin worth 1⁄100 of an Irish pound before the introduction of the euro. Abbreviation: p.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the US and (formerly) Canada, a one-cent coin, worth 1⁄100 of a dollar. Abbreviation: ¢.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In various countries, a small-denomination copper or brass coin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A unit of nail size, said to be either the cost per 100 nails, or the number of nails per penny. Abbreviation: d.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Money in general.",
                  "examples": [
                    "to turn an honest penny"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "penny (third-person singular simple present pennies, present participle pennying, simple past and past participle pennied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To jam a door shut by inserting pennies between the doorframe and the door.",
                  "examples": [
                    "Zach and Ben had only been at college for a week when their door was pennied by the girls down the hall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) To circumvent the tripping of an electrical circuit breaker by the dangerous practice of inserting a coin in place of a fuse in a fuse socket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Oxbridge slang) During a meal or as part of a drinking game, to drop a penny in a person's drink such that they must finish it (or some such variation thereof); commonly associated with crewdates at Oxford and swaps at Cambridge.",
                  "examples": [
                    "You got pennied! Down it, fresher."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}