{
  "word": "impeachment",
  "etymologies": [
    {
      "description": [
        "From Middle English empechement (“hindrance, impediment, obstacle, obstruction; legal accusation or charge; act of calling into question or discrediting; challenge to a claim or right”), and thence either:",
        "The English word is analysable as impeach +‎ -ment.",
        "Old French empechier, empeechier and empescher (compare modern French empêcher) are derived from Late Latin impedicāre (“to catch; to entangle”), present active infinitive of Latin impedicō (“to entangle; to fetter”), from im- (variant of in-) + pedica (“fetter, shackle; snare, trap”) (from pēs (“foot”), ultimately from Proto-Indo-European *ped- (“to step, walk; to fall, stumble”)) + -ō.",
        "In senses 1.2 (“accusation that a person has committed a crime”) and 1.3 (“act of impeaching or charging a public official with misconduct”), the word has been used in place of Latin impetere, the present active infinitive of impetō (“to assail, attack, rush upon”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "impeachment (countable and uncountable, plural impeachments)",
          "definitionGroups": [
            {
              "group": "(countable) The act of calling into question or challenging the accuracy or propriety of something.",
              "entries": [
                {
                  "meaning": "(countable, law) A demonstration in a court of law, or before another finder of fact, that a witness was ingenuine before, and is therefore less likely to tell the truth now.",
                  "examples": []
                },
                {
                  "meaning": "(countable, law, Britain) An accusation that a person has committed a crime against the state, such as treason.",
                  "examples": []
                },
                {
                  "meaning": "(countable, law, chiefly US) The act of impeaching or charging a public official with misconduct, especially if serious, often with the aim of having the official dismissed from office.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The state of being impeached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, archaic) Hindrance; impediment; obstruction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}