{
  "word": "faith",
  "etymologies": [
    {
      "description": [
        "From Middle English faith (also fay), borrowed from Old French fei, feid, from Latin fidem. Displaced native Old English ġelēafa, which was also the word for \"belief.\"",
        "Old French had [θ] as a final devoiced allophone of /ð/ from lenited Latin /d/; this eventually fell silent in the 12th century.  The -th of the Middle English forms is most straightforwardly accounted for as a direct borrowing of a French [θ]. However, it has also been seen as arising from alteration of a French form with -d under influence of English abstract nouns in the suffix -th (e.g. truth, ruth, health, etc.), or as a recharacterisation of a French form like fay, fey, fei with the same suffix, thus making the word equivalent to fay +‎ -th."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "faith (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Alternative form of in faith (“really, truly”)",
                  "examples": [
                    "'Faith, friend,' he says, 'that was a nasty fall for a fellow that has supped weel. Where might your road be gaun to?'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "faith (countable and uncountable, plural faiths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trust or confidence in the intentions or abilities of a person, object, or ideal from prior empirical evidence.",
                  "examples": [
                    "The faithfulness of Old Faithful gives us faith in it.",
                    "I have faith in the goodness of my fellow man.",
                    "You need to have faith in yourself, that you can overcome your shortcomings and become a good person."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conviction about abstractions, ideas, or beliefs, without empirical evidence, experience, or observation.",
                  "examples": [
                    "I have faith that my prayers will be answered.",
                    "I have faith in the healing power of crystals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A religious or spiritual belief system.",
                  "examples": [
                    "The Christian faith.",
                    "We seek justice for the Indo-European Folk Faith; what's wrong in our literature for that?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An obligation of loyalty or fidelity and the observance of such an obligation.",
                  "examples": [
                    "He acted in good faith to restore broken diplomatic ties after defeating the incumbent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Credibility or truth.",
                  "examples": [
                    "the faith of the foregoing  […]  narrative"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}