{
  "word": "femme",
  "etymologies": [
    {
      "description": [
        "From French femme (“woman”). Doublet of feme, femina, and hembra."
      ],
      "adjectives": [
        {
          "description": "femme (comparative more femme, superlative most femme)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US, journalism, entertainment) Pertaining to a femme; feminine, female. [from 20th c.]",
                  "examples": [
                    "Admittedly, Kiedis was concerned about the lack of femme rockers on the bill: the only women featured were in British band Lush, who would open each day's festivities before a few hundred curious onlookers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly derogatory) Effeminate (of a man). [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic of a feminine lesbian or queer woman. [from 20th c.]",
                  "examples": [
                    "Her style was more femme than butch."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "femme (plural femmes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A woman, a wife; (now chiefly Canada, US) a young woman or girl. [from 19th c.]",
                  "examples": [
                    "Then I turned to him and said, \"O my lord, I have that to propose to thee wherein thou must not cross me; and this it is that, when we reach Baghdad, my native city, I offer thee my life as thy handmaiden in holy matrimony, and thou shalt be to me baron and I will be femme to thee.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT) A lesbian or other queer woman whose appearance, identity etc. is seen as feminine as opposed to butch. [from 20th c.]",
                  "examples": [
                    "Synonym: (less common) fem",
                    "Antonym: butch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT, less common) A person whose gender is feminine-leaning, such as a feminine non-binary person.",
                  "examples": [
                    "Coordinate term: masc"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}