{
  "word": "knock",
  "etymologies": [
    {
      "description": [
        "From Middle English knokken, from Old English cnocian, ġecnocian, cnucian (“to knock, pound on, beat”), from Proto-West Germanic *knokōn, from Proto-Germanic *knukōną (“to knock”), a suffixed form of *knu-, *kneu- (“to pound on, beat”), from Proto-Indo-European *gen- (“to squeeze, pinch, kink, ball up, concentrate”). The English word is cognate with Middle High German knochen (“to hit”), Old English cnuian, cnuwian (“to pound, knock”), Old Norse knoka (compare Danish knuge, Swedish knocka (“to hug”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "knock (countable and uncountable, plural knocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An abrupt rapping sound, as from an impact of a hard object against wood.",
                  "examples": [
                    "I heard a knock on my door."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp impact.",
                  "examples": [
                    "He took a knock on the head."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A criticism.",
                  "examples": [
                    "Since forming in 2007 Mumford & Sons have hard-toured their way to a vast market for throaty folk that's strong on banjo and bass drum. They have released two enormous albums. But, wow, do they take some knocks back home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A blow or setback.",
                  "examples": [
                    "\"Come on!\" cried Mr. Beaver, who was almost dancing with delight. \"Come and see! This is a nasty knock for the Witch! It looks as if her power was already crumbling.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive, uncountable) Preignition, a type of abnormal combustion occurring in spark ignition engines caused by self-ignition; also, the characteristic knocking sound associated with it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A batsman's innings.",
                  "examples": [
                    "He played a slow but sure knock of 35."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling, uncountable) Synonym of hunger knock",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "knock (third-person singular simple present knocks, present participle knocking, simple past and past participle knocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To strike for admittance; to rap upon, as a door.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To criticize verbally; to denigrate; to undervalue.",
                  "examples": [
                    "Don’t knock it until you’ve tried it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, soccer) To kick a ball towards another player; to pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain, slang, dated) To impress forcibly or strongly; to astonish; to move to admiration or applause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, dated) To bump or impact.",
                  "examples": [
                    "I knocked against the table and bruised my leg.",
                    "I accidentally knocked my drink off the bar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rap one's knuckles against something, especially wood.",
                  "examples": [
                    "Knock on the door and find out if they’re home."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}