{
  "word": "brawl",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Late Middle English braulen, brall, brallen (“to clamour, to shout; to quarrel; to boast”); further etymology is uncertain, but the word could be related to bray and ultimately imitative. It may be cognate with Danish bralle (“to chatter, jabber”), Dutch brallen (“to boast”), Low German brallen (“to brag”), Middle High German prālen (“to boast, flaunt”) (modern German prahlen (“to boast, flaunt, vaunt”)).",
        "The noun is derived from Middle English brall, bralle, braul, braule, brawle (“disturbance, squabble; brawl”), from the verb braulen: see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brawl (plural brawls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A disorderly argument or fight, usually with a large number of people involved.",
                  "examples": [
                    "Synonyms: row, scuffle, squabble; see also Thesaurus:dispute, Thesaurus:fight"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brawl (third-person singular simple present brawls, present participle brawling, simple past and past participle brawled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in a brawl; to fight or quarrel.",
                  "examples": [
                    "Synonyms: squabble, wrangle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To create a disturbance; to complain loudly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Especially of a rapid stream running over stones: to make a loud, confused noise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pour abuse on; to scold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from French branler (“to shake”), from Old French brandeler (“to shake, wave; to agitate”), from brand, branc (“blade of a sword”), from Vulgar Latin *brandus (“firebrand; flaming sword; sword”), ultimately from Proto-Indo-European *bʰrenu- (“to burn”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "brawl (third-person singular simple present brawls, present participle brawling, simple past and past participle brawled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To move to and fro, to quiver, to shake.",
                  "examples": [
                    "Synonyms: vibrate, waver"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French branle (“type of dance; an act of shaking, a shake”), from branler (“to shake”), from Old French brandeler (“to shake, wave; to agitate”); see further at etymology 2.",
        "Alternatively, the word could be derived from brawl (“(obsolete) to move to and fro, quiver, shake”): see etymology 2."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brawl (plural brawls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance, obsolete) A type of dance move or step.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance, music, historical) Alternative form of branle (“dance of French origin dating from the 16th century, performed by couples in a circle or a line; the music for this dance”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}