{
  "word": "pike",
  "etymologies": [
    {
      "description": [
        "From Middle English pyke, pyk, pik, pike (“pike; sharp point, iron tip of a staff or spear, pointed toe of an item of footwear; sharp tool; mountain, peak”), from Old English pīc (“pointed object, pick axe”), and Middle French pique (“long thrusting weapon”), from Old French pic (“sharp point, spike”); both ultimately from Proto-West Germanic *pīk, from Proto-Germanic *pīkaz, *pīkō (“sharp point, pike, peak”), related to pick with a narrower meaning.",
        "The word is cognate with Middle Dutch pecke, peke, picke (modern Dutch piek), German Pike, Norwegian pik, and possibly Old Irish pīk. It is a doublet of pique.",
        "The diving or gymnastics position is probably from tapered appearance of the body when the position is executed.",
        "The carnivorous freshwater fish is probably derived from the “sharp point, spike” senses, due to the fish’s pointed jaws.",
        "The verb sense “to quit or back out of a promise” may be from the sense of taking up pilgrim's staff or pike and leaving on a pilgrimage; and compare Middle English pī̆ken (“to go, remove oneself”) and Old Danish pikke af (“to go away”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pike (plural pikes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) A very long spear used two-handed by infantry soldiers for thrusting (not throwing), both for attacks on enemy foot soldiers and as a countermeasure against cavalry assaults.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp, pointed staff or implement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large haycock (“conical stack of hay left in a field to dry before adding to a haystack”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any carnivorous freshwater fish of the genus Esox, especially the northern pike, Esox lucius.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(diving, gymnastics) A position with the knees straight and a tight bend at the hips with the torso folded over the legs, usually part of a jack-knife. [from 1920s]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(fashion, dated) A pointy extrusion at the toe of a shoe.",
              "entries": [
                {
                  "meaning": "(historical) A style of shoes with pikes, popular in Europe in the 14th and 15th centuries.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Northern England) Especially in place names: a hill or mountain, particularly one with a sharp peak or summit.",
                  "examples": [
                    "Scafell Pike is the highest mountain in England."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pick, a pickaxe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Britain, dialectal) A hayfork.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, often euphemistic) A penis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pike (third-person singular simple present pikes, present participle piking, simple past and past participle piked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prod, attack, or injure someone with a pike.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, diving, gymnastics) To assume a pike position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, gambling) To bet or gamble with only small amounts of money.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Australia, New Zealand, slang) Often followed by on or out: to quit or back out of a promise.",
                  "examples": [
                    "Don’t pike on me like you did last time!"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Clipping of turnpike (“a toll road, especially a toll expressway; a spiked barrier across a road, originally used to block access to the road until toll had been paid”)",
        "Noun sense 2 (“gypsy, itinerant tramp, or traveller”) and verb sense 2 (“to depart, travel, especially to flee, run away”) may refer to someone frequently using turnpikes, or may be derived from Middle English pī̆ken (“to go, remove oneself”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pike (plural pikes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) Clipping of turnpike.",
                  "examples": [
                    "They tried out every idea that came down the pike.",
                    "There is heavy traffic on the Mass Pike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, ethnic slur, slang) A gypsy, itinerant tramp, or traveller from any ethnic background; a pikey.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pike (third-person singular simple present pikes, present participle piking, simple past and past participle piked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To equip with a turnpike.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete, Britain, thieves' cant) To depart or travel (as if by a turnpike), especially to flee, to run away.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}