{
  "word": "plug",
  "etymologies": [
    {
      "description": [
        "From Dutch plug, from Middle Dutch plugge (“peg, plug”), from Old Dutch *pluggi, from Proto-West Germanic *plugi. Further origin unknown. Possibly from Proto-Germanic *plugjaz, but the word seems originally restricted to northern continental West Germanic: compare German Low German Plüg, Norwegian plug (“peg, wedge”, probably borrowed from Middle Low German), German Pflock (“peg”, restricted to Central German and phonetically divergent). Possibly akin to Lithuanian plúkti (“to strike, hew”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plug (plural plugs)",
          "definitionGroups": [
            {
              "group": "(electricity) A pronged connecting device which fits into a mating socket, especially an electrical one.",
              "entries": [
                {
                  "meaning": "(loosely) An electric socket: wall plug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any piece of wood, metal, or other substance used to stop or fill a hole.",
                  "examples": [
                    "Synonyms: bung, dowel, stopper, stopple",
                    "Pull the plug out of the tub so it can drain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A flat oblong cake of pressed tobacco.",
                  "examples": [
                    "He preferred a plug of tobacco to loose chaw."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A high, tapering silk hat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A worthless horse.",
                  "examples": [
                    "Synonyms: (racing) bum, dobbin, hack, jade, nag",
                    "That sorry old plug is ready for the glue factory!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Any worn-out or useless article.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang) A book that fails to sell.",
                  "examples": [
                    "Stack all new and fresh, composed of the fast-selling standard books only — no old plugs or unsalable books whatever."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) A block of wood let into a wall to afford a hold for nails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A promotion (act of promoting) a product (such as a book, film or play) or other thing (concept, etc), for example during an interview or a commercial.",
                  "examples": [
                    "During the interview, the author put in a plug for his latest novel.",
                    "She used her tour of the zoo to work in another plug for conservation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A body of once molten rock that hardened in a volcanic vent. Usually round or oval in shape.",
                  "examples": [
                    "Pressure built beneath the plug in the caldera, eventually resulting in a catastrophic explosion of pyroclastic shrapnel and ash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A type of lure consisting of a rigid, buoyant or semi-buoyant body and one or more hooks.",
                  "examples": [
                    "The fisherman cast the plug into a likely pool, hoping to catch a whopper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) A small seedling grown in a tray from expanded polystyrene or polythene filled usually with a peat or compost substrate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(jewelry) A short cylindrical piece of jewellery commonly worn in larger-gauge body piercings, especially in the ear.",
                  "examples": [
                    "Synonym: earspool",
                    "Hyponym: earflare (Ancient Maya)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A drug dealer.",
                  "examples": [
                    "He saw me catch a trap and leave the house of a drug dealer. That's why he targeted me. He could have easily blown my ass off right then and there for lying, but for some reason he didn't. He just left. I biked back to my plug's spot and told him  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A branch from a water-pipe to supply a hose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A standard, modular fuselage component that can be added or removed.",
                  "examples": [
                    "Add front and aft closures to the fuselage midsection. Addition or subtraction of fuselage plugs, to a maximum of five rows, conveniently distributed on each side of wing, is possible."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plug (third-person singular simple present plugs, present participle plugging, simple past and past participle plugged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stop with a plug; to make tight by stopping a hole.",
                  "examples": [
                    "He attempted to plug the leaks with some caulk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To blatantly mention a particular product or service as if advertising it.",
                  "examples": [
                    "The main guest on the show just kept plugging his latest movie: it got so tiresome."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To persist or continue with something.",
                  "examples": [
                    "Keep plugging at the problem until you find a solution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shoot a bullet into something with a gun.",
                  "examples": [
                    "I am awfully glad that you kept your nerve and plugged him; it would have been better if you could have nailed him through the right shoulder, which would not have killed him..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To have sex with, penetrate sexually.",
                  "examples": [
                    "I’d love to plug him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To ingest a drug rectally",
                  "examples": [
                    "Synonym: boof"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}