{
  "word": "shear",
  "etymologies": [
    {
      "description": [
        "From Middle English sheren, scheren, from Old English sċieran (“to shear; to shave”), from Proto-West Germanic *skeran, from Proto-Germanic *skeraną, from Proto-Indo-European *(s)ker- (“to cut”).",
        "Cognate with West Frisian skarre, Low German scheren, Dutch scheren, German scheren, Danish skære, Norwegian Bokmål skjære, Norwegian Nynorsk skjera, Swedish skära; and (from Indo-European) with Ancient Greek κείρω (keírō, “I cut off”), Latin caro (“flesh”), Albanian shqerr (“to tear, cut”), harr (“to cut, to mow”),  Lithuanian skìrti (“separate”), Welsh ysgar (“separate”). See also sharp."
      ],
      "adjectives": [
        {
          "description": "shear",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of sheer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "shear (countable and uncountable, plural shears)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cutting tool similar to scissors, but often larger.",
                  "examples": [
                    "Synonym: shears"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metalworking) A large machine use for cutting sheet metal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of shearing, or something removed by shearing.",
                  "examples": [
                    "After the second shearing, he is a two-shear ram;  […]  at the expiration of another year, he is a three-shear ram; the name always taking its date from the time of shearing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) Forces that push in opposite directions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, meteorology) Wind shear, or an instance thereof.",
                  "examples": [
                    "We hit a nasty shear on approach and had to go around."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A transformation that displaces every point in a direction parallel to some given line by a distance proportional to the point’s distance from the line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) The response of a rock to deformation usually by compressive stress, resulting in particular textures.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shear (third-person singular simple present shears, present participle shearing, simple past sheared or shore, past participle shorn or sheared)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut, originally with a sword or other bladed weapon, now usually with shears, or as if using shears.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the fleece from a sheep etc. by clipping.",
                  "examples": [
                    "shear the llamas"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut the hair of (a person).",
                  "examples": [
                    "shear the afro off someone's head"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) To deform because of forces pushing in opposite directions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, meteorology, intransitive, of wind) To change in direction or speed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) To transform by displacing every point in a direction parallel to some given line by a distance proportional to the point’s distance from the line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining, intransitive) To make a vertical cut in coal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) To reap, as grain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To deprive of property; to fleece.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}