{
  "word": "interview",
  "etymologies": [
    {
      "description": [
        "From Old French entreveue (French entrevue), feminine singular past participle of entrevëoir, from entre- + vëoir (“to see”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "interview (plural interviews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An official face-to-face meeting of monarchs or other important figures. [16th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any face-to-face meeting, especially of an official or adversarial nature. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conversation in person (or, by extension, over the telephone, Internet etc.) between a journalist and someone whose opinion or statements he or she wishes to record for publication, broadcast etc. [from 19th c.]",
                  "examples": [
                    "The reporter gave the witness an interview."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A formal meeting, in person, for the assessment of a candidate or applicant. [from 20th c.]",
                  "examples": [
                    "It was a dreadful interview; I have no hope of getting the job."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An audition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A police interrogation of a suspect or party in an investigation. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "interview (third-person singular simple present interviews, present participle interviewing, simple past and past participle interviewed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ask questions of (somebody); to have an interview.",
                  "examples": [
                    "He interviewed the witness.",
                    "The witness was interviewed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be interviewed; to attend an interview.",
                  "examples": [
                    "When she interviewed with Microsoft in August, she overlooked a small cut in salary and asked about long-term career opportunities — and quality of life."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}