{
  "word": "dress",
  "etymologies": [
    {
      "description": [
        "The verb is from Middle English dressen, dresse (“to arrange, put in order”), from Anglo-Norman, Old French dresser, drecier (modern French dresser), from Late Latin *directiare, from Latin dīrēctus, the perfect passive participle of dīrigō (“to arrange in lines, direct, steer”), from dis- (prefix meaning ‘apart; asunder; in two’) + regō (“to govern, manage”), ultimately from Proto-Indo-European *h₃reǵ- (“straight, right”). Doublet of direct.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dress (countable and uncountable, plural dresses)",
          "definitionGroups": [
            {
              "group": "(countable)",
              "entries": [
                {
                  "meaning": "An item of clothing (usually worn by a woman or young girl) which both covers the upper part of the body and includes a skirt below the waist.",
                  "examples": [
                    "Amy and Mary looked very pretty in their dresses."
                  ]
                },
                {
                  "meaning": "(archaic) An item of outer clothing or set of such clothes (worn by people of all sexes) which is generally decorative and appropriate for a particular occasion, profession, etc.",
                  "examples": []
                },
                {
                  "meaning": "(film, television, theater) Ellipsis of dress rehearsal.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(uncountable)",
              "entries": [
                {
                  "meaning": "Apparel or clothing, especially when appropriate for a particular occasion, profession, etc.",
                  "examples": [
                    "military dress",
                    "He came to the party in formal dress."
                  ]
                },
                {
                  "meaning": "(archaic) The act of putting on clothes, especially fashionable ones, or for a particular (especially formal) occasion.",
                  "examples": []
                },
                {
                  "meaning": "(by extension)",
                  "examples": []
                },
                {
                  "meaning": "The external covering of an animal (for example, the feathers of a bird) or an object.",
                  "examples": []
                },
                {
                  "meaning": "The appearance of an object after it has undergone some process or treatment to fit or prepare it for use; finish.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) The external appearance of something, especially if intended to give a positive impression; garb, guise.",
                  "examples": []
                },
                {
                  "meaning": "(archaic, historical) The system of furrows on the face of a millstone.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) The act of applying a dressing to or otherwise treating a wound; also, the dressing so applied.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dress (third-person singular simple present dresses, present participle dressing, simple past dressed, past participle dressed or (obsolete) drest)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(also reflexive and figuratively) To put clothes (or, formerly, armour) on (oneself or someone, a doll, a mannequin, etc.); to clothe. [from 15th c.]",
                  "examples": [
                    "Synonyms: attire, don; see also Thesaurus:clothe",
                    "Antonyms: strip, undress; see also Thesaurus:undress",
                    "He was dressed in the latest fashions."
                  ]
                },
                {
                  "meaning": "(specifically) To attire (oneself or someone) for a particular (especially formal) occasion, or in a fashionable manner.",
                  "examples": []
                },
                {
                  "meaning": "To design, make, provide, or select clothes (for someone).",
                  "examples": [
                    "The fashion designer was proud to have dressed the queen for the charity event."
                  ]
                },
                {
                  "meaning": "To arrange or style (someone's hair).",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) To adorn or ornament (something). [from 15th c.]",
                  "examples": [
                    "It was time to dress the windows for Christmas again."
                  ]
                },
                {
                  "meaning": "To arrange a display of goods in, or to decorate (a shop or shop window).",
                  "examples": []
                },
                {
                  "meaning": "(nautical) To ornament (a ship) by hoisting the national colours at the peak and mastheads, and setting the jack forward; when \"dressed full\", the signal flags and pennants are added.",
                  "examples": []
                },
                {
                  "meaning": "To apply a dressing to or otherwise treat (a wound); (obsolete) to give (a wounded person) medical aid. [from 15th c.]",
                  "examples": [
                    "Synonyms: bandage, put a bandage on"
                  ]
                },
                {
                  "meaning": "To fit or prepare (something) for use; to render (something) suitable for an intended purpose; to get ready.",
                  "examples": [
                    "in mining and metallurgy, to dress ores by sorting and separating them"
                  ]
                },
                {
                  "meaning": "To prepare, treat, or curry (animal hide or leather).",
                  "examples": []
                },
                {
                  "meaning": "To prepare the surface of (a material, usually lumber or stone).",
                  "examples": []
                },
                {
                  "meaning": "(historical or England, regional) To remove chaff or impurities from (flour, grain, etc.) by bolting or sifting, winnowing, and other methods.",
                  "examples": []
                },
                {
                  "meaning": "(fishing) To prepare (an artificial fly) to be attached to a fish hook.",
                  "examples": []
                },
                {
                  "meaning": "(agriculture, horticulture) To cultivate or tend to (a garden, land, plants, etc.); especially, to add fertilizer or manure to (soil); to fertilize, to manure.",
                  "examples": []
                },
                {
                  "meaning": "(butchering) To cut up (an animal or its flesh) for food; specifically (hunting), to remove the internal organs (of a game animal) shortly after it has been killed so that the carcass cools more quickly; to field dress.",
                  "examples": []
                },
                {
                  "meaning": "(cooking) To prepare (food) for cooking or eating, especially by seasoning it; specifically, to add a dressing or sauce (to food, especially a salad). [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(film, television, theater)",
                  "examples": []
                },
                {
                  "meaning": "To design, make, or prepare costumes (for a play or other performance); also, to present (a production) in a particular costume style.",
                  "examples": []
                },
                {
                  "meaning": "To prepare (a set) by installing the props, scenery, etc.",
                  "examples": []
                },
                {
                  "meaning": "(military) To arrange (soldiers or troops) into proper formation; especially, to adjust (soldiers or troops) into straight lines and at a proper distance from each other; to align.",
                  "examples": [
                    "to dress the ranks"
                  ]
                },
                {
                  "meaning": "(Northern England, archaic) To treat (someone) in a particular manner; specifically, in an appropriate or fitting manner; (by extension, ironic) to give (someone) a deserved beating; also, to give (someone) a good scolding; to dress down.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To break in and train (a horse or other animal) for use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, intransitive, obsolete) To prepare (oneself); to make ready. [14th–16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To put on clothes.",
                  "examples": [
                    "Synonym: get dressed",
                    "Antonyms: disrobe, get undressed, strip, undress",
                    "I rose and dressed before daybreak.    It’s very cold out. Dress warm."
                  ]
                },
                {
                  "meaning": "(specifically) To attire oneself for a particular (especially formal) occasion, or in a fashionable manner.",
                  "examples": [
                    "They returned home early to dress for dinner."
                  ]
                },
                {
                  "meaning": "Of a thing: to attain a certain condition after undergoing some process or treatment to fit or prepare it for use.",
                  "examples": []
                },
                {
                  "meaning": "(euphemistic, chiefly in the tailoring context) To allow one's penis to fall to one side or the other within one's trousers. [from 20th c.]",
                  "examples": [
                    "While measuring him for his trousers, the tailor asked him if he dressed to the left or the right."
                  ]
                },
                {
                  "meaning": "(slang) Ellipsis of cross-dress.",
                  "examples": []
                },
                {
                  "meaning": "(butchering) Of an animal carcass: to have a certain quantity or weight after removal of the internal organs and skin; also, to have a certain appearance after being cut up and prepared for cooking.",
                  "examples": []
                },
                {
                  "meaning": "(military, sometimes imperative as a drill command) Of soldiers or troops: to arrange into proper formation; especially, to form into straight lines and at a proper distance from each other.",
                  "examples": [
                    "Right, dress!(literally, “Form a straight line, and align yourself to the right!”)"
                  ]
                },
                {
                  "meaning": "(sports) Of a sportsperson: to put on the uniform and have the equipment needed to play a sport.",
                  "examples": [
                    "Due to a left ankle sprain, the basketball player did not dress for the game against Indiana."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}