{
  "word": "dungeon",
  "etymologies": [
    {
      "description": [
        "From Middle English dongeoun, dongoun (“keep, dungeon, abyss”), from Old French donjon (“castle keep”), from Medieval Latin dungiō, from either Vulgar Latin *dominiō (from Latin dominium (“lordship; ownership”)) or Frankish *dungijā (“prison, dungeon, underground cellar”). The current sense may have been influenced by Middle English dung, dunge, dong, donge (“abyss”) or its etymon Old English dung (“a subterranean chamber; a prison; dungeon”).",
        "The Frankish word derives from Proto-Germanic *dungijǭ (“an enclosed space; a vault; bower; treasury”), from Proto-Indo-European *dʰengʰ- (“to cover”), and is related to the aforementioned Old English dung, Old Saxon dung (“underground cellar”), Middle Dutch donc (“underground basement”), Old High German tung (“underground cellar; an underground chamber or apartment for overwintering”) (whence German Tunk (“manure or soil covered basement, underground weaving workshop”)), Old Norse dyngja (“a detached apartment, a lady's bower”); whence Icelandic dyngja (“chamber”)). See also dung, dingle.",
        "The game term has been popularized by Dungeons & Dragons."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dungeon (plural dungeons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An underground prison or vault, typically built underneath a castle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The main tower of a motte or castle; a keep or donjon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A shrewd person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(games) An area inhabited by enemies, containing story objectives, treasure and bosses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM) A room dedicated to sadomasochistic sexual activity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dungeon (third-person singular simple present dungeons, present participle dungeoning, simple past and past participle dungeoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To imprison in a dungeon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}