{
  "word": "project",
  "etymologies": [
    {
      "description": [
        "From Latin prōiectus, perfect passive participle of prōiciō (“throw forth, extend; expel”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "project (plural projects)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A planned endeavor, usually with a specific goal and accomplished in several steps or stages.",
                  "examples": [
                    "projects of happiness devised by human reason"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural, US) An urban low-income housing building.",
                  "examples": [
                    "Projects like Pruitt-Igoe were considered irreparably dangerous and demolished."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) An idle scheme; an impracticable design.",
                  "examples": [
                    "a man given to projects"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, sports) a raw recruit who the team hopes will improve greatly with coaching; a long shot diamond in the rough",
                  "examples": [
                    "Sakho was seen as no-frills, whereas Maiga was a project who could develop into the next big thing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A projectile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A projection.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "project (third-person singular simple present projects, present participle projecting, simple past and past participle projected)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To extend beyond a surface.",
                  "examples": [
                    "Synonyms: extend, jut, protrude, stick out"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cast (an image or shadow) upon a surface; to throw or cast forward; to shoot forth.",
                  "examples": [
                    "Synonyms: cast, throw"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To extend (a protrusion or appendage) outward.",
                  "examples": [
                    "Synonyms: extend, jut, jut out"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make plans for; to forecast.",
                  "examples": [
                    "Synonyms: forecast, foresee, foretell"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, reflexive) To present (oneself), to convey a certain impression, usually in a good way.",
                  "examples": [
                    "It is difficult to gauge the exact point at which women stop trying to fool men and really begin to deceive themselves, but an objective analyst cannot escape the conclusion (1) that partly from a natural device inherent in the species, women deliberately project upon actual or potential suitors an impression of themselves that is not an accurate picture of their total nature, and (2) that few women ever are privileged to see themselves as they really are."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, psychology, psychoanalysis) To assume qualities or mindsets in others based on one's own personality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartography) To change the projection (or coordinate system) of spatial data with another projection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) To draw straight lines from a fixed point through every point of any body or figure, and let these fall upon a surface so as to form the points of a new figure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(neuroanatomy) (of a neuron or group of neurons) to have axon(s) extending to and therefore able to influence a remote location",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To speak or sing in such a way that one can be heard from a large distance away.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}