{
  "word": "steel",
  "etymologies": [
    {
      "description": [
        "From Middle English stele, stel, from Old English stīele, from Proto-West Germanic *stahlī (“something made of steel”), enlargement of *stahl (“steel”), from Proto-Germanic *stahlą, from *stah- or *stag- (“to be firm, rigid”), from Proto-Indo-European *stak- (“to stay, to be firm”) (compare Umbrian stakaz (“upright, erected”), Avestan 𐬯𐬙𐬀𐬑𐬭𐬀‎ (staxra, “strong”), Sanskrit स्तकति (stakati, “resist, strike against”)), related to Proto-Indo-European *steh₂- (“to stand”)."
      ],
      "adjectives": [
        {
          "description": "steel (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of steel.",
                  "examples": [
                    "Strained in stel ger on steedes of might."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Similar to steel in color, strength, or the like; steely.",
                  "examples": [
                    "Wher neuer cessing soyle doth steelebright stuff send out from mines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) Of or belonging to the manufacture or trade in steel.",
                  "examples": [
                    "East Chicago, Ind., a smoky Lake Michigan steel town that isn't exactly famous for its esthetic splendor even when the sun shines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, obsolete) Containing steel.",
                  "examples": [
                    "To mix some Sugar of steel, or steel wine with the first glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) Engraved on steel.",
                  "examples": [
                    "The best picture I have had yet is the steel frontis-piece to my new book."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "steel (countable and uncountable, plural steels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artificial metal produced from iron, harder and more elastic than elemental iron; used figuratively as a symbol of hardness.",
                  "examples": [
                    "Ocearium stæli."
                  ]
                }
              ]
            },
            {
              "group": "(countable) Any item made of this metal, particularly including:",
              "entries": [
                {
                  "meaning": "Bladed or pointed weapons, as swords, javelins, daggers.",
                  "examples": [
                    "For heom ne may halter ne bridel Bringe from here wode wyse, Ne mon mid stele ne mid ire."
                  ]
                },
                {
                  "meaning": "A piece used for striking sparks from flint.",
                  "examples": [
                    "Of ston mid stel in ðe tunder wel to brennen one ðis wunder."
                  ]
                },
                {
                  "meaning": "Armor.",
                  "examples": [
                    "Þai gun hem boþe armi In iren and stiel þat tide."
                  ]
                },
                {
                  "meaning": "A honing steel, a tool used to sharpen or hone metal blades.",
                  "examples": [
                    "The steill to scherp the schawing jrne."
                  ]
                },
                {
                  "meaning": "(sewing) Pieces used to strengthen, support, or expand an item of clothing.",
                  "examples": [
                    "I haue a ruffe is a quarter deep, measured by the yeard... You haue a pretty set too, how big is the steele you set with?"
                  ]
                },
                {
                  "meaning": "(dialectal) A flat iron.",
                  "examples": [
                    "One of them having occasion to use a Steele, smoothing Iron, or some such kinde of Laundry Instrument."
                  ]
                },
                {
                  "meaning": "(sewing, dialectal) A sewing needle; a knitting needle; a sharp metal stylus.",
                  "examples": [
                    "The threaded steel...Flies swiftly."
                  ]
                },
                {
                  "meaning": "(printing) An engraving plate:",
                  "examples": [
                    "A re-issue of the Examples of the Architecture of Venice. By John Ruskin... With the Text, and the 16 Plates (10 Steels and 6 Lithographs) as originally published."
                  ]
                },
                {
                  "meaning": "Projectiles.",
                  "examples": [
                    "The crews at the port batteries were pumping steel at the enemy."
                  ]
                },
                {
                  "meaning": "(sewing) A fringe of beads or decoration of this metal.",
                  "examples": [
                    "A trailing skirt embroidered in what is termed fine steel."
                  ]
                },
                {
                  "meaning": "(music, guitar) A type of slide used while playing the steel guitar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, medicine, obsolete) Medicinal consumption of this metal; chalybeate medicine; (eventually) any iron or iron-treated water consumed as a medical treatment.",
                  "examples": [
                    "A stronger physick is now necessary, perhaps a whole course of steel: A physick, God knowes, that this Kingdome hath been under five or six yeares."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Varieties of this metal.",
                  "examples": [
                    "The bars are exposed to two or three successive processes of cementation, and are hence said to be twice or thrice converted into steels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, colors) The gray hue of this metal; steel-gray, or steel blue.",
                  "examples": [
                    "Falkenhayn gave...to Jane a steel glacé silk dress."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Extreme hardness or resilience.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "steel (third-person singular simple present steels, present participle steeling, simple past and past participle steeled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To edge, cover, or point with steel.",
                  "examples": [
                    "Hure þolien ant a beoren hare unirude duntes wið mealles istelet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To harden or strengthen; to nerve or make obdurate; to fortify against.",
                  "examples": [
                    "But stil he was so steelde With heart so good, as victor he dead left them in the field."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, of mirrors) To back with steel.",
                  "examples": [
                    "Nay, a Crystall glasse will not show a man his face, except it be steeled, except it be darkned on the backside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, medicine, obsolete) To treat a liquid with steel for medicinal purposes.",
                  "examples": [
                    "She drunk her drink steeled, with which she was cured."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dialectal) To press with a flat iron.",
                  "examples": [
                    "Tha hasn't tha Sense to stile thy own Dressing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, uncommon) To cause to resemble steel in appearance.",
                  "examples": [
                    "And lo! those waters, steeled By breezeless air to smoothest polish, yield A vivid repetition of the stars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To steelify; to turn iron into steel.",
                  "examples": [
                    "By passing an electric current thus through the bars the operation of steeling is much hastened."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To electroplate an item, particularly an engraving plate, with a layer of iron.",
                  "examples": [
                    "My large dry-point,...called Two Stumps of Driftwood, gave 1000 copies (after being steeled) without perceptible wearing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sharpen with a honing steel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French Bastille (a French prison)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}