{
  "word": "ride",
  "etymologies": [
    {
      "description": [
        "From Middle English riden, from Old English rīdan, from Proto-West Germanic *rīdan, from Proto-Germanic *rīdaną, from Proto-Indo-European *Hreydʰ-, from Proto-Indo-European *h₃reyH-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ride (plural rides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of riding.",
                  "examples": [
                    "Can I have a ride on your bike?",
                    "We took the horses for an early-morning ride in the woods.",
                    "go for a quick ride"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A vehicle.",
                  "examples": [
                    "That's a nice ride; what did it cost?",
                    "pimp my ride"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amusement ridden at a fair or amusement park.",
                  "examples": [
                    "the kids went on all the rides"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lift given to someone in another person's vehicle.",
                  "examples": [
                    "Can you give me a ride home?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A road or avenue cut in a wood, for riding; a bridleway or other wide country path.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect, archaic) A saddle horse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland) A person (or sometimes a thing or a place) that is visually attractive.",
                  "examples": [
                    "Absolutely, and I agree about Madonna. An absolute ride *still*. :-) M."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) In jazz, a steady rhythmical style.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wild, bewildering experience of some duration.",
                  "examples": [
                    "That story was a ride from start to finish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An act of sexual intercourse",
                  "examples": [
                    "Synonyms: shag, fuck, cop, bang",
                    "I gave my boyfriend a ride before breakfast."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ride (third-person singular simple present rides, present participle riding, simple past rode or (obsolete) rade or (obsolete) rid, past participle ridden or (now colloquial and nonstandard) rode)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To transport oneself by sitting on and directing a horse, later also a bicycle etc. [from 8th c., transitive usage from 9th c.]",
                  "examples": [
                    "I ride to work every day and park the bike outside the office."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To be transported in a vehicle; to travel as a passenger. [from 9th c., transitive usage from 19th c.]",
                  "examples": [
                    "In an elaborately built, indoor San Francisco, passengers ride cable cars through quiet, hilly streets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal, chiefly US and South Africa) To transport (someone) in a vehicle. [from 17th c.]",
                  "examples": [
                    "The cab rode him downtown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a ship: to sail, to float on the water. [from 10th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To be carried or supported by something lightly and quickly; to travel in such a way, as though on horseback. [from 10th c.]",
                  "examples": [
                    "The witch cackled and rode away on her broomstick."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To traverse by riding.",
                  "examples": [
                    "Early women tobogganists rode the course in the requisite attire of their day: skirts. In spite of this hindrance, some women riders turned in very respectable performances."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey, as by riding; to make or do by riding.",
                  "examples": [
                    "How many races have you ridden this year?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To support a rider, as a horse; to move under the saddle.",
                  "examples": [
                    "A horse rides easy or hard, slow or fast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive, slang) To mount (someone) to have sex with them; to have sexual intercourse with. [from 13th c.]",
                  "examples": [
                    "She rode him hard, and he squeezed her breasts, and she came again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To nag or criticize; to annoy (someone). [from 19th c.]",
                  "examples": [
                    "“One old boy started riding me about not having gone to Vietnam; I just spit my coffee at him, and he backed off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of clothing: to gradually move (up) and crease; to ruckle. [from 19th c.]",
                  "examples": [
                    "In athletics, triple jumper Ashia Hansen advises a thong for training because, while knickers ride up, ‘thongs have nowhere left to go’: but in Beijing Britain's best are likely, she says, to forgo knickers altogether, preferring to go commando for their country under their GB kit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rely, depend (on). [from 20th c.]",
                  "examples": [
                    "With so much riding on the new payments system, it was thus a grave embarrassment to the government when the tariff for 2006-07 had to be withdrawn for amendments towards the end of February."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of clothing: to rest (in a given way on a part of the body). [from 20th c.]",
                  "examples": [
                    "She's wearing inky-blue jeans that ride low enough on her hips that her aquamarine thong peeks out teasingly at the back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(lacrosse) To play defense on the defensemen or midfielders, as an attackman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To manage insolently at will; to domineer over.",
                  "examples": [
                    "The nobility […]  could no longer endure to be ridden by bakers, coblers[sic], brewers, and the like."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surgery) To overlap (each other); said of bones or fractured fragments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(radio, television, transitive) To monitor (some component of an audiovisual signal) in order to keep it within acceptable bounds.",
                  "examples": [
                    "vocal riding"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) In jazz, to play in a steady rhythmical style.",
                  "examples": [
                    "The quintet in Propheticape muses out-of-measured-time until Holland leads it into swift, riding jazz."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}