{
  "word": "realize",
  "etymologies": [
    {
      "description": [
        "Attested since 1610, from French réaliser, from Middle French real (“actual”), from Old French reel, from Latin reālis, from rēs (“thing, event, deed, fact”); as if real +‎ -ize."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "realize (third-person singular simple present realizes, present participle realizing, simple past and past participle realized)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(formal, transitive) To make real; to convert from the imaginary or fictitious into reality; to bring into real existence",
                  "examples": [
                    "Synonyms: accomplish, actualize, materialize"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To become aware of (a fact or situation, especially of something that has been true for a long time).",
                  "examples": [
                    "Do you realize that everyone you know someday will die?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to seem real to other people.",
                  "examples": [
                    "Many coincidences  […]  soon begin to appear in them [Greek inscriptions] which realize ancient history to us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sense vividly or strongly; to make one's own in thought or experience.",
                  "examples": [
                    "Over the mind of the tourist, visiting the Old World for the first time,—countries where have transpired thrilling events recorded in history, what an immensity of thought and feeling sweeps! It was thus with Natalie; she could not realize that she was treading in the footsteps of royalty, who living in long past days, had held sway over this land, had looked upon this land of \"merrie England\" as their home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, business) To acquire as an actual possession; to obtain as the result of plans and efforts; to gain; to get",
                  "examples": [
                    "to realize large profits from a speculation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, business, finance) To convert any kind of property into money, especially property representing investments, such as shares, bonds, etc.",
                  "examples": [
                    "Profits from the investment can be realized at any time by selling the shares.",
                    "By realizing the company's assets, the liquidator was able to return most of the shareholders’ investments."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, business, obsolete) To convert into real property; to make real estate of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, linguistics) To turn an abstract linguistic object into actual language, especially said of a phoneme's conversion into speech sound.",
                  "examples": [
                    "The southern /v/ is realized as the voiced approximant [ʋ]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}