{
  "word": "vamp",
  "etymologies": [
    {
      "description": [
        "From Middle English vaumpe, vaum-pei, vampe (“covering for the foot, perhaps a slipper or understocking; upper of a boot or shoe”), or from Anglo-Norman vampe, *vaumpé (“part of a stocking covering the top of the foot”), from Old French avantpied, avantpiet, variants of avantpié, from avant (“in front”) + pié (“foot”).",
        "Noun senses 2 and 3 (“a patch; something patched up or improvised”) appear to have been extended from sense 1 (“top part of a boot or shoe”). Sense 4 (“repeated and often improvised musical accompaniment”) was probably derived from sense 3, and sense 5 (“activity to fill or stall for time”) from sense 4.",
        "The verb senses were derived from the noun. Compare also Middle English vaum-peien (“(uncertain) to repair (footwear) with a new upper or vamp; to fabricate an upper or vamp”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vamp (plural vamps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The top part of a boot or shoe, above the sole and welt and in front of the ankle seam, that covers the instep and toes; the front part of an upper; the analogous part of a stocking. [from c. 1225]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something added to give an old thing a new appearance.",
                  "examples": [
                    "Synonym: patch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something patched up, pieced together, improvised, or refurbished.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A repeated and often improvised accompaniment, usually consisting of one or two measures, often a single chord or simple chord progression, repeated as necessary, for example, to accommodate dialogue or to anticipate the entrance of a soloist. [from c. 1789]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) An activity or speech intended to fill or stall for time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vamp (third-person singular simple present vamps, present participle vamping, simple past and past participle vamped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To patch, repair, or refurbish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Often as vamp up: to fabricate or put together (something) from existing material, or by adding new material to something existing.",
                  "examples": [
                    "He has vamp'd an old speech, and the court to their sorrow, / Shall hear him harangue against Prior to morrow."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To cobble together, to extemporize, to improvise.",
              "entries": [
                {
                  "meaning": "(transitive, intransitive, music, specifically) To perform a vamp (“a repeated, often improvised accompaniment, for example, under dialogue or while waiting for a soloist to be ready”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, shoemaking) To attach a vamp (to footwear).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, now dialectal) To travel by foot; to walk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To delay or stall for time, as for an audience.",
                  "examples": [
                    "Keep vamping! Something’s wrong with the mic!",
                    "She went out there to vamp since the speaker was late arriving."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Clipping of vampire. From a character type developed first for silent film, notably for Theda Bara's role in the 1915 film A Fool There Was.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vamp (plural vamps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flirtatious, seductive woman, especially one who exploits men by using their sexual desire for her. [from c. 1915]",
                  "examples": [
                    "Synonyms: see Thesaurus:vamp"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A vampire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vamp (third-person singular simple present vamps, present participle vamping, simple past and past participle vamped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To seduce or exploit someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fiction, transitive) To turn into a vampire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Uncertain; possibly related to vamp (etymology 1, above): see the 2008 quotation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vamp (plural vamps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A volunteer firefighter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}