{
  "word": "corona",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Latin corōna (“crown; garland, wreath”), from Ancient Greek κορώνη (korṓnē, “type of crown; curved object (door handle, tip of a bow, stern of a ship, etc.)”), from Proto-Indo-European *(s)ker- (“to turn, bend”). The English word is a doublet of crown.",
        "The plural form coronae is borrowed from Latin corōnae.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "corona (plural coronas or coronae or (obsolete) coronæ)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large, round, pendent chandelier, with spikes around its upper rim to hold candles or lamps, usually hung from the roof of a church.",
                  "examples": [
                    "Synonym: corona lucis"
                  ]
                }
              ]
            },
            {
              "group": "(anatomy) An upper or crownlike portion of certain parts of the body.",
              "entries": [
                {
                  "meaning": "A region of the skull located along the coronal suture, at the junction between the frontal bone and the two parietal bones.",
                  "examples": []
                },
                {
                  "meaning": "The external (supragingival) portion of the tooth, covered by enamel; the crown.",
                  "examples": []
                },
                {
                  "meaning": "The circumference of the base of the glans penis in human males.",
                  "examples": [
                    "Synonyms: corona glandis penis, (by ellipsis) corona glandis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The large, flat, projecting member of a cornice which crowns the entablature, situated above the bed moulding and below the cymatium.",
                  "examples": [
                    "Synonyms: drip, larmier"
                  ]
                }
              ]
            },
            {
              "group": "(astronomy)",
              "entries": [
                {
                  "meaning": "The luminous plasma atmosphere of the Sun (the solar corona) or other star, extending millions of kilometres into space, most easily seen during a total solar eclipse.",
                  "examples": []
                },
                {
                  "meaning": "(also geology) An oval-shaped astrogeological feature, present on both the planet Venus and Uranus's moon Miranda, probably formed by upwellings of warm material below the surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any luminous or crownlike ring around an object or person.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(biology) Any appendage of an organism that resembles a crown or corona (sense 4.1).",
              "entries": [
                {
                  "meaning": "(botany) A ring or set of appendages of adaxial tissue arising from the corolla or the outer edge of the stamens, present in some plants (Narcissus, Passiflora, etc.); a paraperigonium.",
                  "examples": []
                },
                {
                  "meaning": "(zoology)",
                  "examples": []
                },
                {
                  "meaning": "An annular ciliated organ on the head of rotifers, used for locomotion and sweeping food into the mouth.",
                  "examples": []
                },
                {
                  "meaning": "The main body of the test of an echinoid, consisting of ambulacral and interambulacral areas.",
                  "examples": []
                },
                {
                  "meaning": "The crown of a crinoid, consisting of a cuplike central body (theca) and a set of arms.",
                  "examples": []
                },
                {
                  "meaning": "(virology) A fringe of large, bulbous surface projections on coronaviruses, formed by viral spike peplomers, creating an appearance reminiscent of the solar corona.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electricity) A luminous appearance caused by corona discharge, often seen as a bluish glow in the air adjacent to pointed metal conductors carrying high voltages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) A circle or set of circles visible around a bright celestial object, especially the Sun or the Moon, attributable to an optical phenomenon produced by the diffraction of its light by small water droplets or tiny ice crystals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mineralogy) A mineral zone, consisting of one or more minerals, which surrounds another mineral or lies at the interface of two minerals, typically in a radial arrangement; a reaction rim.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pathology) A manifestation of secondary syphilis, consisting of papular lesions along the hairline, often bordering the scalp in the manner of a crown.",
                  "examples": [
                    "Synonyms: corona veneris, crown of Venus"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Rome, historical) A crown or garland bestowed among the Romans as a reward for distinguished services.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "corona (third-person singular simple present coronas, present participle coronaing, simple past and past participle coronaed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To surround with a luminous or crownlike ring like the solar corona.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A clipping of coronavirus, ultimately from etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "corona (countable and uncountable, plural coronas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, also attributively) A coronavirus, especially SARS-CoV-2.",
                  "examples": [
                    "Synonym: (SARS-CoV-2, informal) rona",
                    "The recent surge of deaths due to corona reveals the shortcomings of our current healthcare system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, also attributively) A disease caused by a coronavirus, especially COVID-19.",
                  "examples": [
                    "She caught corona last week."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Italian corona."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "corona (plural coronas or corone)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetry) A series of sonnets linked together such that the last word of each is the first word of the next.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Spanish La Corona (literally “The Crown”), a brand of cigars from Havana, Cuba."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "corona (plural coronas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, straight-sided cigar with a blunt, rounded end.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}