{
  "word": "wink",
  "etymologies": [
    {
      "description": [
        "From Middle English winken (strong verb) and Middle English winken (weak verb), from Old English *wincan (strong verb) and wincian (“to wink, make a sign, close the eyes, blink”, weak verb), from Proto-Germanic *winkaną (“to move side to side, sway”), *winkōn (“to close one's eyes”), from Proto-Indo-European *weng- (“to bow, bend, arch, curve”). Cognate with Middle Low German winken (“to blink, wink”), German winken (“to nod, beckon, make a sign”). Related also to Saterland Frisian wäänke, Dutch wenken (“to beckon, motion”), Latin vacillare (“sway”), Lithuanian véngti (“to swerve, avoid”), Albanian vang (“tire, felloe”), Sanskrit वङ्गति (vaṅgati, “(he, she) limps”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wink (plural winks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of winking (a blinking of only one eye), or a message sent by winking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief period of sleep; especially forty winks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief time; an instant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The smallest possible amount.",
                  "examples": [
                    "It’s many’s the time I shot the selfsame rifiie before, and it’s many ’s the time after, but niver a wink of the same have I seen. 'T was the sight of a lifetime."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A subtle allusion.",
                  "examples": [
                    "The film includes a wink to wartime rationing."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wink (third-person singular simple present winks, present participle winking, simple past and past participle winked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To close one's eyes in sleep.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To close one's eyes.",
                  "examples": [
                    "I kept my eyes shut, after once glancing at him; and, I protest, I thought I saw him still, though I winked as close as ever I could."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Usually followed by at: to look the other way, to turn a blind eye.",
                  "examples": [
                    "Synonyms: (obsolete) connive, shut one's eyes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To close one's eyes quickly and involuntarily; to blink.",
                  "examples": [
                    "The pipes began to be puffed in a silence which had an air of severity; the more important customers, who drank spirits and sat nearest the fire, staring at each other as if a bet were depending on the first man who ‘’’winked’’’  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To blink with only one eye as a message, signal, or suggestion, usually with an implication of conspiracy. (When transitive, the object may be the eye being winked, or the message being conveyed.)",
                  "examples": [
                    "He winked at me. She winked her eye. He winked his assent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To gleam fitfully or intermitently; to twinkle; to flicker.",
                  "examples": [
                    "Down in the bottoms the sycamore and cottonwood are casting off their yellowing leaves; but the white oak will cling to her gorgeous finery till the blizzard comes shrieking up the gulch to wrest it from her, or until the winking prairie-fire leaps among her branches, and mounting upward to the highest limbs, finally leaves the vain beauty a blackened skeleton."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of tiddlywink."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wink (plural winks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tiddlywinks) Synonym of tiddlywink (“small disc used in the game of tiddlywinks”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of periwinkle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wink (plural winks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) Synonym of periwinkle",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}