{
  "word": "buncher",
  "etymologies": [
    {
      "description": [
        "From bunch +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buncher (plural bunchers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who bunches.",
                  "examples": [
                    "Often a buncher might come in a little early to have some work ready when rollers arrived. […] If a buncher ran short of tobacco, the rollers got more for her."
                  ]
                }
              ]
            },
            {
              "group": "Something that bunches or causes to bunch.",
              "entries": [
                {
                  "meaning": "(manufacturing) A machine that twists strands together during the manufacture of metal wire; a strander.",
                  "examples": [
                    "Stranded copper wire and cable are made on machines known as bunchers or stranders. Conventional bunchers are used for stranding small diameter wires (34 to 10 AWG)."
                  ]
                },
                {
                  "meaning": "(electronics, physics) A circuit that causes electrons or other charged particles in a particle beam to group together.",
                  "examples": [
                    "The pulse width can be decreased by means of a buncher, which consists of a longitudinal re-entrant cavity. The first electrons to reach the buncher are accelerated by a weaker longitudinal field than those that reach it at later times."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An illegitimate supplier of laboratory animals who obtains the animals by kidnapping pets or illegally trapping strays.",
                  "examples": [
                    "The undercover investigation of this facility has revealed that its proprietors were aware that some of the companion animals brought to the facility were stolen, and also revealed a list of over 50 “bunchers,” individuals who obtain animals and sell them to “random source” animal dealers. Bunchers have a variety of methods for obtaining companion animals, including responding to newspaper ads offering free animals, trespassing on private property to abduct the animals from yards, and house burglaries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, RAF, World War II) A ground-based radio transmitter, configured within a system to guide aircraft to their allocated airfields.",
                  "examples": [
                    "Each airfield had its own buncher which emitted a particular radio signal. Each plane had a radio compass so that when we flew toward the buncher, the compass would go straight up. When we flew over the buncher, it would point straight down."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}