{
  "word": "jubilee",
  "etymologies": [
    {
      "description": [
        "From Late Middle English jubile (“Old Testament practice of celebrating the end of a fifty-year period; (Roman Catholicism) year declared by the Pope for remission of sins; celebration of the fiftieth anniversary of an event; (figuratively) occasion of rejoicing”) [and other forms], from Middle French jubile, from Old French jubilee, jubileus (modern French jubilé), from Late Latin iūbilaeus (adjective, also treated as a noun), from Ancient Greek ἰωβηλαῖος (iōbēlaîos, “of a jubilee”), from ἰώβηλος (iṓbēlos, “jubilee”) + -ῐος (-ios, suffix meaning ‘of or pertaining to’ forming adjectives). Ἰώβηλος (Iṓbēlos) is either derived:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jubilee (countable and uncountable, plural jubilees)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Jewish history) A special year of emancipation supposed to be observed every fifty years, when farming was temporarily stopped, certain houses and land which had been sold could be redeemed by the original owners or their relatives, and Hebrew slaves set free. [from late 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, by extension)",
              "entries": [
                {
                  "meaning": "(Roman Catholicism) A special year (originally held every hundred years, then at more frequent intervals, and now declarable by the Pope at any time and also for periods less than a year) in which plenary indulgences and remission from sin can be granted upon making a pilgrimage to Rome or other designated churches. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "A major anniversary of an event, particularly the fiftieth (50th) anniversary of a coronation or marriage. [from late 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "(countable) A time for release or restitution. [from late 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(countable) A time of celebration or rejoicing. [from late 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) Exultation, rejoicing; jubilation. [from early 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) The sound of celebration or rejoicing; shouts of joy. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(countable, African-American Vernacular, music, often attributively) A joyful African-American (usually Christian) folk song. [from late 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, obsolete)",
              "entries": [
                {
                  "meaning": "A period of fifty years; a half-century. [17th–18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(rare) A fiftieth year. [17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}