{
  "word": "cuck",
  "etymologies": [
    {
      "description": [
        "Clipping of cuckold.  The sense of weakling, race traitor, etc. apparently originated on 4chan in 2014 and migrated to Reddit soon after."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cuck (plural cucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A cuckold or (uncommon) cuckquean.",
                  "examples": [
                    "Not the Horn-Plague, but something worse, Had drove the frighted Cucks from thence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang) A weakling.",
                  "examples": [
                    "That journo is such a beta cuck, she even swears by the Oxford comma."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang) One who meekly and submissively acts against their own interests, or those of their own race, gender, class, religion, etc.",
                  "examples": [
                    "The feel-good petition was only supported by cucks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cuck (third-person singular simple present cucks, present participle cucking, simple past and past participle cucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To cuckold, to be sexually unfaithful towards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To turn into a cuckold or cuckquean, to cheat with the partner of (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive, derogatory) To weaken or emasculate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive, derogatory) To fool and thus lower the status of, to exploit the trust or tolerance of (to one's own benefit and the other's disadvantage); to make into a cuck (one who acts against their own interests).",
                  "examples": [
                    "It’s redolent of the way establishment conservatives lost the culture war in the first place, by bowing to the opposition, allowing others to play them for fools, and contenting themselves with the occasional scraps thrown to them by progressive elites. I said “cucked by Zuck” earlier, but in reality, they were cucked a long time ago and by their enemies in the Democratic Party and liberal media."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Back-formation from cucking stool."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "cuck (third-person singular simple present cucks, present participle cucking, simple past and past participle cucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To punish (someone) by putting them in a cucking stool.",
                  "examples": [
                    "Follow the law, and you can cucke mee, spare not."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}