{
  "word": "depose",
  "etymologies": [
    {
      "description": [
        "Recorded since c.1300, from Middle English, from Old French deposer, from de- (“down”) + poser (“to put, place”). Deposition (1494 in the legal sense) belongs to deposit, but that related word and depose became thoroughly confused."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "depose (third-person singular simple present deposes, present participle deposing, simple past and past participle deposed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literally, transitive) To put down; to lay down; to deposit; to lay aside; to put away.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove (a leader) from (high) office, without killing the incumbent.",
                  "examples": [
                    "A deposed monarch may go into exile as pretender to the lost throne, hoping to be restored in a subsequent revolution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, intransitive) To give evidence or testimony, especially in response to interrogation during a deposition",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, transitive) To interrogate and elicit testimony from during a deposition; typically done by a lawyer.",
                  "examples": [
                    "After we deposed the claimant we had enough evidence to avoid a trial."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take or swear an oath.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To testify; to bear witness; to claim; to assert; to affirm.",
                  "examples": [
                    "to depose the yearly rent or valuation of lands"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}