{
  "word": "fly",
  "etymologies": [
    {
      "description": [
        "From Middle English flye, flie, from Old English flȳġe, flēoge (“a fly”), from Proto-Germanic *fleugǭ (“a fly”), from Proto-Indo-European *plewk- (“to fly”). Cognate with Scots flee, Saterland Frisian Fljooge, Dutch vlieg, German Low German Fleeg, German Fliege, Danish flue, Norwegian Bokmål flue, Norwegian Nynorsk fluge, Swedish fluga, Icelandic fluga."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fly (plural flies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Any insect of the order Diptera; characterized by having two wings (except for some wingless species), also called true flies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(non-technical) Especially, any of the insects of the family Muscidae, such as the common housefly (other families of Diptera include mosquitoes and midges).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any similar, but not closely related insect, such as a dragonfly or butterfly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A lightweight fishing lure resembling an insect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weightlifting) A chest exercise performed by moving extended arms from the sides to in front of the chest. (also flye)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(swimming) The butterfly stroke (plural is normally flys).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A witch's familiar.",
                  "examples": [
                    "a trifling fly, none of your great familiars"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A parasite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(preceded by definite article) A simple dance in which the hands are shaken in the air, popular in the 1960s.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A butterfly (combination of four options).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English flien, from Old English flēogan, from Proto-Germanic *fleuganą (compare Saterland Frisian fljooge, Dutch vliegen, Low German flegen, German fliegen, Danish flyve, Norwegian Nynorsk flyga), from Proto-Indo-European *plewk- (*plew-k-, “to fly”) (compare Lithuanian plaũkti ‘to swim’), enlargement of *plew- (“flow”). More at flee and flow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fly (plural flys or flies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The action of flying; flight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of flying.",
                  "examples": [
                    "There was a good wind, so I decided to give the kite a fly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A fly ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) Short for fly route.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of canvas that covers the opening at the front of a tent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India, obsolete) The sloping or roof part of the canvas of a tent.",
                  "examples": [
                    "[T]he main part of the operation of pitching the tent, consisting of raising the flies, may be performed, and shelter afforded, without the walls, &c., being present."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often plural) A strip of material (sometimes hiding zippers or buttons) at the front of a pair of trousers, pants, underpants, bootees, etc.",
                  "examples": [
                    "Ha-ha! Your flies are undone!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The free edge of a flag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The horizontal length of a flag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weightlifting) An exercise that involves wide opening and closing of the arms perpendicular to the shoulders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a vane pointing the direction from which the wind blows.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) That part of a compass on which the points are marked; the compass card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Two or more vanes set on a revolving axis, to act as a fanner, or to equalize or impede the motion of machinery by the resistance of the air, as in the striking part of a clock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for flywheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A type of small, light, fast horse-drawn carriage that can be hired for transportation (sometimes pluralised flys).",
                  "examples": [
                    "Can I get a fly, or a carriage of any kind? Is it too late?",
                    "I dismissed the fly a mile distant from the park, and getting my directions from the driver, proceeded by myself to the house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a knitting machine, the piece hinged to the needle, which holds the engaged loop in position while the needle is penetrating another loop; a latch..",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The pair of arms revolving around the bobbin, in a spinning wheel or spinning frame, to twist the yarn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving) A shuttle driven through the shed by a blow or jerk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) The person who took the printed sheets from the press.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) A vibrating frame with fingers, attached to a power printing press for doing the same work.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the upper screens of a stage in a theatre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cotton manufacture) waste cotton",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fly (third-person singular simple present flies, present participle flying, simple past flew, past participle flown)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel through the air, another gas, or a vacuum, without being in contact with a grounded surface.",
                  "examples": [
                    "Birds of passage fly to warmer regions as it gets colder in winter.",
                    "The Concorde flew from Paris to New York faster than any other passenger airplane.",
                    "It takes about eleven hours to fly from Frankfurt to Hong Kong.",
                    "The little fairy flew home on the back of her friend, the giant eagle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, archaic, poetic) To flee, to escape (from).",
                  "examples": [
                    "Fly, my lord! The enemy are upon us!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ergative) To cause to fly (travel or float in the air): to transport via air or the like.",
                  "examples": [
                    "Charles Lindbergh flew his airplane The Spirit of St. Louis across the Atlantic ocean.",
                    "Why don’t you go outside and fly kites, kids? The wind is just perfect.",
                    "Birds fly their prey to their nest to feed it to their young.",
                    "Each day the postal service flies thousands of letters around the globe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel or proceed very fast; to hasten.",
                  "examples": [
                    "He flew down the hill on his bicycle.",
                    "It's five o'clock already. Doesn't time fly?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move suddenly, or with violence; to do an act suddenly or swiftly.",
                  "examples": [
                    "a door flies open",
                    "a bomb flies apart"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To proceed with great success.",
                  "examples": [
                    "His career is really flying at the moment.",
                    "One moment the company was flying high, the next it was on its knees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial, of a proposal, project or idea) To be accepted, come about or work out.",
                  "examples": [
                    "Let's see if that idea flies.",
                    "You know, I just don't think that's going to fly. Why don't you spend your time on something better?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ergative) To display (a flag) on a flagpole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hunt with a hawk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, entomology, of a type of moth or butterfly) To be in the winged adult stage.",
                  "examples": [
                    "This species flies from late summer until frost."
                  ]
                }
              ]
            }
          ]
        },
        {
          "description": "fly (third-person singular simple present flies, present participle flying, simple past and past participle flied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, baseball) To hit a fly ball; to hit a fly ball that is caught for an out. Compare ground (verb) and line (verb).",
                  "examples": [
                    "Jones flied to right in his last at-bat."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; probably from the verb or noun."
      ],
      "adjectives": [
        {
          "description": "fly (comparative flier, superlative fliest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) Quick-witted, alert, mentally sharp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Well dressed, smart in appearance; in style, cool.",
                  "examples": [
                    "He's pretty fly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Beautiful; displaying physical beauty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Related to German Flügel (“a wing”), Dutch vleugel (“a wing”), Swedish flygel (“a wing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fly (plural flies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rural, Scotland, Northern England) A wing.",
                  "examples": [
                    "The bullet barely grazed the wild fowl's fly."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}