{
  "word": "prefer",
  "etymologies": [
    {
      "description": [
        "From Middle English preferren, from Anglo-Norman preferer and Old French preferer, from Latin praeferō, praeferre. Displaced native Middle English foresettan and foreberan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "prefer (third-person singular simple present prefers, present participle preferring, simple past and past participle preferred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be in the habit of choosing something rather than something else; to favor; to like better. [from 14th c.]",
                  "examples": [
                    "I prefer tea to coffee.",
                    "I'd prefer it if you didn't do it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now dated) To advance, promote (someone or something). [from 14th c.]",
                  "examples": [
                    "[…]  she was one of my Master’s Captives. For this Reason, I presume, it was, that she took so much Compassion upon me; considering herself a Slave in a strange Country, and only preferr’d to my Master’s Bed by Courtesy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To present or submit (something) to an authority (now usually in \"to prefer charges\"). [from 16th c.]",
                  "examples": [
                    "At length the Maroons, who were delighted to have him with them, became discontented with his absence, and for several years, during the sessions of the House of Assembly, preferred repeated complaints against him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To put forward for acceptance; to introduce, recommend (to). [16th–19th c.]",
                  "examples": [
                    "one Master David Hume, who making some use of his purse, gave him Letters to his friends in Scotland to preferre him to King Iames."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}