{
  "word": "novum",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin novum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "novum (countable and uncountable, plural novums or nova)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A new feature, a novelty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(narratology, science fiction) An innovation which is fictional, but, following the logic of cognitive estrangement (characteristic of science fiction), is afforded plausibility by the assumption that the fictional setting is scientifically consistent.",
                  "examples": [
                    "In his book Metamorphoses of Science Fiction (1979), Suvin introduced a number of ideas that remain central in sf criticism: cognitive estrangement, the novum and sf's genetic link with utopia. […] Even more influential in sf theory than cognitive estrangement is Suvin's concept of the novum. […] Suvin adopts the concept of the novum from the work of Ernst Bloch, for whom the term refers to those concrete innovations of lived history that awaken human collective consciousness out of a static present to awareness that history can be changed. The novum thus inspires hope for positive historical transformations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) A game of dice, properly called novem quinque, the two principal throws being nine and five.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}