{
  "word": "meat",
  "etymologies": [
    {
      "description": [
        "From Middle English mete, from Old English mete (“food”), from Proto-West Germanic *mati, from Proto-Germanic *matiz (“food”), from Proto-Indo-European *meh₂d- (“to drip, ooze; grease, fat”). Cognate with West Frisian mete, Old Saxon meti, Old High German maz (“food”), Icelandic matur, Gothic 𐌼𐌰𐍄𐍃 (mats).",
        "A -ja- derivation from the same base is found in Middle Dutch and Middle Low German met (“lean pork”), from which Dutch met (“minced pork”) and German Mett (“minced meat”) derive, respectively. Compare also Old Irish mess (“animal feed”) and Welsh mes (“acorns”), English mast (“fodder for swine and other animals”), which are probably from the same root."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "meat (countable and uncountable, plural meats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The flesh (muscle tissue) of an animal used as food. [from 14th c.]",
                  "examples": [
                    "A large portion of domestic meat production comes from animals raised on factory farms.",
                    "The homesteading teenager shot a deer to supply his family with wild meat for the winter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A type of meat, by anatomic position and provenance. [from 16th c.]",
                  "examples": [
                    "The butchery's profit rate on various meats varies greatly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic, dialectal) Food, for animals or humans, especially solid food. See also meat and drink. [from 8th c.]",
                  "examples": [
                    "As full of fun and frolic as an egg is full of meat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A type of food, a dish. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A meal. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Meal; flour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Any relatively thick, solid part of a fruit, nut etc. [from 15th c.]",
                  "examples": [
                    "The apple looked fine on the outside, but the meat was not very firm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A penis. [from 16th c.]",
                  "examples": [
                    "He sits me on the floor (the shower is still beating down on us). He lays me down and slides his huge meat into me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) The best or most substantial part of something. [from 16th c.]",
                  "examples": [
                    "We recruited him right from the meat of our competitor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The sweet spot of a bat or club (in cricket, golf, baseball etc.). [from 20th c.]",
                  "examples": [
                    "He hit it right on the meat of the bat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A meathead.",
                  "examples": [
                    "Throw it in here, meat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian Aboriginal) A totem, or (by metonymy) a clan or clansman which uses it.",
                  "examples": [
                    "When a stranger comes to an aboriginal camp or settlement in north-western NSW, he is asked by one of the older aborigines: \"What meat (clan) are you?\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}