{
  "word": "disappoint",
  "etymologies": [
    {
      "description": [
        "From Middle French desapointer (compare French désappointer); From dis- +‎ appoint."
      ],
      "adjectives": [
        {
          "description": "disappoint (comparative more disappoint, superlative most disappoint)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang) disappointed",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "disappoint (third-person singular simple present disappoints, present participle disappointing, simple past and past participle disappointed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sadden or displease (someone) by underperforming, or by not delivering something promised or hoped for.",
                  "examples": [
                    "His lack of respect disappointed her.",
                    "I was disappointed by last year’s revenue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deprive (someone of something expected or hoped for).",
                  "examples": [
                    "They that haue money in their purse, are afrayde and in doubte, yea and are continuallye martyred with feare, leaste GOD should disappoint them of their pray, and abate their portion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To fail to meet (an expectation); to fail to fulfil (a hope).",
                  "examples": [
                    "It is not uncommon for those who at their first entrance into the world were distinguished for eminent attainments or superior abilities, to disappoint the hopes which they had raised, and to end in neglect and obscurity that life which they began in celebrity and honour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To show (an opinion, belief, etc.) to be mistaken.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To prevent (something planned or attempted).",
                  "examples": [
                    "Synonyms: frustrate, thwart"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}