{
  "word": "guide",
  "etymologies": [
    {
      "description": [
        "c. 1325–75. From Middle English guide, from the Old French guide, from Old Occitan guida, from guidar, from Frankish *wītan (“to show the way, lead”), from Proto-Germanic *wītaną (“to see, know; go, depart”), from Proto-Indo-European *weyd- (“to see, know”). Cognate with Old English wītan (“to see, take heed to, watch after, guard, keep”). Related also to English wit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "guide (plural guides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who guides, especially someone hired to show people around a place or an institution and offer information and explanation, or to lead them through dangerous terrain.",
                  "examples": [
                    "The guide led us around the museum and explained the exhibits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A document or book that offers information or instruction; guidebook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sign that guides people; guidepost.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any marking or object that catches the eye to provide quick reference.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A device that guides part of a machine, or guides motion or action.",
              "entries": [
                {
                  "meaning": "A blade or channel for directing the flow of water to the buckets in a water wheel.",
                  "examples": []
                },
                {
                  "meaning": "A grooved director for a probe or knife in surgery.",
                  "examples": []
                },
                {
                  "meaning": "(printing, dated) A strip or device to direct the compositor's eye to the line of copy being set.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(occult) A spirit believed to speak through a medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A member of a group marching in formation who sets the pattern of movement or alignment for the rest.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English guiden, from Old French guider, from Old Occitan guidar, from Frankish *wītan (“to show the way, lead”), from Proto-Germanic *wītaną (“to see, know; go, depart”), from Proto-Indo-European *weyd- (“to see, know”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "guide (third-person singular simple present guides, present participle guiding, simple past and past participle guided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to serve as a guide for someone or something; to lead or direct in a way; to conduct in a course or path.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to steer or navigate, especially a ship or as a pilot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to exert control or influence over someone or something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to supervise the education or training of someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) to act as a guide.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}