{
  "word": "espy",
  "etymologies": [
    {
      "description": [
        "From Middle English aspien, espien (“to make covert observations of (a person or place) with hostile intent, to spy on; to seek to discover by spying; to act as a spy; to catch sight of, see; to look over, observe; to wait in ambush, to ambush; to plot against; to look for, seek to find; to inquire or look into, investigate; to discover, find”) [and other forms], from Old French espier (“to watch”) (modern French épier (“to keep an eye on, watch; to spy on; (dated) to watch for”)), from Vulgar Latin *spiāre, from Frankish *spehōn (“to look, peer; to spy”), from Proto-Germanic *spehōną (“to look, peer; to spy”), from Proto-Indo-European *speḱ- (“to look, observe, see”). Doublet of spy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "espy (third-person singular simple present espies, present participle espying, simple past and past participle espied)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To find out or observe (someone or something, especially if not easy to see) by spying or looking; to catch sight of; to see; to spot.",
                  "examples": [
                    "Synonyms: descry, discern, discover; see also Thesaurus:spot",
                    "to espy land    to espy a man in a crowd"
                  ]
                },
                {
                  "meaning": "To see (someone or something) without foreplanning or unexpectedly.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To observe (someone or something) as a spy; also, to examine or observe (someone or something) carefully; or to look out or watch for.",
                  "examples": []
                },
                {
                  "meaning": "To become aware of (a fact, information, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To observe as a spy, to spy; also, to examine or observe carefully; or to look out or watch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English aspie, espie (“covert investigation or observation, scouting, spying; information obtained through spying; secret and treacherous plan, plot; treachery; a scout or spy”) [and other forms],\nfrom Anglo-Norman espie, Old French espie, from espier (verb): see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "espy (countable and uncountable, plural espies) (obsolete)",
          "definitionGroups": [
            {
              "group": "(countable)",
              "entries": [
                {
                  "meaning": "An act of finding out or observing by spying or looking; an espial or espying.",
                  "examples": []
                },
                {
                  "meaning": "A scout or spy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act or process of learning secret information through clandestine means; espionage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}