{
  "word": "jar",
  "etymologies": [
    {
      "description": [
        "From Middle English jarre (“jar”), from Medieval Latin jarra, or from Middle French jarre (“liquid measure”) (from Old French jare; modern French jarre (“earthenware jar”)), or from Spanish jarra, jarro (“jug, pitcher; mug, stein”), all from Arabic جَرَّة‎ (jarra, “earthen receptacle”).",
        "The word is cognate with Italian giara (“jar; crock”), Occitan jarro, Portuguese jarra, jarro (“jug; ewer, pitcher”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jar (plural jars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally) An earthenware container, either with two or no handles, for holding oil, water, wine, etc., or used for burial. [from late 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, approximately cylindrical container, normally made of clay or glass, for holding fruit, preserves, etc., or for ornamental purposes.",
                  "examples": [
                    "Synonyms: cruse, pot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A jar and its contents; as much as fills such a container; a jarful.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Ireland, colloquial) A pint glass",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Ireland, colloquial, metonymically) A glass of beer or cider, served by the pint.",
                  "examples": [
                    "2013 March 15,  “The Shopping Trolley”, in  Horsing Around‎[1], performed by Richie Kavanagh:About a shopping trolley, I thought I'd let ye know. Ya'd try to push it straight but it never seems ta go. Ya'd wobble through the car park, hopping off the cars. Anyone would think ya had a few auld jars."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jar (third-person singular simple present jars, present participle jarring, simple past and past participle jarred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To preserve (food) in a jar.",
                  "examples": [
                    "Synonym: bottle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From earlier jar, jur, jarre, jurre, of uncertain origin. Possibly from earlier *char, *chur, *charre, *churre (now spelt chirr, churr (“to make a sound”); compare also nightjar and its variant nightchurr), from Middle English *chirren, *cherren, *churren (“to sound, cry, murmur, complain”), from Old English ċeorian (“to murmur, gripe, complain with just cause”), from Proto-West Germanic *karēn (“to complain”). For the change of ch to j, compare also charm, jarm (“chirping”); achar, ajar (“slightly turned or open”), chaw, jaw, etc. The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jar (countable and uncountable, plural jars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A clashing or discordant set of sounds, particularly with a quivering or vibrating quality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, also figuratively) A quivering or vibrating movement or sensation resulting from something being shaken or struck.",
                  "examples": [
                    "Synonym: jolt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, by extension) A sense of alarm or dismay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The effect of something contradictory or discordant; a clash.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, now rare) A disagreement, a dispute, a quarrel; (uncountable) contention, discord; quarrelling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jar (third-person singular simple present jars, present participle jarring, simple past and past participle jarred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To knock, shake, or strike sharply, especially causing a quivering or vibrating movement.",
                  "examples": [
                    "He hit it with a hammer, hoping he could jar it loose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To harm or injure by such action.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To shock or surprise.",
                  "examples": [
                    "I think the accident jarred him, as he hasn’t got back in a car since."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To act in disagreement or opposition, to clash, to be at odds with; to interfere; to dispute, to quarrel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To (cause something to) give forth a rudely tremulous or quivering sound; to (cause something to) sound discordantly or harshly.",
                  "examples": [
                    "The clashing notes jarred on my ears."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To quiver or vibrate due to being shaken or struck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) Of the appearance, form, style, etc., of people and things: to look strangely different; to stand out awkwardly from its surroundings; to be incongruent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}