{
  "word": "confection",
  "etymologies": [
    {
      "description": [
        "From Middle English confescioun, borrowed from Old French confeccion (French confection), borrowed from Latin cōnfectiōnem, from confectus, past participle of conficere (“prepare”), from com- (“with”) + facere (“to make, do”). Originally \"the making by means of ingredients\"; sense of \"candy or light pastry\" predominant since 1500s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "confection (plural confections)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A food item prepared very sweet, frequently decorated in fine detail, and often preserved with sugar, such as a candy, sweetmeat, fruit preserve, pastry, or cake.",
                  "examples": [
                    "The table was covered with all sorts of tempting confections."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or process of confecting; the process of making, compounding, or preparing something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The result of such a process; something made up or confected; a concoction.",
                  "examples": [
                    "The defense attorney maintained that the charges were a confection of the local police."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) An artistic, musical, or literary work taken as frivolous, amusing, or contrived; a composition of a light nature.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Something, such as a garment or a decoration, that is very elaborate, delicate, or luxurious, usually also impractical or non-utilitarian.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pharmacology) A preparation of medicine sweetened with sugar, honey, syrup, or the like; an electuary.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "confection (third-person singular simple present confections, present participle confectioning, simple past and past participle confectioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make into a confection, prepare as a confection.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}