{
  "word": "drape",
  "etymologies": [
    {
      "description": [
        "From Middle English drape (“a drape”, noun), from Old French draper (“to drape; to full cloth”), from drap (“cloth, drabcloth”), from Late Latin drappus, drapus (“drabcloth, kerchief”), a word first recorded in the Capitularies of Charlemagne, probably from Frankish *drapi, *drāpi (“that which is fulled, drabcloth”, literally “that which is struck or for striking”), from Proto-Germanic *drapiz (“a strike, hit, blow”) and Proto-Germanic *drēpiz (“intended for striking, to be beaten”), both from *drepaną (“to beat, strike”), from Proto-Indo-European *dʰreb- (“to beat, crush, make or become thick”). Cognate with English drub (“to beat”), North Frisian dreep (“a blow”), Low German drapen, dräpen (“to strike”), German treffen (“to meet”), Swedish dräpa (“to slay”). More at drub."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drape (plural drapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A curtain; a drapery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textiles) The way in which fabric falls or hangs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A member of a youth subculture distinguished by its sharp dress, especially peg-leg pants (1950s: e.g. Baltimore, MD). Antonym: square.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dress made from an entire piece of cloth, without having pieces cut away as in a fitted garment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "drape (third-person singular simple present drapes, present participle draping, simple past and past participle draped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or adorn with drapery or folds of cloth, or as with drapery.",
                  "examples": [
                    "to drape a bust, a building, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spread over, cover.",
                  "examples": [
                    "I draped my towel over the radiator to dry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To rail at; to banter.",
                  "examples": [
                    "At my Arrival , the King asked me many questions about my Journey, about the Congress, draping us for spending him so money"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make cloth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To design drapery, arrange its folds, etc., as for hangings, costumes, statues, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hang or rest limply.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}