{
  "word": "meet",
  "etymologies": [
    {
      "description": [
        "From Middle English meten, from Old English mētan (“to meet, find, encounter”), from Proto-West Germanic *mōtijan (“to meet”), from Proto-Germanic *mōtijaną (“to meet”), from Proto-Indo-European *meh₂d- (“to come, meet”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "meet (plural meets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A sports competition, especially for track and field or swimming.",
                  "examples": [
                    "track meet",
                    "swim meet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting) A gathering of riders, horses and hounds for foxhunting; a field meet for hunting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A meeting of two trains in opposite directions on a single track, when one is put into a siding to let the other cross.",
                  "examples": [
                    "Antonym: pass"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A meeting.",
                  "examples": [
                    "OK, let's arrange a meet with Tyler and ask him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(algebra) The greatest lower bound, an operation between pairs of elements in a lattice, denoted by the symbol ∧.",
                  "examples": [
                    "Antonym: join"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "meet (third-person singular simple present meets, present participle meeting, simple past and past participle met)",
          "definitionGroups": [
            {
              "group": "To make contact (with) while in proximity.",
              "entries": [
                {
                  "meaning": "To come face to face with by accident; to encounter.",
                  "examples": [
                    "Fancy meeting you here! Guess who I met at the supermarket today?"
                  ]
                },
                {
                  "meaning": "To come face to face with someone by arrangement.",
                  "examples": [
                    "Let's meet at the station at 9 o'clock."
                  ]
                },
                {
                  "meaning": "To get acquainted with someone.",
                  "examples": [
                    "I'm pleased to meet you! I'd like you to meet a colleague of mine.",
                    "I met my husband through a mutual friend at a party. It wasn't love at first sight; in fact, we couldn't stand each other at first!"
                  ]
                }
              ]
            },
            {
              "group": "(Of groups) To come together.",
              "entries": [
                {
                  "meaning": "To gather for a formal or social discussion; to hold a meeting.",
                  "examples": [
                    "I met with them several times. The government ministers met today to start the negotiations."
                  ]
                },
                {
                  "meaning": "To come together in conflict.",
                  "examples": []
                },
                {
                  "meaning": "(sports) To play a match.",
                  "examples": [
                    "England and Holland will meet in the final."
                  ]
                }
              ]
            },
            {
              "group": "To make physical or perceptual contact.",
              "entries": [
                {
                  "meaning": "To converge and finally touch or intersect.",
                  "examples": [
                    "The two streets meet at a crossroad half a mile away."
                  ]
                },
                {
                  "meaning": "To touch or hit something while moving.",
                  "examples": [
                    "The right wing of the car met the column in the garage, leaving a dent."
                  ]
                },
                {
                  "meaning": "To adjoin, be physically touching.",
                  "examples": [
                    "The carpet meets the wall at this side of the room. The forest meets the sea along this part of the coast."
                  ]
                },
                {
                  "meaning": "(transitive) To respond to (an argument etc.) with something equally convincing; to refute.",
                  "examples": [
                    "He met every objection to the trip with another reason I should go."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To satisfy; to comply with.",
                  "examples": [
                    "This proposal meets my requirements. The company agrees to meet the cost of any repairs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To balance or come out correct.",
                  "examples": [
                    "In this instance he has chosen an accountant. I suppose that it will be possible for an accountant to make the figures meet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perceive; to come to a knowledge of; to have personal acquaintance with; to experience; to suffer.",
                  "examples": [
                    "The eye met a horrid sight. He met his fate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be mixed with, to be combined with aspects of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English mete, imete, from Old English ġemǣte (“suitable, having the same measurements”), from the Proto-Germanic *gamētijaz, *mētiz (“reasonable; estimable”) (cognate with Dutch meten (“measure”), German gemäß (“suitable”) etc.), itself from collective prefix *ga- + Proto-Indo-European *med- (“to measure”)."
      ],
      "adjectives": [
        {
          "description": "meet (comparative meeter, superlative meetest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Suitable; right; proper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}