{
  "word": "moist",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Middle English moist, moiste (“damp, humid, moist, wet; well-irrigated, well-watered; made up of water or other fluids, fluid; of ale: fresh; (figuratively) carnal, lascivious; undisciplined, weak; (alchemy, medicine, physics) dominated by water as an element”) [and other forms], from Anglo-Norman moist, moiste, moste, Middle French moiste, and Old French moiste, muste (“damp, moist, wet”) (modern French moite); further etymology uncertain, perhaps a blend of a Late Latin variant of Latin mūcidus (“mouldy, musty”) + a Late Latin derivative of Latin mustum (“unfermented or partially fermented grape juice or wine, must”).",
        "The noun is derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "moist (comparative moister or more moist, superlative moistest or most moist)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characterized by the presence of moisture; not dry; slightly wet; damp. [from 14th c.]",
                  "examples": [
                    "Synonyms: moisty; see also Thesaurus:wet",
                    "Antonyms: unmoist; see also Thesaurus:dry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of eyes: wet with tears; tearful; also (obsolete), watery due to some illness or to old age. [from 14th c.]",
                  "examples": [
                    "Synonyms: dewy-eyed, misty, teary, weepy, wet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a climate, the weather, etc.: damp, humid, rainy. [from 14th c.]",
                  "examples": [
                    "Synonyms: dank; see also Thesaurus:muggy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Of the vagina: sexually lubricated due to sexual arousal; of a woman: sexually aroused, turned on. [from 20th c.]",
                  "examples": [
                    "Synonym: wet"
                  ]
                }
              ]
            },
            {
              "group": "(medicine)",
              "entries": [
                {
                  "meaning": "Characterized by the presence of some fluid such as mucus, pus, etc. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "Of sounds of internal organs (especially as heard through a stethoscope): characterized by the sound of air bubbling through a fluid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences, historical) Pertaining to one of the four essential qualities formerly believed to be present in all things, characterized by wetness; also, having a significant amount of this quality. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "Fluid, liquid, watery. [from 14th or earlier–17th c.]",
                  "examples": [
                    "Synonyms: liquidlike; see also Thesaurus:fluidic"
                  ]
                },
                {
                  "meaning": "(also poetic) Bringing moisture or rain. [a. 14th – 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "moist (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete except US, regional) Moistness; also, moisture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English moisten, moist, moiste (“to make moist or wet; to soak in liquid; to become moist or wet; to provide with moisture or water; to satisfy thirst with liquor or water, slake”) [and other forms], and then either:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "moist (third-person singular simple present moists, present participle moisting, simple past and past participle moisted)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(obsolete except Britain, regional and US) To make (something) moist or wet; to moisten.",
                  "examples": [
                    "Synonyms: dampen, enmoisten, hydrate, wet",
                    "Antonyms: dehydrate, desiccate, dry, (obsolete) exiccate, exsiccate, parch"
                  ]
                },
                {
                  "meaning": "(obsolete, figuratively) To inspire, to refresh (someone); also, to soften (one's heart).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "(US) To rain lightly; to drizzle.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To have an effect of moistening or wetting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}