{
  "word": "winter",
  "etymologies": [
    {
      "description": [
        "From Middle English winter, from Old English winter, from Proto-Germanic *wintruz (“winter”). Cognate with West Frisian winter (“winter”), Dutch winter (“winter”), German Winter (“winter”), Danish, Swedish and Norwegian vinter (“winter”), Icelandic vetur (“winter”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "winter (countable and uncountable, plural winters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Traditionally the fourth of the four seasons, typically regarded as being from December 23 to March 20 in continental regions of the Northern Hemisphere or the months of June, July, and August in the Southern Hemisphere. It is the time when the sun is lowest in the sky, resulting in short days, and the time of year with the lowest atmospheric temperatures for the region.",
                  "examples": [
                    "There shall he learn, ere sixteen winters old,  That [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, poetic) The period of decay, old age, death, or the like.",
                  "examples": [
                    "Buterin seemed to sense that the market was out of balance, and he made a smart decision that helped Ethereum weather the crypto winter and continue to build while the market was down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, fashion) Someone with dark skin, eyes and hair, seen as best suited to certain colors of clothing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An appliance to be fixed on the front of a grate, to keep a kettle warm, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India, archaic) The rainy season.",
                  "examples": [
                    "Note that the Citie of Goa is the principall place of all the Oriental India, and the winter thus beginneth the 15 of May, with very great raine."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "winter (third-person singular simple present winters, present participle wintering, simple past and past participle wintered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To spend the winter (in a particular place).",
                  "examples": [
                    "When they retired, they hoped to winter in Florida."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To store something (for instance animals) somewhere over winter to protect it from cold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}