{
  "word": "clew",
  "etymologies": [
    {
      "description": [
        "Middle English clewe, from Old English cleowen, cliewen, cliwen (“sphere, ball, skein; ball of thread or yarn; mass, group”), from Proto-Germanic *kliuwiną, *klewô (“ball, bale”), from Proto-Indo-European *glew- (“to conglomerate, gather into a mass; clump, ball, bale”). Akin to Old English clǣġ (“clay”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clew (plural clews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A roughly spherical mass or body.",
                  "examples": [
                    "If the whole troupe be diuided into many clewes, or round bunches, you need not then doubt but that there are many kings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A ball of thread or yarn.",
                  "examples": [
                    "A rare, precious, and never interrupted race of philosophers to whom wisdom, like another Ariadne, seems to have given a clew of thread which they have been walking along unwinding since the beginning of the world, through the labyrinth of human affairs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Yarn or thread as used to guide one's way through a maze or labyrinth; a guide, a clue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The lower corner(s) of a sail to which a sheet is attached for trimming the sail (adjusting its position relative to the wind); the metal loop or cringle in the corner of the sail, to which the sheet is attached. (on a triangular sail) The trailing corner relative to the wind direction.",
                  "examples": [
                    "\"Clew\" is Saxon; \"garnet\" (from granato, a fruit) is Italian,—that is, the garnet- or pomegranate-shaped block fastened to the clew or corner of the courses, and hence the rope running through the block."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) The sheets so attached to a sail.",
                  "examples": [
                    "The canvas running up in a proud sweep,Wind-wrinkled at the clews, and white like lint,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, in the plural) The cords suspending a hammock.",
                  "examples": [
                    "He taught us how to attach the clews to the ends of the hammock and then lash it between jack stays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of clue",
                  "examples": [
                    "The clew, without which it was perilous to enter the vast and intricate maze of Continental politics, was in his hands."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clew (third-person singular simple present clews, present participle clewing, simple past and past participle clewed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to roll into a ball",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) (transitive and intransitive) to raise the lower corner(s) of (a sail)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}