{
  "word": "lunette",
  "etymologies": [
    {
      "description": [
        "Borrowed from French lunette, diminutive of lune (“moon”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lunette (plural lunettes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A small opening in a vaulted roof of a circular or crescent shape. [from 17th c.]",
                  "examples": [
                    "Next came the semi-landing with the lunette window, and here the door opened under the pressure of a single finger, and with a sigh and creak."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A crescent-shaped recess or void in the space above a window or door. [from 18th c.] a lunette in the Thomas Jefferson building of the US Library of Congress",
                  "examples": [
                    "The decoration of a lunette discovered in the Duomo of Pistoia in the 1950s, which represents Christ blessing and Saints James and John, all bust-length, constitutes a more remarkable and stylistically more advanced approach to painting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An image or other representation of a crescent moon. [18th–19th c.]",
                  "examples": [
                    "The lesser portions of the tablet has over this Mithras, a lunette or symbol of the moon, who, according to Porphyry's comment, is the queen of generation and as such was denominated by the ancients both a bee and a bull [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fortifications) A field work consisting of two projecting faces forming a wedge each of which extends from one of two parallel flanks. [from 18th c.] two kinds of lunette fortification",
                  "examples": [
                    "This Lunette, as we have seen, was confronted, and even in siege-form \"approached\", by a part of Canrobert's army [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A luna: a crescent-shaped receptacle, often glass, for holding the (consecrated) host (the bread of communion) upright when exposed in the monstrance. [from 19th c.]",
                  "examples": [
                    "On those occasions when lunettes, custodia and monstrances are used, the sacristan needs to be sure that the lunette fits into the given monstrance, that the host fits into the lunette, and that the host is put out before Mass for consecration."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of flattened glass used in watch-making. [from 19th c.]",
                  "examples": [
                    "Lunette and double lunette glasses are generally sized in quarters; crystals and thin flat lunettes for hunters in eighths."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The circular hole in the guillotine in which the victim's neck is placed. [from 19th c.]",
                  "examples": [
                    "some \"future\" events may be likelier than others, O.K., but all are chimeric, and every cause-and-effect sequence is always a hit-and-miss affair, even if the lunette has already closed around your neck, and the cretinous crowd holds its breath."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A type of crescent-shaped dune blown up along a lake basin, especially in dry areas of Australia. [from 20th c.]",
                  "examples": [
                    "Sticking out of a crescent-shaped sand ridge of a type known as a lunette were some human bones."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(farriery) A half horseshoe, lacking the sponge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of felt to cover the eye of a vicious horse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An iron shoe at the end of the stock of a gun carriage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) See lunettes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}