{
  "word": "angel",
  "etymologies": [
    {
      "description": [
        "From Middle English angel, aungel, ængel, engel, from Old English anġel, ænġel, enġel, enċġel (“angel, messenger”), from Proto-West Germanic *angil, borrowed from Latin angelus, itself from Ancient Greek ἄγγελος (ángelos, “messenger”); and also in part from Anglo-Norman angele, angle, from the same Latin source. The religious sense of the Greek word first appeared in the Septuagint as a translation of the Hebrew word מַלְאָךְ‎ (malʾāḵ, “messenger”) or יהוה מַלְאָךְ (malʾāḵ YHWH, “messenger of YHWH”).",
        "Use of the term in some churches to refer to a church official derives from interpreting the \"angels\" of the Seven churches of Asia in Revelation as being bishops or ministers rather than angelic beings."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "angel (plural angels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An incorporeal and sometimes divine messenger from a deity, or other divine entity, often depicted in art as a youthful winged figure in flowing robes.",
                  "examples": [
                    "The dear good angel of the Spring, / The nightingale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Abrahamic tradition) One of the lowest order of such beings, below virtues.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person having the qualities attributed to angels, such as purity or selflessness.",
                  "examples": [
                    "Thanks for making me breakfast in bed, you little angel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Attendant spirit; genius; demon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(possibly obsolete) An official (a bishop, or sometimes a minister) who heads a Christian church, especially a Catholic Apostolic Church.",
                  "examples": [
                    "An apostle, or angel, or bishop, as he is now called, resided with a college of presbyters about him, in every considerable city of the Roman empire; to that angel or bishop, was committed the pastoral care of all the Christian in the city and its suburbs, extending as far on all sides as the jurisdiction of the civil magistrate extended;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An English gold coin, bearing the figure of the archangel Michael, circulated between the 15th and 17th centuries, and varying in value from six shillings and eightpence to ten shillings.",
                  "examples": [
                    "Synonym: angel-noble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military slang, originally Royal Air Force) An altitude, measured in thousands of feet.",
                  "examples": [
                    "Climb to angels sixty. ― ascend to 60,000 feet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, dated) An unidentified flying object detected by air traffic control radar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) An angel investor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) The person who funds a show.",
                  "examples": [
                    "Synonym: backer"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "angel (third-person singular simple present angels, present participle angeling or angelling, simple past and past participle angeled or angelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, theater, slang) To support by donating money.",
                  "examples": [
                    "Six years ago, he lost $20,000 in the first show he angelled, a turkey called Dance Night."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of Angelman"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "angel (plural angels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A person who has Angelman syndrome.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}