{
  "word": "surround",
  "etymologies": [
    {
      "description": [
        "From Middle English sourrounden (“to submerge, overflow”), from Middle French souronder, suronder, from Late Latin superundō, from super + undō (“to rise in waves”), from unda (“wave”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "surround (plural surrounds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) Anything, such as a fence or border, that surrounds something.",
                  "examples": [
                    "He drifted through the room, avoiding the furniture by instinct, closed the door that led to the passage, and only then flicked on his flashlight.",
                    "It swept around the room, picking out a desk, a telephone, a wall of bookshelves, and a deep armchair, and finally settled on a handsome fireplace with a large surround of red brick."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "surround (third-person singular simple present surrounds, present participle surrounding, simple past and past participle surrounded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To encircle something or simultaneously extend in all directions.",
                  "examples": [
                    "and this way they get rid of those grand and stubborn opinions that surround them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enclose or confine something on all sides so as to prevent escape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To pass around; to travel about; to circumnavigate.",
                  "examples": [
                    "to surround the world"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}