{
  "word": "magazine",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French magasin (“warehouse, store”), from Italian magazzino (“storehouse”), ultimately from Arabic مَخَازِن‎ pl (maḵāzin), plural of مَخْزَن‎ (maḵzan, “storeroom, storehouse”), noun of place from خَزَنَ‎ (ḵazana, “to store, to stock, to lay up”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "magazine (plural magazines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A non-academic periodical publication, generally consisting of sheets of paper folded in half and stapled at the fold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(military) An ammunition storehouse.",
              "entries": [
                {
                  "meaning": "(nautical) The portion of a warship where munitions are stored.",
                  "examples": [
                    "The cruiser blew up when a shell hit its magazine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chamber in or attachable to a firearm enabling multiple rounds of ammunition to be fed into the firearm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reservoir or supply chamber for a stove, battery, camera, typesetting machine, or other apparatus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A country or district especially rich in natural products.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A city viewed as a marketing center.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A store, or shop, where goods are kept for sale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, UK, Ireland) A collection of Teletext pages.",
                  "examples": [
                    "Most teletext \"magazines\" contain about 100 pages of information, typically including news headlines, weather reports, sports scores, video games, and stock prices."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}