{
  "word": "proud",
  "etymologies": [
    {
      "description": [
        "From Middle English proud, prout, prut, from Old English prūd, prūt (“proud, arrogant, haughty”) (compare Old English prȳtung (“pride”); prȳde, prȳte (“pride”)).",
        "Cognate with German Low German praud, Old Norse prúðr (“gallant, brave, magnificent, stately, handsome, fine”) (Icelandic prúður, Middle Swedish prudh, Danish prud), probably from Old French prod, prud (“brave, gallant”) (modern French preux), from Late Latin prōde (“useful”), derived from Latin prōdesse (“to be of value”); however, the Old English umlaut derivatives prȳte, prȳtian, etc. suggest the word may be older and possibly native. See also pride."
      ],
      "adjectives": [
        {
          "description": "proud (comparative prouder or more proud, superlative proudest or most proud)",
          "definitionGroups": [
            {
              "group": "Feeling honoured (by something); feeling happy or satisfied about an event or fact; gratified.",
              "entries": [
                {
                  "meaning": "That makes one feel proud (of something one did)",
                  "examples": [
                    "That was not the proudest thing I did but I can’t deny it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Possessed of a due sense of what one deserves or is worth.",
                  "examples": [
                    "I was too proud to apologise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly biblical) Having too high an opinion of oneself; arrogant, supercilious.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Generating a sense of pride; being a cause for pride.",
                  "examples": [
                    "It was a proud day when we finally won the championship."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Of things) standing upwards as in the manner of a proud person; stately or majestic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Standing out or raised; swollen.",
                  "examples": [
                    "After it had healed, the scar tissue stood proud of his flesh.",
                    "The weld was still a bit proud of the panel, so she ground it down flush."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Brave, valiant; gallant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Excited by sexual desire; specifically of a female animal: in heat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}