{
  "word": "think",
  "etymologies": [
    {
      "description": [
        "From Middle English thinken, thynken, thenken, thenchen, from Old English þenċan, from Proto-West Germanic *þankijan, from Proto-Germanic *þankijaną (“to think”), from Proto-Indo-European *teng- (“to think, feel, know”).",
        "Cognate with Scots think, thynk (“to think”), North Frisian teenk, taanke, tanke, tånke (“to think”), Saterland Frisian toanke (“to think”), West Frisian tinke (“to think”), Dutch denken (“to think”), Afrikaans dink (“to think”), Low German denken, dinken (“to think”), German denken (“to think”), Danish tænke (“to think”), Swedish tänka (“to think”), Norwegian Bokmål tenke (“to think”), Norwegian Nynorsk tenkja (“to think”), Icelandic þekkja (“to know, recognise, identify, perceive”), Latin tongeō (“know”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "think (usually uncountable, plural thinks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK) An act of thinking; consideration (of something).",
                  "examples": [
                    "I'll have a think about that and let you know."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "think (third-person singular simple present thinks, present participle thinking, simple past and past participle thought)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ponder, to go over in one's head.",
                  "examples": [
                    "Idly, the detective thought what his next move should be."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To communicate to oneself in one's mind, to try to find a solution to a problem.",
                  "examples": [
                    "I thought for three hours about the problem and still couldn’t find the solution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To conceive of something or someone (usually followed by of; infrequently, by on).",
                  "examples": [
                    "I tend to think of her as rather ugly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be of opinion (that); to consider, judge, regard, or look upon (something) as.",
                  "examples": [
                    "At the time I thought his adamant refusal to give in right.",
                    "I hope you won’t think me stupid if I ask you what that means.",
                    "I think she is pretty, contrary to most people.",
                    "Boxing is thought to be a dangerous sport."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To guess; to reckon.",
                  "examples": [
                    "I think she’ll pass the examination."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To plan; to be considering; to be of a mind (to do something).",
                  "examples": [
                    "The cupbearer shrugged up his shoulders in displeasure. \"I thought to have lodged him in the solere chamber,\" said he […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To presume; to venture.",
                  "examples": [
                    "Think not to say within yourselves, We have Abraham to our father."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English thinken, thynken, thenken (also thinchen, thünchen), from Old English þyncan (“to seem, appear”), from Proto-Germanic *þunkijaną (“to seem”).",
        "Cognate with Dutch dunken (“to seem, appear”), German dünken (“to seem, appear”), Danish tykkes (“to seem”), Swedish tycka (“to seem, think, regard”), Icelandic þykja (“to be regarded, be considered, seem”). More at methinks."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "think (third-person singular simple present thinks, present participle thinking, simple past and past participle thought)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete except in methinks) To seem, to appear.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}