{
  "word": "yacht",
  "etymologies": [
    {
      "description": [
        "Circa 1557; variant of yaught, earlier yeaghe (“light, fast-sailing ship”), from Dutch jacht (“yacht; hunt”), in older spelling jaght(e), short for jaghtschip (“light sailing vessel, fast pirate ship”, literally “pursuit ship”), compound of jacht and schip (“ship”).",
        "In the 16th century the Dutch built light, fast ships to chase the ships of pirates and smugglers from the coast. The ship was introduced to England in 1660 when the Dutch East India Company presented one to King Charles II, who used it as a pleasure boat, after which it was copied by British shipbuilders as a pleasure craft for wealthy gentlemen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "yacht (plural yachts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slick and light ship for making pleasure trips or racing on water, having sails but often motor-powered. At times used as a residence offshore on a dock.",
                  "examples": [
                    "Would you like to go sailing on my uncle’s yacht?",
                    "You are a true yachtsman! Are you a member of the local yacht club?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any vessel used for private, noncommercial purposes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "yacht (third-person singular simple present yachts, present participle yachting, simple past and past participle yachted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To sail, voyage, or race in a yacht.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}