{
  "word": "sack",
  "etymologies": [
    {
      "description": [
        "From Middle English sak (“bag, sackcloth”), from Old English sacc (“sack, bag”) and sæcc (“sackcloth, sacking”); both from Proto-West Germanic *sakku, from late Proto-Germanic *sakkuz (“sack”), borrowed from Latin saccus (“large bag”), from Ancient Greek σάκκος (sákkos, “bag of coarse cloth”), from Semitic, possibly Phoenician or Hebrew.",
        "Cognate with Dutch zak, German Sack, Swedish säck, Danish sæk, Hebrew שַׂק‎ (śaq, “sack, sackcloth”), Aramaic סַקָּא‎, Classical Syriac ܣܩܐ‎, Ge'ez ሠቅ (śäḳ), Akkadian 𒆭𒊓 (saqqu), Egyptian sꜣgꜣ. Doublet of sac, saccus, saco, and sakkos.",
        "Černý and Forbes suggest the word was originally Egyptian, a nominal derivative of sꜣq (“to gather or put together”) that also yielded Coptic ⲥⲟⲕ (sok, “sackcloth”) and was borrowed into Greek perhaps by way of a Semitic intermediary. However, Vycichl and Hoch reject this idea, noting that such an originally Egyptian word would be expected to yield Hebrew *סַק rather than שַׂק‎. Instead, they posit that the Coptic and Greek words are both borrowed from Semitic, with the Coptic word perhaps developing via Egyptian sꜣgꜣ."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sack (plural sacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bag; especially a large bag of strong, coarse material for storage and handling of various commodities, such as potatoes, coal, coffee; or, a bag with handles used at a supermarket, a grocery sack; or, a small bag for small items, a satchel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount a sack holds; also, an archaic or historical measure of varying capacity, depending on commodity type and according to local usage; an old English measure of weight, usually of wool, equal to 13 stone (182 pounds), or in other sources, 26 stone (364 pounds).",
                  "examples": [
                    "Seven pounds make a clove, 2 cloves a stone, 2 stone a tod, 6 1/2 tods a wey, 2 weys a sack, 12 sacks a last. [...] It is to be observed here that a sack is 13 tods, and a tod 28 pounds, so that the sack is 364 pounds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The plunder and pillaging of a captured town or city.",
                  "examples": [
                    "the sack of Rome"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Loot or booty obtained by pillage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A successful tackle of the quarterback behind the line of scrimmage. See verb sense4 below.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) One of the square bases anchored at first base, second base, or third base.",
                  "examples": [
                    "He twisted his ankle sliding into the sack at second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Dismissal from employment, or discharge from a position, usually as give (someone) the sack or get the sack. See verb sense5 below.",
                  "examples": [
                    "The boss is gonna give her the sack today.",
                    "He got the sack for being late all the time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, US) Bed (either literally or figuratively); usually as hit the sack or in the sack. See also sack out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) (also sacque) A kind of loose-fitting gown or dress with sleeves which hangs from the shoulders, such as a gown with a Watteau back or sack-back, fashionable in the late 17th to 18th century; or, formerly, a loose-fitting hip-length jacket, cloak or cape.",
                  "examples": [
                    "Her Dress, too, was of the same cast, a thin muslin short sacque and Coat lined throughout with Pink, – a modesty bit – and something of a very short cloak half concealed about half of her old wrinkled Neck […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A sack coat; a kind of coat worn by men, and extending from top to bottom without a cross seam.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) The scrotum.",
                  "examples": [
                    "He got passed the ball, but it hit him in the sack."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sack (third-person singular simple present sacks, present participle sacking, simple past and past participle sacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put in a sack or sacks.",
                  "examples": [
                    "Help me sack the groceries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bear or carry in a sack upon the back or the shoulders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To plunder or pillage, especially after capture; to obtain spoils of war from.",
                  "examples": [
                    "Synonyms: loot, ransack",
                    "The barbarians sacked Rome in 410 CE."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) To tackle the quarterback behind the line of scrimmage, especially before he is able to throw a pass.",
                  "examples": [
                    "On third down, the rejuvenated Rickey Jackson stormed in over All-Pro left tackle Richmond Webb to sack Marino yet again for a 2-yard loss."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, transitive) To discharge from a job or position; to fire.",
                  "examples": [
                    "Synonyms: see Thesaurus:lay off",
                    "He was sacked last September."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From earlier (wyne) seck from Middle French (vin (“wine”)) sec (“dry”), from Latin siccus (“dry”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sack (countable and uncountable, plural sacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A variety of light-colored dry wine from Spain or the Canary Islands; also, any strong white wine from southern Europe; sherry.",
                  "examples": [
                    "The vesper bell had rung its parting note; the domini were mostly caged in comfortable quarters, discussing the merits of old port; and the merry student had closed his oak, to consecrate the night to friendship, sack, and claret."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sack (plural sacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dated form of sac (“pouch in a plant or animal”).",
                  "examples": [
                    "Sometimes fishes are born that have rudimentary yolk sacks. Such young are born prematurely."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sack (plural sacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of sac (“sacrifice”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sack (third-person singular simple present sacks, present participle sacking, simple past and past participle sacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of sac (“sacrifice”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}