{
  "word": "border",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English bordure, from Old French bordeure, of Germanic origin, from Frankish *bord, equivalent to modern French bord (“a border”) + -er.",
        "Akin to Middle High German borte (“border, trim”), German Borte (“ribbon, trimming”). Doublet of bordure. More at board."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "border (countable and uncountable, plural borders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The line or frontier area separating political or geographical regions.",
                  "examples": [
                    "The Ministry of Defence said on Wednesday the men had been killed on Tuesday in the Nahr-e Saraj district of Helmand province, on the border of Kandahar just north of the provincial capital Lashkar Gah."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The outer edge of something.",
                  "examples": [
                    "the borders of the garden"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A decorative strip around the edge of something.",
                  "examples": [
                    "There's a nice frilly border around the picture frame.",
                    "a solid border around a table of figures"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strip of ground in which ornamental plants are grown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, uncountable) border morris or border dancing; a vigorous style of traditional English dance originating from villages along the border between England and Wales, performed by a team of dancers usually with their faces disguised with black makeup.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A string that is both a prefix and a suffix of another particular string.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "border (third-person singular simple present borders, present participle bordering, simple past and past participle bordered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put a border on something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form a border around; to bound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lie on, or adjacent to, a border of.",
                  "examples": [
                    "Denmark borders Germany to the south."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To touch at a border (with on, upon, or with).",
                  "examples": [
                    "Connecticut borders on Massachusetts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To approach; to come near to; to verge (with on or upon).",
                  "examples": [
                    "Wit which borders upon profaneness  […] deserves to be branded as folly."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}