{
  "word": "musty",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Late Middle English musty; further origin uncertain, possibly from one of the following:",
        "Compare Middle French moisi (“mouldy”), an adjective use of the past participle of moisir (“(to cause) to go mouldy, to moulder”) (modern French moisir), from Latin mūcēre, the present active infinitive of Old Latin mūceō (“to be mouldy or musty”): see above.",
        "The English word is analysable as must (“mould; mustiness”) +‎ -y (suffix meaning ‘having the quality of’ forming adjectives); however, must is thought to be a back-formation from musty.",
        "The noun and verb are derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "musty (comparative mustier, superlative mustiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Affected by dampness or mould; damp, mildewed, mouldy.",
                  "examples": [
                    "Synonym: fusty"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having an odour or taste of mould; also (generally), having a stale or unfresh odour or taste.",
                  "examples": [
                    "Synonym: fusty",
                    "musty food    musty furniture    a musty odour"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic of or relating to mould or mouldiness.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Of attitudes, ideas, writing, or other abstract things: no longer fresh or interesting; outdated, stale.",
                  "examples": [
                    "Synonym: outmoded"
                  ]
                },
                {
                  "meaning": "Of a person: boring and unadventurous; also, old-fashioned, stuck in the past.",
                  "examples": [
                    "Synonym: fogeyish"
                  ]
                },
                {
                  "meaning": "(archaic except Northern England (northwest)) Bad-tempered, grumpy, irritable.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "musty (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A type of snuff with a musty flavour (adjective sense 2).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "musty (third-person singular simple present musties, present participle mustying, simple past and past participle mustied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To turn musty (adjective sense 1 or 2); to must.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From musth (“time during which male elephants exhibit increased levels of sexual activity and aggressiveness”) +‎ -y (suffix meaning ‘having the quality of’ forming adjectives)."
      ],
      "adjectives": [
        {
          "description": "musty (comparative more musty, superlative most musty)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Of a male animal such as a camel or an elephant: in musth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}