{
  "word": "manufacture",
  "etymologies": [
    {
      "description": [
        "From Middle French manufacture, from Old French, from Medieval Latin manūfactūra (“a making by hand”), from manūfactus, a compound of manū factus, manū being ablative of manus (“hand”), and factus past participle of faciō (“I do, make”).",
        "Compare manual, facture."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "manufacture (plural manufactures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The action or process of making goods systematically or on a large scale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything made, formed or produced; product.",
                  "examples": [
                    "The roads [are] crowded with carriers, laden with rich manufactures."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The process of such production; generation, creation.",
                  "examples": [
                    "Our lawgivers take special pride in the ever active manufacture of new bills and laws."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horology) A watch manufacturer that makes its own parts, rather than assembling watches from parts obtained from other firms.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "manufacture (third-person singular simple present manufactures, present participle manufacturing, simple past and past participle manufactured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make things, usually on a large scale, with tools and either physical labor or machinery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work (raw or partly wrought materials) into suitable forms for use.",
                  "examples": [
                    "to manufacture wool into blankets"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) To fabricate; to create false evidence to support a point.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}