{
  "word": "motile",
  "etymologies": [
    {
      "description": [
        "From Latin mōtus, perfect passive participle of moveō (“I move”) (English move)."
      ],
      "adjectives": [
        {
          "description": "motile (comparative more motile, superlative most motile)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) In organisms: having the power to move spontaneously.",
                  "examples": [
                    "Sessile organisms are those which are sedentary in habit, whether attached or possessing slight powers of locomotion. Motile organisms are those that habitually move about. Vagile or creeping forms as well as swimming, walking, flying, burrowing types are included. Most sessile animals are capable of moving their parts, while only a few sessile plants possess this capacity, and these only to a slight degree. There is no sharp distinction between sessile (sedentary) and motile organisms. Every possible gradation exists between fixed non-motile types as trees on the one hand and the pelagic fishes on the other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) In organs or organelles: capable of producing motion.",
                  "examples": [
                    "These [Foraminifera] were always found, a few hours after the weed had been deposited in my vases, adhering to the glass, with the pseudopodia extended ... constantly roaming ; they crawled up and down the stems and branches of the Algae, and over the various objects in the tank, never remaining long in. one station ... it is by means of the adhesion and contraction of the pseudopodia, that the animal drags itself along...."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physiology) In organs: having the power to move their contents, or to change their shape or tension by writhing or contracting as required by their particular physiological functions.",
                  "examples": [
                    "Visceral motility is responsible for transporting the contents of the different organs. Thus it controls the amount of contents found in any organ at any one time. Through contraction and dilatation mechanisms, the food bolus passes through the intestinal tract, the gall bladder secretes bile, urine is excreted, semen is transported and the uterus wall contracts during birth.This motility is also responsible for the closing of sphincters, for example at the stomach exit (pylorus) or in the bladder. The diastole and systole of the heart can be understood as the motility of the circulatory system."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "motile (plural motiles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) A person whose prevailing mental imagery takes the form of inner feelings of action, such as incipient pronunciation of words, muscular innervations, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}