{
  "word": "always",
  "etymologies": [
    {
      "description": [
        "From Middle English alwayes, allwayes, allweyes, a variant of Middle English allwaye, alwey, alle wey (“always”), from Old English ealneġ, ealneweġ (“always, perpetually”, literally “all the way, all the while, continuously”), from ealne + weġ (accusative case), equivalent to alway +‎ -s. Cognate with Scots alwayis (“always”), Low German allerwegens (“very often”, literally “all ways'”). More at all, way."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "always (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "At all times; throughout all time; since the beginning.",
                  "examples": [
                    "God is always the same.",
                    "Green has always been my favorite color. I’ve loved it for as long as I can remember.",
                    "Airplanes did not always exist as a form of transportation.",
                    "Synonyms: perpetually, continually, all the time, every time; see also Thesaurus:forever",
                    "Antonyms: at no time, never; see also Thesaurus:never"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Constantly during a certain period, or regularly at stated intervals (opposed to sometimes or occasionally).",
                  "examples": [
                    "Synonyms: invariably, uniformly; see also Thesaurus:uniformly",
                    "Antonyms: manywise, sundrily, variously; see also Thesaurus:diversely",
                    "In this street, the shops always close during lunchtime."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) In any event.",
                  "examples": [
                    "I thought I could always go back to work.",
                    "Synonyms: anyhow, anyway, at any rate, regardless; see also Thesaurus:regardless"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}