{
  "word": "codswallop",
  "etymologies": [
    {
      "description": [
        "Unknown, attested from 1959 episode of UK TV series Hancock's Half Hour. The writers (Galton and Simpson) state that the phrase was in general use when the show was broadcast. A national TV appeal in the UK in 2006 failed to find earlier references, though a humorous newspaper column from 1947 does use the fictional name \"Sir Aubrey Codswallop\".  Originally written (1963) codswallop, spelling cod's wallop is later.",
        "Various etymologies are proposed from some sense of cod, such as from cod (“joke, imitation”) +‎ -s- +‎ wallop (“beer (slang)”), hence cod + wallop “imitation beer” (with interconsonantal -s- to ease pronunciation of -dw-), or from cod (“scrotum, as in codpiece”) +‎ -s- +‎ wallop (“to hit”), hence cod + wallop “testicle bag”  or \"tbag\" or \"hit with testicle bag,\" or from cod (“fish”) (some part of the fish, as from fishing industry).",
        "A frequently given etymology, although widely rejected as a folk etymology, derives it from Hiram Codd, British soft drink maker of the 1870s, known for the eponymous Codd-neck bottle, with the suggestion that codswallop is a derisive term for soft drinks by beer drinkers, from Codd’s + wallop (“beer (slang)”) “Codd’s beer (sarcastic)”. There is no evidence that early uses had this sense, the slang wallop (“beer”) comes later than Codd’s lifetime, initial spellings (1963 in print) do not reflect such a derivation (*Codd’s wallop and *coddswallop with -dd- are not found), and there is an 80-year gap between proposed coinage and attestation.",
        "This is also the name given to the wooden device placed over the neck of a codd bottle and given a push (wallop) to dislodge the marble in the neck of the bottle. The word has also been used to describe the process of opening a codd bottle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "codswallop (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Ireland, Australia, New Zealand, slang) Senseless talk or writing; nonsense; rubbish.",
                  "examples": [
                    "Synonyms: see Thesaurus:nonsense"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}