{
  "word": "rick",
  "etymologies": [
    {
      "description": [
        "From Middle English *rykke, from Old English hrycce (“rick, heap, pile”), cognate with Scots ruk (“rick”), Norwegian ruka (“rick, haystack”). Related also to Old English hrēac (“rick, stack”), from Proto-Germanic *hraukaz (“heap”). Further relations: Dutch rook, Norwegian rauk, Swedish rök, Icelandic hraukur."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rick (plural ricks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Straw, hay etc. stored in a stack for winter fodder, commonly protected with thatch.",
                  "examples": [
                    "There is a remnant still of last year's golden clusters of beehive ricks, rising at intervals beyond the hedgerows; […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A stack of wood, especially cut to a regular length; also used as a measure of wood, typically four by eight feet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rick (third-person singular simple present ricks, present participle ricking, simple past and past participle ricked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To heap up (hay, etc.) in ricks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From earlier wrick, from Middle English wricken, wrikken (“to move back and forth”), probably from Middle Dutch *verwricken or Middle Low German vorwricken. Cognate with West Frisian wrikke, wrikje, Dutch wrikken, Low German wricken, German wricken, Danish vrikke, Swedish vricka."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rick (third-person singular simple present ricks, present participle ricking, simple past and past participle ricked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To slightly sprain or strain the neck, back, ankle etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Abbreviated form from recruit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rick (plural ricks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, derogatory and demeaning) A brand new (naive) boot camp inductee.",
                  "examples": [
                    "No turning back now rick, you are the property of the US government now."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}