{
  "word": "thereabouts",
  "etymologies": [
    {
      "description": [
        "The adverb is derived from Middle English there-aboutes, þare aboutes (“of a place or an object: around there, in its vicinity; of time: about then, around that time”) [and other forms], from ther (“in that place, in those places, there; on that; thither, to that place; from there, thence; at that time; thereupon; in that situation, under those circumstances; in that case, with regard to that”) (from Old English þǣr (“there”)) + aboutes (“in all directions, around”, adverb), aboutes (“in all directions from, on all sides of; near; concerned with”, preposition) (from aboute, abouten (“so as to surround; so as to cover; on the border or edge; as measured around the outside; to as to travel around something; so as to revolve about an axis or centre; aside; in all directions; in the vicinity; in connection with something; in several places; everywhere, throughout; to all or everyone; almost, approximately; concerning; in succession; so as to be or happen”, adverb), aboute, abouten (“surrounding; covering; over; upon; on the border of; in all directions; in the vicinity of, near to; in several places; everywhere, throughout; almost, approximately; concerning; engaged in; on behalf of”, preposition) (from Old English abūtan, onbūtan (“about; round about; on; on the outside”)) + -s (suffix forming adverbs)); see further at thereabout. The English word is analysable as thereabout +‎ -s (suffix forming adverbs).",
        "The noun may result from a confusion of thereabouts with whereabouts.",
        "The word is attested later than thereabout."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "thereabouts (not comparable)",
          "definitionGroups": [
            {
              "group": "Synonym of thereabout:",
              "entries": [
                {
                  "meaning": "About or near that place.",
                  "examples": []
                },
                {
                  "meaning": "About or around that date or time.",
                  "examples": []
                },
                {
                  "meaning": "About or near to that condition or quality.",
                  "examples": []
                },
                {
                  "meaning": "Approximately that number or quantity.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "About that; concerning that.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) Near to that activity or situation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "thereabouts pl (plural only)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(possibly erroneous) Location; whereabouts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}