{
  "word": "barge",
  "etymologies": [
    {
      "description": [
        "From Middle English barge, borrowed from Old French barge (“boat”), from Late Latin barca, from Latin baris, from Ancient Greek βάρις (báris, “Egyptian boat”), from Coptic ⲃⲁⲁⲣⲉ (baare, “small boat”), from Demotic br, from Egyptian bꜣjr (“transport ship, type of fish”),",
        "Doublet of bark, barque and baris."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "barge (plural barges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large flat-bottomed towed or self-propelled boat used mainly for river and canal transport of heavy goods or bulk cargo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A richly decorated ceremonial state vessel propelled by rowers for river processions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large flat-bottomed coastal trading vessel having a large spritsail and jib-headed topsail, a fore staysail and a very small mizen, and having leeboards instead of a keel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the boats of a warship having fourteen oars",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The wooden disk in which bread or biscuit is placed on a mess table.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A double-decked passenger or freight vessel, towed by a steamboat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialect, dated) A large omnibus used for excursions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "barge (third-person singular simple present barges, present participle barging, simple past and past participle barged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To intrude or break through, particularly in an unwelcome or clumsy manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To push someone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}