{
  "word": "war",
  "etymologies": [
    {
      "description": [
        "From Middle English werre, from Late Old English werre, wyrre (“armed conflict”) from Old Northern French werre (compare modern French guerre), from Medieval Latin werra, from Frankish *werru (“confusion; quarrel”), from Proto-Indo-European *wers- (“to mix up, confuse, beat, thresh”). Displaced native Old English ġewinn.",
        "Related to Old High German werra (“confusion, strife, quarrel”) and German verwirren (“to confuse”), Old Saxon werran (“to confuse, perplex”), Dutch war (“confusion, disarray”), West Frisian war (“defense, self-defense, struggle\", also \"confusion”),\nOld English wyrsa, wiersa (“worse”), Old Norse verri (“worse, orig. confounded, mixed up”), Italian guerra (“war”). There may be a connection with worse and wurst."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "war (countable and uncountable, plural wars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Organized, large-scale, armed conflict between countries or between national, ethnic, or other sizeable groups, usually but not always involving active engagement of military forces.",
                  "examples": [
                    "holy war... just war... civil war..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A particular conflict of this kind.",
                  "examples": [
                    "All human tribes glad token seeIn the close of the wars of Grant and Lee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, sometimes proscribed) Protracted armed conflict against irregular forces, particularly groups considered terrorists.",
                  "examples": [
                    "Our war on terror begins with al Qaeda, but it does not end there. It will not end until every terrorist group of global reach has been found, stopped, and defeated."
                  ]
                }
              ]
            },
            {
              "group": "(countable, by extension) Any protracted conflict, particularly",
              "entries": [
                {
                  "meaning": "(chiefly US) Campaigns against various social problems.",
                  "examples": [
                    "The war against war is going to be no holiday excursion or camping party... Ask all our millions, north and south, whether they would vote now (were such a thing possible) to have our war for the Union expunged from history... and probably hardly a handful of eccentrics would say yes. Those ancestors, those efforts, those memories and legends, ar the most ideal part of what we now own together, a sacred spiritual possession worth more than all the blood poured out. Yet ask those same people whether they would be willing, in cold blood, to start another civil war now to gain another similar possession, and not one man or woman would vote for the proposition."
                  ]
                },
                {
                  "meaning": "(business) A protracted instance of fierce competition in trade.",
                  "examples": [
                    "price wars... Cola Wars... format wars..."
                  ]
                },
                {
                  "meaning": "(crime) A prolonged conflict between two groups of organized criminals, usually over organizational or territorial control.",
                  "examples": [
                    "turf war... gang war... Castellammarese War..."
                  ]
                },
                {
                  "meaning": "(Internet) An argument between two or more people with opposing opinions on a topic or issue.",
                  "examples": [
                    "flame war... edit war..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) An assembly of weapons; instruments of war.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Armed forces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, card games) Any of a family of card games where all cards are dealt at the beginning of play and players attempt to capture them all, typically involving no skill and only serving to kill time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "war (third-person singular simple present wars, present participle warring, simple past and past participle warred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in conflict (may be followed by \"with\" to specify the foe).",
                  "examples": [
                    "...to war the Scot, and borders to defend..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carry on, as a contest; to wage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}