{
  "word": "climax",
  "etymologies": [
    {
      "description": [
        "From Latin clīmax, from Ancient Greek κλῖμαξ (klîmax, “ladder, staircase, [rhetorical] climax”), from κλίνω (klínō, “I lean, slant”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "climax (countable and uncountable, plural climaxes or (rare) climaces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally rhetoric) A rhetorical device in which a series is arranged in ascending order.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An instance of such an ascending series.",
                  "examples": [
                    "...Expressions for the whole Climax of sensibility..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(narratology) The culmination of a narrative's rising action, the turning point.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(now often) A culmination or acme: the last term in an ascending series, particularly:",
              "entries": [
                {
                  "meaning": "(rhetoric, imprecise) The final term of a rhetorical climax.",
                  "examples": [
                    "When he adds epithets of praise, his climax is ‘so English’."
                  ]
                },
                {
                  "meaning": "(ecology) The culmination of ecological development, whereby species are in equilibrium with their environment.",
                  "examples": [
                    "The succession of associations leading to a climax represents the process of adjustment to the conditions of stress, and the climax represents a condition of relative equilibrium. Climax associations... are the resultants of certain climatic, geological... conditions."
                  ]
                },
                {
                  "meaning": "(euphemistic) The culmination of sexual pleasure, an orgasm.",
                  "examples": [
                    "In many cases the man's climax comes so swiftly that the woman's reactions are not nearly ready."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "climax (third-person singular simple present climaxes, present participle climaxing, simple past and past participle climaxed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To reach or bring to a climax (in any sense).",
                  "examples": [
                    "Frank had two bouts in October of 1954, losing them both, and then climaxed his career with a 6-round decision victory over Mickey Warner on December 1, 1954."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}