{
  "word": "vertu",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian virtù, †vertù (“moral worth, virtue (13th century); determination, perseverance, military valour (14th century); study of the liberal or fine arts; appreciation of, taste for, or expertise in the fine arts; objets d'art collectively (16th century)”); or from French vertu (“virtue”), ultimately from Latin virtūt-, virtus (“virtue”). Doublet of virtue."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vertu (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, now historical) The fine arts as a subject of study or expertise; understanding of arts and antiquities. [from 18th c.]",
                  "examples": [
                    "He engaged a certain Abbé of distinguished taste in virtù to attend them as their Ciceroné, and explain the antiquities brought from Herculaneum and Pompeia  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, now historical) Objets d'art collectively. [from 18th c.]",
                  "examples": [
                    "Now, when with royal Tranquo I visited this wondrous whale, and saw the skull an altar, and the artificial smoke ascending from where the real jet had issued, I marvelled that the king should regard a chapel as an object of vertù."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Especially with reference to the writings of Machiavelli (1469–1527): the requisite qualities for political or military success; vitality, determination; power. [from 19th c.]",
                  "examples": [
                    "All these connotations, even the positive and moral ones, are within the range of significations Machiavelli wants us to hear in “virtù.” For him the word suggests a kind of flexibility that can initiate effective, efficient, and energetic action based on a courageous assertion of the will and an ability to execute the products of one's own calculations. Such calculations are a significant adjunct to his ideas about virtù: they outline what might be called an internal or mental virtù."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moral worth; virtue, virtuousness. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}