{
  "word": "bonnet",
  "etymologies": [
    {
      "description": [
        "From Middle English bonet, from Middle French bonet (Modern French bonnet), from Old French bonet (“material from which hats are made”), from Frankish *bunni (“that which is bound”), from Proto-Germanic *bundiją (“bundle”), from Proto-Indo-European *bʰendʰ- (“to tie”).",
        "Compare also Late Latin abbonis, obbonis (“ribbon of a headdress”), also of Germanic origin, from Frankish *obbunni, from *ob- (“above, over”) + *bunni.",
        "Cognate with Old High German gibunt (“band, ribbon”), Middle Dutch bont (“bundle, truss”), Gothic 𐌲𐌰𐌱𐌿𐌽𐌳𐌹 (gabundi, “bond”). More at over, bundle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bonnet (plural bonnets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of hat, once worn by women or children, held in place by ribbons tied under the chin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A traditional Scottish woollen brimless cap; a bunnet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The polishing head of a power buffer, often made of wool.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Britain, New Zealand, South Africa, automotive) The hinged cover over the engine of a motor car; a hood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A length of canvas attached to a fore-and-aft sail to increase the pulling power.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang) An accomplice of a gambler, auctioneer, etc., who entices others to bet or to bid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The second stomach of a ruminant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A ducat, an old Scottish coin worth 40 shillings.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Anything resembling a bonnet (hat) in shape or use.",
              "entries": [
                {
                  "meaning": "A small defence work at a salient angle; or a part of a parapet elevated to screen the other part from enfilade fire.",
                  "examples": []
                },
                {
                  "meaning": "A metallic canopy, or projection, over an opening, as a fireplace, or a cowl or hood to increase the draught of a chimney, etc.",
                  "examples": []
                },
                {
                  "meaning": "A frame of wire netting over a locomotive chimney, to prevent escape of sparks.",
                  "examples": []
                },
                {
                  "meaning": "A roofing over the cage of a mine, to protect its occupants from objects falling down the shaft.",
                  "examples": []
                },
                {
                  "meaning": "In pumps, a metal covering for the openings in the valve chambers.",
                  "examples": []
                },
                {
                  "meaning": "(mycology) A mushroom of the genus Mycena.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bonnet (third-person singular simple present bonnets, present participle bonneting or bonnetting, simple past and past participle bonneted or bonnetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put a bonnet on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To take off the bonnet or cap as a mark of respect; to uncover.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, transitive) To pull the bonnet or cap down over the eyes of.",
                  "examples": [
                    "Synonym: block"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}