{
  "word": "presence",
  "etymologies": [
    {
      "description": [
        "Through Old French presence, from Latin praesentia (“a being present”), from praesentem. Displaced native Old English andweardnes."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "presence (countable and uncountable, plural presences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fact or condition of being present, or of being within sight or call, or at hand.",
                  "examples": [
                    "Any painter can benefit from the presence of a live model from which to draw."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of space within one's immediate vicinity.",
                  "examples": [
                    "Bob never said anything about it in my presence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quality of poise and effectiveness that enables a performer to achieve a close relationship with their audience.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quality that sets an individual out from others; a quality that makes them noticed and/or admired even if they are not speaking or performing.",
                  "examples": [
                    "Despite being less than five foot, she filled up the theatre with her stage presence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something (as a spirit) felt or believed to be present.",
                  "examples": [
                    "I'm convinced that there was a presence in that building that I can't explain, which led to my heroic actions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A company's business activity in a particular market.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) An assembly of great persons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being closely focused on the here and now, not distracted by irrelevant thoughts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(audio) Synonym of room tone",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "presence (third-person singular simple present presences, present participle presencing, simple past and past participle presenced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, transitive, intransitive) To make or become present.",
                  "examples": [
                    "Within a completely neutral horizon, the primordial continuous stream of experience is presenced without interruption. As this time, the past and future have no meaning apart from the now in which they are presenced."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}