{
  "word": "deuteragonist",
  "etymologies": [
    {
      "description": [
        "Ancient Greek δευτεραγωνιστής (deuteragōnistḗs, literally “second actor”), originally in Greek drama, from ἀγωνιστής (agōnistḗs, “a combatant, pleader, actor”).",
        "Surface analysis deuter- (“second”) +‎ agonist (“combatant, participant”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "deuteragonist (plural deuteragonists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(narratology) A secondary character; specifically, the second most important character (after the protagonist).",
                  "examples": [
                    "The issue is no longer about the artistic representation of woman going on within the story: rather, the art object, now unrelated to the actual woman (at a literal level, at any rate), becomes her deuteragonist and antagonist, and the opposition thus settled becomes further complicated by reversal, exchanges, shifts in their respective positions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, ancient Greek drama) An actor playing a role (potentially all roles) requiring a second actor to be present on the stage, opposite the protagonist.",
                  "examples": [
                    "The first disposition accords with the attested reality of Nero acting in masks resembling his own features or those of women with whom he was in love (Suet. Nero 21.3), especially Poppaea (Dio 63.9.5), and generates a set of roles for the deuteragonist all of which focus on failed counsel; it also underlines the parallelism between the Seneca-Nero and Nero-Prefect scenes, and reinforces the view that the First and Second Prefect are not identical."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}