{
  "word": "canker",
  "etymologies": [
    {
      "description": [
        "From Middle English canker, cancre, from Old English cancer, akin to Dutch kanker, Old High German chanchar. Ultimately from Latin cancer (“a cancer”). Doublet of cancer, a later borrowing from Latin, and chancre, which came through French."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "canker (countable and uncountable, plural cankers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phytopathology) A plant disease marked by gradual decay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A region of dead plant tissue caused by such a disease.",
                  "examples": [
                    "Slightly sunken brown cankers of variable size and shape affect stem parts  primarily below the soil line."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A worm or grub that destroys plant buds or leaves; cankerworm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A corroding or sloughing ulcer; especially a spreading gangrenous ulcer or collection of ulcers in or about the mouth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything which corrodes, corrupts, or destroys.",
                  "examples": [
                    "the cankers of envy and faction"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of wild rose; the dog rose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An obstinate and often incurable disease of a horse's foot, characterized by separation of the horny portion and the development of fungoid growths. Usually resulting from neglected thrush.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An avian disease affecting doves, poultry, parrots and birds of prey, caused by Trichomonas gallinae.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English cankren, from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "canker (third-person singular simple present cankers, present participle cankering, simple past and past participle cankered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To affect as a canker; to eat away; to corrode; to consume.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To infect or pollute; to corrupt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To waste away, grow rusty, or be oxidized, as a mineral.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be or become diseased, or as if diseased, with canker; to grow corrupt; to become venomous.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}