{
  "word": "dibble",
  "etymologies": [
    {
      "description": [
        "Possibly dib (“to dab lightly”) +‎ -le (“frequentative suffix indicating repetition or continuousness”); however, the word dibble is attested earlier than dib."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dibble (plural dibbles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pointed implement used to make holes in the ground in which to set out plants or to plant seeds.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dibble (third-person singular simple present dibbles, present participle dibbling, simple past and past participle dibbled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make holes or plant seeds using, or as if using, a dibble.",
                  "examples": [
                    "It was Digory who had the bright idea of eating four each and planting the ninth; for, as he said, \"if the bar off the lamp-post turned into a little light-tree, why shouldn’t this turn into a toffee-tree?\" So they dibbled a small hole in the turf and buried the piece of toffee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use a dibble; to make holes in the soil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dib or dip frequently, as in angling.",
                  "examples": [
                    "And neere to them ye see the lesser dibling Teale"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the character of Officer Charlie Dibble, a New York Police Department officer, in the Hanna-Barbera cartoon series Top Cat (first broadcast in the US in 1961, and in the UK in 1962 under the title Boss Cat)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dibble (countable and uncountable, plural dibbles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain, originally Manchester, countable) A police officer, especially one serving with Greater Manchester Police.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain, originally Manchester, uncountable) Preceded by the: the police.",
                  "examples": [
                    "Watch out, lads! Here comes the dibble!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}