{
  "word": "claviature",
  "etymologies": [
    {
      "description": [
        "From German Klaviatur, ultimately from Latin clāvis (“key”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "claviature (plural claviatures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A keyboard, especially of a musical instrument.",
                  "examples": [
                    "Over the mouth of each of them is drawn a thin piece of bladder, and over it, at the distance of a quarter of an inch, are flat pieces of a very hard wood, arranged like the claviature of a piano."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The layout of keys on such a keyboard.",
                  "examples": [
                    "In the practice of music it becomes almost a necessity to agree upon some fixed system of interval measurement in order to clearly and economically define the notation, and the claviature of instruments. This confers an appearance of false simplicity upon tonal procedure, but it enables (in the same way as squared paper does with curves) the highly variable system of tonality to be represented in great generality with a limited number of fixed tones."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A system or style of applying the fingers to such a keyboard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Metaphorically, a repertoire or toolkit of concepts or resources for application to a field.",
                  "examples": [
                    "The emerging discipline permeates all medical levels, modelling of tumors, diagnostics, tumor monitoring, therapy and study design, thereby providing a whole claviature of novel therapeutic targets"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}