{
  "word": "guaranty",
  "etymologies": [
    {
      "description": [
        "From Old French guarantie, from Old French guarantie (“protection, defense”), from Old French garantir, guarantir (“to warrant, vouch for something”), from Old French garant, guarant, warant (“a warrant; warranter, supporter, defender, protector”), from Frankish *warand, *warjand (“a warrant”), from Frankish *warjan (“to fend for, designate something as true, vouch for”), from Proto-Germanic *warjaną (“to defend, protect”), from Proto-Indo-European *wer- (“to close, cover, protect, save, defend”). Cognate with Middle Low German warent, warend (“a warrant”), German gewähren (“to grant”). More at warrant. Doublet of guarantee and warranty."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "guaranty (plural guaranties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An undertaking to answer for the payment of some debt, or the performance of some contract or duty, of another, in case of the failure of such other to pay or perform; a warranty; a security.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something serving as a security for such an undertaking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An assurance or guarantee.",
                  "examples": [
                    "The concept of God and immortality is for him a guaranty of this eternal difference between right and wrong."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "guaranty (third-person singular simple present guaranties, present participle guarantying, simple past and past participle guarantied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of guarantee",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}