{
  "word": "ninja",
  "etymologies": [
    {
      "description": [
        "A romanized borrowing of Japanese 忍者 (ninja), popularized within Japanese by manga after World War II and in English by Eric Van Lustbader's 1980 novel The Ninja and the 1981 movie Enter the Ninja, of uncertain derivation but with an underlying sense of secret or hidden person.",
        "The “Mongolian miner” sense arose from the supposed resemblance of the bowls used to wash ore with mercury to the shells of the Teenage Mutant Ninja Turtles.",
        "The Juggalo slang sense arose via influence from AAVE nigga."
      ],
      "adjectives": [
        {
          "description": "ninja (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or related to ninjas in their various senses.",
                  "examples": [
                    "The July 1966 issue had a cartoon concerning a Ninja dojo."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "ninja (plural ninja or ninjas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(martial arts) A person trained in ninjutsu, especially (historical) one used for espionage, assassination, and other tasks requiring stealth during Japan's shogunate period.",
                  "examples": [
                    "The men... are now learning to be ninja or ‘stealers-in’."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A person considered similarly skillful to the historical ninja, especially in covert or stealthy operation.",
                  "examples": [
                    "For months the Japanese spoke of national-security adviser Henry Kissinger as a ninja—the magician of Japanese legends who performs supernatural acts and practices sorcery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A person considered to look like the historical ninja in some way, including (Mongolia, historical slang) amateur private miners.",
                  "examples": [
                    "He immediately suspected they were ninjas because, he said, they were dressed in black and wore masks, trademarks of the mysterious assassins who have been sowing terror across East Java in recent months."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Juggalo slang) Synonym of man as a friendly term of address.",
                  "examples": [
                    "What up, my ninja!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ninja (third-person singular simple present ninjas, present participle ninjaing, simple past and past participle ninjaed or ninja'd)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To act or move like a ninja, particularly with regard to a combination of speed, power, and stealth.",
                  "examples": [
                    "I leapt up, ninja'd over to Gav's bed and wheeched the duvet off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, slang) Synonym of preempt: to supersede and invalidate a response by posting immediately before it.",
                  "examples": [
                    "When I hit post, I saw that Blue Emu had ninja'd me, so I just deleted my reply."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming slang) To claim an item through abuse of game mechanics.",
                  "examples": [
                    "That damn warrior ninja'd an epic-quality wand even though he can't even use it!"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}