{
  "word": "game",
  "etymologies": [
    {
      "description": [
        "From Middle English game, gamen, gammen, from Old English gamen (“sport, joy, mirth, pastime, game, amusement, pleasure”), from Proto-West Germanic *gaman, from Proto-Germanic *gamaną (“amusement, pleasure, game\", literally \"participation, communion, people together”), from *ga- (collective prefix) + *mann- (“man”); or alternatively from *ga- + a root from Proto-Indo-European *men- (“to think, have in mind”).",
        "Cognate with Old Frisian game, gome (“joy, amusement, entertainment”), Middle High German gamen (“joy, amusement, fun, pleasure”), Swedish gamman (“mirth, rejoicing, merriment”), Icelandic gaman (“fun”). Related to gammon, gamble."
      ],
      "adjectives": [
        {
          "description": "game (comparative gamer, superlative gamest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Willing and able to participate.",
                  "examples": [
                    "Synonyms: sporting, willing, daring, disposed, favorable, nervy, courageous, valiant",
                    "Antonyms: cautious, disinclined"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of an animal) That shows a tendency to continue to fight against another animal, despite being wounded, often severely.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Persistent, especially in senses similar to the above.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "game (countable and uncountable, plural games)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "A playful or competitive activity.",
              "entries": [
                {
                  "meaning": "A playful activity that may be unstructured; an amusement or pastime.",
                  "examples": [
                    "Synonyms: amusement, diversion, entertainment, festivity, frolic, fun, gaiety, gambol, lark, merriment, merrymaking, pastime, play, prank, recreation, sport, spree",
                    "Antonyms: drudgery, work, toil",
                    "Being a child is all fun and games."
                  ]
                },
                {
                  "meaning": "(countable) An activity described by a set of rules, especially for the purpose of entertainment, often competitive or having an explicit goal.",
                  "examples": [
                    "Synonyms: see Thesaurus:game"
                  ]
                },
                {
                  "meaning": "(UK, in the plural) A school subject during which sports are practised.",
                  "examples": []
                },
                {
                  "meaning": "(countable) A particular instance of playing a game.",
                  "examples": [
                    "Synonym: match",
                    "Sally won the game.",
                    "They can turn the game around in the second half."
                  ]
                },
                {
                  "meaning": "That which is gained, such as the stake in a game.",
                  "examples": []
                },
                {
                  "meaning": "The number of points necessary to win a game.",
                  "examples": [
                    "In short whist, five points are game.",
                    "See also: for the win"
                  ]
                },
                {
                  "meaning": "(card games) In some games, a point awarded to the player whose cards add up to the largest sum.",
                  "examples": []
                },
                {
                  "meaning": "(countable) The equipment that enables such activity, particularly as packaged under a title.",
                  "examples": [
                    "Some of the games in the closet we have on the computer as well."
                  ]
                },
                {
                  "meaning": "One's manner, style, or performance in playing a game.",
                  "examples": [
                    "Study can help your game of chess.",
                    "Hit the gym if you want to toughen up your game."
                  ]
                },
                {
                  "meaning": "(countable) Ellipsis of video game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Lovemaking, flirtation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Prostitution. (Now chiefly in on the game.)",
                  "examples": [
                    "[H]e put spurs to his horse, and just in the twilight reached the gate, where, at that time, there happened to be two ladies of the game [translating mugeres moças], who being on their journey to Seville, with the carriers, had chanced to take up their night's lodging in this place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal, nearly always singular) A field of gainful activity, as an industry or profession.",
                  "examples": [
                    "Synonym: line",
                    "When it comes to making sales, John is the best in the game.",
                    "He's in the securities game somehow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, figuratively) Something that resembles a game with rules, despite not being designed.",
                  "examples": [
                    "In the game of life, you may find yourself playing the waiting game far too often."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, military) An exercise simulating warfare, whether computerized or involving human participants.",
                  "examples": [
                    "Synonym: wargame"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) wild animals hunted for food.",
                  "examples": [
                    "The forest has plenty of game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, informal, used mostly for men) The ability to seduce someone, usually by strategy.",
                  "examples": [
                    "He didn't get anywhere with her because he had no game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Mastery; the ability to excel at something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A questionable or unethical practice in pursuit of a goal.",
                  "examples": [
                    "Synonyms: scheme, racket",
                    "You want to borrow my credit card for a week? What's your game?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "game (third-person singular simple present games, present participle gaming, simple past and past participle gamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To gamble.",
                  "examples": [
                    "an impressive protest against gaming, swearing, and all immoral practices which might forfeit divine aid in the great struggle for National Independence"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To play card games, board games, or video games.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exploit loopholes in a system or bureaucracy in a way which defeats or nullifies the spirit of the rules in effect, usually to obtain a result which otherwise would be unobtainable.",
                  "examples": [
                    "We'll bury them in paperwork, and game the system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, seduction community, slang, of males) To perform premeditated seduction strategy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [
        {
          "description": "game (comparative more game, superlative most game)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Injured, lame (of a limb).",
                  "examples": [
                    "You come with me and we'll have a cozy dinner and a pleasant talk together, and by that time your game ankle will carry you home very nicely, I am sure.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}