{
  "word": "uncircumcised",
  "etymologies": [
    {
      "description": [
        "From Middle English uncircumcised, equivalent to un- +‎ circumcised.  Subsidiary definitions are much influenced by traditions of the Abrahamic religions."
      ],
      "adjectives": [
        {
          "description": "uncircumcised (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not circumcised, intact.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Not Jewish or Muslim; gentile",
                  "examples": [
                    "Even to-day the Turk hurls abuse at the Christian by calling him \"an uncircumcised dog.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Spiritually impure; irreligious.",
                  "examples": [
                    "The Scripture speaks of uncircumcised hearts, and uncircumcised lips, and uncircumcised ears ; and our eyes in looking, and coveting, and our hands in reaching to that which is not ours, are as far uncircumcised as ears, or lips, or hearts : therefore we are to carry this circumcision all over; We must circumcise, says St. Bernard, in came, peccatum, the flesh, the body, the substance of the sin, in cute, operimentum, in the skin, all covers, and palliations, and disguises, and extenuations of the sin; and, in sanguine incentimm, in the blood all fomentations and provocations to that sin: the sin itself, the circumstances of the sin, the relapses to or towards that sin must be circumcised ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Closed in, so as to work imperfectly",
                  "examples": [
                    "Moises answeride bifore the Lord, Lo! the children of Israel here not me, and hou schal Farao here, moost sithen Y am vncircumcidid in lippis?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}