{
  "word": "husband",
  "etymologies": [
    {
      "description": [
        "From Middle English husbonde, housbonde, from Old English hūsbonda, hūsbunda (“male head of a household, householder, master of a house”), from Old Norse húsbóndi (“master of house”), from hús (“house”) + bóndi (“dweller, householder”), equivalent to house +‎ bond (“serf, slave\", originally, \"dweller”).",
        "Bond in turn represents a formation derived from the present participle of West Scandinavian búa, East Scandinavian bôa = to build, plow; compare German bauen, der Bauende. Cognate with Icelandic húsbóndi (“head of household”), Faroese húsbóndi (“husband”), Norwegian husbond (“head of household, husband”), Swedish husbonde (“master”), Danish husbond (“husband”) (< Old Danish husbonde)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "husband (plural husbands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The master of a house; the head of a family; a householder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tiller of the ground; a husbandman.",
                  "examples": [
                    "He is the neatest husband for curious ordering his domestick and field accommodations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prudent or frugal manager.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A man in a marriage or marital relationship, especially in relation to his spouse.",
                  "examples": [
                    "You should start dating so you can find a suitable husband."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The male of a pair of animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A manager of property; one who has the care of another's belongings, owndom, or interests; a steward; an economist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large cushion with arms meant to support a person in the sitting position.",
                  "examples": [
                    "While reading her book, Sally leaned back against her husband, wishing it were the human kind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) A polled tree; a pollard.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "husband (third-person singular simple present husbands, present participle husbanding, simple past and past participle husbanded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To manage or administer carefully and frugally; use to the best advantage; economise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To conserve.",
                  "examples": [
                    "...I found pens, ink, and paper, and I husbanded them to the utmost; and I shall show that while my ink lasted, I kept things very exact, but after that was gone I could not, for I could not make any ink by any means that I could devise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To till; cultivate; farm; nurture.",
                  "examples": [
                    "Land so trim and rarely husbanded."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with a husband.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To engage or act as a husband to; assume the care of or responsibility for; accept as one's own.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}