{
  "word": "praemunire",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin praemūnīre, shortened form of praemunire facias (“that you cause to be forewarned”) from the opening words of the writ: praemūnīre (“to fortify (defend in advance)”) (an error for praemonēre (“to forewarn”)) + faciās (“you make”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "praemunire (plural praemunires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, now historical) The offence in English law of bringing suit in or obeying a foreign (especially papal) court or authority, thus challenging the supremacy of the Crown. The offence was created by the Statute of Praemunire 1393 (16 Richard II, chapter 5), and abolished by the Criminal Law Act 1967 (chapter 58).",
                  "examples": [
                    "For I have heard of a judge, who upon the criminal's appeal to the dreadful day of judgment, told him, he had incurred a premunire, for appealing to a foreign jurisdiction; and of another in Wales, who severely checked the prisoner for offering the same plea  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The writ charging a person with this offence, the writ of praemunire facias.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in extended use) Any of a number of criminal offences incurring similar penalties to the original offence of praemunire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Crime, offence, wrongdoing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The penalty for this offence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A difficulty or predicament.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "praemunire (third-person singular simple present praemunires, present participle praemuniring, simple past and past participle praemunired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, historical) To charge with the offence of praemunire; to subject to the penalties of praemunire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}