{
  "word": "diptych",
  "etymologies": [
    {
      "description": [
        "From Late Latin diptycha, plural, from Ancient Greek, neuter plural of δίπτυχος (díptukhos, “folded, doubled”), from δι (di) + -πτυχος (-ptukhos) (akin to Greek πτυχή (ptychí, “fold, layer”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "diptych (plural diptychs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A writing tablet consisting of two leaves of rigid material connected by hinges and shutting together so as to protect the writing within.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) A picture or series of pictures painted on two tablets, usually connected by hinges.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A double catalogue, containing in one part the names of living, and in the other of deceased, ecclesiastics and benefactors of a church.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A catalogue of saints.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, Ancient Rome) Artistically-wrought tablets distributed by consuls, etc. of the later Roman Empire to commemorate their tenure of office; hence (transferred sense) a list of magistrates.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A novel published in two volumes forming one continuous story (as opposed to a duology or dilogy).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A literary work consisting of two contrasting parts, such as a narrative telling the same story from two opposing points of view.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transferred sense) Any work made up of two parts treating complementary or contrasting aspects of one general topic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}