{
  "word": "pandect",
  "etymologies": [
    {
      "description": [
        "Sense 3 (“comprehensive treatise”) is from Latin pandectēs (“book that contains everything, encyclopedia”), from Ancient Greek πανδέκτης (pandéktēs, “encyclopedia”, literally “all-receiver”), from παν- (pan-, prefix meaning ‘all’) (from πᾶς (pâs, “all”)) + δέκτης (déktēs, “receiver, recipient”) (from δέχομαι (dékhomai, “to receive”) (from Proto-Indo-European *deḱ- (“to take; to perceive”)) + -της (-tēs, suffix forming agent nouns)).",
        "Sense 1 (“compendium of writings on Roman law”) in the plural form Pandects is from Late Latin pandectae (“the Pandects”), the plural of pandectēs, modelled after (Byzantine) Ancient Greek πανδέκται (pandéktai, “the Pandects”), the plural of πανδέκτης (pandéktēs): see further above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pandect (plural pandects)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Rome, law, historical) Usually in the plural form Pandects: a compendium or digest of writings on Roman law divided in 50 books, compiled in the 6th century C.E. by order of the Eastern Roman emperor Justinian I (c. 482–565).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, rare) Also in the plural form pandects: a comprehensive collection of laws; specifically, the whole body of law of a country; a legal code.",
                  "examples": [
                    "Synonym: digest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, also figuratively) A treatise or similar work that is comprehensive as to a particular topic; specifically (Christianity) a manuscript of the entire Bible.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}