{
  "word": "wardrobe",
  "etymologies": [
    {
      "description": [
        "From Middle English warderobe, from Old Northern French warderoube, wardereube, northern variants of Old French garderobe, from garder (“to keep safe”) + robe. Subsequently influenced by various senses of garderobe as they developed in French."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wardrobe (plural wardrobes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A room for keeping clothes and armor safe, particularly a dressing room or walk-in closet beside a bedroom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A governmental office or department in a monarchy which purchases, keeps, and cares for royal clothes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The building housing such a department.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any closet used for storing anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A room for keeping costumes and other property safe at a theater; a prop room.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The department of a theater, movie studio, etc which purchases, keeps, and cares for costumes; its staff; its room(s) or building(s).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A movable cupboard or cabinet designed for storing clothes, particularly as a large piece of bedroom furniture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tall built-in cupboard or closet for storing clothes, often including a rail for coat-hangers, and usually located in a bedroom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, uncommon) Anything that similarly stores or houses something.",
                  "examples": [
                    "Now death... crams his store house to the top with bloud,Might I now and Andrea in one fight,Make vp thy wardroopeRicher by a knight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The contents of a wardrobe: an individual's entire collection of clothing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any collection of clothing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, uncommon) Any collection of anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A private chamber, particularly one used for sleeping or (euphemistic) urinating and defecating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting, obsolete) Badger feces, particularly used in tracking game.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wardrobe (third-person singular simple present wardrobes, present participle wardrobing, simple past and past participle wardrobed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act as a wardrobe department, to provide clothing or sets of clothes.",
                  "examples": [
                    "[…]  impressed with the quality of the talent and production, good wardrobing and speedy pacing."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}