{
  "word": "identify",
  "etymologies": [
    {
      "description": [
        "From French identifier, from Medieval Latin identicus + Latin faciō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "identify (third-person singular simple present identifies, present participle identifying, simple past and past participle identified)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To establish the identity of someone or something.",
                  "examples": [
                    "It was hard to identify the shoplifter because the CCTV records didn't have a clear image."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disclose the identity of someone.",
                  "examples": [
                    "The Associated Press will not identify the suspect of the crime because he is a juvenile."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, biology) To establish the taxonomic classification of an organism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To equate or make the same; to unite or combine into one.",
                  "examples": [
                    "Let us identify, let us incorporate ourselves with the people."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To have a strong affinity with; to feel oneself to be modelled on or connected to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To associate oneself with some group; to feel, or believe one feels, the same way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, with as) To claim an identity; to describe oneself as a member of a group; to assert the use of a particular term to describe oneself.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}