{
  "word": "dance",
  "etymologies": [
    {
      "description": [
        "From Middle English dauncen, daunsen, a borrowing from Anglo-Norman dauncer, dancer (“to dance”) (compare Old French dancier), from Frankish *þansōn (“to draw, pull, stretch out, gesture”) (compare Old High German dansōn (“to draw, pull”)), from Proto-West Germanic *þansōn, ultimately from Proto-Indo-European *tens- (“to stretch, pull”). Replaced Old English sealtian (“to dance”) borrowed from Latin saltāre (“to leap, dance”). More at thin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dance (countable and uncountable, plural dances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sequence of rhythmic steps or movements usually performed to music, for pleasure or as a form of social interaction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A social gathering where dancing is the main activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The art, profession, and study of dancing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A genre of modern music characterised by sampled beats, repetitive rhythms and few lyrics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of music with a particular dance rhythm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A battle of wits, especially one commonly fought between two rivals.",
                  "examples": [
                    "So how much longer are we gonna do this dance?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, dated) Any strenuous or difficult movement, action, or task.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A normally horizontal stripe called a fess that has been modified to zig-zag across the center of a coat of arms from dexter to sinister.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(apiology) A repetitive movement used in communication between worker honey bees.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The death throes of a hanged person.",
                  "examples": [
                    "1926,  Walter Noble Burns,  The Saga of Billy the Kid‎[2], page 250:Beneath the shoulder blades of the limp form lying there lay the heart that had hated him, that had beat high at the thought of seeing him kick at the end of a hangman's rope, that had exulted in the prospect of him dancing a death dance on air.",
                    "2010 January 12,  Sara Starbuck,  Dread Pirate Fleur and the Hangman's Noose‎[3], page 342:'Hats off!' the shout went up, not out of respect for those about to die, but for a better view of their death dance. The hangman, who was as drunk as anyone else,  uncoiled the rope's free end from each prisoner in turn and threw it up to an assistant balanced precariously on the beam above. Each was tightly fastened, leaving very little slack. When the moment came, the carts would be driven out from under the prisoners, leaving them dancing the Tyburn jig, their legs paddling helplessly in the air.",
                    "2022 November 30,  John Gardiner,  A Hitchhiker's Triptych‎[4]:Initially, all hanging deaths were by the short rope. The victims strangled as they performed a twitching death dance. Over time there was a move to a longer rope. The extra drop meant the victim's neck snapped, causing a more humane death. For a long time adter the long rope was introduced, stories circulated around Aberdeen of executioners slipping in the short rope for criminals convicted of particularly heinous crimes, especially for crimes against children. No quick end for these devils. A slow dancing death, courtesy of the short rope, brouht in by canny executioners."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dance (third-person singular simple present dances, present participle dancing, simple past and past participle danced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move with rhythmic steps or movements, especially in time to music.",
                  "examples": [
                    "I danced with her all night long.",
                    "These drum beats are making me dance!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To leap or move lightly and rapidly.",
                  "examples": [
                    "His eyes danced with pleasure as he spoke.   She accused her political opponent of dancing around the issue instead of confronting it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To perform the steps to.",
                  "examples": [
                    "Have you ever danced the tango?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to dance, or move nimbly or merrily about.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, euphemistic) To make love or have sex.",
                  "examples": [
                    "You make me feel like dancing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(apiology, of a worker honey bee) To make a repetitive movement in order to communicate to other worker honey bees.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, euphemistic) To kick and convulse from the effects of being hanged.",
                  "examples": [
                    "1907,  Literary Digest‎[6], volume 34, page 364:If that veil can be maintained, if the workers can be kept from knowing the perfidy of officials, the criminality of capitalism, the murderous vengeance that is planned by the plutocratic powers of America, then Charles Moyer, William D. Haywood, and George Pettibone will dance on empty air, while the ghouls of capitalism rejoice because they have landed another blow upon the body of resisting labor.",
                    "1926,  Walter Noble Burns,  The Saga of Billy the Kid‎[7], page 250:Beneath the shoulder blades of the limp form lying there lay the heart that had hated him, that had beat high at the thought of seeing him kick at the end of a hangman's rope, that had exulted in the prospect of him dancing a death dance on air.",
                    "2001,  Paul Doherty,  The Hangman's Hymn (Canterbury Tales Mysteries, Book 5)‎[8]:Simon had seen other men executed at Berkeley, both in the castle and outside in the village. They were usually strung up like rats, left to dance, their death throes sometimes seeming to last forever.",
                    "2010 January 12,  Sara Starbuck,  Dread Pirate Fleur and the Hangman's Noose‎[9], page 342:'Hats off!' the shout went up, not out of respect for those about to die, but for a better view of their death dance. The hangman, who was as drunk as anyone else,  uncoiled the rope's free end from each prisoner in turn and threw it up to an assistant balanced precariously on the beam above. Each was tightly fastened, leaving very little slack. When the moment came, the carts would be driven out from under the prisoners, leaving them dancing the Tyburn jig, their legs paddling helplessly in the air.",
                    "2019 November 7,  Carter J. Gregory,  The Hangman's Psalm: The Girl at the Gallows‎[10]:Not only will you be whipped, but Jack Ketch will be displeased. He knows how to attach the rope just so...a man's neck can be snaped in an instant and he feels pain for a moment only. Or, at Ketch's pleasure, the man swings in the air, his legs dance in an ungainly manner, his face turns red, his tongue turns purple and protrudes - a poor devil once bit off the tip and spit it out, and he chocked(sic) to death.",
                    "2022 November 30,  John Gardiner,  A Hitchhiker's Triptych‎[11]:Initially, all hanging deaths were by the short rope. The victims strangled as they performed a twitching death dance. Over time there was a move to a longer rope. The extra drop meant the victim's neck snapped, causing a more humane death. For a long time adter the long rope was introduced, stories circulated around Aberdeen of executioners slipping in the short rope for criminals convicted of particularly heinous crimes, especially for crimes against children. No quick end for these devils. A slow dancing death, courtesy of the short rope, brouht in by canny executioners."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}