{
  "word": "stamp",
  "etymologies": [
    {
      "description": [
        "From Middle English stampen (“to pound, crush”), from assumed Old English *stampian, variant of Old English stempan (“to crush, pound, pound in mortar, stamp”), from Proto-West Germanic *stampōn, *stampijan, from Proto-Germanic *stampōną, *stampijaną (“to trample, beat”), from Proto-Indo-European *stemb- (“to trample down”). Cognate with Dutch stampen (“to stamp, pitch”), German stampfen (“to stamp”), Danish stampe (“to stamp”), Swedish stampa (“to stomp”), Occitan estampar, Polish stąpać (“to step, treat”). See also stomp, step. Marks indicating that postage had been paid were originally made by stamping the item to be mailed; when affixed pieces of paper were introduced for this purpose, the term “stamp” was transferred to cover this new form."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stamp (plural stamps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of stamping the foot, paw or hoof.",
                  "examples": [
                    "The horse gave two quick stamps and rose up on its hind legs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An indentation, imprint, or mark made by stamping.",
                  "examples": [
                    "My passport has quite a collection of stamps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for stamping designs.",
                  "examples": [
                    "She loved to make designs with her collection of stamps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small piece of paper, with a design and a face value, used to prepay postage or other dues such as tax or licence fees.",
                  "examples": [
                    "I need one first-class stamp to send this letter.",
                    "Now that commerce is done electronically, tax stamps are no longer issued here."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small piece of paper bearing a design on one side and adhesive on the other, used to decorate letters or craft work.",
                  "examples": [
                    "These stamps have a Christmas theme."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, figuratively) A tattoo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A single dose of lysergic acid diethylamide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of heavy pestle, raised by water or steam power, for crushing ores.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cast; form; character; distinguishing mark or sign; evidence.",
                  "examples": [
                    "the stamp of criminality"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stamp (third-person singular simple present stamps, present participle stamping, simple past and past participle stamped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To step quickly and heavily, once or repeatedly.",
                  "examples": [
                    "The toddler screamed and stamped, but still got no candy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (the foot or feet) quickly and heavily, once or repeatedly.",
                  "examples": [
                    "The crowd cheered and stamped their feet in appreciation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike, beat, or press forcibly with the bottom of the foot, or by thrusting the foot downward.",
                  "examples": [
                    "He frets, he fumes, he stares, he stamps the ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark by pressing quickly and heavily.",
                  "examples": [
                    "This machine stamps the metal cover with a design.",
                    "This machine stamps the design into the metal cover."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give an official marking to, generally by impressing or imprinting a design or symbol.",
                  "examples": [
                    "The immigration officer stamped my passport."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply postage stamps to.",
                  "examples": [
                    "I forgot to stamp this letter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To mark; to impress.",
                  "examples": [
                    "God  […]  has stamped no original characters on our minds wherein we may read his being."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}