{
  "word": "grant",
  "etymologies": [
    {
      "description": [
        "From Middle English granten, graunten, grantien, grauntien, from Anglo-Norman granter, graunter, from Old French granter, graunter, graanter, greanter (“to promise, assure, guarantee, confirm, ratify”), from a merger of Old French garantir, guarantir (“to guarantee, assure, vouch for”) (see English guarantee) and earlier cranter, craanter, creanter (“to allow, permit”), from an assumed Medieval Latin *credentāre, from Latin credere (“to believe, trust”). More at guarantee, credit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grant (plural grants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of granting; a bestowing or conferring; concession; allowance; permission.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The yielding or admission of something in dispute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The thing or property granted; a gift; a boon.",
                  "examples": [
                    "I got a grant from the government to study archeology in Egypt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A transfer of property by deed or writing; especially, an appropriation or conveyance made by the government.",
                  "examples": [
                    "a grant of land or of money"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The deed or writing by which such a transfer is made.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An application for a grant (monetary boon to aid research or the like).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grant (third-person singular simple present grants, present participle granting, simple past and past participle granted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ditransitive) to give (permission or wish)",
                  "examples": [
                    "He was granted permission to attend the meeting.",
                    "The genie granted him three wishes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ditransitive) To bestow or confer, with or without compensation, particularly in answer to prayer or request; to give.",
                  "examples": [
                    "God, grant me the serenity... in w:Serenity Prayer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To agree with (someone) on (something); to accept (something) for the sake of argument; to admit to (someone) that (something) is true.",
                  "examples": [
                    "Synonyms: concur, concede, allow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To assent; to consent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}