{
  "word": "basilisk",
  "etymologies": [
    {
      "description": [
        "From Middle English basilicke, borrowed from Old French basilique, from Latin basiliscus, from Ancient Greek βασιλίσκος (basilískos, “literally, a minor king or chieftain; also, possibly based on descriptions or rare encounters with different types of cobras could have given rise to the mythical snake \"Basilisk\", as certain cobras have crown-like patterns on their heads. The \"deadly gaze\" of the basilisk could have been from the \"spitting cobras\" ability to spit their venom into the eyes of any predators or prey from a distance”), from βασιλεύς (basileús, “king”).  The cognitohazard/infohazard sense is by analogy with the deadly gaze of the mythical creature."
      ],
      "adjectives": [
        {
          "description": "basilisk (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Suggesting a basilisk (snake-like dragon): baleful, spellbinding.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "basilisk (plural basilisks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mythical snake-like dragon, so venomous that even its gaze was deadly.",
                  "examples": [
                    "the deadly look of the basilisk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(science fiction) An infohazard or cognitohazard, especially a Langford's basilisk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A type of dragon used in heraldry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tree-dwelling type of lizard of the genus Basiliscus: the basilisk lizard.",
                  "examples": [
                    "As a guide to start your collection we'd suggest either iguanas, tejus, swifts, basilisks, horned toads or alligator lizards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of large brass cannon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}