{
  "word": "velvet",
  "etymologies": [
    {
      "description": [
        "From Middle English velvet, velwet, veluet, from Old Occitan veluet, from Late Latin villutittus, diminutive of villūtus, from Latin villus (“shaggy hair, tuft of hair”). Cognate with French velours."
      ],
      "adjectives": [
        {
          "description": "velvet (comparative more velvet, superlative most velvet)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of velvet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Soft and delicate, like velvet; velvety.",
                  "examples": [
                    "The fawn then rose up, and creeping gently about the room, touched the cheeks or hands of the slumbering inmates with its velvet tongue, but so softly that none were awakened."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Peaceful; carried out without violence; especially as pertaining to the peaceful breakup of Czechoslovakia.",
                  "examples": [
                    "What at the time of the initial agreement of Yeltsin, Shushkevich and Kravchuk to join together in a new 'Commonwealth of Independent States' had seemed like a reconstitution of the lands of ancient Rus, quickly turned out to be, in the words of the leading Russian-Ukrainian reformer Aleksandr Tsipko, merely a 'velvet disintegration'."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "velvet (countable and uncountable, plural velvets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A closely woven fabric (originally of silk, now also of cotton or man-made fibres) with a thick short pile on one side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Very fine fur, including the skin and fur on a deer's antlers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, countable) A female chinchilla; a sow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) The drug dextromethorphan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Money acquired by gambling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "velvet (third-person singular simple present velvets, present participle velveting, simple past and past participle velveted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover with velvet or with a covering of a similar texture.",
                  "examples": [
                    "Penmachno mill is situate where a stream has furrowed a deep channel, and velveted the rocks with the richest mosses  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) To coat raw meat in starch, then in oil, preparatory to frying.",
                  "examples": [
                    "Blanching cut and specially marinated chicken in oil or water prior to stir-frying is a technique common to Chinese restaurant kitchens. The 20-second bath tenderizes the chicken remarkably, hence the process has been dubbed \"velveting\" in English. Velveted chicken is half-cooked, will not stick to the pan, and needs almost no oil when stir-fried."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the velvet from a deer's antlers.",
                  "examples": [
                    "Reacting to painkillers when velveted, Sovereign II was too sick to grow antlers last year, but has since recovered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, transitive) To soften; to mitigate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a cat's claws) to retract.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}