{
  "word": "sheet",
  "etymologies": [
    {
      "description": [
        "From Middle English schete; partly from Old English sċīete (“a sheet, a piece of linen cloth”); partly from Old English sċēata (“a corner, angle; the lower corner of a sail, sheet”); and Old English sċēat (“a corner, angle”); all from Proto-Germanic *skautijǭ, *skautaz (“corner, wedge, lap”), from Proto-Indo-European *(s)kewd- (“to throw, shoot, pursue, rush”).",
        "Cognate with North Frisian skut (“the fold of a garment, lap, coattail”), West Frisian skoat (“sheet; sail; lap”), Dutch schoot (“the fold of a garment, lap, sheet”), German Low German Schote (“a line from the foot of a sail”), German Schoß (“the fold of a garment, lap”), Swedish sköt (“sheet”), Icelandic skaut (“the corner of a cloth, a line from the foot of a sail, the skirt or sleeve of a garment, a hood”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sheet (plural sheets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin bed cloth used as a covering for a mattress or as a layer over the sleeper.",
                  "examples": [
                    "Use the sheets in the hall closet to make the bed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of paper, usually rectangular, that has been prepared for writing, artwork, drafting, wrapping, manufacture of packaging (boxes, envelopes, etc.), and for other uses. The word does not include scraps and irregular small pieces destined to be recycled, used for stuffing or cushioning or paper mache, etc.",
                  "examples": [
                    "Holonyms: signature, quire",
                    "Meronyms: leaf, folium, page",
                    "A sheet of paper measuring eight and one-half inches wide by eleven inches high is a popular item in commerce.",
                    "Paper is designated “20 pound” if a stack (ream) of 500 sheets 22 inches by 17 inches weighs 20 pounds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat metal pan, often without raised edge, used for baking.",
                  "examples": [
                    "Place the rolls on the cookie sheet, edges touching, and bake for 10-11 minutes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin, flat layer of solid material.",
                  "examples": [
                    "The glazer cut several panes from a large sheet of glass.",
                    "A sheet of that new silicon stuff is as good as a sheet of tinfoil to keep food from sticking in the baking pan."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broad, flat expanse of a material on a surface.",
                  "examples": [
                    "Mud froze on the road in a solid sheet, then more rain froze into a sheet of ice on top of the mud!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A line (rope) used to adjust the trim of a sail.",
                  "examples": [
                    "To be \"three sheets to the wind\" is to say that a four-cornered sail is tethered only by one sheet and thus the sail is useless."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, nonstandard) A sail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) The area of ice on which the game of curling is played.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard) A layer of veneer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Precipitation of such quantity and force as to resemble a thin, virtually solid wall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) An extensive bed of an eruptive rock intruded between, or overlying, other strata.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The space in the forward or after part of a boat where there are no rowers.",
                  "examples": [
                    "fore sheets; stern sheets"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, dated) A distinct level or stage within a game.",
                  "examples": [
                    "If you land safely you will gain 30 extra points and move to the next sheet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sheet (third-person singular simple present sheets, present participle sheeting, simple past and past participle sheeted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or wrap with cloth, or paper, or other similar material.",
                  "examples": [
                    "Remember to sheet the floor before you start painting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form into sheets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of rain, or other precipitation, to pour heavily.",
                  "examples": [
                    "We couldn't go out because the rain was sheeting down all day long."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To trim a sail using a sheet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}