{
  "word": "history",
  "etymologies": [
    {
      "description": [
        "From Middle English historie, from Old French estoire, estorie (“chronicle, history, story”) (French histoire), from Latin historia, from Ancient Greek ἱστορίᾱ (historíā, “learning through research”), from ἱστορέω (historéō, “to research, inquire (and) record”), from ἵστωρ (hístōr, “the knowing, wise one”), from Proto-Indo-European *weyd- (“see, know”). Doublet of story and storey.",
        "Attested in Middle English in 1393 by John Gower, Confessio Amantis, which was aimed at an educated audience familiar with French and Latin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "history (countable and uncountable, plural histories)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The aggregate of past events.",
                  "examples": [
                    "Synonyms: background, past"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The branch of knowledge that studies the past; the assessment of notable events.",
                  "examples": [
                    "He teaches history at the university.",
                    "History will not look kindly on these tyrants.",
                    "He dreams of an invention that will make history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The portion of the past that is known and recorded by this field of study, as opposed to all earlier and unknown times that preceded it (prehistory).",
                  "examples": [
                    "in all of human history and prehistory",
                    "in all recorded history"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A set of events involving an entity.",
                  "examples": [
                    "What is your medical history?",
                    "The family's history includes events best forgotten.",
                    "a long and sordid history"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A record or narrative description of past events.",
                  "examples": [
                    "Synonyms: account, chronicle, story, tale",
                    "I really enjoyed Shakespeare's tragedies more than his histories.",
                    "a short history of post-Columbian colonization"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, medicine) A list of past and continuing medical conditions of an individual or family.",
                  "examples": [
                    "Synonym: medical history",
                    "A personal medical history is required for the insurance policy.",
                    "He has a history of cancer in his family.",
                    "This diagnosis is usually based solely on the history and physical examination, although laboratory tests are occasionally also obtained."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, computing) A record of previous user events, especially of visited web pages in a browser.",
                  "examples": [
                    "Synonym: log",
                    "I visited a great site yesterday but forgot the URL. Luckily, I didn't clear my history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Something that no longer exists or is no longer relevant.",
                  "examples": [
                    "I told him that if he doesn't get his act together, he's history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Shared experience or interaction.",
                  "examples": [
                    "There is too much history between them for them to split up now.",
                    "He has had a lot of history with the police."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "history (third-person singular simple present histories, present participle historying, simple past and past participle historied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To narrate or record.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}