{
  "word": "heath",
  "etymologies": [
    {
      "description": [
        "From Middle English heeth, heth, hethe, from Old English hǣþ (“heath, untilled land, waste; heather”), from Proto-West Germanic *haiþi, from Proto-Germanic *haiþī (“heath, waste, untilled land”), from Proto-Indo-European *kayt- (“forest, wasteland, pasture”). Cognate with Dutch heide (“heath, moorland”), German Heide (“heath, moor”), Norwegian hei (“heath”), Swedish hed (“heath, moorland”), Old Welsh coit (“forest”), Welsh coed (“forest”), Latin būcētum (“pastureland”, literally “cow-pasture”) -cetum (“place of, grove of”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "heath (countable and uncountable, plural heaths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tract of level uncultivated land with sandy soil and scrubby vegetation; heathland.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Any small evergreen shrub of the family Ericaceae.",
              "entries": [
                {
                  "meaning": "Many of the species in the genus Erica",
                  "examples": []
                },
                {
                  "meaning": "Many of the species in the genus Cassiope",
                  "examples": []
                },
                {
                  "meaning": "Both species in the genus Daboecia",
                  "examples": []
                },
                {
                  "meaning": "Any of the species in the genus Epacris, Australian heath",
                  "examples": []
                },
                {
                  "meaning": "Any of the species in the genus Leucopogon, beard heath",
                  "examples": []
                },
                {
                  "meaning": "Any of the species in the genus Phyllodoce, mountain heath",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable) Certain butterflies and moths",
              "entries": [
                {
                  "meaning": "The palearctic species of Coenonympha, a genus of brush-footed butterfly",
                  "examples": []
                },
                {
                  "meaning": "Coenonympha pamphilus, native to Europe, Asia except tropical India and Indochina, and Northern Africa, the small heath",
                  "examples": []
                },
                {
                  "meaning": "Coenonympha tullia, native to Europe, Asia except tropical India and Indochina, and North America, the large heath",
                  "examples": []
                },
                {
                  "meaning": "Melitaea athalia, the heath fritillary",
                  "examples": []
                },
                {
                  "meaning": "Semiothisa clathrata, a moth known as the latticed heath",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}