{
  "word": "scandal",
  "etymologies": [
    {
      "description": [
        "From Middle French scandale (“indignation caused by misconduct or defamatory speech”), from Ecclesiastical Latin scandalum (“that on which one trips, cause of offense”, literally “stumbling block”), from Ancient Greek σκάνδαλον (skándalon, “a trap laid for an enemy, a cause of moral stumbling”), from Proto-Indo-European *skand- (“to jump”). Cognate with Latin scandō (“to climb”). First attested from Old Northern French escandle, but the modern word is a reborrowing. Doublet, via Old French esclandre, of slander.",
        "Sense evolution from \"cause of stumbling, that which causes one to sin, stumbling block\" to \"discredit to reputation, that which brings shame, thing of disgrace\" is possibly due to early influence from other similar sounding words for infamy and disgrace (compare Old English scand (“ignominity, scandal, disgraceful thing”), Old High German scanda (“ignominy, disgrace”), Gothic 𐍃𐌺𐌰𐌽𐌳𐌰 (skanda, “shame, disgrace”)). See shand, shend, shonda."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scandal (countable and uncountable, plural scandals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An incident or event that disgraces or damages the reputation of the persons or organization involved.",
                  "examples": [
                    "Their affair was reported as a scandal by most tabloids."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Damage to one's reputation.",
                  "examples": [
                    "The incident brought considerable scandal to his family."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Widespread moral outrage, indignation, as over an offence to decency.",
                  "examples": [
                    "When their behaviour was made public it caused a great scandal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) Religious discredit; an act or behaviour which brings a religion into discredit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) Something which hinders acceptance of religious ideas or behaviour; a stumbling-block or offense.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Defamatory talk; gossip, slander.",
                  "examples": [
                    "According to village scandal, they weren't even married."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scandal (third-person singular simple present scandals, present participle scandalling or scandaling, simple past and past participle scandalled or scandaled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To treat opprobriously; to defame; to slander.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To scandalize; to offend.",
                  "examples": [
                    "A propensity to scandal may partly proceed from an inability to distinguish the proper objects of censure"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}