{
  "word": "lamp",
  "etymologies": [
    {
      "description": [
        "From Middle English laumpe, lampe, from Old French lampe (“lamp, light”), from Latin lampas (“torch, lamp, light”), from Ancient Greek λαμπάς (lampás, “torch, lamp, beacon, light, meteor”), from Proto-Indo-European *leh₂p- (“to shine”). Cognate with Lithuanian lópė (“light”), Welsh llachar (“bright”). Displaced native Old English lēohtfæt (literally “light container”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lamp (plural lamps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device that generates heat, light or other radiation. Especially an electric light bulb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device containing oil, burnt through a wick for illumination; an oil lamp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of furniture holding one or more electric light sockets.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lamp (third-person singular simple present lamps, present participle lamping, simple past and past participle lamped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang) To hit, clout, belt, wallop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Ireland) To hunt at night using a lamp, during which bright lights are used to dazzle the hunted animal or to attract insects for capture.",
                  "examples": [
                    "Synonyms: (North America) jacklight, spotlight"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, US) To hang out or chill; to do nothing in particular.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make into a table lamp, said of a vase or urn, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}