{
  "word": "bingo",
  "etymologies": [
    {
      "description": [
        "Alternate form of bing, suggesting a ringing sound. Attested since 1925."
      ],
      "adjectives": [
        {
          "description": "bingo (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, aviation slang, chiefly military, primarily of fuel) Just sufficient to return to base (or, alternatively, to divert to an alternative airfield). (also written Bingo or BINGO)",
                  "examples": [
                    "Well, the old pucker factor went up about 75 notches at that point cause that length of time would put my wingman below Bingo fuel, plus the thought of sitting in an orbit several miles West of the Yen Bai  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bingo (countable and uncountable, plural bingos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A game of chance for two or more players, who mark off numbers on a grid as they are announced by the caller; the game is won by the first person to call out \"bingo!\" or \"house!\" after crossing off all numbers on the grid or in one line of the grid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A similar game or amusement in which participants tick off themed words, phrases or pictures as these are called out, or as they are mentioned, for example during a speech or performance:",
                  "examples": [
                    "animal bingo (animal pictures), ABBA bingo (titles or lyrics of ABBA songs), buzzword bingo"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A win in such a game.",
                  "examples": [
                    "There were two bingos in the last game, so the players split the prize money."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Scrabble, US) A play where all seven of a player's letter tiles are played, awarding a score bonus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bingo (third-person singular simple present bingos, present participle bingoing, simple past and past participle bingoed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To play the game of bingo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To give the winning cry of \"bingo!\" in a game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To play all of one's seven tiles in one move in the game of Scrabble, earning a score bonus.",
                  "examples": [
                    "With IN on the board, he bingoed with OPERATING for 74 points, while Ann added the CO in front of it for 30 points."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, aviation slang, chiefly military) To return to base.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Perhaps related to stingo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bingo (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, obsolete) Brandy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}