{
  "word": "rig",
  "etymologies": [
    {
      "description": [
        "From Early Modern English rygge, probably of North Germanic origin. Compare Norwegian rigge (“to bind up; wrap around; rig; equip”), Swedish dialectal rigga (“to rig a horse”), Faroese rigga (“to rig; to equip and fit; to make s.th. function”). Possibly from Proto-Germanic *rik- (“to bind”), from Proto-Indo-European *rign-, *reyg- (“to bind”); or related to Old English *wrīhan, wrīohan, wrēohan, wrēon (“to bind; wrap up; cover”). See also wry (“to cover; clothe; dress; hide”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rig (plural rigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The rigging of a sailing ship or other such craft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Special equipment or gear used for a particular purpose.",
                  "examples": [
                    "The climbers each had a different rig for climbing that particular rockface."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A large truck such as a semi-trailer truck.",
                  "examples": [
                    "Every rig at the truckstop had custom-made mud-flaps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The special apparatus used for drilling wells.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A costume or an outfit.",
                  "examples": [
                    "My sister and I always made our own rigs for Halloween."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, computing) A personal computer, typically one modified for looks.",
                  "examples": [
                    "When I saw a special version of Quake running on Voodoo hardware, I knew I would be forking out quite a bit of money on my gaming rig."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An imperfectly castrated horse, sheep etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Radio equipment, especially a citizen's band transceiver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(animation) A model outfitted with parameterized controls for animation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rig (third-person singular simple present rigs, present participle rigging, simple past and past participle rigged)",
          "definitionGroups": [
            {
              "group": "(transitive) To fit out with a harness or other equipment.",
              "entries": [
                {
                  "meaning": "(transitive, nautical) To equip and fit (a ship) with sails, shrouds, and yards.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, manufacturing) To move (a heavy object) with the help of slings, hoists, block and tackle, levers, or similar equipment.",
                  "examples": [
                    "To rig such massive equipment requires experienced riggers"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To dress or clothe in some costume.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make or construct something in haste or in a makeshift manner.",
                  "examples": [
                    "rig up a makeshift shelter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To manipulate something dishonestly for personal gain or discriminatory purposes.",
                  "examples": [
                    "to rig an election"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To make free with; hence, to steal; to pilfer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, animation) To outfit a model with controls for animation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See ridge."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rig (plural rigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Scotland, dialect) A ridge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Compare wriggle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rig (plural rigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A wanton; one given to unbecoming conduct.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A promiscuous woman.",
                  "examples": [
                    "However, terrible as it may seem to the tall maiden sisters of J.P.'s in Queen Anne houses with walled vegetable gardens, this courtesan, strumpet, harlot, whore, punk, fille de joie, street-walker, this trollop, this trull, this baggage, this hussy, this drab, skit, rig, quean, mopsy, demirep, demimondaine, this wanton, this fornicatress, this doxy, this concubine, this frail sister, this poor Queenie--did actually solicit me, did actually say 'coming home to-night, dearie' and my soul was not blasted enough to call a policeman."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A sportive or unbecoming trick; a frolic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A blast of wind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rig (third-person singular simple present rigs, present participle rigging, simple past and past participle rigged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To play the wanton; to act in an unbecoming manner; to play tricks.",
                  "examples": [
                    "Rigging and rifling all ways, and no noise / Made with thy soft feet, where it all destroys."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From ring (“algebraic structure”), omitting the letter n to suggest the lack of negatives. Compare structure like a ring but lacking a multiplicative identity."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rig (plural rigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(algebra, ring theory) An algebraic structure similar to a ring, but without the requirement that every element have an additive inverse.",
                  "examples": [
                    "The set of natural numbers N with the usual operations of addition and multiplication is a rig, but not a ring. The set of integers Z is a ring. For a rig/ring (R,0,+,1,−), the set of polynomials R[x] on a generator x with the usual operations of addition and multiplication is also a rig/ring."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}