{
  "word": "sterling",
  "etymologies": [
    {
      "description": [
        "From Middle English sterling, sterlinge, sterlynge, starling, of uncertain origin. Possibly from sterling (“starling”) (the bird), which at one time was stamped in quarters on the coin; or perhaps from Middle English sterre (“star”) + -ling (as in shilling), as some Norman coins presumably featured stars on them.",
        "For the UK currency gloss, the term is a contraction of esterling, referring to eastern merchants from Baltic towns who established a bullion weight standard for transactions. (Taylor and Palmer, 1968)"
      ],
      "adjectives": [
        {
          "description": "sterling (comparative more sterling, superlative most sterling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Of, or relating to British currency, or the former British coinage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Of, relating to, or made from sterling silver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of acknowledged worth or influence; high quality; authoritative.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Genuine; true; pure; of great value or excellence.",
                  "examples": [
                    "I have said that Mr. Crawley was a stern, unpleasant man; and it certainly was so. The man must be made of very sterling stuff, whom continued and undeserved misfortune does not make unpleasant."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "sterling (countable and uncountable, plural sterlings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The currency of the United Kingdom; especially the pound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Former British gold or silver coinage of a standard fineness: for gold 0.91666 and for silver 0.925.",
                  "examples": [
                    "Sterling was the known and approved standard in England, in all probability, from the beginning of King Henry the Second's reign."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sterling silver, or articles made from this material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A structure of pilings that protects the piers of a bridge; a starling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}