{
  "word": "hinge",
  "etymologies": [
    {
      "description": [
        "From Middle English henge, from Old English *henġ (“hinge”), compare Old English henġe- in henġeclif (“overhanging cliff”), Old English henġen (“hanging; that upon which a thing is hung”), from Proto-West Germanic *hangiju. Akin to Scots heenge (“hinge”), Saterland Frisian Hänge (“hinge”), Dutch heng (“door handle”), Low German henge (“a hook, hinge, handle”), Middle Dutch henghe, hanghe (“a hook, hinge, handle”), Scots hingel (“any attachment by which something is hung or fastened”), Dutch hengel (“hook”), geheng (“hinge”), hengsel (“handle”), dialectal German Hängel (“hook, joint”), German Henkel (“handle, hook”), Old English hōn (“to hang”), hangian (“to cause to hang, hang up”). More at hang."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hinge (plural hinges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A jointed or flexible device that allows the pivoting of a door etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A naturally occurring joint resembling such hardware in form or action, as in the shell of a bivalve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stamp hinge, a folded and gummed paper rectangle for affixing postage stamps in an album.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A principle, or a point in time, on which subsequent reasonings or events depend.",
                  "examples": [
                    "This argument was the hinge on which the question turned."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics) The median of the upper or lower half of a batch, sample, or probability distribution.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the four cardinal points, east, west, north, or south.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A movement that presents itself as rotation when an off-centre fixed point is taken into account.",
                  "examples": [
                    "Synonym: swing"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hinge (third-person singular simple present hinges, present participle hinging or hingeing, simple past and past participle hinged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attach by, or equip with a hinge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with on or upon) To depend on something.",
                  "examples": [
                    "Games can hinge on the sort of controversial decision made by Taylor in the 10th minute. After Rivière collected Gabriel Obertan’s pass and sashayed beyond Daley Blind he drew the United centre-half into a rash, clumsy challenge but, puzzlingly, Taylor detected no penalty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaeology) The breaking off of the distal end of a knapped stone flake whose presumed course across the face of the stone core was truncated prematurely, leaving not a feathered distal end but instead the scar of a nearly perpendicular break.",
                  "examples": [
                    "The flake hinged at an inclusion in the core."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To bend.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move or already be positioned in such a fashion that it presents itself as rotation when an off-centre fixed point is taken into account.",
                  "examples": [
                    "Synonym: swing"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}