{
  "word": "know",
  "etymologies": [
    {
      "description": [
        "From Middle English knowen, from Old English cnāwan (“to know, perceive, recognise”), from Proto-West Germanic *knāan, from Proto-Germanic *knēaną (“to know”), from Proto-Indo-European *ǵneh₃- (“to know”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "know (plural knows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Knowledge; the state of knowing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Knowledge; the state of knowing; now confined to the fixed phrase ‘in the know’",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "know (third-person singular simple present knows, present participle knowing, simple past knew or (nonstandard) knowed, past participle known or (colloquial and nonstandard) knew)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To perceive the truth or factuality of; to be certain of or that.",
                  "examples": [
                    "I know that I’m right and you’re wrong.",
                    "He knew something terrible was going to happen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be aware of; to be cognizant of.",
                  "examples": [
                    "Did you know Michelle and Jack were getting divorced? ― Yes, I knew.",
                    "She knows where I live.",
                    "I knew he was upset, but I didn't understand why."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be acquainted or familiar with; to have encountered.",
                  "examples": [
                    "I know your mother, but I’ve never met your father."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To experience.",
                  "examples": [
                    "Their relationship knew ups and downs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be able to distinguish, to discern, particularly by contrast or comparison; to recognize the nature of.}}",
                  "examples": [
                    "to know a person's face or figure",
                    "to know right from wrong",
                    "I wouldn't know one from the other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To recognize as the same (as someone or something previously encountered) after an absence or change.",
                  "examples": [
                    "At nearer view he thought he knew the dead, / And call'd the wretched man to mind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To understand or have a grasp of through experience or study.",
                  "examples": [
                    "Let me do it. I know how it works.",
                    "She knows how to swim.",
                    "His mother tongue is Italian, but he also knows French and English.",
                    "She knows chemistry better than anybody else.",
                    "Know your enemy and know yourself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, biblical) To have sexual relations with. This meaning normally specified in modern English as e.g. to ’know someone in the biblical sense’ or to ‘know biblically.’",
                  "examples": [
                    "Now Gerald had never thought of her having a mother. Then there must have been a father, too, some time. And Miss Wilmarth existed because two people once had loved and known. It was not a thought to dwell upon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have knowledge; to have information, be informed.",
                  "examples": [
                    "It is vital that he not know.",
                    "She knew of our plan.",
                    "He knows about 19th century politics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be or become aware or cognizant.",
                  "examples": [
                    "Did you know Michelle and Jack were getting divorced? ― Yes, I knew."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To be acquainted (with another person).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be able to play or perform (a song or other piece of music).",
                  "examples": [
                    "Do you know \"Blueberry Hill\"?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}