{
  "word": "gooseberry",
  "etymologies": [
    {
      "description": [
        "From goose +‎ berry. It is possible that the first element was originally something related to the gros- of French groseille and/or the kruis- of Dutch kruisbes but has been altered by folk etymology."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gooseberry (plural gooseberries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fruit of species Ribes uva-crispa, related to the currant.",
                  "examples": [
                    "We had a good haul of gooseberries from our bushes this year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any other plant or fruit in the subgenus Grossularia, distinguished from currants by bearing spines, including Ribes hirtellum (American gooseberry).",
                  "examples": []
                }
              ]
            },
            {
              "group": "Any of several other plants that are not closely related but bear fruit in some way similar:",
              "entries": [
                {
                  "meaning": "Chinese gooseberry or kiwifruit, the edible berry of a cultivar group of the woody vine Actinidia deliciosa and hybrids between this and other species in the genus Actinidia",
                  "examples": []
                },
                {
                  "meaning": "Indian gooseberry (Phyllanthus emblica), emblic, amla.",
                  "examples": []
                },
                {
                  "meaning": "Ceylon gooseberry, a species of Dovyalis native to Sri Lanka and southern India",
                  "examples": []
                },
                {
                  "meaning": "Barbados gooseberry (Pereskia aculeata), an unusual cactus",
                  "examples": []
                },
                {
                  "meaning": "Long Key locustberry or shiny locustberry (Byrsonima lucida)",
                  "examples": []
                },
                {
                  "meaning": "Jamaican gooseberry tree (Phyllanthus acuminatus), a herb-like plant",
                  "examples": []
                },
                {
                  "meaning": "star gooseberry",
                  "examples": []
                },
                {
                  "meaning": "Otaheite gooseberry (Phyllanthus acidus)",
                  "examples": []
                },
                {
                  "meaning": "Katuk (Sauropus androgynus), a shrub grown in some tropical regions as a leaf vegetable",
                  "examples": []
                },
                {
                  "meaning": "Physalis angulata, also called balloon cherry and cutleaf groundcherry",
                  "examples": []
                },
                {
                  "meaning": "Cape gooseberry (Physalis peruviana), indigenous to South America",
                  "examples": []
                },
                {
                  "meaning": "poison gooseberry (Withania somnifera)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, British slang) A chaperone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) An additional person who is neither necessary nor wanted in a given situation.",
                  "examples": [
                    "Robert and Susan were so in love with each other that nobody could go near them without feeling like a gooseberry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, British slang) A fool.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, British slang) A fantastic story; a tall tale; a hoax.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, British slang, vulgar, usually in the plural) A testicle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}