{
  "word": "shape",
  "etymologies": [
    {
      "description": [
        "From Middle English shap, schape, from Old English ġesceap (“shape, form, created being, creature, creation, dispensation, fate, condition, sex, gender, genitalia”), from Proto-West Germanic *ga- + *skap, from Proto-Germanic *ga- + *skapą (“shape, nature, condition”), possibly from Proto-Indo-European *(s)kep- (“to split, cut”). Cognate with Middle Dutch schap (“form”), Middle High German geschaf (“creature”), Icelandic skap (“state, condition, temper, mood”).",
        "The verb is from Middle English shapen, schapen, from Old English scieppan (“to shape, form, make, create, assign, arrange, destine, order, adjudge”), from Proto-Germanic *skapjaną (“to create”), from the noun. Cognate with Dutch scheppen, German schaffen, Swedish skapa (“create, make”), Norwegian Bokmål skape (“create”). Doublet of -ship."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shape (countable and uncountable, plural shapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The status or condition of something",
                  "examples": [
                    "The used bookshop wouldn’t offer much due to the poor shape of the book."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Condition of personal health, especially muscular health.",
                  "examples": [
                    "The vet checked to see what kind of shape the animal was in.",
                    "We exercise to keep in good physical shape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The appearance of something in terms of its arrangement in space, especially its outline; often a basic geometric two-dimensional figure.",
                  "examples": [
                    "He cut a square shape out of the cake.",
                    "What shape shall we use for the cookies? Stars, circles, or diamonds?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Form; formation.",
                  "examples": [
                    "What if God's plans and actions do mold the shape of human events?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(iron manufacture) A rolled or hammered piece, such as a bar, beam, angle iron, etc., having a cross section different from merchant bar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(iron manufacture) A piece which has been roughly forged nearly to the form it will receive when completely forged or fitted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking, now rare) A mould for making blancmange, jelly, etc., or a piece of such food formed moulded into a particular shape.",
                  "examples": [
                    "It was brawn and shape for high tea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) A loaded die.",
                  "examples": [
                    "A top cheater seldom ever uses shapes or loaded dice because they do not assure you of winning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) In the Hack programming language, a group of data fields each of which has a name and a data type.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shape (third-person singular simple present shapes, present participle shaping, simple past shaped or (obsolete) shope, past participle shaped or (archaic) shapen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England, Scotland, rare) To create or make.",
                  "examples": [
                    "Earth was shapen by God for God's folk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give something a shape and definition.",
                  "examples": [
                    "The professor never pretended to the academic prerogative of forcing his students into his own channels of reasoning; he entered into and helped shape the discussion but above all he made his men learn to think for themselves and rely upon their own intellectual judgments."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form or manipulate something into a certain shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a country, person, etc) To give influence to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To suit; to be adjusted or conformable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To imagine; to conceive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}