{
  "word": "stand",
  "etymologies": [
    {
      "description": [
        "From Middle English standen, stonden (verb) and stand, stond (noun, from the verb), from Old English standan (“to stand, occupy a place”), from Proto-West Germanic *standan, from Proto-Germanic *standaną (“to stand”), from Pre-Germanic *sth₂-n-t-´, an innovative extended n-infixed form of Proto-Indo-European *steh₂-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stand (plural stands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of standing.",
                  "examples": [
                    "I took my stand upon an eminence […] to look into their several ladings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A defensive position or effort.",
                  "examples": [
                    "The Commander says we will make our stand here."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A resolute, unwavering position; firm opinion; action for a purpose in the face of opposition.",
                  "examples": [
                    "They took a firm stand against copyright infringement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of performance in a given location or venue.",
                  "examples": [
                    "They have a four-game stand at home against the Yankees.  They spent the summer touring giving 4 one-night stands a week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device to hold something upright or aloft.",
                  "examples": [
                    "He set the music upon the stand and began to play.  an umbrella stand;  a hat-stand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The platform on which a witness testifies in court; the witness stand or witness box.",
                  "examples": [
                    "She took the stand and quietly answered questions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An area of raised seating for waiters at the stock exchange.",
                  "examples": [
                    "When a member has failed to comply with his bargains the fact is announced from one of the stands,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular grove or other group of trees or shrubs.",
                  "examples": [
                    "This stand of pines is older than the one next to it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(forestry) A contiguous group of trees sufficiently uniform in age-class distribution, composition, and structure, and growing on a site of sufficiently uniform quality, to be a distinguishable unit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A standstill, a motionless state, as of someone confused, or a hunting dog who has found game.",
                  "examples": [
                    "One of the later school of the Grecians, examineth the matter, and is at a stand, to think what should be in it, that men should love lies; where neither they make for pleasure, as with poets, nor for advantage, as with the merchant; but for the lie’s sake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small building, booth, or stage, as in a bandstand or hamburger stand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A designated spot where someone or something may stand or wait.",
                  "examples": [
                    "a taxi stand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated) The situation of a shop, store, hotel, etc.",
                  "examples": [
                    "a good, bad, or convenient stand for business"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, historical) Short for tavern stand (“a roadside inn”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) Grandstand. (often in the plural)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A partnership.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, plural often stand) A single set, as of arms.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Rank; post; station; standing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A state of perplexity or embarrassment.",
                  "examples": [
                    "to be at a stand what to do"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A young tree, usually reserved when other trees are cut; also, a tree growing or standing upon its own root, in distinction from one produced from a scion set in a stock, either of the same or another kind of tree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A location or position where one may stand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(advertising) An advertisement filling an entire billboard, comprising many sheets of paper.",
                  "examples": [
                    "The cost of the printing alone will average $2 a 'stand.' The sheets are about 28x42 inches and are in four colors, which means they must go through the process four times."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fiction) A type of supernatural ability from the anime and manga series JoJo's Bizarre Adventure, named for the fact that they appear to 'stand' next to their user.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stand (third-person singular simple present stands, present participle standing, simple past stood, past participle stood or (obsolete) standen or (nonstandard) stand)",
          "definitionGroups": [
            {
              "group": "To position or be positioned physically:",
              "entries": [
                {
                  "meaning": "(intransitive, copulative) To support oneself on the feet in an erect position.",
                  "examples": [
                    "Here I stand, wondering what to do next."
                  ]
                },
                {
                  "meaning": "(intransitive) To rise to one’s feet; to stand up.",
                  "examples": [
                    "Stand up, walk to the refrigerator, and get your own snack."
                  ]
                },
                {
                  "meaning": "(intransitive, copulative) To remain motionless.",
                  "examples": [
                    "Do not leave your car standing in the road."
                  ]
                },
                {
                  "meaning": "(intransitive) To be placed in an upright or vertical orientation.",
                  "examples": [
                    "He seized the gun which always stood in a corner of his bedroom […]."
                  ]
                },
                {
                  "meaning": "(transitive) To place in an upright or standing position.",
                  "examples": [
                    "He stood the broom in a corner and took a break."
                  ]
                },
                {
                  "meaning": "(intransitive) To occupy or hold a place; to be set, placed, fixed, located, or situated.",
                  "examples": [
                    "Paris stands on the Seine."
                  ]
                },
                {
                  "meaning": "(intransitive) To measure when erect on the feet.",
                  "examples": [
                    "His face, as I grant, in spite of spite, / Has a broad-blown comeliness, red and white, / And six feet two, as I think, he stands;"
                  ]
                },
                {
                  "meaning": "(intransitive, of tears, sweat, etc.) To be present, to have welled up.",
                  "examples": [
                    "now my heart beginneth to melt within me being wounded (with that the tears stood in his eyes) to see the faces of some here present, whom J most earnestly love, and now must depart from with shame  […]"
                  ]
                }
              ]
            },
            {
              "group": "To position or be positioned mentally:",
              "entries": [
                {
                  "meaning": "(intransitive, followed by to + infinitive) To be positioned to gain or lose.",
                  "examples": [
                    "He stands to get a good price for the house."
                  ]
                },
                {
                  "meaning": "(transitive, negative) To tolerate.",
                  "examples": [
                    "I can’t stand when people don’t read the instructions.",
                    "I can’t stand him."
                  ]
                },
                {
                  "meaning": "(intransitive, copulative) To maintain one's ground; to be acquitted; not to fail or yield; to be safe.",
                  "examples": [
                    "readers by whose judgment I would stand or fall"
                  ]
                },
                {
                  "meaning": "(intransitive, copulative) To maintain an invincible or permanent attitude; to be fixed, steady, or firm; to take a position in resistance or opposition.",
                  "examples": [
                    "The king granted the Jews […] to gather themselves together, and to stand for their life."
                  ]
                },
                {
                  "meaning": "(intransitive, copulative, obsolete) To be in some particular state; to have essence or being; to be; to consist.",
                  "examples": [
                    "sacrifices […] which stood only in meats and drinks"
                  ]
                }
              ]
            },
            {
              "group": "To position or be positioned socially:",
              "entries": [
                {
                  "meaning": "(intransitive, cricket) To act as an umpire.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To undergo; withstand; hold up.",
                  "examples": [
                    "The works of Shakespeare have stood the test of time."
                  ]
                },
                {
                  "meaning": "(intransitive, Britain) To be a candidate (in an election).",
                  "examples": [
                    "He is standing for election to the local council."
                  ]
                },
                {
                  "meaning": "(intransitive) To be valid.",
                  "examples": [
                    "What I said yesterday still stands."
                  ]
                },
                {
                  "meaning": "(transitive) To oppose, usually as a team, in competition.",
                  "examples": [
                    "\"Kim, Jack, and I will stand you guys,\" Jimmie Burdette said. ¶ \"We'll smear you!\" laughed Ron."
                  ]
                },
                {
                  "meaning": "(transitive) To cover the expense of; to pay for.",
                  "examples": [
                    "to stand a round of drinks",
                    "to stand a treat",
                    "to stand bail (security in respect of an arrested person)"
                  ]
                },
                {
                  "meaning": "(intransitive) To have or maintain a position, order, or rank; to be in a particular relation.",
                  "examples": [
                    "Christian charity, or love, stands first in the rank of gifts."
                  ]
                },
                {
                  "meaning": "(intransitive) To be consistent; to agree; to accord.",
                  "examples": [
                    "Doubt me not; by heaven, I will do nothing / But what may stand with honour."
                  ]
                },
                {
                  "meaning": "(intransitive) To appear in court.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) Of a ship or its captain, to steer, sail (in a specified direction, for a specified destination etc.).",
                  "examples": [
                    "To repaire his defects, hee stood for the coast of Calabria, but hearing there was six or seven Galleyes at Mesina hee departed thence for Malta […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative) To remain without ruin or injury.",
                  "examples": [
                    "My mind on its own centre stands unmov'd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) To stop asking for more cards; to keep one's hand as it has been dealt so far.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stand, stande, stond, stonde, stoonde, probably from Middle Dutch stande, from Old Dutch *standan (“to stand”), from Frankish *standan.",
        "Forms with -o- may show influence of stonden (“stand”, verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stand (plural stands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Scotland, dated) A container which stands upright, such as a barrel or cask.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A weight of from two hundred and fifty to three hundred pounds, used in weighing pitch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}