{
  "word": "hypostasis",
  "etymologies": [
    {
      "description": [
        "From Ecclesiastical Latin hypostasis, from Ancient Greek ὑπόστασις (hupóstasis, “sediment, foundation; substance, existence, essence”), from ὑπό (hupó, “under”) + στάσις (stásis, “standing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hypostasis (countable and uncountable, plural hypostases or hypostaseis)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, now historical) A sedimentary deposit, especially in urine. [from 14th c.]",
                  "examples": [
                    "Thus the kidneys also have their particular excrement which is contained in it and is the hypostasis (deposit)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) The essential person, specifically the single person of Christ (as distinguished from his two ‘natures’, human and divine), or of the three ‘persons’ of the Trinity (sharing a single ‘essence’). [from 16th c.]",
                  "examples": [
                    "As Gregory of Nyssa had explained, the three hypostases of Father, Son, and Spirit were not objective facts but simply “terms that we use” to express the way in which the “unnameable and unspeakable” divine nature (ousia) adapts itself to the limitations of our human minds."
                  ]
                }
              ]
            },
            {
              "group": "(philosophy) The underlying reality or substance of something. [from 17th c.]",
              "entries": [
                {
                  "meaning": "(linguistics) A relationship between a name and a known quantity, as a cultural personification (i.e. objectification with personality) of an entity or quality.",
                  "examples": []
                },
                {
                  "meaning": "(psychology) Referring to the hypostatic model of personality; i.e., asserting that humans present themselves in many different aspects or hypostases, depending on the internal and external realities they relate to, including different approaches to the study of personality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) The effect of one gene preventing another from expressing. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Postmortem lividity; livor mortis; suggillation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}