{
  "word": "arbitrary",
  "etymologies": [
    {
      "description": [
        "From Middle English arbitrarie, Latin arbitrārius (“arbitrary, uncertain”), from arbiter (“witness, on-looker, listener, judge, overseer”)."
      ],
      "adjectives": [
        {
          "description": "arbitrary (comparative more arbitrary, superlative most arbitrary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually of a decision) Based on individual discretion or judgment; not based on any objective distinction, perhaps even made at random.",
                  "examples": [
                    "Benjamin Franklin's designation of \"positive\" and \"negative\" to different charges was arbitrary.",
                    "The decision to use 18 years as the legal age of adulthood was arbitrary, as both age 17 and 19 were reasonable alternatives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Determined by impulse rather than reason; heavy-handed.",
                  "examples": [
                    "The Russian trials were Stalin's purges, with which he attempted to consolidate his power. Like most people in the West, I believed these show trials to be the arbitrary acts of a cruel dictator."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Any, out of all that are possible.",
                  "examples": [
                    "The equation is true for an arbitrary value of x."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Determined by independent arbiter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Not representative or symbolic; not iconic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "arbitrary (plural arbitraries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything arbitrary, such as an arithmetical value or a fee.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}