{
  "word": "hypocrisy",
  "etymologies": [
    {
      "description": [
        "From Middle English ipocrisie, from Old French ypocrisie, from Late Latin hypocrisis, from Ancient Greek ὑπόκρισις (hupókrisis, “answer, stage acting, pretense”), from ὑποκρίνομαι (hupokrínomai, “I answer (a fellow actor on stage), play a part, dissemble, feign”), from ὑπό (hupó, “under, equivalent of the modern \"hypo-\" prefix”) + the middle voice of κρίνω (krínō, “I separate, judge, decide”).",
        "Displaced native Old English līċettung."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hypocrisy (countable and uncountable, plural hypocrisies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The contrivance of a false appearance of virtue or goodness, while concealing real character or inclinations, especially with respect to religious and moral beliefs; hence in general sense, dissimulation, pretence, sham.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The claim or pretense of having beliefs, standards, qualities, behaviours, virtues, motivations, etc. which one does not really have. [from early 13th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The practice of engaging in the same behaviour or activity for which one criticises another; moral self-contradiction whereby the behavior of one or more people belies their own claimed or implied possession of certain beliefs, standards or virtues.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of any or all of the above.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}