{
  "word": "intervene",
  "etymologies": [
    {
      "description": [
        "Back-formation from intervention, and/or from Latin interveniō (“come between”, verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "intervene (third-person singular simple present intervenes, present participle intervening, simple past and past participle intervened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become involved in a situation, so as to alter or prevent an action.",
                  "examples": [
                    "Synonyms: interfere, step in",
                    "The police had to be called to intervene in the fight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To occur, fall, or come between, points of time, or events.",
                  "examples": [
                    "An instant intervened between the flash and the report.",
                    "I hadn't seen him since we were in school, and the intervening years had not been kind to him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To occur or act as an obstacle or delay.",
                  "examples": [
                    "Nothing intervened to prevent the undertaking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To say (something) in the middle of a conversation or discussion between other people, or to respond to a situation involving other people.",
                  "examples": [
                    "Synonym: interrupt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To come between, or to be between, persons or things.",
                  "examples": [
                    "The Mediterranean intervenes between Europe and Africa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) In a suit to which one has not been made a party, to put forward a defense of one's interest in the subject matter.",
                  "examples": [
                    "an application for leave (i.e. permission) to intervene"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}