{
  "word": "shrimp",
  "etymologies": [
    {
      "description": [
        "From Middle English schrimpe (“shrimp, puny person”), ultimately from Proto-Germanic *skrimpaz (“shrivelled”) (compare Middle High German schrimpf (“a scratch, minor wound”), Norwegian skramp (“thin horse, thin man”)), from Proto-Germanic *skrimpaną (“to shrivel”) (compare Old English sċrimman (“to shrink”) and scrimp, Middle High German schrimpfen (“to shrink, dry up”), Swedish skrympa (“to shrink”)), from Proto-Indo-European *skremb-, *skr̥mb- (compare Lithuanian skrembti (“to crust over, stiffen”), and possibly Albanian shkrumb (“embers, ashes; crumble”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shrimp (countable and uncountable, plural shrimp or shrimps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of many swimming, often edible, crustaceans, chiefly of the infraorder Caridea or the suborder Dendrobranchiata, with slender legs, long whiskers and a long abdomen.",
                  "examples": [
                    "Butter well a deep dish, upon which place a thick layer of pounded biscuit; having picked and boiled your shrimps, put them upon the biscuit; a layer of shrimps, with small pieces of butter, a little pepper, mace or nutmeg."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The flesh of such crustaceans.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A small, puny or unimportant person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncommon) Synonym of butterface: a person with an attractive body but unattractive face.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shrimp (third-person singular simple present shrimps, present participle shrimping, simple past and past participle shrimped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fish for shrimp.",
                  "examples": [
                    "Fishing, shrimping and crabbing are permitted on designated areas of the refuge subject to the following conditions: […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To contract; to shrink.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}