{
  "word": "handle",
  "etymologies": [
    {
      "description": [
        "From Middle English handel, handle, from Old English handle (“a handle”), from handlian (“to handle, feel, deal with, discuss”). See verb below. Cognate with Danish handel (“a handle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "handle (plural handles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of an object which is (designed to be) held in the hand when used or moved.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instrument for effecting a purpose (either literally or figuratively); a tool, or an opportunity or pretext.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) The gross amount of wagering within a given period of time or for a given event at one of more establishments.",
                  "examples": [
                    "The daily handle of a Las Vegas casino is typically millions of dollars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textiles) The tactile qualities of a fabric, e.g., softness, firmness, elasticity, fineness, resilience, and other qualities perceived by touch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A name, nickname or pseudonym.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A title attached to one's name, such as Doctor or Colonel.",
                  "examples": [
                    "The successful businessman was knighted and acquired a handle to his name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A reference to an object or structure that can be stored in a variable.",
                  "examples": [
                    "This article describes how to find the module name from the window handle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, chiefly Northern Territory, New Zealand) A 10 fluid ounce (285 mL) glass of beer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A half-gallon (1.75-liter) bottle of alcohol.",
                  "examples": [
                    "Josh bought a fifth of Evan Williams for Andrew as a token of gratitude and Ray, because of the financial constraints, purchased the cheapest handle of whiskey he could find: Heaven Hill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography, Newfoundland and Labrador, rare) A point, an extremity of land.",
                  "examples": [
                    "the Handle of the Sug in Newfoundland"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(topology) A topological space homeomorphic to a ball but viewed as a product of two lower-dimensional balls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(algebraic geometry) The smooth, irreducible subcurve of a comb which connects to each of the other components in exactly one point.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English handlen, from Old English handlian (“to handle, feel, deal with, discuss”), from Proto-Germanic *handlōną (“to take, grip, feel”), equivalent to hand +‎ -le. Cognate with West Frisian hanneljen, hanljen (“to handle, treat”), Dutch handelen (“to handle, deal, act, negotiate”), German handeln (“to act, trade, negotiate, behave”), Swedish handla (“to buy, trade, deal”), Icelandic höndla (“to handle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "handle (third-person singular simple present handles, present participle handling, simple past and past participle handled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch; to feel or hold with the hand(s).",
                  "examples": [
                    "Happy, ye leaves! when as those lilly hands [...] Shall handle you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To accustom to the hand; to take care of with the hands.",
                  "examples": [
                    "The hardness of the winters forces the breeders to house and handle their colts for at least six months every year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To manage, use, or wield with the hands.",
                  "examples": [
                    "Light on his feet for a big man, he handled the rifle like a pistol."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To manage, control, or direct.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat, to deal with (in a specified way).",
                  "examples": [
                    "she handled the news with grace",
                    "the Persians handled the French ambassador shamefully"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deal with (a subject, argument, topic, or theme) in speaking, in writing, or in art.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To receive and transfer; to have pass through one's hands; hence, to buy and sell.",
                  "examples": [
                    "a merchant handles a variety of goods, or a large stock"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To be concerned with; to be an expert in.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put up with; to endure (and continue to function).",
                  "examples": [
                    "I can't handle this hot weather."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use the hands.",
                  "examples": [
                    "They [idols made of gold and silver] have hands, but they handle not"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer, intransitive) To illegally touch the ball with the hand or arm; to commit handball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To behave in a particular way when handled (managed, controlled, directed).",
                  "examples": [
                    "the car handles well"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}