{
  "word": "lodge",
  "etymologies": [
    {
      "description": [
        "From Middle English logge, from Old French loge (“arbour, covered walk-way”), from Frankish *laubijā (“shelter; arbour”), from Proto-West Germanic *laub (“leaf; folliage”) (whence English leaf).",
        "See also (compare cognate Medieval Latin lobia, laubia; also Old High German louba (“porch, gallery”) (German Laube (“bower, arbor”)), Old High German loub (“leaf, foliage”), Old English lēaf (“leaf, foliage”). Doublet of loggia and lobby."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lodge (plural lodges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A building for recreational use such as a hunting lodge or a summer cabin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for porter's lodge: a building or room near the entrance of an estate or building, especially (UK, Canada) as a college mailroom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A local chapter of some fraternities, such as freemasons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A local chapter of a trade union.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rural hotel or resort, an inn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A beaver's shelter constructed on a pond or lake.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A den or cave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The chamber of an abbot, prior, or head of a college.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) The space at the mouth of a level next to the shaft, widened to permit wagons to pass, or ore to be deposited for hoisting; called also platt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A collection of objects lodged together.",
                  "examples": [
                    "the Maldives, a famous lodge of islands"
                  ]
                }
              ]
            },
            {
              "group": "An indigenous American home, such as tipi or wigwam.  By extension, the people who live in one such home; a household.",
              "entries": [
                {
                  "meaning": "(historical) A family of Native Americans, or the persons who usually occupy an Indian lodge; as a unit of enumeration, reckoned from four to six persons.",
                  "examples": [
                    "The tribe consists of about two hundred lodges, that is, of about a thousand individuals."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lodge (third-person singular simple present lodges, present participle lodging, simple past and past participle lodged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be firmly fixed in a specified position.",
                  "examples": [
                    "The bullet missed its target and lodged in the bark of a tree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To firmly fix in a specified position.",
                  "examples": [
                    "I've got some spinach lodged between my teeth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stay in a boarding-house, paying rent to the resident landlord or landlady.",
                  "examples": [
                    "The detective Sherlock Holmes lodged in Baker Street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stay in any place or shelter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive (an animal) to covert.",
                  "examples": [
                    "This is the time that the horseman are flung out, not having the cry to lead them to the death. When quadruped animals of the venery or hunting kind are at rest, the stag is said to be harboured, the buck lodged, the fox kennelled, the badger earthed, the otter vented or watched, the hare formed, and the rabbit set. When you find and rouse up the stag and buck, they are said to be imprimed:  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To supply with a room or place to sleep in for a time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put money, jewellery, or other valuables for safety.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place (a statement, etc.) with the proper authorities (such as courts, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become flattened, as grass or grain, when overgrown or beaten down by the wind.",
                  "examples": [
                    "The heavy rain caused the wheat to lodge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to flatten, as grass or grain.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}