{
  "word": "operate",
  "etymologies": [
    {
      "description": [
        "From Latin operātus, past participle of operārī (“to work, labor, toil, have effect”), from opus, operis (“work, labor”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "operate (third-person singular simple present operates, present participle operating, simple past and past participle operated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To perform a work or labour; to exert power or strength, physical or mechanical; to act.",
                  "examples": [
                    "Could someone explain how this meeting operates?",
                    "In this town, the garbage removal staff operate between six o'clock at midnight.",
                    "The police had inside knowledge of how the gang operated."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To produce an appropriate physical effect; to issue in the result designed by nature; especially (medicine) to take appropriate effect on the human system.",
                  "examples": [
                    "The drug operates by facilitating the negative neurotransmitter gamma-aminobutyric acid (GABA), resulting in the blocking of neural long-term potentiation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To act or produce effect on the mind; to exert moral power or influence.",
                  "examples": [
                    "A plain, convincing reason operates on the mind both of a learned and ignorant hearer as long as they live."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, transitive or intransitive) To perform some manual act upon a human body in a methodical manner, and usually with instruments, with a view to restore soundness or health, as in amputation, lithotomy, etc.",
                  "examples": [
                    "The surgeon had to operate on her heart.",
                    "I'm being operated tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To deal in stocks or any commodity with a view to speculative profits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To produce, as an effect; to cause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To put into, or to continue in, operation or activity; to work.",
                  "examples": [
                    "to operate a machine"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}