{
  "word": "differentiation",
  "etymologies": [
    {
      "description": [
        "From differentiate +‎ -ion, from different +‎ -iate, from differ +‎ -ent, from Middle English differen, from Old French differer, from Latin differō (“carry apart, put off, defer; differ”), from dis- (“apart”) + ferō (“carry, bear”); cognate with Ancient Greek διαφέρω (diaphérō, “to differ”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "differentiation (countable and uncountable, plural differentiations)",
          "definitionGroups": [
            {
              "group": "The act or process of differentiating (generally, without a specialized sense).",
              "entries": [
                {
                  "meaning": "The act of treating one thing as distinct from another, or of creating such a distinction; of separating a class of things into categories; of describing a thing by illustrating how it is different from something else.",
                  "examples": []
                },
                {
                  "meaning": "The process of developing distinct components.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) The process by which the components of multicellular life (cells, organs, etc.) are produced and acquire function, as when a seed develops the root and stem, and the initial stem develops the leaf, branches, and flower buds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, evolution) The evolutionary process by which one taxonomic group (species, genus, variety, etc.) becomes distinct from another, or acquires distinct features; the result of such a process: distinctness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) The process of separation of cooling magma into various rock types.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, calculus) The process of applying the derivative operator to a function; of calculating a function's derivative.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}