{
  "word": "chimera",
  "etymologies": [
    {
      "description": [
        "Variant of Middle English chimere, chymere, & chymera under renewed Latin influence from the 16th century, from French chimère, from Latin Chimaera, from Ancient Greek Χίμαιρα (Khímaira, “fire-breathing mythological monster, fire-spewing Lycian or Cilician mountain”), from χίμαιρα (khímaira, “she-goat”), from χίμαρος (khímaros, “male goat”) + -α (-a), from Proto-Indo-European *ǵʰey-. In reference to the fish, directly from Latin Chimaera, used by Linnaeus. In reference to organisms with distinct areas of different genetic makeups, a calque of German Chimäre, used by Hans Winkler in 1907."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chimera (plural chimeras)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Greek mythology) Alternative letter-case form of Chimera, a supposed monster in Lycia with the head of a lion, body of a goat, and tail of a dragon or serpent, killed by the hero Bellerophon.",
                  "examples": [
                    "...beestis clepid chymeres, that han a part of ech beest, and suche ben not, no but oonly in opynyoun..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mythology, art) Any fantastic creature combining parts from different animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A foolish, incongruous, or vain thought or product of the imagination.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Anything composed of very disparate parts.",
                  "examples": [
                    "He built his car one piece at a time, producing a chimera with the head of a Volkswagen, the body of a Geely, and the tail of an aftermarket Porsche."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A grotesque like a gargoyle, but without a spout for rainwater.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) An organism with genetically distinct cells originating from two or more zygotes.",
                  "examples": [
                    "The DNA test returned a false negative because the killer was a chimera, having absorbed her twin in utero."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Alternative form of chimaera, a cartilaginous marine fish in the subclass Holocephali and especially the order Chimaeriformes, with a blunt snout, long tail, and a spine before the first dorsal fin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Synonym of bogeyman: any terrifying thing, especially as an unreal, imagined threat.",
                  "examples": [
                    "How could that Chymera haue come in any mannes mynd?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}