{
  "word": "autotelic",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek αὐτός (autós, “self”) +‎ τέλος (télos, “result; end”); compare auto- and telic. From early 20th century."
      ],
      "adjectives": [
        {
          "description": "autotelic (comparative more autotelic, superlative most autotelic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology, of an activity, process, person or personality) Containing its own meaning or purpose; deriving meaning and purpose from within.",
                  "examples": [
                    "It is possible that these three people have jobs that are more autotelic than those of the rest of this group; that they have more responsibility, more initiative and challenge at their workplace than is usual for employees of their type."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to the quality of (a thing's) being autotelic.",
                  "examples": [
                    "The autotelic score was negatively correlated with the anxiety/ambiguity score r = −.57 and negatively correlated with the boredom/rigidity score r = −.36."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, of a work of art or literature) Not motivated by anything beyond itself; thematically self-contained.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "autotelic (plural autotelics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An autotelic person, a person with an autotelic personality.",
                  "examples": [
                    "Measuring autotelic personality similarly with young adults, Hektner (1996) confirmed that autotelics were least happy and motivated in apathy (low-challenge, low-skill) situations, whereas nonautotelics (those least motivated in high-challenge, high-skill situations) did not find the apathy condition aversive."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}