{
  "word": "rubber",
  "etymologies": [
    {
      "description": [
        "From rub +‎ -er.",
        "The sense of the substance comes from its ability to function as an eraser, displacing earlier caoutchouc. The senses not having to do with rubbing or erasing are secondarily derived from the name of the substance."
      ],
      "adjectives": [
        {
          "description": "rubber",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, of a draft/check) Not covered by funds on account.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "rubber (usually uncountable, plural rubbers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Pliable material derived from the sap of the rubber tree; a hydrocarbon polymer of isoprene.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, countable) Synthetic materials with the same properties as natural rubber.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Australia, India, Brunei, New Zealand, UK) An eraser.",
                  "examples": [
                    "For example, they may use paddle pop sticks, hand span, pencils, rubbers, mathematics equipment (i.e. base 10 material) or anything else the teacher can find to measure the lengths of nominated objects."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Canada, US, slang) A condom.",
                  "examples": [
                    "Synonyms: see Thesaurus:condom"
                  ]
                }
              ]
            },
            {
              "group": "(countable) Someone or something which rubs.",
              "entries": [
                {
                  "meaning": "One who rubs down horses.",
                  "examples": []
                },
                {
                  "meaning": "One who practises massage.",
                  "examples": []
                },
                {
                  "meaning": "A coarse towel for rubbing the body.",
                  "examples": []
                },
                {
                  "meaning": "An abrasive for rubbing with: a whetstone, file, or emery cloth, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The cushion of an electric machine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, baseball) The rectangular pad on the pitcher's mound from which the pitcher must pitch.",
                  "examples": [
                    "Synonyms: pitcher's plate, pitcher's rubber",
                    "Jones toes the rubber and then fires to the plate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, in the plural) Water-resistant shoe covers, galoshes, overshoes.",
                  "examples": [
                    "Johnny, don't forget your rubbers today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Tires, particularly racing tires.",
                  "examples": [
                    "Jones enters the pits to get new rubber."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A hardship or misfortune.",
                  "examples": [
                    "The British barges, off New-London, sometimes meet with the rubbers. In an attack upon an armed smack, some days ago, they were beaten off, with the reported loss of 8 men killed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unknown."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rubber (plural rubbers)",
          "definitionGroups": [
            {
              "group": "(sports) In relation to a series of games or matches between two competitors where the overall winner of the series is the competitor which wins a majority of the individual games or matches:",
              "entries": [
                {
                  "meaning": "The entire series, of an odd number of games or matches in which ties are impossible (especially a series of three games in bridge or whist).",
                  "examples": [
                    "They played, and Creed and his young partner won the first rubber, winning the two first games running."
                  ]
                },
                {
                  "meaning": "An individual match within the series (especially in racquet sports).",
                  "examples": [
                    "Ladies matches shall consist of 6 rubbers. Each rubber shall consist of best of 3 games to 21 points."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, Canada, US) A rubber match; a game or match played to break a tie.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The game of rubber bridge.",
                  "examples": [
                    "\"Still, I confess that I miss my rubber. It is the first Saturday night for seven-and-twenty years that I have not had my rubber.\" \"I think you will find that you will play for a higher stake to-night than you have ever done yet, and that the play will be more exciting.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rubber (third-person singular simple present rubbers, present participle rubbering, simple past and past participle rubbered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telephony) To eavesdrop on a telephone call",
                  "examples": [
                    "\"There's a lot of nostalgia about the phone and how it was the way to get the local news,\" said Jane Beck of the Vermont Folklife Center in Middlebury. One way was \"rubbering,\" or listening in on a neighbor's conversations ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To rubberneck; to observe with unseemly curiosity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}