{
  "word": "anesthesia",
  "etymologies": [
    {
      "description": [
        "Sense of “insensibility” attested since 1679, from Latin anaisthesia, from Ancient Greek ἀναισθησία (anaisthēsía, “without sensation”), from ἀν- (an-, “not”) and αἴσθησις (aísthēsis, “sensation”).",
        "Sense of “state induced by an agent” attested since 1846."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "anesthesia (countable and uncountable, plural anesthesias)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine)(American spelling, Canadian spelling) An artificial method of preventing sensation, used to eliminate pain without causing loss of vital functions, by the administration of one or more agents which block pain impulses before transmitted to the brain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling) The loss or prevention of sensation, as caused by anesthesia (in the above sense), or by a lesion in the nervous system, or by another physical abnormality.",
                  "examples": [
                    "In some individuals optimism may become quasi-pathological. The capacity for even a transient sadness or a momentary humility seems cut off from them as by a kind of congenital anæsthesia."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Philippines, loosely, medicine, proscribed) A substance administered to reduce the perception of pain or to induce numbness for surgery and may render the recipient unconscious.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}