{
  "word": "kidney",
  "etymologies": [
    {
      "description": [
        "From Middle English kednei, kidenei, from earlier kidnēre, kidenēre (“kidney”), of obscure origin and formation. Probably a compound consisting of Middle English *kid, *quid (“belly, womb”), from Old English cwiþ, cwiþa (“belly, womb, stomach”) + Middle English nēre (“kidney”), from Old English *nēora (“kidney”), from Proto-Germanic *neurô (“kidney”), from Proto-Indo-European *negʷʰr- (“kidney”). If so, then related to Scots nere, neir (“kidney”), Saterland Frisian Njuure (“kidney”), Dutch nier (“kidney”), German Niere (“kidney”), Danish nyre (“kidney”), Norwegian nyre (“kidney”), Swedish njure (“kidney”), Ancient Greek νεφρός (nephrós).",
        "Alternate etymology traces the first element to Old English cēod, codd (“sack, scrotum”), from Proto-Germanic *keudō (“sack”) as the terms for testicle and kidney were often interchangeable in Germanic (compare Old High German nioro (“kidney\", also \"testicle”), Old Swedish vig-niauri (“testicle”). More at codpiece."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kidney (plural kidneys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An organ in the body that filters the blood, producing urine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "This organ (of an animal) cooked as food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, dated) Constitution, temperament, nature, type, character, disposition. (usually used of people)",
                  "examples": [
                    "Your poets, spendthrifts, and other fools of that kidney, pretend, forsooth, to crack their jokes on prudence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang) A waiter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}