{
  "word": "tinsel",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English tinsel (“cloth containing gold or silver thread”) [and other forms], probably from Anglo-Norman tincel, tincelle, tencele, and then:",
        "The English word is a doublet of scintilla, scintillate, and stencil.",
        "The adjective is from an attributive use of the noun; while the verb is derived from the noun."
      ],
      "adjectives": [
        {
          "description": "tinsel (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Of fabric: ornamented by being woven with gold or silver thread, or overlaid with thin metal plates; brocaded.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(obsolete) Glittering.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) Apparently beautiful and costly but having little value; superficially attractive; gaudy, showy, tawdry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tinsel (usually uncountable, plural tinsels)",
          "definitionGroups": [
            {
              "group": "(obsolete) A shining fabric used for ornamental purposes.",
              "entries": [
                {
                  "meaning": "A silk or wool fabric with gold or silver thread woven into it; brocade.",
                  "examples": [
                    "Synonym: baldacchin"
                  ]
                },
                {
                  "meaning": "A very thin, gauzelike cloth with gold or silver (or, later, copper) thread woven into it, or overlaid with thin metal plates.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "A thin, shiny foil for ornamental purposes which is of a material made of metal or resembling metal; especially, narrow glittering strips of such a material, often strung on to thread, and traditionally at Christmastime draped on Christmas trees, hung from balustrades or ceilings, or wrapped around objects as a decoration.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) Anything shining and gaudy; especially something superficially shiny and showy, or having a false lustre, and more pretty than valuable.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tinsel (third-person singular simple present tinsels, present participle (UK) tinselling or (US) tinseling, simple past and past participle (UK) tinselled or (US) tinseled) (transitive)",
          "definitionGroups": [
            {
              "group": "To adorn (something) with tinsel.",
              "entries": [
                {
                  "meaning": "(also figuratively) To ornament (fabric, etc.) by weaving into it thread of gold, silver, or some other shiny material.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) To deck out (a place or something) with showy but cheap ornaments; to make gaudy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To give (something) a false or superficial attractiveness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is derived from Middle English tinsel (“destruction, loss; damnation, spiritual loss; state of damnation”) [and other forms], probably from Old Norse *týnsla (modern Norwegian tynsla (“damage, destruction”)), from týna (“to destroy; to lose; to perish”) (whence Middle English tinen (“to be deprived of, lose; to fail to maintain; to forfeit; to lose track of; to mislay; to be separated from; to escape; to be defeated or forced to withdraw; to waste; to consume, use up; to be destroyed, perish; to damn; to remove, take”)) + -sla (suffix forming nouns from verbs, either denoting the action of the verb or the medium or product of the action). Týna is derived from tjón (“damage; loss”), from Proto-Germanic *teuną (“damage; destruction, ruin; lack”); further etymology uncertain, possibly from Proto-Indo-European *dū- (“to torment, vex”) or *dāw- (“to burn”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tinsel (uncountable) (Scotland)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Damage, detriment; loss.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, archaic) Deprivation; forfeiture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tinsel (third-person singular simple present tinsels, present participle tinselling, simple past and past participle tinselled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland, obsolete, rare) To cause (someone) damage or loss; also, to impose a fine on (someone); to mulct.",
                  "examples": [
                    "Synonym: (archaic) endamage"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}