{
  "word": "vellicate",
  "etymologies": [
    {
      "description": [
        "From Latin vellicatus, past participle of vellicare (“to twitch”). Cognate with Spanish pellizcar (“to pinch”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "vellicate (third-person singular simple present vellicates, present participle vellicating, simple past and past participle vellicated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch (a body part) lightly so as to excite the surface nerves and cause uneasiness, laughter, or spasmodic movements.",
                  "examples": [
                    "Convulſions ariſing from Some Acrimony in the Stomach, or from ſomething vellicating a Nerve in its Extremity, and not in its Original where it ariſeth from the Brain, are not very dangerous."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To twitch or move convulsively.",
                  "examples": [
                    "All her life, Mrs Foster had had an almost pathological fear of missing a train, a plane, a boat, or even a theatre curtain. In other respects, she was not a particularly nervous woman, but the mere thought of being late on occasions like these would throw her into such a state of nerves that she would begin to twitch.  It was nothing much – just a tiny vellicating muscle in the corner of the left eye, like a secret wink – but the annoying thing was that it refused to disappear until an hour or so after the train or plane or whatever it was had been safely caught."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, formal) To tickle, provoking twitching and laughter.",
                  "examples": [
                    "Where irritation coincides with sensation to produce the same catenations of motion, as in inflammatory fevers, they are excited with still greater energy than by the irritation alone. So when children expect to be tickled in play, by a feather lightly passed over the lips, or by gently vellicating the soles of their feet, laughter is most vehemently excited; though they can stimulate these parts with their own fingers unmoved. Here the pleasureable idea of playfulness coincides with the vellication; and there is no voluntary exertion used to diminish the sensation, as there would be, if a child should endeavour to tickle himself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To criticize in a somewhat irritating way; to carp at.",
                  "examples": [
                    "Sir, I Have received yours, and reading the Confirmation of your Hypotheſis (which I took the boldneſs a little to vellicate) and your Anſwer to my Objections againſt it, I could not but obſerve your ingenious dexterity therein with pleaſure."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}