{
  "word": "spam",
  "etymologies": [
    {
      "description": [
        "The original sense (canned ham) is a proprietary name registered by Geo. A. Hormel & Co. in U.S., 1937. It is presumed to be a conflation of either \"spiced ham\" or \"shoulder of pork and ham\" but was soon extended to other kinds of canned meat. Hormel spells the trademarked name in all upper case.",
        "The use for unsolicited and unwanted email derives from a Monty Python sketch (Flying Circus, Episode 25). In the 1970 sketch, a group of Vikings in a restaurant repeatedly chant the word \"spam\". The earliest recorded real-life use for this sense occurs around 1993 which finds reference in an email dated March 31, 1993.",
        "The term appears to have been used earlier in a different sense in relation to \"Multi-User Dungeons\" (MUDs), a kind of multi-user computer gaming environment before widespread use of the Internet, in the 1980s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spam (countable and uncountable, plural spams)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, rarely countable, computing, Internet) Unsolicited bulk electronic messages.",
                  "examples": [
                    "Synonym: junk mail",
                    "Antonym: ham"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, computing, Internet) Any undesired electronic content automatically generated for commercial purposes.",
                  "examples": [
                    "An Act to provide for the control of spam, which is unsolicited commercial communications sent in bulk by electronic mail or by text or multi-media messaging to mobile telephone numbers, and to provide for matters connected therewith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Internet) Ellipsis of spam account.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of tinned meat made mainly from ham.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spam (third-person singular simple present spams, present participle spamming, simple past and past participle spammed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, computing, Internet) To send spam (i.e. unsolicited electronic messages.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing, Internet) To send spam (i.e. unsolicited electronic messages) to a person or entity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, computing, Internet) To post the same text repeatedly with disruptive effect; to flood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension, computing, video games) To do something rapidly and repeatedly.",
                  "examples": [
                    "Stop spamming that special attack!",
                    "Spam this button to get a speed boost."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}