{
  "word": "career",
  "etymologies": [
    {
      "description": [
        "Mid 16th century, from French carrière (“road; racecourse”), from Italian carriera, from Old Occitan carreira, from Late Latin carrāria based on Latin carrus (“wheeled vehicle”), ultimately from Proto-Indo-European *ḱr̥sós, from *ḱers- (“to run”); alternatively, from Middle French carriere, from Old Occitan."
      ],
      "adjectives": [
        {
          "description": "career (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of serial (“doing something repeatedly or regularly as part of one's lifestyle or career”)",
                  "examples": [
                    "a career criminal"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "career (plural careers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's calling in life; a person's occupation; one's profession.",
                  "examples": [
                    "As I explored the possibility of a library science path, having previously been employed in libraries during my school career and afterwards, I decided that I needed to actually experience work in a library setting full time again  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "General course of action or conduct in life, or in a particular part of it.",
                  "examples": [
                    "Washington's career as a soldier"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Speed.",
                  "examples": [
                    "when a horse is running in his full career"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A jouster's path during a joust.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A short gallop of a horse. [16th–18th c.]",
                  "examples": [
                    "Such littleness damps the heat, and weakens the force of genius; as we check a horse in his career, and rein him in when we want him to amble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry) The flight of a hawk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A racecourse; the ground run over.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "career (third-person singular simple present careers, present participle careering, simple past and past participle careered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move rapidly straight ahead, especially in an uncontrolled way.",
                  "examples": [
                    "Synonym: careen",
                    "The car careered down the road, missed the curve, and went through a hedge."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}