{
  "word": "ord",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ord",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Abbreviation of order.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Abbreviation of ordinance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English ord (“point, point of a weapon, beginning”), from Old English ord (“point, spear-point, spear, source, beginning, front, vanguard”), from Proto-West Germanic *oʀd, from Proto-Germanic *uzdaz (“point”), of obscure origin (see *uzdaz).",
        "Cognate with  Middle English ord, North Frisian od (“tip, place, beginning”), Dutch oord (“place, region”), German Ort (“location, place, position”), Danish od (“a point”), Swedish udd (“a point, prick”), Icelandic oddur (“tip, point of a weapon, leader”). See also odd."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ord (plural ords)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly UK dialectal) A point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly UK dialectal) A point of origin; a beginning.",
                  "examples": [
                    "\"[...] But such is life — hard upon hard from ord to end; and if I had not been made of the best of neat-leather, the longer in water the tougher, I would have melted away with my tears long ago!\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly UK dialectal) A point of land; a promontory.",
                  "examples": [
                    "When a man came from Sutherland into Caithness over the Ord [of Caithness, in the southern tip of the county], he was called an ord-louper ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly UK dialectal) The point or edge of a weapon.",
                  "examples": [
                    "Saul drew his sword, And ran even upon the ord. — Cursor Mundi.",
                    "And touched him with the spear's ord. — Romance of Sir Otuel."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}