{
  "word": "cobbler",
  "etymologies": [
    {
      "description": [
        "From Middle English cobeler, cobelere (“mender of shoes, cobbler”) [and other forms]; further origin unknown; possibly from Proto-Germanic *kuppaz (“round object”) (see Etymology 3). The word appears to be derived from an early form of cobble (“to mend roughly, patch; (specifically) to mend shoes, especially roughly”) +‎ -er (suffix forming agent nouns), but is attested much earlier than the verb which suggests that the verb may be a back-formation from cobbler.",
        "Sense 2 (“sheep left to the end to be sheared”) is a pun on cobbler’s last (“tool for shaping or preserving the shape of shoes”); while sense 3 (“clumsy workman”) is derived from cobble +‎ -er: see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cobbler (plural cobblers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who repairs, and sometimes makes, shoes.",
                  "examples": [
                    "(maker): Synonyms: (India, archaic) chuckler, cordwainer, shoemaker, (obsolete) snobscat, (Northern England, Scotland) souter",
                    "(repairer): Synonyms: (obsolete, one sense) botcher, (India, archaic) chuckler, (Britain, slang, obsolete) lad of wax, shoemender, (Northern England, Scotland) souter, (Ireland, dated) waxie, (Britain, slang, obsolete) waxy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, agriculture, slang) A sheep left to the end to be sheared (for example, because its wool is filthy, or because it is difficult to catch).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A person who cobbles (“to assemble or mend in an improvised or rough way”); a clumsy workman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; it has been suggested that the word derives from cobbler’s punch (“warm drink made of beer with added spirit, sugar, and spices”), or because the drink patches up (“repairs; makes better”) the drinker."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cobbler (plural cobblers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, alcoholic beverages) An (iced) alcoholic drink containing spirit or wine, with lemon juice and sugar.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From cobble (“rounded stone used for paving roads, cobblestone”) +‎ -er (occupational suffix). Cobble is from Late Middle English, from cobbe (“head or leader; gangleader; bully (?); male swan, cob; the head; something rounded or in the form of a lump”) + -le, -el (suffix forming diminutives). The further etymology of cobbe is uncertain; it is perhaps a variant of cop (“the top of something (a house, tower, mountain, tree, etc.); crown or top of the head; the head”), from Old English cop, copp (“summit, top; cup, vessel”), from Proto-Germanic *kuppaz (“round object, orb; knoll; hilltop, summit; crown or top of the head; head; skull; bowl; container, vessel”), from Proto-Indo-European *gup- (“round object; knoll”), from *gew- (“to bend, curve; an arch, vault”). However, this is doubted by the Oxford English Dictionary."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cobbler (plural cobblers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A roadworker who lays cobbles.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably a variant of or related to cob, cobb (“stony fruit kernel; nut used in the game of conkers, conker; game of conkers”), perhaps from Middle English cobbe (“head or leader; gangleader; bully (?); male swan, cob; the head; something rounded or in the form of a lump”): see further at etymology 3."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cobbler (plural cobblers)",
          "definitionGroups": [
            {
              "group": "(Britain, dialectal)",
              "entries": [
                {
                  "meaning": "The shiny, hard seed of the horse chestnut tree (Aesculus hippocastanum), especially when used in the game of the same name (sense 1.2); a conker, a horse chestnut.",
                  "examples": []
                },
                {
                  "meaning": "(games) Synonym of conkers (“a game for two players in which the participants each have a horse-chestnut (known as a cobbler (sense 1.1) or conker) suspended from a length of string, and take turns to strike their opponent's conker with their own with the object of destroying the opponent's conker before their own is destroyed”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Origin unknown."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cobbler (plural cobblers)",
          "definitionGroups": [
            {
              "group": "Used as a name for various animals.",
              "entries": [
                {
                  "meaning": "(Australia) Also estuary cobbler:",
                  "examples": []
                },
                {
                  "meaning": "The South Australian catfish (Cnidoglanis macrocephalus), a species of catfish native to Australia which has dorsal and pectoral fins bearing sharp, venomous spines.",
                  "examples": []
                },
                {
                  "meaning": "The soldier or South Australian cobbler (Gymnapistes marmoratus), a brown fish native to southern Australian estuaries which is not closely related to Cnidoglanis macrocephalus, but also has venemous spines on its dorsal and pectoral fins.",
                  "examples": []
                },
                {
                  "meaning": "(Britain)",
                  "examples": []
                },
                {
                  "meaning": "Also river cobbler: basa (Pangasius bocourti), an edible species of shark catfish native to the Chao Phraya and Mekong river basins in Southeast Asia.",
                  "examples": []
                },
                {
                  "meaning": "Pangas catfish (Pangasius pangasius), an edible species of shark catfish native to Bangladesh, India, Myanmar, and Pakistan.",
                  "examples": []
                },
                {
                  "meaning": "(US) Condica sutor, an owlet moth native to North America.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural, slang) A police officer.",
                  "examples": [
                    "Synonyms: see Thesaurus:police officer",
                    "Look out: it’s the cobblers!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. First attested in 1859; various suggested etymologies include:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cobbler (plural cobblers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Often preceded by a descriptive word as in apple cobbler, peach cobbler, etc.: a kind of pie, usually filled with fruit, originally having a crust at the base but nowadays generally lacking this and instead topped with a thick, cake-like pastry layer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From cobbler's awls."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cobbler (plural cobblers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cockney rhyming slang, chiefly in the plural) A testicle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}