{
  "word": "zed",
  "etymologies": [
    {
      "description": [
        "From Middle English zed, zedde, zede, from Old French zede, from Late Latin zeta, from Ancient Greek ζῆτα (zêta), from Hebrew zayin with influence from beta, eta and theta. Letter had rare nonstandard usage in Old English, such as in bezt, where it represented \"ts\" (compare the German, Italian, and Finnish pronunciation of Z). For the sleep sense, see zzz. The zombie sense comes from the initial letter. Doublet of zeta. Cognate to Spanish zeta, German Zett, French zède, Italian zeta, and perhaps Portuguese zê."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "zed (plural zeds) (chiefly Commonwealth)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The name of the Latin-script letter Z.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in combination) Something Z-shaped.",
                  "examples": [
                    "zed-bar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, usually in the plural) Sleep.",
                  "examples": [
                    "I'm going to go get some zeds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A zombie.",
                  "examples": [
                    "A horde of zeds began to shuffle into the shopping mall."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "zed (third-person singular simple present zeds, present participle zedding, simple past and past participle zedded) (chiefly Britain, Australia, New Zealand, Canada, Ireland, South Africa)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To sleep or nap. (Compare zzz, catch some z's.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare) To zigzag; to move with sharp alternating turns.",
                  "examples": [
                    "We were zedding hell-bells up the hill towards Cervione, with a bank of road metal and a precipice on our left..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}