{
  "word": "bosom",
  "etymologies": [
    {
      "description": [
        "From Middle English bosom, bosum, from Old English bōsm, from Proto-West Germanic *bōsm, from Proto-Germanic *bōsmaz, from Proto-Indo-European *bʰewH- (“to swell, bend, curve”). Cognate with Saterland Frisian Bossem, Bousem (“bosom”), West Frisian boezem (“bosom”), Dutch boezem (“bosom”), German Busen (“bosom”). Related also to Albanian buzë (“lip”), Greek βυζί (vyzí, “breast”), Romanian buză (“lip”), Irish bus (“lip”), and Latin bucca (“cheek”)."
      ],
      "adjectives": [
        {
          "description": "bosom (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a very close relationship.",
                  "examples": [
                    "bosom buddies"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bosom (plural bosoms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy, somewhat dated) The breast or chest of a human (or sometimes of another animal). [from 11thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The seat of one's inner thoughts, feelings, etc.; one's secret feelings; desire. [from 13thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The protected interior or inner part of something; the area enclosed as by an embrace. [from 15thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a dress etc. covering the chest; a neckline.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A woman's breast(s). [from 20thc.]",
                  "examples": [
                    "The prevailing look at Aintree was of a well-upholstered woman wearing an outfit about three sizes too small for her; trouser suits so tight you could not only tell if the lady had a coin in her pocket but see if it was heads or tails, and skimpy tops proclaiming proudly that bosoms are back—and this time it's personal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any thing or place resembling the breast; a supporting surface; an inner recess; the interior.",
                  "examples": [
                    "The appointed place was on the edge of a deep, rocky ravine, down in whose dark bosom brawled and foamed a little mountain torrent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A depression round the eye of a millstone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bosom (third-person singular simple present bosoms, present participle bosoming, simple past and past participle bosomed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To enclose or carry in the bosom; to keep with care; to take to heart; to cherish.",
                  "examples": [
                    "Bosom up my counsel,",
                    "You’ll find it wholesome."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To conceal; to hide from view; to embosom.",
                  "examples": [
                    "To happy Convents bosom’d deep in Vines,",
                    "Where slumber Abbots, purple as their Wines;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To belly; to billow, swell or bulge.",
                  "examples": [
                    "Just above the recess the cliff bosomed out with a full swell for some two or three feet, effectually preventing any one’s looking down into the nest from above  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To belly; to cause to billow, swell or bulge.",
                  "examples": [
                    "I looked again, and though I was sensible it must be a delusion brought on by the stroke of his powerful rod, yet I did see the appearance of a glorious fleet of ships coming bounding along the surface of the firmament of air, while every mainsail was bosomed out like the side of a Highland mountain."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}