{
  "word": "subliminal",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from sub- (prefix meaning ‘beneath, under’) +‎ liminal (“of or pertaining to an entrance or threshold”) (from Latin līminālis, from līmen (“doorstep, threshold; doorway, entrance; beginning, commencement”) (possibly ultimately from Proto-Indo-European *Heh₃l- (“to bend, bow; elbow”)) + *-mn̥ (suffix forming action nouns or result nouns from verbs)) + -ālis (suffix forming adjectives of relationship from nouns)). The English word is borrowed from German subliminal, or a calque of German unterschwellig (“subliminal”, literally “beneath the threshold”).",
        "The noun is derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "subliminal (comparative more subliminal, superlative most subliminal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physiology) Of a stimulus: below the limen or threshold of conscious perception, especially if still able to produce a response; also (generally), below the threshold where a response can be produced. [from late 19th c.]",
                  "examples": [
                    "Synonyms: latent, underthreshold",
                    "Antonym: superliminal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) Without directed awareness or thought; subconscious (dated), unconscious. [from late 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Of an advertisement, a message, etc.: conveyed in a manner that a person is unaware of being influenced by it. [from mid 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "subliminal (plural subliminals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physiology) Chiefly preceded by the: something which is below the limen or threshold of conscious perception. [from late 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) Chiefly preceded by the: the subconscious (dated) or unconscious self. [from late 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) An advertisement, a message, etc., which is conveyed in a manner that a person is unaware of being influenced by it. [from mid 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}