{
  "word": "forest",
  "etymologies": [
    {
      "description": [
        "From Middle English forest, from Old French forest, from Medieval Latin forestis (“open wood”), first used in the Capitularies of Charlemagne in reference to the royal forest (as opposed to the inner woods, or parcus), of uncertain origin. Compare Old Saxon forest, forst (“forest”), Old High German forst (“forest”), Modern German Forst (“forest”).",
        "Medieval Latin foresta probably represents the fusion of two earlier words: one taken as an adaptation of the Late Latin phrase forestis silva (“the outside woods”), mistaking forestis for woods (—a development not found in Romance languages; compare Old French selve (“forest”)); the other is the continuance of an existing word since Merovingian times from Frankish *forhist, *furhiþi (“forest, wooded country, game preserve”) as the general word for \"forest, forested land\". The Medieval Latin term may have originated as a sound-alike, or been adapted as a play on the Frankish word. In the latter case, this would make forest a doublet of frith.",
        "In this sense, mostly displaced native Old English wudu, whence Modern English wood."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "forest (plural forests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dense uncultivated tract of trees and undergrowth, larger than woods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any dense collection or amount.",
                  "examples": [
                    "a forest of criticism"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A defined area of land set aside in England as royal hunting ground or for other privileged use; all such areas.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A graph with no cycles; i.e., a graph made up of trees.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, Microsoft Windows) A group of domains that are managed as a unit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The colour forest green.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "forest (third-person singular simple present forests, present participle foresting, simple past and past participle forested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover an area with trees.",
                  "examples": [
                    "From the view-point of national economy professor Fehér communicates to us most interesting facts, which he has established in an important question now of actuality : in the subject of foresting the Great Hungarian Plains."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}