{
  "word": "scrim",
  "etymologies": [
    {
      "description": [
        "Attested since the end of the 18th century. Origin unknown.",
        "In one of the earliest mentions, \"The Statistical Account of Scotland\", 1793, by John Sinclair, page 593, we read in a paragraph devoted to weavers: \"Besides these, they are now much employed in working a thin kind of coarse linen called Silesias, vulgarly Scrims, whereof each piece is 27 or 30 inches broad\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scrim (countable and uncountable, plural scrims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of light cotton or linen fabric, often woven in openwork patterns, used for curtains, etc,.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large military scarf, usually camouflage coloured and used for concealment when not used as a scarf.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A woven, nonwoven or knitted fabric composed of continuous strands of material used for reinforcing or strengthening membranes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A theater drop that appears opaque when a scene in front is lighted and transparent or translucent when a scene in back is lighted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) A sheet of gauze etc. used to reduce the intensity of light.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Thin canvas glued on the inside of panels to prevent shrinking, checking, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scrim (third-person singular simple present scrims, present participle scrimming, simple past and past participle scrimmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) To use a scrim.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From scrimmage."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scrim (plural scrims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming) A practice match between one or more organized teams usually in preparation for a more competitive format, such as a tournament.",
                  "examples": [
                    "As a team, the players decided to focus less on streaming (a major source of income) and more on in-house scrims, VOD review and practice, hoping to become a better team."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scrim (third-person singular simple present scrims, present participle scrimming, simple past and past participle scrimmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming) To participate in a scrim.",
                  "examples": [
                    "Accusations of him drinking instead of scrimming with the team, not attending practices at all and playing guitar instead of scrimming surfaced."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}