{
  "word": "microcosm",
  "etymologies": [
    {
      "description": [
        "From French microcosme, from Latin microcosmus, from Ancient Greek μικρός (mikrós, “small”) + κόσμος (kósmos, “universe, order”); micro- +‎ -cosm."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "microcosm (plural microcosms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Human nature or the human body as representative of the wider universe; man considered as a miniature counterpart of divine or universal nature. [from 15th c.]",
                  "examples": [
                    "The Christian humanists were emphatic in their demand that a man who wishes to understand himself must realize that he is a little world that reflects on a smaller scale the larger world of the universe. […] On the other hand, the whole idea of man as a microcosm was questioned by those who were not in sympathy with the Christian humanists."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The human body; a person. [17th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A smaller system which is seen as representative of a larger one. [from 17th c.]",
                  "examples": [
                    "‘In a sense, the problems experienced at Bristol are like a microcosm of what is happening in the NHS - experienced surgeons battling against difficult circumstances, with inadequate resources and in a culture where the finding of scapegoats appears to be put before the finding of solutions.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecology) A small natural ecosystem; an artificial ecosystem set up as an experimental model. [from 19th c.]",
                  "examples": [
                    "The method is relatively labour intensive (24-30 microcosms are run) and more difficult to interpret when compared with other microcosm methods (Shannon et al. 1986; Cairns & Cherry 1993)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}