{
  "word": "coon",
  "etymologies": [
    {
      "description": [
        "Clipping of raccoon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coon (plural coons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ethnic slur) A black person.",
                  "examples": [
                    "And that one looks Jewish, and that one's a coon! Who let all this riff-raff into the room?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, chiefly Southern US) A raccoon.",
                  "examples": [
                    "He also said that minks, muskrats, foxes, coons, and wild mice were found there, but no squirrels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, South Africa) A member of a colorfully dressed dance troupe in Cape Town during New Year celebrations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Southern US, ethnic slur) A coonass; a white Acadian French person who lives in the swamps.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated) A sly fellow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular) A black person who \"plays the coon\"; that is, who plays the dated stereotype of a black fool for an audience, particularly including Caucasians.",
                  "examples": [
                    ""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "coon (third-person singular simple present coons, present participle cooning, simple past and past participle cooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Southern US, colloquial) To hunt raccoons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) To traverse by crawling, as a ledge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Southern US, colloquial) To crawl while straddling, especially in crossing a creek.",
                  "examples": [
                    "There is a little ledge low on the face of the cliff, and by this with careful “cooning” one may reach a recession in the rock which makes a lovely arm chair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Georgia, colloquial) To fish by noodling, by feeling for large fish in underwater holes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, of an African-American English) To play the dated stereotype of a black fool for an audience, particularly including Caucasians.",
                  "examples": [
                    "From the classic toasts to the dirty dozens to the early blues50 and now to gangsta rap lyrics—why not consider it all just a bunch of niggers cooning for the white man’s delight and dollars?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Southern US, colloquial, dated) To steal.",
                  "examples": [
                    "Cooning water-melons [sic.] was a common custom, and young people would go out at night on such parties. To prevent any raids on our melon patch Grandfather set a trap alarm—which brought disaster."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}