{
  "word": "recruit",
  "etymologies": [
    {
      "description": [
        "From French recruter (as a verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "recruit (plural recruits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A supply of anything wasted or exhausted; a reinforcement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person enlisted for service in the army; a newly enlisted soldier.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hired worker",
                  "examples": [
                    "These new recruits were hired after passing the interviews"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, ecology) A new adult or breeding-age member of a certain population.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "recruit (third-person singular simple present recruits, present participle recruiting, simple past and past participle recruited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To enroll or enlist new members or potential employees on behalf of an employer, organization, sports team, the military, etc.",
                  "examples": [
                    "We need to recruit more admin staff to deal with the massive surge in popularity of our products"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To supply with new men, as an army; to fill up or make up by enlistment; also, to muster",
                  "examples": [
                    "the army was recruited for a campaign",
                    "they were looking to recruit two thousand troops for battle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To replenish, renew, or reinvigorate by fresh supplies; to remedy a lack or deficiency in.",
                  "examples": [
                    "Her cheeks glow the brighter, recruiting their colour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, intransitive) To become an adult or breeding-age member of a population.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biochemistry) To prompt a protein, leucocyte. etc. to intervene in a given region of the body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, intransitive) To recuperate; to gain health, flesh, spirits, or the like.",
                  "examples": [
                    "Lean cattle recruit in fresh pastures.",
                    "Go to the country to recruit."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}