{
  "word": "empire",
  "etymologies": [
    {
      "description": [
        "From Middle English empire, from Old French empire, empere, from Latin imperium, inperium (“command, control, dominion, sovereignty, a dominion, empire”), from imperare, inperare (“to command, order”), from in (“in, on”) + parare (“to make ready, order”). Doublet of empery and imperium."
      ],
      "adjectives": [
        {
          "description": "empire (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative letter-case form of Empire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "empire (plural empires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A political unit, typically having an extensive territory or comprising a number of territories or nations (especially one comprising one or more kingdoms) and ruled by a single supreme authority.",
                  "examples": [
                    "the Russian empire"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A political unit ruled by an emperor or empress.",
                  "examples": [
                    "The Empire of Vietnam was a short-lived client state of Japan governing Vietnam between March 11 and August 23, 1945."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The group of states or other territories that owe allegiance to an imperial power (foreign to them), when distinguished from the native territory of that power; imperial possessions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An expansive and powerful enterprise under the control of one person or group.",
                  "examples": [
                    "the McDonald's fast food empire"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Absolute) control, dominion, sway.",
                  "examples": [
                    "The brutality, the unthinking, the unreflecting character of the barbarians were so great, that the new faith, the new feelings with which they had been inspired, exercised but a very slight empire over them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}