{
  "word": "lake",
  "etymologies": [
    {
      "description": [
        "Arose from a conflation of the form of inherited Middle English lake (“small stream of running water, pool, lake”) with Middle English lac (“lake”), from Old French lac (“lake”) or Latin lacus (“lake, basin, tank”), see lac. The former, lake (“stream, pool, lake”), is inherited from Old English lacu (“stream, pool, expanse of water, lake”), from Proto-West Germanic *laku, from Proto-Germanic *lakō (“stream, pool, water aggregation”),  ultimately derived from Proto-Indo-European *leg- (“to leak, drain”). It is related to Dutch laak (“stream, drainage ditch, pond”), German Low German Lake, Laak (“drainage, marshland”), German Lache (“puddle”), Icelandic lækur (“stream”).",
        "Despite their similarity in form and meaning, Old English lacu is not related to English lay (“lake”), Latin lacus (“hollow, lake, pond”), Scottish Gaelic loch (“lake”), Ancient Greek λάκκος (lákkos, “waterhole, tank, pond, pit”), all from Proto-Indo-European *lókus, *l̥kwés (“lake, pool”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lake (plural lakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large, landlocked stretch of water or similar liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large amount of liquid; as, a wine lake.",
                  "examples": [
                    "So you punched out a window for ventilation. Was that before or after you noticed you were standing in a lake of gasoline?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) A small stream of running water; a channel for water; a drain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pit, or ditch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lake, lak, lac (also loke, laik, layke), from Old English lāc (“play, sport, strife, battle, sacrifice, offering, gift, present, booty, message”), from Proto-West Germanic *laik, from Proto-Germanic *laikaz (“game, dance, hymn, sport”), from Proto-Indo-European *leyg- (“to bounce, shake, tremble”). Cognate with Old High German leih (“song, melody, music”). Verb form partly from Middle English laken, from Old English lacan, from Proto-Germanic *laikaną, from Proto-Indo-European *leyg-. More at lay, -lock."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lake (plural lakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An offering, sacrifice, gift.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) Play; sport; game; fun; glee.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lake (third-person singular simple present lakes, present participle laking, simple past and past participle laked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To present an offering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly dialectal) To leap, jump, exert oneself, play.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lake, from Old English *lacen or Middle Dutch laken; both from Proto-Germanic *lakaną (“linen; cloth; sheet”). Cognate with Dutch lake (“linen”), Dutch laken (“linen; bedsheet”), German Laken, Danish lagan, Swedish lakan, Icelandic lak, lakan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lake (plural lakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A kind of fine, white linen.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French laque (“lacquer”), from Persian لاک‎ (lâk), from Hindi लाख (lākh), from Sanskrit लक्ष (lakṣa, “one hundred thousand”), referring to the number of insects that gather on the trees and make the resin seep out. Doublet of lakh, lac, and lacquer."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lake (plural lakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In dyeing and painting, an often fugitive crimson or vermillion pigment derived from an organic colorant (cochineal or madder, for example) and an inorganic, generally metallic mordant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the composition of colors for use in products intended for human consumption, made by extending on a substratum of alumina, a salt prepared from one of the certified water-soluble straight colors.",
                  "examples": [
                    "The name of a lake prepared by extending the aluminum salt prepared from FD&C Blue No. 1 upon the substratum would be FD&C Blue No. 1--Aluminum Lake."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lake (third-person singular simple present lakes, present participle laking, simple past and past participle laked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make lake-red.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}