{
  "word": "gardyloo",
  "etymologies": [
    {
      "description": [
        "From Edinburgh Scots gardyloo, from a corruption of medieval French gardez l'eau (“mind the water”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gardyloo (plural gardyloos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, historical) A cry of \"gardyloo\".",
                  "examples": [
                    "[…]  I began to round up the scattered empties which, without so much as a ‘gardyloo’, I chucked from the window into the backcourt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of discarding waste or some other substance from a height. Also attributive and figurative.",
                  "examples": [
                    "I believe the auld women wad hae greed, for Lucky Mac-Phail sent down the lass to tell my friend Mrs Crombie that she had made the gardyloo out of the wrang window, out of respect for twa Highlandmen that were speaking Gaelic in the close below the right ane.  […]",
                    "Mrs Glass, who had been in long and anxious expectation, now rushed, full of eager curiosity and open-mouthed interrogation, upon our heroine, who was positively unable to sustain the overwhelming cataract of her questions, which burst forth with the subliminity of a grand gardyloo  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Caution, warning.",
                  "examples": [
                    "Released but a few weeks before Gremlins, this film drew only foreshadowings of concern that spiraled up into hysterical gardyloos when Gremlins made its debut."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}