{
  "word": "react",
  "etymologies": [
    {
      "description": [
        "From re- +‎ act."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "react (plural reacts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) An emoji used to express a reaction to a post on social media.",
                  "examples": [
                    "Sad reacts only"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "react (third-person singular simple present reacts, present participle reacting, simple past and past participle reacted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act in response.",
                  "examples": [
                    "How did she react to the news?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To act or perform a second time; to do over again; to reenact. [from 17th c.]",
                  "examples": [
                    "It is somewhat extraordinary, that the offence for which James II, was expelled, that of setting up power by assumption, should be re-acted, under another shape and form, by the parliament that expelled him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, intransitive) To return an impulse or impression; to resist the action of another body by an opposite force",
                  "examples": [
                    "Every body reacts on the body that impels it from its natural state."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry, intransitive) To act upon each other; to exercise a reciprocal or a reverse effect, as two or more chemical agents; to act in opposition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry, transitive) To cause chemical agents to react; to cause one chemical agent to react with another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, intransitive) To post a reaction (icon or emoji indicating how one feels about a posted message).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}