{
  "word": "traveller",
  "etymologies": [
    {
      "description": [
        "From Middle English traveler, travelour, travailere, travailour (“worker\", also \"traveller”), equivalent to travel +‎ -er. Compare Anglo-Norman travailur, travailour, Old French travailleor, travelleeur, travelier."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "traveller (plural travellers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who travels, especially to distant lands.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A salesman who travels from place to place on behalf of a company.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) Someone who lives (particularly in the UK) in a caravan, bus or other vehicle rather than a fixed abode.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland) Alternative letter-case form of Traveller",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A list and record of instructions that follows a part in a manufacturing process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical engineering) One of the wires connecting the two members of a pair of three-way switches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A metal ring that moves freely on part of a ship’s rigging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, theater) A rail or track for a sliding curtain.",
                  "examples": [
                    "That would detract from the austerity of Rudkin's study, and a curtain on a traveler is always slid across the stage  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge) A sheet of paper that is circulated with the board of cards, on which players record their scores.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Mississippi Delta) A styrofoam cup filled with liquor and usually ice, to be taken away from a place.",
                  "examples": [
                    "Nowhere else in the world had I seen such gigantic measures of liquor poured, such widespread enthusiasm for Bloodies and Mimosas on weekend mornings, or such firm insistence on giving sixteen-ounce Styrofoam cups loaded with iced liquor to guests leaving a party, so they might have a \"traveler\" for the drive home.",
                    "At a bar in Yazoo City, the bartender asked me if I wanted to \"go tall\" with my bourbon on the rocks. I didn't know what he meant, but it sounded encouraging. \"Sure,\" I said, \"Let's go tall.\" He filled up a pint glass with ice. Then he filled it to the brim with bourbon. When I got up to leave with about half the drink gone, he poured the rest of it into a Styrofoam cup, assuming I would want a traveler."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}