{
  "word": "underdose",
  "etymologies": [
    {
      "description": [
        "under- +‎ dose, by analogy with overdose."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "underdose (plural underdoses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inadequate dose (of a medication).",
                  "examples": [
                    "“ […]  I put laudanum in his coffee last night. I was afraid to put in too much for fear of killing him, so I suppose I didn’t put in enough, for he laid wide awake all night.”",
                    "“Ah, yes! that would be the effect of an under-dose of laudanum.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An inadequate amount of something.",
                  "examples": [
                    "“Seems as though sometimes I get an overdose of feeling, and an underdose of sense.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "underdose (third-person singular simple present underdoses, present participle underdosing, simple past and past participle underdosed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To administer an inadequate dose (to someone or to oneself).",
                  "examples": [
                    "The time may come when penicillin can be bought by anyone in the shops. Then there is the danger that the ignorant man may easily underdose himself and by exposing his microbes to non-lethal quantities of the drug make them resistant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To administer an inadequate dose of (a medication).",
                  "examples": [
                    "[…]  a Child new-born may take an eighth or tenth part of a paper, a Child of a year old a quarter of a paper or a sixth part, 2, 3, or 4 years old a third 5, 6, 7, half a paper, &c. for you cannot hurt if you over or under dose it a little; the Medicine being safe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, intransitive) To use a scant or inadequate amount of an ingredient or product.",
                  "examples": [
                    "My advice is to slightly under-dose on the whiskey in Delia’s recipe, who I imagine went for a rather better bottle than I did."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}