{
  "word": "league",
  "etymologies": [
    {
      "description": [
        "From Middle English liege, ligg, lige (“a pact between governments, an agreement, alliance”), from Middle French ligue, from Italian lega, from the verb legare, from Latin ligō (“I tie”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "league (plural leagues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group or association of cooperating members.",
                  "examples": [
                    "the League of Nations"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) An organization of sports teams which play against one another for a championship.",
                  "examples": [
                    "My favorite sports organizations are the National Football League and the American League in baseball."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, rugby) Ellipsis of rugby league.",
                  "examples": [
                    "Are you going to watch the league tonight?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the negative) A class or type of people or things that are evenly matched or on the same level.",
                  "examples": [
                    "Forget about dating him; he's out of your league.",
                    "We're not even in the same league."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prefecture-level administrative unit in Inner Mongolia (Chinese: 盟).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An alliance or coalition.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "league (third-person singular simple present leagues, present participle leaguing, simple past and past participle leagued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To form an association; to unite in a league or confederacy; to combine for mutual support.",
                  "examples": [
                    "I believe that all the Bohemians and the great folks in Paris are so leagued together, that they are afraid of one another, and the people receive all the buffets of their disagreeings."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lege (“league”), from Late Latin leuca, leuga (“the Gaulish mile”), from Gaulish, from Proto-Celtic *lougā (compare Middle Breton leau, lew, Breton lev / leo (“league”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "league (plural leagues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(measurement) The distance that a person can walk in one hour, commonly taken to be approximately three English miles (about five kilometers).",
                  "examples": [
                    "Thenne kynge Mark and sir Dynadan rode forth a four leges englysshe tyl that they came to a brydge where houed a knyght on horsbak armed and redy to Iuste.",
                    "\"Then King Mark and Sir Dinadan rode forth a four leagues English, till that they came to a bridge where hoved a knight on horseback, armed and ready to joust.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stone erected near a public road to mark the distance of a league.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}