{
  "word": "crusty",
  "etymologies": [
    {
      "description": [
        "From Middle English, equivalent to crust +‎ -y."
      ],
      "adjectives": [
        {
          "description": "crusty (comparative crustier, superlative crustiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a crust, especially a thick one.",
                  "examples": [
                    "No one was there. But there was a cloth spread upon the table that stood against the wall, and a cover was laid for one, with a crusty brown loaf and a bottle of wine beside the plate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, figuratively, of a person or behavior) Short-tempered and gruff but, sometimes, with a harmless or benign inner nature.",
                  "examples": [
                    "Synonyms: gruff, peevish, surly, harsh"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Of very low quality.",
                  "examples": [
                    "Synonym: inferior"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "crusty (plural crusties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, informal) A tramp or homeless young person with poor cleanliness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Dried eye mucus.",
                  "examples": [
                    "Synonyms: (UK dialectal) gound, sleep, (informal) sleepy dust"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK and Ireland, informal) A member of an urban subculture with roots in punk and grebo, characterized by antiestablishment attitudes and an unkempt appearance.",
                  "examples": [
                    "2010,  Matthew Collin,  Altered State: The Story of Ecstasy Culture and Acid House‎[1], page 202:Many of them, dressed in raggedy black combat gear, with haircuts that matched and mismatched punk, Rasta and Native American styles - a look which would later be codified as 'crustie' - began to join the travellers on the road. This influx from the cities changed the travelling scene, and after the Battle of the Beanfield, sections of the downcast and disillusioned travelling community began to seek oblivion through Special Brew superlager or even heroin as the dream of rural liberation turned sour."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}