{
  "word": "string",
  "etymologies": [
    {
      "description": [
        "From Middle English string, streng, strynge, from Old English strenġ, from Proto-West Germanic *strangi, from Proto-Germanic *strangiz (“string”), from Proto-Indo-European *strengʰ- (“rope, cord, strand; to tighten”). Cognate with Scots string (“string”), Dutch streng (“cord, strand”), Low German strenge (“strand, cord, rope”), German Strang (“strand, cord, rope”), Danish streng (“string”), Swedish sträng (“string, cord, wire”), Icelandic strengur (“string”), Latvian stringt (“to be tight, wither”), Latin stringō (“I tighten”), Ancient Greek στραγγαλόομαι (strangalóomai, “to strangle”), from στραγγάλη (strangálē, “halter”), Ancient Greek στραγγός (strangós, “tied together, entangled, twisted”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "string (countable and uncountable, plural strings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A long, thin and flexible structure made from threads twisted together.",
                  "examples": [
                    "Synonyms: cord, rope, line, thread; see also Thesaurus:string"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Such a structure considered as a substance.",
                  "examples": [
                    "Synonyms: cord, rope, twine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A thread",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable) Any similar long, thin and flexible object.",
              "entries": [
                {
                  "meaning": "(music) A segment of wire (typically made of plastic or metal) or other material used as vibrating element on a musical instrument.",
                  "examples": [
                    "a violinstring",
                    "a bowstring"
                  ]
                },
                {
                  "meaning": "(sports) A length of nylon or other material on the head of a racquet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thread or cord on which a number of objects or parts are strung or arranged in close and orderly succession; hence, a line or series of things arranged on a thread, or as if so arranged.",
                  "examples": [
                    "a string of shells or beads",
                    "a string of sausages"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A cohesive substance taking the form of a string.",
                  "examples": [
                    "The string of spittle dangling from his chin was most unattractive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A series of items or events.",
                  "examples": [
                    "Synonyms: sequence, series"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The members of a sports team or squad regarded as most likely to achieve success. (Perhaps metaphorical as the \"strings\" that hold the squad together.) Often first string, second string etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) In various games and competitions, a certain number of turns at play, of rounds, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) A drove of horses, or a group of racehorses kept by one owner or at one stable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, programming) An ordered sequence of text characters stored consecutively in memory and capable of being processed as a single entity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, metonymically, countable) A stringed instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, usually in the plural) The stringed instruments as a section of an orchestra, especially those played by a bow, or the persons playing those instruments.",
                  "examples": [
                    "Synonym: string section"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, in the plural) The conditions and limitations in a contract collectively.",
                  "examples": [
                    "Synonyms: conditions, provisions",
                    "no strings attached"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, physics) The main object of study in string theory, a branch of theoretical physics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Cannabis or marijuana.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards) Part of the game of billiards, where the order of the play is determined by testing who can get a ball closest to the bottom rail by shooting it onto the end rail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, billiards) The buttons strung on a wire by which the score is kept.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards, by extension) The points made in a game of billiards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards, pool) The line from behind and over which the cue ball must be played after being out of play, as by being pocketed or knocked off the table; also called the string line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strip, as of leather, by which the covers of a book are held together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A fibre, as of a plant; a little fibrous root.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A nerve or tendon of an animal body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(shipbuilding) An inside range of ceiling planks, corresponding to the sheer strake on the outside and bolted to it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The tough fibrous substance that unites the valves of the pericarp of leguminous plants.",
                  "examples": [
                    "the strings of beans"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A small, filamentous ramification of a metallic vein.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A stringcourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang) A hoax; a fake story.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of stable (“group of prostitutes managed by one pimp”)",
                  "examples": [
                    "They were turning tricks, doing drugs, and generally little better off than they had been before, except that they were keeping more of their money. But they seemed lonely, too, without the company of their pimp and the rest of his string."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(oil industry) A column of drill pipe that transmits drilling fluid (via the mud pumps) and torque (via the kelly drive or top drive) to the drill bit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "string (third-person singular simple present strings, present participle stringing, simple past strung or (obsolete or nonstandard) strang, past participle strung)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put (items) on a string.",
                  "examples": [
                    "You can string these beads on to this cord to make a colorful necklace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put strings on (something).",
                  "examples": [
                    "It is difficult to string a tennis racket properly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form into a string or strings, as a substance which is stretched, or people who are moving along, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, billiards) To drive the ball against the end of the table and back, in order to determine which player is to open the game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(birdwatching) To deliberately state that a certain bird is present when it is not; to knowingly mislead other birders about the occurrence of a bird, especially a rarity; to misidentify a common bird as a rare species.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}