{
  "word": "adumbration",
  "etymologies": [
    {
      "description": [
        "From Latin adumbrātiō (“sketch; outline, silhouette; pretence, semblance”)  +‎ -ion (suffix indicating a condition or state). Adumbrātiō is derived from adumbrāre (present active infinitive of adumbrō (“to represent an object with light and shade, to shade; to represent in outline, to outline, silhouette, sketch; to cast a shadow on, overshadow, shade; to copy, counterfeit, imitate”)) + -tiō (suffix forming nouns relating to actions or the results of actions). Adumbrō is derived from ad- (prefix meaning ‘to, towards’) + umbrō (“to cast a shadow, to shade; to overshadow”) (from umbra (“shade; shadow; ghost”)).",
        "Sense 2.1 (“(heraldry) outline of a charge”) is modelled after umbration (“(heraldry) figure with a faint outline”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "adumbration (countable and uncountable, plural adumbrations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The state of being in shadow or shade; (countable) a shadow.",
                  "examples": [
                    "Synonyms: shading, shadowing"
                  ]
                }
              ]
            },
            {
              "group": "(countable) A faint sketch; a brief representation, an outline.",
              "entries": [
                {
                  "meaning": "(specifically, heraldry) The outline of a charge (“image displayed on an escutcheon”), sometimes filled in with a darker shade than the field.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, figuratively) A rough or symbolic representation; a vague indication of what is to come, a foreshadowing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, philosophy, specifically phenomenology) The form of an object as seen by an observer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}