{
  "word": "smicker",
  "etymologies": [
    {
      "description": [
        "From Middle English smiker, from Old English smicer, smicor (“beauteous, beautiful, elegant, fair, fine, neat, tasteful”), from Proto-Germanic *smikraz (“fine, elegant, delicate, tender”), from Proto-Indo-European *smēyg- (“small, delicate”), from Proto-Indo-European *smē-, *smey- (“to smear, stroke, wipe, rub”). Cognate with Middle High German smecker (“neat, elegant”), Ancient Greek σμικρός (smikrós), μικρός (mikrós, “small, short”), Lithuanian smeigti (“to lunge, thrust, jab”), Latin mīca (“crumb, morsel, bit”).",
        "For the verb, compare Swedish smickra (“to flatter, coax, wheedle, butter up”), Danish smigre (“to flatter”)."
      ],
      "adjectives": [
        {
          "description": "smicker (comparative more smicker, superlative most smicker)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Elegant; fine; attractive, beautiful.",
                  "examples": [
                    "No, his deep-reaching spirit could not brookThe fond addiction to such vanity;Regardful of his honour he forsookThe smicker use of court-humanity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Amorous; wanton.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Handsome, spruce; smart, dapper.",
                  "examples": [
                    "A smicker boy, a lither swain,Heigh ho, a smicker swain,That his love was wanton fain,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "smicker (third-person singular simple present smickers, present participle smickering, simple past and past participle smickered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To look amorously or wantonly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly Scotland) To look or smile seductively or amorously.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly Scotland) To laugh or smile in a sniggering or leering way; smirk.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}