{
  "word": "probe",
  "etymologies": [
    {
      "description": [
        "For verb: borrowed from Latin probare (“to test, examine, prove”), from probus (“good”).",
        "For noun: borrowed from Late Latin proba (“a proof”), from probare (“to test, examine, prove”); Doublet of proof. Compare Spanish tienta (“a surgeon's probe”), from tentar (“try, test”); see tempt."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "probe (plural probes)",
          "definitionGroups": [
            {
              "group": "(surgery) Any of various medical instruments used to explore wounds, organs, etc. [from 15th c.]",
              "entries": [
                {
                  "meaning": "(comedy, fiction) An anal probe, a fictional instrument commonly used by aliens on abducted humans.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something which penetrates something else, as though to explore; something which obtains information. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of probing; a prod, a poke. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An investigation or inquiry. [from 20th c.]",
                  "examples": [
                    "They launched a probe into the cause of the accident."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aeronautics) A tube attached to an aircraft which can be fitted into the drogue from a tanker aircraft to allow for aerial refuelling. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) A small device, especially an electrode, used to explore, investigate or measure something by penetrating or being placed in it. [from 20th c.]",
                  "examples": [
                    "Insert the probe into the soil and read the temperature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronautics) A small, usually uncrewed, spacecraft used to acquire information or measurements about its surroundings. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(game of Go) a move with multiple answers seeking to make the opponent choose and commit to a strategy",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biochemistry) Any group of atoms or molecules radioactively labeled in order to study a given molecule or other structure",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "probe (third-person singular simple present probes, present participle probing, simple past and past participle probed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To explore, investigate, or question",
                  "examples": [
                    "If you probe further, you may discover different reasons."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To insert a probe into.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}