{
  "word": "throe",
  "etymologies": [
    {
      "description": [
        "The noun is probably derived partly:",
        "The current spelling of the word is a 16th-century variant of Middle English throu, throwe, perhaps to avoid confusion with throw (“act of turning or twisting; fit of bad temper or peevishness; look of anger, bad temper, irritation, etc., a grimace”).",
        "The verb is derived:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "throe (plural throes)",
          "definitionGroups": [
            {
              "group": "A severe pang or spasm of pain, especially one experienced when the uterus contracts during childbirth, or when a person is about to die.",
              "entries": [
                {
                  "meaning": "(usually in the plural) The pain of labour or childbirth; the suffering of death.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any severe pang or spasm, especially an outburst of feeling; a paroxysm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, usually in the plural) A hard struggle, especially one associated with the beginning or finishing of a task.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "throe (third-person singular simple present throes, present participle throeing, simple past and past participle throed) (obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (someone) to feel throes, as if in childbirth; to put in agony.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To feel throes; to struggle in extreme pain; to be in agony; to agonize.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Perhaps a variant of froe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "throe (plural throes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of froe (“a cleaving tool for splitting cask staves and shingles from a block of wood”)",
                  "examples": [
                    "Synonym: frow"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}