{
  "word": "waif",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Late Middle English weif (“ownerless property subject to seizure and forfeiture; the right of such seizure and forfeiture; revenues obtained from such seizure and forfeiture”) [and other forms], from Anglo-Norman waif, weif [and other forms] (compare Anglo-Latin waivum [and other forms], Medieval Latin waivium), possibly from Old French waif, a variant of gaif, gayf (“property that is lost and unclaimed; of property: lost and unclaimed”) (Norman) [and other forms], probably from a North Germanic source such as Old Norse veif (“flag; waving thing”), from Proto-Germanic *waif-, from Proto-Indo-European *weyp- (“to oscillate, swing”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waif (plural waifs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, law, archaic) Often in the form waif and stray, waifs and strays: an article of movable property found of which the owner is not known, such as goods washed up on a beach or thrown away by an absconding thief; such items belong to the Crown, which may grant the right of ownership to them to a lord of a manor.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Something found, especially if without an owner; something which comes along, as it were, by chance.",
                  "examples": []
                },
                {
                  "meaning": "A person (especially a child) who is homeless and without means of support; also, a person excluded from society; an outcast.",
                  "examples": [
                    "Synonyms: see Thesaurus:vagabond"
                  ]
                },
                {
                  "meaning": "(by extension) A very thin person.",
                  "examples": [
                    "Synonyms: see Thesaurus:thin person",
                    "Antonyms: see Thesaurus:fat person"
                  ]
                },
                {
                  "meaning": "(by extension, botany) A plant introduced in a place outside its native range but is not persistently naturalized.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "waif (third-person singular simple present waifs, present participle waifing, simple past and past participle waifed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cast aside or reject, and thus make a waif.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Possibly from Old Norse veif (“flag; waving thing”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waif (plural waifs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, chiefly whaling, historical) A small flag used as a signal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Origin unknown; possibly related to the following words:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waif (plural waifs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something (such as clouds or smoke) carried aloft by the wind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}