{
  "word": "snob",
  "etymologies": [
    {
      "description": [
        "Late 18th century dialectal English snob (“cobbler”), of unknown origin. Early senses of the word carried the meaning of \"lower status;\" it was then used to describe those seeking to imitate those of higher wealth or status. Folk etymology derives it from the Latin phrase sine nobilitate (“without nobility”), but early uses had no connection to this.",
        "The modern sense was popularized by William Makepeace Thackeray in The Book of Snobs (1848)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "snob (plural snobs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, derogatory) A person who wishes to be seen as a member of the upper classes and who looks down on those perceived to have inferior or unrefined tastes. [from 20th c.]",
                  "examples": [
                    "If wanting the best things in life means being a snob then glory hallelujah I'm a snob."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A cobbler or shoemaker. [from 18th c.]",
                  "examples": [
                    "The snobs were also kind to him, and gave him a pair of boots which they assured him were of a type and quality reserved entirely for officers  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A member of the lower classes; a commoner. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A workman who works for lower wages than his fellows, especially one who will not join a strike (a scab).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cambridge University) A townsman, as opposed to a gownsman.",
                  "examples": [
                    "Synonym: cad"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}