{
  "word": "chark",
  "etymologies": [
    {
      "description": [
        "A back-formation from charcoal (interpreted as chark coal)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chark (countable and uncountable, plural charks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Charcoal; coke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pointed stick, which when placed with the point against another piece of wood, and spun rapidly in alternate directions with the aid of attached cords, produces enough heat by friction to create a fire; a fire drill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Alaska) A wine glass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Middle Eastern falcon, probably the lanner.",
                  "examples": [
                    "A good chark will sometimes take as many as eight or ten bustards or five or six gazelles in the course of a morning."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chark (third-person singular simple present charks, present participle charking, simple past and past participle charked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reduce by strong heat, as to produce charcoal or coke; to calcine.",
                  "examples": [
                    "I have ſeen Turf chark'd, and then it ſerves to work Iron, and, as I have been inform'd will ſerve to make it in a Bloomery or Iron-work. Turf chark'd I reckon the ſweeteſt and wholeſomeſt Fire that can be, fitter for a Chamber and conſumptive People, than either Wood, Stone-Coal or Charcoal."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Cognate with Scots chork, from Middle English charken, cherkin, from Old English ċearcian, variant of cracian (“to resound, make an abrasive sound, crack”), from Proto-West Germanic *krakōn, from Proto-Germanic *krakōną (“to crack, crackle; to shriek”). Doublet of chirk, crack, and crake."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "chark (third-person singular simple present charks, present participle charking, simple past and past participle charked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) To make a grating sound.",
                  "examples": [
                    "The hoarse charking conversation which they carried on was calculated to support the delusion."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}