{
  "word": "knife",
  "etymologies": [
    {
      "description": [
        "From Middle English knyf, knif, from late Old English cnīf, possibly from Old Norse knífr, from Proto-Germanic *knībaz, from *knīpaną (“to pinch”), Proto-Indo-European *gneybʰ- (compare Lithuanian gnýbti, žnýbti (“to pinch”), gnaibis (“pinching”)). Replaced Middle English sax (“knife”) from Old English seax; and Middle English coutel, qwetyll (“knife”) from Old French coutel.",
        "The verb knife is attested since the mid 1800s; the variant knive is attested since 1733."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "knife (plural knives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A utensil or a tool designed for cutting, consisting of a flat piece of hard material, usually steel or other metal (the blade), usually sharpened on one edge, attached to a handle. The blade may be pointed for piercing.",
                  "examples": [
                    "Jeff was bent low over the backboard, working with the knife, a steady sawing motion, his shirt soaked through with sweat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A weapon designed with the aforementioned specifications intended for slashing and/or stabbing and too short to be called a sword. A dagger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any blade-like part in a tool or a machine designed for cutting, such as that of a chipper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "knife (third-person singular simple present knifes, present participle knifing, simple past and past participle knifed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut with a knife.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use a knife to injure or kill by stabbing, slashing, or otherwise using the sharp edge of the knife as a weapon.",
                  "examples": [
                    "She was repeatedly knifed in the chest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To cut through as if with a knife.",
                  "examples": [
                    "The boat knifed through the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To betray, especially in the context of a political slate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To positively ignore, especially in order to denigrate; compare cut.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}