{
  "word": "distil",
  "etymologies": [
    {
      "description": [
        "From Late Middle English distillen (“to fall, flow, or shed in drops, drop, trickle; to shed drops; to fill (the eyes) with tears; (alchemy, medicine) to subject (something) to distillation; to obtain (something) using distillation; to distil; to condense or vaporize; (figuratively) to give (good fortune) to; to say (slanderous words)”) [and other forms], from Old French distiller (modern French distiller (“to distil”)), and from its etymon Latin distīllāre, a variant of Latin dēstīllāre, the present active infinitive of dēstīllō (“to drip or trickle down; to distil”), from dē- (prefix meaning ‘down, down from, down to’) + stīllō (“to drip, drop, trickle; to distil”) (from stīlla (“drop of liquid; (figuratively) small quantity”), probably a diminutive of stīria (“ice drop; icicle”), from Proto-Indo-European *ster- (“stiff”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "distil (third-person singular simple present distils, present participle distilling, simple past and past participle distilled) (British spelling)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To exude (a liquid) in small drops; also, to give off (a vapour) which condenses in small drops.",
                  "examples": [
                    "Firs distil resin."
                  ]
                },
                {
                  "meaning": "(by extension, figuratively) To impart (information, etc.) in small quantities; to infuse.",
                  "examples": []
                },
                {
                  "meaning": "To heat (a substance, usually a liquid) so that a vapour is produced, and then to cool the vapour so that it condenses back into a liquid, either to purify the original substance or to obtain one of its components; to subject to distillation.",
                  "examples": []
                },
                {
                  "meaning": "Followed by off or out: to expel (a volatile substance) from something by distillation.",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively)",
                  "examples": []
                },
                {
                  "meaning": "To extract the essence of (something) by, or as if by, distillation; to concentrate, to purify.",
                  "examples": []
                },
                {
                  "meaning": "To transform a thing (into something else) by distillation.",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) To make (something, especially spirits such as gin and whisky) by distillation.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To dissolve or melt (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To fall or trickle down in small drops; to exude, to ooze out; also, to come out as a vapour which condenses in small drops.",
                  "examples": []
                },
                {
                  "meaning": "To flow or pass gently or slowly; hence (figuratively) to be manifested gently or gradually.",
                  "examples": []
                },
                {
                  "meaning": "To drip or be wet with some liquid.",
                  "examples": []
                },
                {
                  "meaning": "To turn into a vapour and then condense back into a liquid; to undergo or be produced by distillation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}