{
  "word": "flange",
  "etymologies": [
    {
      "description": [
        "From dialectal English flange (“to project”), flanch (“a projection”), from Old French flanche (“flank, side”). See flank. As a term for a group of baboons, it was popularized in the comedy TV series Not the Nine O'Clock News."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flange (plural flanges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An external or internal rib or rim, used either to add strength or to hold something in place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The projecting edge of a rigid or semi-rigid component.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(role-playing games) An ability in a role-playing game which is not commonly available, overpowered or arbitrarily imposed by the referees.",
                  "examples": [
                    "[The] enduring problem with the Gathering is that [players] can't affect anything that happens ... whatever they do, the LT just flange it back to the original plot line."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar slang) The vulva.",
                  "examples": [
                    "I was in bed the other day with the missus and I asked to see her flange. Imagine my surprise when she got up went downstairs to my toolbox and brought me up a metal looking object called a flange!!!!! Needless to say when she asked to see my nuts the next time I obliged by doing exactly the same as her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, humorous) The collective noun for a group of baboons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The electronic sound distortion produced by a flanger.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flange (third-person singular simple present flanges, present participle flanging, simple past and past participle flanged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be bent into a flange.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mechanics) To make a flange on; to furnish with a flange; to bend (esp. sheet metal) in the form of a flange.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sound engineering) To mix two copies of together, one delayed by a very short, slowly varying time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}