{
  "word": "daub",
  "etymologies": [
    {
      "description": [
        "From Middle English daub (noun), from Middle English dauben (“to plaster or whitewash; cover with clay; bespatter”, verb), from Old Northern French dauber (“to whitewash; plaster”), of uncertain origin. Probably from Latin dealbāre (“to whiten thoroughly”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "daub (countable and uncountable, plural daubs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Excrement or clay used as a bonding material in construction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A soft coating of mud, plaster, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A crude or amateurish painting.",
                  "examples": [
                    "Ah, but what if he penned what in the art schools they call an 'artist's statement' wherein he explained the relation of his gibberish or his daubs to the mainstream of art or writing?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "daub (third-person singular simple present daubs, present participle daubing, simple past and past participle daubed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To apply (something) to a surface in hasty or crude strokes.",
                  "examples": [
                    "Synonyms: apply, coat, cover, plaster, smear",
                    "The artist just seemed to daub on paint at random and suddenly there was a painting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To paint (a picture, etc.) in a coarse or unskilful manner.",
                  "examples": [
                    "[…]  a lame, imperfect Piece, rudely daub’d over with too little Reflection and too much haste."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To cover with a specious or deceitful exterior; to disguise; to conceal.",
                  "examples": [
                    "No flattering praises daub my stone,",
                    "My frailties and my faults to hide;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To flatter excessively or grossly.",
                  "examples": [
                    "I can safely say, however, that without any daubing at all, I am, very sincerely, Your very affectionate, humble servant,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To put on without taste; to deck gaudily.",
                  "examples": [
                    "Yet shall Whitehall the Innocent, the Good,",
                    "See these men dance all daub’d with Lace and Blood."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}