{
  "word": "banjo",
  "etymologies": [
    {
      "description": [
        "A corruption of bandore, from the pronunciation of African slaves."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "banjo (plural banjos or banjoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stringed musical instrument (chordophone), usually with a round body, a membrane-like soundboard and a fretted neck, played by plucking or strumming the strings.",
                  "examples": [
                    "I come from Alabama with my banjo on my knee..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various similar musical instruments, such as the Tuvan doshpuluur, with a membrane-like soundboard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An object shaped like a banjo, especially a frying pan or a shovel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Dagenham) A cul-de-sac with a round end.",
                  "examples": [
                    "They all came back here — we cleared the room and put up tables for the reception — and then we went to another house on the banjo for a \"knees-up\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A miner's round-nosed shovel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "banjo (third-person singular simple present banjos, present participle banjoing, simple past and past participle banjoed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To play a banjo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, Britain) To beat, to knock down.",
                  "examples": [
                    "Admitting the assault, the husband said that he had given her a 'banjoing' but that she had asked for it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, Britain, military) To shell or attack (a target).",
                  "examples": [
                    "Riding reported that on the day Mayne had asked for DZ coordinates, their base had been banjoed by the Germans."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}