{
  "word": "freedom",
  "etymologies": [
    {
      "description": [
        "From Middle English fredom, freedom, from Old English frēodōm (“freedom, state of free-will, charter, emancipation, deliverance”), from Proto-West Germanic *frijadōm (“freedom”). Equivalent to free +‎ -dom. Cognate with North Frisian fridoem (“freedom”), Dutch vrijdom (“freedom”), Low German frīdom (“freedom”), Middle High German vrītuom (“freedom”), Norwegian fridom (“freedom”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "freedom (countable and uncountable, plural freedoms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The state of being free, of not being imprisoned or enslaved.",
                  "examples": [
                    "Synonym: freehood",
                    "Having recently been released from prison, he didn't know what to do with his newfound freedom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The lack of a specific constraint, or of constraints in general; a state of being free, unconstrained.",
                  "examples": [
                    "Synonym: freeness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The right or privilege of unrestricted use or access",
                  "examples": [
                    "Freedom of a city"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Frankness; openness; unreservedness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Improper familiarity; violation of the rules of decorum.",
                  "examples": [
                    "\"A first love is not easily extinguished, Mr. Allanson,\" said she. \"You may guess from my appearance, that I have been fortunate in life; but, for all that, my first love for you has continued the same, unaltered and unchanged, and you must forgive the little freedoms I used to-day to try your affections, and the effects my appearance would have on you.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}