{
  "word": "endow",
  "etymologies": [
    {
      "description": [
        "From Late Middle English endowen, endouen, enduen, indouen, indw (“to provide with assets, a livelihood, or privileges; to bestow, grant; (figuratively) to favour; to endow”), from Anglo-Norman endouer, from Old French en- (prefix meaning ‘in, into’) + douer (“to endow”) (from Latin dōtāre (present active infinitive of dōtō (“to endow”)); modern French douer). Dōtō is derived from dōs (“dowry; endowment, gift”) (ultimately from Proto-Indo-European *deh₃- (“to give”)) + -ō (suffix forming regular first-conjugation verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "endow (third-person singular simple present endows, present participle endowing, simple past and past participle endowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give property to (someone) as a gift; specifically, to provide (a person or institution) with support in the form of a permanent fund of money or other benefits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Followed by with, or rarely by of: to enrich or furnish with some faculty or quality.",
                  "examples": [
                    "Synonym: begift"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Usually in the passive: to naturally furnish (with something).",
                  "examples": [
                    "Synonyms: bless, gift",
                    "She was endowed with a beautiful voice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic or obsolete) To provide with a dower (“the portion that a widow receives from her deceased husband's property”) or a dowry (“property given to a bride”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}