{
  "word": "gemmule",
  "etymologies": [
    {
      "description": [
        "Borrowed from French gemmule, from Latin gemmula (“small bud; small gem”), from gemma (“bud of a plant; gem, jewel; thing made of precious stones”) (further etymology uncertain; possibly from Proto-Indo-European *ǵenh₁- (“to beget, give birth; to produce”), but see further at that entry) + -ula (feminine form of -ulus (diminutive suffix))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gemmule (plural gemmules)",
          "definitionGroups": [
            {
              "group": "(biology)",
              "entries": [
                {
                  "meaning": "(archaic) Synonym of gemma (“an asexual reproductive structure, as found in animals such as hydra (genus Hydra) and plants such as liverworts (division Marchantiophyta), consisting of a cluster of cells from which a new individual can develop”)",
                  "examples": []
                },
                {
                  "meaning": "(specifically, zoology) A small gemma or bud of dormant embryonic cells produced by some freshwater sponges (phylum Porifera) that develops into a new sponge.",
                  "examples": []
                },
                {
                  "meaning": "(historical) In the obsolete theory of pangenesis propounded by the English scientist Charles Darwin (1809–1882): a hypothetical particle once thought to be the basis of heredity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Synonym of plumule (“the first bud, or growing point, of a plant embryo, situated above the cotyledons”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(neurology) Synonym of dendritic spine (“a small membranous protrusion from the dendrite of a neuron that typically receives input from a single axon at the synapse”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}