{
  "word": "shed",
  "etymologies": [
    {
      "description": [
        "From Middle English scheden, schede, from Old English scēadan, scādan (“to separate, divide, part, make a line of separation between; remove from association or companionship; distinguish, discriminate, decide, determine, appoint; shatter, shed; expound; decree; write down; differ”), from Proto-West Germanic *skaiþan, from Proto-Germanic *skaiþaną (compare West Frisian skiede, Dutch and German scheiden), from Proto-Indo-European *skeyt- (“to cut, part, divide, separate”), from *skey-.",
        "See also Welsh chwydu (“to break open”), Lithuanian skėsti (“to spread”), skíesti (“to separate”), Old Church Slavonic цѣдити (cěditi, “to filter, strain”), Ancient Greek σχίζω (skhízō, “to split”), Old Armenian ցտեմ (cʿtem, “to scratch”), Sanskrit च्यति (cyáti, “he cuts off”)). Related to shoad, shit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "shed (third-person singular simple present sheds, present participle shedding, simple past and past participle shed or (nonstandard) shedded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, UK, dialectal) To part, separate or divide.",
                  "examples": [
                    "To shed something in two.",
                    "To shed the sheep from the lambs.",
                    "A metal comb shed her golden hair.",
                    "We are shed with each other by an enormous distance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To part with, separate from, leave off; cast off, let fall, be divested of.",
                  "examples": [
                    "You must shed your fear of the unknown before you can proceed.",
                    "When we found the snake, it was in the process of shedding its skin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To pour; to make flow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow to flow or fall.",
                  "examples": [
                    "I didn't shed many tears when he left me.",
                    "A tarpaulin sheds water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To radiate, cast, give off (light); see also shed light on.",
                  "examples": [
                    "Can you shed any light on this problem?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To pour forth, give off, impart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To fall in drops; to pour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sprinkle; to intersperse; to cover.",
                  "examples": [
                    "Her hair  […]  is shed with gray."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving) To divide, as the warp threads, so as to form a shed, or passageway, for the shuttle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English sched, schede, schad, from a combination of Old English scēada (“a parting of the hair, top of the head”) and Old English ġesċēad (“distinction, reason”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shed (plural sheds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving) An area between upper and lower warp yarns through which the weft is woven.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A distinction or dividing-line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A parting in the hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The top of the head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An area of land as distinguished from those around it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A unit of area equivalent to 10−52 square meters; used in nuclear physics",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Dialectal variant of a specialized use of shade."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shed (plural sheds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slight or temporary structure built to shade or shelter something; a structure usually open in front; an outbuilding; a hut.",
                  "examples": [
                    "a wagon shed; a wood shed; a garden shed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large temporary open structure for reception of goods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, derogatory, informal) An automobile which is old, worn-out, slow, or otherwise of poor quality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, rail transportation) A British Rail Class 66 locomotive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shed (third-person singular simple present sheds, present participle shedding, simple past and past participle shedded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To place or allocate a vehicle, such as a locomotive, in or to a depot or shed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) to woodshed",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}