{
  "word": "phenomenology",
  "etymologies": [
    {
      "description": [
        "phenomenon +‎ -logy, from Ancient Greek φαινόμενον (phainómenon, “thing appearing to view”), hence \"the study of what shows itself (to consciousness)\".",
        "According to Heidegger's Introduction to Phenomenological Research, \"the expression “phenomenology” first appears in the eighteenth century in Christian Wolff’s School, in Lambert’s Neues Organon, in connection with analogous developments popular at the time, like dianoiology and alethiology, and means a theory of illusion, a doctrine for avoiding illusion.\" (p.3)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "phenomenology (countable and uncountable, plural phenomenologies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) The study of structures of consciousness as experienced from the first-person point of view.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) A movement based on this, originated about 1905 by Edmund Husserl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, philosophy of medical sciences) An approach to clinical practice which places undue reliance upon subjective criteria such as signs and symptoms, while ignoring objective etiologies in the formulation of diagnoses and in the compilation of a formal nosologies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) The use of theoretical models to make predictions that can be tested through experiments.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}