{
  "word": "popple",
  "etymologies": [
    {
      "description": [
        "From Middle English popul, popil, from Old English popul, from Latin populus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "popple (plural popples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) poplar",
                  "examples": [
                    "Some of them had recently built a pulp mill, and he called my attention to the young growths of \"popple\" we could see from the car window and remarked: \"There's good pulp material in those trees, but it's not easy to get 'em cut. You'll strike lots of Catholic lumber-jacks who won't have anything to do with cutting a popple tree, and they won't cross a bridge or sleep in a house that has popple wood in it. There's a tradition that the cross on which Christ was crucified was of popple, and they say the wood was cursed on that account."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English poplen, possibly from Middle Dutch, of imitative origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "popple (plural popples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Choppy water; the motion or sound of agitated water (as from boiling or wind).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "popple (third-person singular simple present popples, present participle poppling, simple past and past participle poppled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of water, to move in a choppy, bubbling, or tossing manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move quickly up and down; to bob up and down, like a cork on rough water.",
                  "examples": [
                    "His Brains came poppling out like Water"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}