{
  "word": "feague",
  "etymologies": [
    {
      "description": [
        "From Dutch vegen (“to sweep, strike”), from Middle Dutch vēghen (“to cleanse”), from Old Dutch *fegōn (“to cleanse”), from Proto-West Germanic *faginōn, from Proto-Germanic *faginōną (“to decorate, make beautiful”), from Proto-Indo-European *pōḱ-, *pēḱ- (“to clean, to adorn”). Cognate with Danish feje (“to sweep”), German fegen (“to cleanse, scour, sweep”), Icelandic fægja (“to polish”), Swedish feja (“to sweep”). More at fay, fair, fake."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "feague (third-person singular simple present feagues, present participle feaguing, simple past and past participle feagued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To increase the liveliness of a horse by inserting an irritant, such as a piece of peeled raw ginger or a live eel, in its anus.",
                  "examples": [
                    "Run along to Hobson's Livery Stable and tell them I want a good fast horse, right? Something with a bit of fizz in its blood! Not some feagued-up old screw, and I know the difference! I want it here in half an hour! Off you go!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To beat or whip; to drive.",
                  "examples": [
                    "[T]here's one Count Sharnofsky, too, such another ambitious dry-chops, he hath not the grace to love good drink, and yet he hath the impudence to aim at the Crown.  […]  [H]e squints at it fearfully, and he hath an itch at the Princess too; (Landlord squints, and makes grim-faces,) but I hope the Cardinal will feage [footnote: \"Whip\" or \"beat.\"] 'um all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To subject to some harmful scheme; to ‘do in’.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To have sexual intercourse with.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from Dutch feeks, probably from vegen (“to sweep, strike”): see etymology of feague (verb) above. Compare Middle English vecke (“old woman”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "feague (plural feagues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An unkempt, slatternly person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}