{
  "word": "largesse",
  "etymologies": [
    {
      "description": [
        "From Middle English larges, largess, largesse [and other forms], from Anglo-Norman largece, largesce, Middle French largece, largesce, largesse, and Old French largesce (“breadth, width; request for a monetary gift; (act of) generous giving; (chiefly in the plural) generous gift; generosity, liberality”) (in Anglo-Norman also “liberty; privilege”; modern French largesse), from large (“big, large; generous; wide”) (from Latin largus (“abundant, plentiful; large; bountiful, liberal”), possibly from Proto-Indo-European *lai- (“fat, grease, lard”) or *las- (“to be willing; covetous; eager”)) + -esce (suffix forming nouns)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "largesse (plural largesses)",
          "definitionGroups": [
            {
              "group": "(uncountable)",
              "entries": [
                {
                  "meaning": "The trait of being willing to donate money, resources, or time; generosity, liberality.",
                  "examples": [
                    "Synonyms: benevolence, munificence",
                    "Antonyms: miserliness, niggardliness, stinginess, tightfistedness"
                  ]
                },
                {
                  "meaning": "Often preceded by do, give, or make: the generous or liberal giving of gifts or money, especially by someone of high standing on a special occasion; also, excessive or wasteful giving.",
                  "examples": []
                },
                {
                  "meaning": "Money, etc., given in this way.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) Abundance of something (chiefly beneficial), regarded as having been given generously.",
                  "examples": [
                    "Synonym: bounty"
                  ]
                },
                {
                  "meaning": "(obsolete) Chiefly in the form at one's largesse: freedom or liberty to act.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable)",
              "entries": [
                {
                  "meaning": "An act of donating or giving generously.",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) A specific gift of money, etc., given in this way, specifically (historical) at harvest time; a donation, a gratuity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}