{
  "word": "agitprop",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Russian агитпро́п (agitpróp, “agitprop”), Агитпро́п (Agitpróp, “Agitprop (Department for Agitation and Propaganda of the Soviet Union)”), short for отде́л агитации и пропаганды (otdél agitacii i propagandy, “Department for Agitation and Propaganda”); analysable as a blend of agitation +‎ propaganda.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "agitprop (countable and uncountable, plural agitprops) (politics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, also attributively) Political propaganda disseminated through art, drama, literature, etc., especially communist propaganda; (specifically, communism, historical) such propaganda formerly disseminated by the Department for Agitation and Propaganda of the Central Committee of the Communist Party of the Soviet Union.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An instance of such propaganda.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An organization or person engaged in disseminating such propaganda.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "agitprop (third-person singular simple present agitprops, present participle agitpropping, simple past and past participle agitpropped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, politics) To disseminate (something as) political propaganda, especially communist propaganda, through art, drama, literature, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}