{
  "word": "approve",
  "etymologies": [
    {
      "description": [
        "From Middle English aproven, appreoven, appreven, apreven, borrowed from Old French aprover, approver, approuvir, appreuver (“to approve”), from Latin approbō, from ad + probō (“to esteem as good, approve, prove”). Doublet of approbate. Compare prove."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "approve (third-person singular simple present approves, present participle approving, simple past and past participle approved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To officially sanction; to ratify; to confirm; to set as satisfactory.",
                  "examples": [
                    "Although we may disagree with it, we must nevertheless approve the sentence handed down by the court-martial."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To regard as good; to commend; to be pleased with; to think well of.",
                  "examples": [
                    "We approve the measure of the administration, for it is an excellent decision."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To make proof of; to demonstrate; to prove or show practically.",
                  "examples": [
                    "He had approved himself a great warrior."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, followed by \"of\") To consider worthy (to); to be pleased (with); to accept.",
                  "examples": [
                    "Her mother never approves of any of her boyfriends. She thinks nobody is good enough for her little girl."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive, usually with a reflexive pronoun) To show to be worthy; to demonstrate the merits of.",
                  "examples": [
                    "The first care and concern must be to approve himself to God."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English approuen, approven, from Old French aprouer; a- + a form apparently derived from the pro, prod, in Latin prōsum (“be useful or profitable”). Compare with improve."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "approve (third-person singular simple present approves, present participle approving, simple past and past participle approved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law, English law) To make profit of; to convert to one's own profit — said especially of waste or common land appropriated by the lord of the manor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}