{
  "word": "water",
  "etymologies": [
    {
      "description": [
        "From Middle English water, from Old English wæter (“water”), from Proto-West Germanic *watar, from Proto-Germanic *watōr (“water”), from Proto-Indo-European *wódr̥ (“water”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "water (countable and uncountable, plural waters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(uncountable) A substance (of molecular formula H2O) found at room temperature and pressure as a clear liquid; it is present naturally as rain, and found in rivers, lakes and seas; its solid form is ice and its gaseous form is steam.",
              "entries": [
                {
                  "meaning": "(uncountable, in particular) The liquid form of this substance: liquid H2O.",
                  "examples": [
                    "May I have a glass of water?",
                    "Your plants need more water."
                  ]
                },
                {
                  "meaning": "(countable) A serving of liquid water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alchemy, philosophy) The aforementioned liquid, considered one of the Classical elements or basic elements of alchemy.",
                  "examples": [
                    "He showed me the river of living water, sparkling like crystal, flowing from the throne of God."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable or in the plural) Water in a body; an area of open water.",
                  "examples": [
                    "The president expressed hope that creating rain over waters between the countries would help reduce pollution.\nAudio (US)(file)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic, archaic or dialectal) A body of water, almost always a river.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A combination of water and other substance(s).",
              "entries": [
                {
                  "meaning": "(sometimes countable) Mineral water.",
                  "examples": [
                    "Perrier is the most popular water in this restaurant."
                  ]
                },
                {
                  "meaning": "(countable, often in the plural) Spa water.",
                  "examples": [
                    "Many people visit Bath to take the waters."
                  ]
                },
                {
                  "meaning": "(pharmacy) A solution in water of a gaseous or readily volatile substance.",
                  "examples": [
                    "ammonia water"
                  ]
                },
                {
                  "meaning": "Urine. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "Amniotic fluid or the amniotic sac containing it. (Used only in the plural in the UK but often also in the singular in North America.)",
                  "examples": [
                    "Synonym: bag of waters",
                    "Before the child is born, the pregnant woman’s water breaks. (North America)",
                    "Before your child is born, your water(s) will break. (North America)",
                    "Before the child is born, the pregnant woman’s waters break. (UK)"
                  ]
                },
                {
                  "meaning": "(colloquial, medicine) Fluids in the body, especially when causing swelling.",
                  "examples": [
                    "He suffers from water on the knee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, in the plural or in the singular) A state of affairs; conditions; usually with an adjective indicating an adverse condition.",
                  "examples": [
                    "The rough waters of change will bring about the calm after the storm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, figuratively) A person's intuition.",
                  "examples": [
                    "Synonym: bones",
                    "I know he'll succeed. I feel it in my waters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, dated, finance) Excess valuation of securities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The limpidity and lustre of a precious stone, especially a diamond.",
                  "examples": [
                    "a diamond of the first water is perfectly pure and transparent"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wavy, lustrous pattern or decoration such as is imparted to linen, silk, metals, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English wateren, from Old English wæterian, from Proto-Germanic *watrōną, *watrijaną, from Proto-Germanic *watōr (“water”), from Proto-Indo-European *wódr̥ (“water”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "water (third-person singular simple present waters, present participle watering, simple past and past participle watered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pour water into the soil surrounding (plants).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wet or supply with water; to moisten; to overflow with water; to irrigate.",
                  "examples": [
                    "Men whose lives glided on like rivers that water the woodlands."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide (animals) with water for drinking.",
                  "examples": [
                    "I need to water the cattle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To get or take in water.",
                  "examples": [
                    "The ship put into port to water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To urinate onto.",
                  "examples": [
                    "Nature called, so I stepped into the woods and watered a tree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dilute.",
                  "examples": [
                    "Can you water the whisky, please?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated, finance) To overvalue (securities), especially through deceptive accounting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fill with or secrete water.",
                  "examples": [
                    "Chopping onions makes my eyes water.",
                    "The smell of fried onions makes my mouth water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wet and calender, as cloth, so as to impart to it a lustrous appearance in wavy lines; to diversify with wavelike lines.",
                  "examples": [
                    "to water silk"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}