{
  "word": "pandemic",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek πάνδημος (pándēmos, “of or belonging to all the people, public”) + English -ic (suffix forming adjectives from nouns with the sense ‘of or pertaining to’). πάνδημος is derived from παν- (pan-, prefix meaning ‘all, every’) (ultimately from Proto-Indo-European *peh₂- (“to protect, shepherd”)) + δῆμος (dêmos, “the common people; free citizens, sovereign people”) (ultimately from Proto-Indo-European *deh₂- (“to divide, share”)). Compare Late Latin pandēmus (“affecting all the people, general, public”)."
      ],
      "adjectives": [
        {
          "description": "pandemic (comparative more pandemic, superlative most pandemic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(epidemiology) Of a disease: epidemic over a wide geographical area and affecting a large proportion of the population; also, of or pertaining to a disease of this nature.",
                  "examples": [
                    "Synonyms: (obsolete) pandemial, (obsolete) pandemical, panepidemic",
                    "Antonym: nonpandemic",
                    "The chaotic breakdown of public health as World War I dragged on is widely recognized as exacerbating the disease burden of the pandemic outbreak of influenza in 1918."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually derogatory) General, widespread.",
                  "examples": [
                    "Synonyms: common, ubiquitous, universal; see also Thesaurus:widespread"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pandemic (plural pandemics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(epidemiology) A pandemic disease; a disease that affects a wide geographical area and a large proportion of the population.",
                  "examples": [
                    "Synonyms: (rare) pandemia, panzoosis; see also Thesaurus:pandemic"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "See Pandemic."
      ],
      "adjectives": [
        {
          "description": "pandemic (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Greek mythology, Roman mythology, rare) Alternative letter-case form of Pandemic (“of Aphrodite Pandemos, the earthly aspect of the Greek goddess of beauty and love Aphrodite and her Roman counterpart Venus, as contrasted with the heavenly aspect known as Aphrodite Urania: earthly, physical, sensual.”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}