{
  "word": "quite",
  "etymologies": [
    {
      "description": [
        "A development of quit, influence by Anglo-Norman quite."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "quite (not comparable)",
          "definitionGroups": [
            {
              "group": "To the greatest extent or degree; completely, entirely.",
              "entries": [
                {
                  "meaning": "With verbs, especially past participles. [from 14th c.]",
                  "examples": [
                    "Nobuyoshi Araki has been called a monster, a pornographer and a genius—and the photographer quite agrees."
                  ]
                },
                {
                  "meaning": "With prepositional phrases and spatial adverbs. [from 15th c.]",
                  "examples": [
                    "Margaret passed quite through the pines, and reached the opening beyond which was what was once the yard, but was now, except for a strip of flower-border and turf which showed care, simply a tangle of bushes and briars."
                  ]
                },
                {
                  "meaning": "With predicative adjectives. [from 15th c.]",
                  "examples": [
                    "It was almost quite dark in there and she kept her arms stretched out in front of her so as not to bump her face into the back of the wardrobe."
                  ]
                },
                {
                  "meaning": "With attributive adjectives, following an (especially indefinite) article; chiefly as expressing contrast, difference etc. [from 16th c.]",
                  "examples": [
                    "When I warned him that his words might be offensive to identical twins, he said that identical twins were a quite different case."
                  ]
                },
                {
                  "meaning": "Preceding nouns introduced by the indefinite article. Chiefly in negative constructions. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "With adverbs of manner. [from 17th c.]",
                  "examples": [
                    "However, the proceedings were quite carefully orchestrated to produce what seemed to be a predetermined outcome."
                  ]
                }
              ]
            },
            {
              "group": "In a fully justified sense; truly, perfectly, actually.",
              "entries": [
                {
                  "meaning": "Coming before the indefinite article and an attributive adjective. (Now largely merged with moderative senses, below.) [from 17th c.]",
                  "examples": [
                    "\"My little plot has been rather successful, after all, hasn't it?\" \"Quite a perfect success,\" said Drake."
                  ]
                },
                {
                  "meaning": "With plain adjectives, past participles, and adverbs. [from 18th c.]",
                  "examples": [
                    "London Underground is quite unique in how many front line staff it has, as anyone who has travelled on the Paris Metro or New York Subway will testify."
                  ]
                },
                {
                  "meaning": "Coming before the definite article and an attributive superlative. [from 18th c.]",
                  "examples": [
                    "Scaramouche has already been greeted as the finest French Revolution yet brought to the screen-and even if you are a little weary of seeing a strongly American band of sans-culottes demolish a pasteboard Paris, you should not miss Scaramouche, for it is quite the best thing Rex Ingram has done since The Four Horsemen."
                  ]
                },
                {
                  "meaning": "Before a noun preceded by an indefinite article; now often with ironic implications that the noun in question is particularly noteworthy or remarkable. [from 18th c.]",
                  "examples": [
                    "To debauch the Indians with rum and cheat them of their land was quite a Government affair, and not at all criminal; but to use rum to cheat them of their peltry, was an abomination in the sight of the law."
                  ]
                },
                {
                  "meaning": "Before a noun preceded by the definite article. [from 18th c.]",
                  "examples": [
                    "His memoir features a child named Tommy Nothing Fancy who suffers from and dies of a seizure disorder. Quite the coincidence, don't you think?"
                  ]
                },
                {
                  "meaning": "(now rare) With prepositional or adverbial phrases. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially Britain) To a moderate extent or degree; somewhat, rather. [from 19th c.]",
                  "examples": [
                    "Mind your shoes, the basement is quite wet.",
                    "Synonyms: see Thesaurus:moderately"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Spanish quite."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quite (plural quites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bullfighting) A series of passes made with the cape to distract the bull.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}