{
  "word": "dispute",
  "etymologies": [
    {
      "description": [
        "From Middle English disputen, from Old French desputer (French disputer), from Latin disputāre (“to dispute, discuss, examine, compute, estimate”), from dis- (“apart”) + putāre (“to reckon, consider, think, originally make clean, clear up”), related to purus (“pure”). Compare compute, count, impute, repute, amputate, etc."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dispute (plural disputes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An argument or disagreement, a failure to agree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Verbal controversy or disagreement; altercation; debate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dispute (third-person singular simple present disputes, present participle disputing, simple past and past participle disputed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) to contend in argument; to argue against something maintained, upheld, or claimed, by another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to make a subject of disputation; to argue pro and con; to discuss",
                  "examples": [
                    "Some residents disputed the proposal, saying it was based more on emotion than fact."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to oppose by argument or assertion; to controvert; to express dissent or opposition to; to call in question; to deny the truth or validity of",
                  "examples": [
                    "to dispute assertions or arguments"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to strive or contend about; to contest",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) to struggle against; to resist",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}