{
  "word": "ovation",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Latin ovātiōnem + English -ion (suffix indicating an action or process, or the result of an action or process). Ovātiōnem is the accusative of ovātiō (“minor triumph; processional entry”), from ovō (“to exult, rejoice; to applaud”) + -tiō (suffix forming nouns relating to some action or the result of an action); ovō is onomatopoeic. The English word is cognate with Italian ovazione (“(Ancient Rome) minor triumph; applause”), Middle French ovation (modern French ovation (“(Ancient Rome) minor triumph; public acclamation; applause”)), Portuguese ovação (“acclamation, ovation”), Spanish ovación (“ovation”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ovation (plural ovations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Rome) A victory ceremony of less importance than a triumph.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A (ceremony for the) recognition of some achievement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Prolonged enthusiastic applause.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ovation (third-person singular simple present ovations, present participle ovationing, simple past and past participle ovationed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, informal, rare) To give (someone) an ovation (prolonged enthusiastic applause).",
                  "examples": [
                    "Synonym: (informal) ovate"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Late Latin ovatio (“egg-laying”) + English -ion (suffix indicating an action or process, or the result of an action or process). Ovatio is derived from ovāre (“to lay eggs”), from Latin ōvum (“egg”) (possibly ultimately from Proto-Indo-European *h₂ew- (“dress; to be dressed, clothe oneself”)) + -āre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ovation (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, obsolete, rare) The act of laying eggs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}