{
  "word": "hog",
  "etymologies": [
    {
      "description": [
        "From Middle English hog, from Old English hogg, hocg (“hog”), possibly from Old Norse hǫggva (“to strike, chop, cut”), from Proto-Germanic *hawwaną (“to hew, forge”), from Proto-Indo-European *kewh₂- (“to beat, hew, forge”).",
        "Cognate with Old High German houwan, Old Saxon hauwan, Old English hēawan (English hew). Hog originally meant a castrated male pig, hence a sense of “the cut one”. (Compare hogget for a castrated male sheep.) More at hew.\nAlternatively from a Brythonic language, from Proto-Celtic *sukkos, from Proto-Indo-European *suH- and thus cognate with Welsh hwch (“sow”) and Cornish hogh (“pig”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hog (plural hogs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any animal belonging to the Suidae family of mammals, especially the pig, the warthog, and the boar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically) An adult swine (contrasted with a pig, a young swine).",
                  "examples": [
                    "Weanlings grow into feeder pigs, and feeder pigs grow into slaughter hogs.  […]  Ultimately the end use for virtually all pigs and hogs is to be slaughtered for the production of pork and other products."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A greedy person or thing; one who refuses to share.",
                  "examples": [
                    "Since the latest upgrade, this program has turned into a CPU hog."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A large motorcycle, particularly a Harley-Davidson.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A young sheep that has not been shorn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A rough, flat scrubbing broom for scrubbing a ship's bottom under water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for mixing and stirring the pulp from which paper is made.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, historical, archaic slang, countable and uncountable) A shilling coin; its value, 12 old pence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, historical, obsolete slang, countable and uncountable) A tanner, a sixpence coin; its value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, historical, obsolete slang, countable and uncountable) A half-crown coin; its value, 30 old pence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) the effect of the middle of the hull of a ship rising while the ends droop",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hog (third-person singular simple present hogs, present participle hogging, simple past and past participle hogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To greedily take more than one's share, to take precedence at the expense of another or others.",
                  "examples": [
                    "The [...] air-conditioning unit didn't work very good, and there was only one fan; and from the minute me and Winn-Dixie got in the library, he hogged it all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clip the mane of a horse, making it short and bristly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To scrub with a hog, or scrubbing broom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To cause the keel of a ship to arch upwards (the opposite of sag).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hog (third-person singular simple present hogs, present participle hogging, simple past and past participle hogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To process (bark, etc.) into hog fuel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of quahog"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hog (plural hogs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A quahog (clam)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}