{
  "word": "mercy",
  "etymologies": [
    {
      "description": [
        "From Middle English mercy, merci, from Anglo-Norman merci (compare continental Old French merci, mercit), from Latin mercēs (“wages, fee, price”), from merx (“wares, merchandise”). Displaced native Old English mildheortnes. Cognate with French merci."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mercy (countable and uncountable, plural mercies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Relenting; forbearance to cause or allow harm to another.",
                  "examples": [
                    "She took mercy on him and quit embarrassing him.",
                    "Antonyms: mercilessness, ruthlessness, cruelty"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Forgiveness or compassion, especially toward those less fortunate.",
                  "examples": [
                    "Have mercy on the poor and assist them if you can."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A tendency toward forgiveness, pity, or compassion.",
                  "examples": [
                    "Mercy is one of his many virtues."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Instances of forbearance or forgiveness.",
                  "examples": [
                    "Psalms 40:11 Do not withhold Your tender mercies from me, O Lord"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A blessing; something to be thankful for.",
                  "examples": [
                    "It was a mercy that we were not inside when the roof collapsed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A children's game in which two players stand opposite with hands grasped and twist each other's arms until one gives in.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mercy (third-person singular simple present mercies, present participle mercying, simple past and past participle mercied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To feel mercy",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To show mercy; to pardon or treat leniently because of mercy",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}