{
  "word": "interest",
  "etymologies": [
    {
      "description": [
        "From Middle English interest, from Old French interesse and interest (French intérêt), from Medieval Latin interesse, from Latin interesse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "interest (usually uncountable, plural interests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, finance) The price paid for obtaining, or price received for providing, money or goods in a credit transaction, calculated as a fraction of the amount or value of what was borrowed. [from earlier 16th c.]",
                  "examples": [
                    "Our bank offers borrowers an annual interest of 5%."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, finance) Any excess over and above an exact equivalent",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A great attention and concern from someone or something; intellectual curiosity. [from later 18th c.]",
                  "examples": [
                    "He has a lot of interest in vintage cars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Attention that is given to or received from someone or something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An involvement, claim, right, share, stake in or link with a financial, business, or other undertaking or endeavor.",
                  "examples": [
                    "When scientists and doctors write articles and when politicians run for office, they are required in many countries to declare any existing conflicts of interest (competing interests).",
                    "I have business interests in South Africa.",
                    "She has an interest in the proceedings, and all stakeholders' interests must be protected."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something or someone one is interested in.",
                  "examples": [
                    "Lexicography is one of my interests.",
                    "Victorian furniture is an interest of mine.",
                    "The main character's romantic interest will be played by a non-professional actor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Condition or quality of exciting concern or being of importance.",
                  "examples": [
                    "The conscience, indeed, is already violated when to moral good or evil we oppose things possessing no moral interest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) Injury, or compensation for injury; damages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) The persons interested in any particular business or measure, taken collectively.",
                  "examples": [
                    "Coordinate terms: industry, trust, syndicate",
                    "the iron interest;  the cotton interest"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "interest (third-person singular simple present interests, present participle interesting, simple past and past participle interested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To engage the attention of; to awaken interest in; to excite emotion or passion in, in behalf of a person or thing.",
                  "examples": [
                    "It might interest you to learn that others have already tried that approach.",
                    "Action films don't really interest me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, often impersonal) To be concerned with or engaged in; to affect; to concern; to excite.",
                  "examples": [
                    "Or rather, gracious sir, / Create me to this glory, since my cause / Doth interest this fair quarrel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To cause or permit to share.",
                  "examples": [
                    "The mystical communion of all faithful men is such as maketh every one to be interested in those precious blessings which any one of them receiveth at God's hands."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}