{
  "word": "deplorable",
  "etymologies": [
    {
      "description": [
        "Borrowed from French déplorable, from Late Latin dēplōrābilis., from dē- +‎ plōrō +‎ -bilis."
      ],
      "adjectives": [
        {
          "description": "deplorable (comparative more deplorable, superlative most deplorable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Deserving strong condemnation; shockingly bad, wretched.",
                  "examples": [
                    "Poor children suffer permanent damage due to deplorable living conditions and deplorable treatment by law enforcement.",
                    "Poor children are often accused of having deplorable manners, when they are, in fact, simply responding to society in ways that mirror how society treats them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be felt sorrow for; worthy of compassion; lamentable.",
                  "examples": [
                    "We were all saddened by the deplorable death of his son."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "deplorable (plural deplorables)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing that is to be deplored.",
                  "examples": [
                    "[…]  heralding, this season, an end of the most awful of all apparel abominations, that most despicable of all deplorables, the ankle sock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(neologism, US politics, often derogatory) A Trumpist conservative, in reference to a 2016 speech by Hillary Clinton calling half of Donald Trump's supporters a \"basket of deplorables\".",
                  "examples": [
                    "He did not say who “the guys” were—but Dowd knew he meant the Trump base, the crowds at his rallies, the Fox News watchers, the deplorables."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}