{
  "word": "decade",
  "etymologies": [
    {
      "description": [
        "From Middle English decade, from Old French decade, from Late Latin decādem (“(set of) ten”), from Ancient Greek δεκάς (dekás), from δέκα (déka, “ten”). In reference to a span of ten years, originally a clipping of the phrase decade of years. Synchronically, deca- +‎ -ade."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "decade (plural decades)",
          "definitionGroups": [
            {
              "group": "A group, set, or series of ten [from 16th c.], particularly:",
              "entries": [
                {
                  "meaning": "A period of ten years [from 17th c.], particularly such a period beginning with a year ending in 0 and ending with a year ending in 9. [from 19th c.]",
                  "examples": [
                    "The 1960s was a turbulent decade.",
                    "I haven’t seen my cousin in over a decade!"
                  ]
                },
                {
                  "meaning": "A period of ten days, (history) particularly those in the ancient Egyptian, Coptic, and French Revolutionary calendars. [from 18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(literary, archaic) A work in ten parts or books, particularly such divisions of Livy's History of Rome. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Roman Catholicism) A series of prayers counted on a rosary, typically consisting of an Our Father, followed by ten Hail Marys, and concluding with a Glory Be and sometimes the Fatima Prayer.",
                  "examples": []
                },
                {
                  "meaning": "Any of the sets of ten sequential braille characters with predictable patterns.",
                  "examples": []
                },
                {
                  "meaning": "(electronics) A set of ten electronic devices used to represent digits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A set of resistors, capacitors, etc. connected so as to provide even increments between one and ten times a base electrical resistance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, engineering) The interval between any two quantities having a ratio of 10 to 1.",
                  "examples": [
                    "There are decades between 1.8 and 18, between 25 and 250 and between 0.03 and 0.003."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}