{
  "word": "luck",
  "etymologies": [
    {
      "description": [
        "From Middle English luk, lukke, related to Old Frisian luk (“luck”), West Frisian gelok (“luck”), Saterland Frisian Gluk (“luck”), Dutch geluk (“luck, happiness”), Low German luk (“luck”), German Glück (“luck, good fortune, happiness”), Danish lykke (“luck”), Swedish lycka (“luck”), Icelandic lukka (“luck”).  According to the OED, it may be related to lock.",
        "Loaned into English in the 15th century (probably as a gambling term) from Middle Dutch luc, a shortened form of gheluc (“good fortune”), whence Modern Dutch geluk.\nMiddle Dutch luc, gheluc is paralleled by Middle High German lücke, gelücke (modern German Glück). The word occurs only from the 12th century, apparently first in Rhine Frankish. Perhaps from a Frankish *galukki. The word enters standard Middle High German during the 13th century, and spreads to English and Scandinavian in the Late Middle Ages. Its origin seems to have been regional or dialectal, and there were competing German words such as gevelle or schick, or the Latinate fortūne from Latin fortūna. Its etymology is unknown, although there are numerous proposals as to its derivations from a number of roots.",
        "Use as a verb in American English is late (1940s), but there was a Middle English verb lukken (“to chance, to happen by good fortune”) in the 15th century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "luck (usually uncountable, plural lucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that happens to someone by chance, a chance occurrence, especially a favourable one.",
                  "examples": [
                    "The raffle is just a matter of luck.",
                    "Sometimes it takes a bit of luck to get success.",
                    "I couldn't believe my luck when I found a fifty dollar bill on the street.",
                    "Gilbert had some bad luck yesterday — he got pick-pocketed and lost fifty dollars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A superstitious feeling that brings fortune or success.",
                  "examples": [
                    "He blew on the dice for luck.",
                    "I wish you lots of luck for the exam tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Success.",
                  "examples": [
                    "I tried for ages to find a pair of blue suede shoes, but didn't have any luck.",
                    "He has a lot of luck with the ladies, perhaps it is because of his new motorbike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, computing) The results of a random number generator.",
                  "examples": [
                    "The creators of tool-assisted speedruns often manipulate a lot of luck to get the most favorable results in order to save the most time."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "luck (third-person singular simple present lucks, present participle lucking, simple past and past participle lucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To find something through good fortune; used with into, on, onto or upon.",
                  "examples": [
                    "I lucked upon a seat, settled in, nodded off and 20 minutes later heard my name being called by the admitting nurse."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}