{
  "word": "colony",
  "etymologies": [
    {
      "description": [
        "From Latin colōnia (“colony”), from colōnus (“farmer; colonist”), from colō (“till, cultivate, worship”), from earlier *quelō, from Proto-Indo-European *kʷel- (“to move; to turn (around)”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "colony (plural colonies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area under the political control of another country and typically occupied by settlers (colonists) from it, or by their descendants.",
                  "examples": [
                    "Much of the eastern United States was formerly a British colony; other areas were French, Spanish, Dutch, or Swedish colonies.",
                    "Bermuda is a crown colony of Great Britain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people who settle such an area and maintain ties to their native country, and (later) their descendants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people, of one nationality, ethnic group, or language, residing in a different country, city, or area; the area such people occupy.",
                  "examples": [
                    "a colony of British expats in Spain",
                    "The Amana Colonies in Iowa were settled by people from Germany."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people with similar interests, occupations, or characteristics, living in a particular area; the area such people occupy.",
                  "examples": [
                    "a nudist colony;   the statue was put up right in the middle of the artist colony",
                    "a leper colony on the outskirts of town; most buildings in the penal colony were made of concrete"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A group of organisms of same or different species living together in close association.",
                  "examples": [
                    "ant colony; coral colony",
                    "a colony of specialized polyps and medusoids"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of bacteria, fungi or other cells cultured together, especially from a single cell.",
                  "examples": [
                    "colonies of stem cells"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) An apartment complex or neighborhood.",
                  "examples": [
                    "Our colony is quite small, but each apartment is large."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A local group of Beaver Scouts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A potential new chapter of a fraternity or sorority awaiting official recognition from their headquarters.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}