{
  "word": "buzz",
  "etymologies": [
    {
      "description": [
        "From Middle English *bussen, of onomatopoeic origin. Compare Middle English bunning (“buzzing”), Middle English hossing (“buzzing”), Middle English bissen (“to hush”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buzz (countable and uncountable, plural buzzes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A continuous humming noise, as of bees; a confused murmur, as of general conversation in low tones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A whisper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The audible friction of voiced consonants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A rush or feeling of energy or excitement; a feeling of slight intoxication.",
                  "examples": [
                    "Still feeling the buzz from the coffee, he pushed through the last of the homework."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A telephone call or e-mail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Major topic of conversation; widespread rumor; information spread behind the scenes.",
                  "examples": [
                    "In Detroit, the buzz is that he's too nice a guy, unwilling to impose draconian job cuts at the risk of angering the UAW."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Synonym of fizz-buzz (“counting game”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "buzz (third-person singular simple present buzzes, present participle buzzing, simple past and past participle buzzed)",
          "definitionGroups": [
            {
              "group": "(intransitive) To make a low, continuous, humming or sibilant sound, like that made by bees with their wings.",
              "entries": [
                {
                  "meaning": "(by extension) To utter a murmuring sound; to speak with a low, humming voice.",
                  "examples": []
                },
                {
                  "meaning": "Of a group of people, to talk about some interesting topic excitedly.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly of an insect) To fly while making such a sound.",
                  "examples": [
                    "A fly was buzzing past me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) To show a high level of activity and haste, energization or excitement, to be busy as a bee in one’s actions but perhaps mentally charged.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To whisper; to communicate, as tales, in an undertone; to spread, as a report, by whispers or secretly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To talk to incessantly or confidentially in a low humming voice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) To fly at high speed and at a very low altitude over a specified area, as to make a surprise pass.",
                  "examples": [
                    "[…]  an asteroid a mere 15-20 metres across exploded with the force of a medium-sized atom bomb over Chelyabinsk, in Russia, and another, much larger one buzzed Earth a few hours later."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut the hair in a close-cropped military style, or buzzcut.",
                  "examples": [
                    "Deacon said, “You used to beg me to let you buzz your hair when you were little.” “And then I grew up and realized how awful you looked when you buzzed yours.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To drink to the bottom.",
                  "examples": [
                    "He buzzed the bottle with such a hearty good will as settled the fate of another, which Soapey rang for as a matter of course. There was but the rejected one, which however Spigot put into a different decanter and brought in  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To communicate with (a person) by means of a buzzer.",
                  "examples": [
                    "Then one day my secretary buzzed me and said Frank Sinatra was on the phone. When I picked up the phone it was the Chief who played dumb and would not admit that he said he was Frank Sinatra."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}