{
  "word": "pollution",
  "etymologies": [
    {
      "description": [
        "From Middle English pollucion, from Anglo-Norman pollutiun, Middle French pollution, pollucion, and their source, post-classical Latin pollūtiō (“defilement, desecration; nocturnal emission”) (4th century), from the participial stem of polluō (“to soil, defile, contaminate”), from por- (“before”) + -luō (“to smear”), related to lutum (“mud”) and luēs (“filth”). Compare Ancient Greek λῦμα (lûma, “filth, dirt, disgrace”) and λῦμαξ (lûmax, “rubbish, refuse”), Old Irish loth (“mud, dirt”), Lithuanian lutynas (“pool, puddle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pollution (countable and uncountable, plural pollutions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Physical contamination, now especially the contamination of the environment by harmful substances, or by disruptive levels of noise, light etc. [from 18th c.]",
                  "examples": [
                    "Pollution levels are almost always higher in cities rather than the countryside, what with the cars, industry and so on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that pollutes; a pollutant. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The desecration of something holy or sacred; defilement, profanation. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic) The ejaculation of semen outside of sexual intercourse, especially a nocturnal emission. [from 14th c.]",
                  "examples": [
                    "When occasioned by a voluntary act it is called, simply, Pollution or Masturbation (q.v.); when excited, during sleep, by lascivious dreams, it takes the name Noctur'nal pollution, Exoneiro'sis, Oneirog'mos, Oneirog'onos, Gonorrhœ'a dormien'tium, G. oneirog'onos, G. Vera, G. libidino'sa, Proflu'vium Sem'inis, Spermatorrhœ'a, Paronir'ia salax, Night pollution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moral or spiritual corruption; impurity, degradation, defilement. [from 15th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}