{
  "word": "fret",
  "etymologies": [
    {
      "description": [
        "From Middle English frēten (“to eat (at), corrode, destroy, annoy”), from Old English fretan (“to eat up, devour; to fret; to break, burst”), from Proto-West Germanic *fraetan, from Proto-Germanic *fraetaną (“to consume, devour, eat up”), from Proto-Germanic *fra- (“for-, prefix meaning ‘completely, fully’”) (from Proto-Indo-European *pro- (“forward, toward”)) + *etaną (“to eat”) (ultimately from Proto-Indo-European *h₁ed- (“to eat”)).",
        "The word is cognate with Dutch vreten, fretten (“to devour, hog, wolf”), Low German freten (“to eat up”), German fressen (“to devour, gobble up, guzzle”), Gothic 𐍆𐍂𐌰𐌹𐍄𐌰𐌽 (fraitan, “to devour”), Swedish fräta (“to eat away, corrode, fret”); and also related to Danish fråse (“to gorge”).",
        "The senses meaning “to chafe, rub” could also be due to sound-association with Anglo-Norman *freiter (modern dialectal French fretter), from Vulgar Latin *frictāre, frequentative of Latin fricāre, from fricō (“to chafe, rub”), ultimately from Proto-Indo-European *bʰreyH- (“to cut”); compare Old French froter (modern French frotter). The chief difficulty is the lack of evidence of the Old French word."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fret (plural frets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Agitation of the surface of a fluid by fermentation or some other cause; a rippling on the surface of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Agitation of the mind marked by complaint and impatience; disturbance of temper; irritation.",
                  "examples": [
                    "He keeps his mind in a continual fret."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Herpes; tetter (“any of various pustular skin conditions”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining, in the plural) The worn sides of riverbanks, where ores or stones containing them accumulate after being washed down from higher ground, which thus indicate to miners the locality of veins of ore.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fret (third-person singular simple present frets, present participle fretting, simple past fretted or fret or frate, past participle fretted or (usually in compounds) fretten)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete or poetic) Especially when describing animals: to consume, devour, or eat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To chafe or irritate; to worry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make rough, to agitate or disturb; to cause to ripple.",
                  "examples": [
                    "to fret the surface of water"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) In the form fret out: to squander, to waste.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To gnaw; to consume, to eat away.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To be chafed or irritated; to be angry or vexed; to utter peevish expressions through irritation or worry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be worn away; to chafe; to fray.",
                  "examples": [
                    "A wristband frets on the edges."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be anxious, to worry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be agitated; to rankle; to be in violent commotion.",
                  "examples": [
                    "Rancour frets in the malignant breast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, brewing, oenology) To have secondary fermentation (fermentation occurring after the conversion of sugar to alcohol in beers and wine) take place.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English frēten (“to decorate”), from Old French freté, freter, fretter (“to fret (decorate with an interlacing pattern)”), from Old French fret (from fraindre (“to break”), from Latin frangō (“to break, shatter”), from Proto-Italic *frangō, ultimately from Proto-Indo-European *bʰreg- (“to break”)) + Old French -er (“suffix forming verbs”) (from Latin -āre, ultimately from Proto-Indo-European *h₃enh₂- (“to burden, charge”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fret (plural frets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ornamental pattern consisting of repeated vertical and horizontal lines, often in relief.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A saltire interlaced with a mascle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fret (third-person singular simple present frets, present participle fretting, simple past and past participle fretted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To decorate or ornament, especially with an interlaced or interwoven pattern, or (architecture) with carving or relief (raised) work.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form a pattern on; to variegate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut through with a fretsaw, to create fretwork.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English freten (“to bind”), from Old French freter, from frete (“ferrule, ring”) (modern French frette). The origin of the music senses are uncertain; they are possibly from frete or from fret (“to chafe, rub”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fret (plural frets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or dialectal) A ferrule, a ring.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) One of the pieces of metal, plastic or wood across the neck of a guitar or other string instrument that marks where a finger should be positioned to depress a string as it is played.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fret (third-person singular simple present frets, present participle fretting, simple past and past participle fretted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bind, to tie, originally with a loop or ring.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive, music) Musical senses.",
              "entries": [
                {
                  "meaning": "To fit frets on to (a musical instrument).",
                  "examples": [
                    "to fret a guitar"
                  ]
                },
                {
                  "meaning": "To press down the string behind a fret.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin fretum (“channel, strait”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fret (plural frets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A channel, a strait; a fretum.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old French frete, fraite, fraicte, possibly partly confused with fret (“channel, strait”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fret (plural frets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A channel or passage created by the sea.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Attested since the mid-1800s, of unknown origin. Perhaps related to fret (“to form a pattern upon”), fret (“to consume”) (as the fog does the land), or fret (“to agitate the surface of water”) (as the wind which blows the fog inland does); compare the semantics of haar (“cold wind; misty wind; fog, mist”). Dialectally, the spelling freet and pronunciation /fɹit/ are also found, as they also are for fret (“consume; agitate”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fret (plural frets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northumbria) A fog or mist at sea, or coming inland from the sea.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}