{
  "word": "chamber",
  "etymologies": [
    {
      "description": [
        "From Middle English chambre, borrowed from Old French chambre, from Latin camera, from Ancient Greek καμάρα (kamára, “vaulted chamber”). Doublet of camera."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chamber (plural chambers)",
          "definitionGroups": [
            {
              "group": "A room or set of rooms, particularly:",
              "entries": [
                {
                  "meaning": "The private room of an individual, especially of someone wealthy or noble.",
                  "examples": []
                },
                {
                  "meaning": "A bedroom.",
                  "examples": []
                },
                {
                  "meaning": "The private office of a judge.",
                  "examples": []
                },
                {
                  "meaning": "The room used for deliberation by a legislature.",
                  "examples": []
                },
                {
                  "meaning": "(UK) A single law office in a building housing several.",
                  "examples": []
                },
                {
                  "meaning": "(dated, usually in the plural) Rooms in a lodging house.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Ellipsis of chamber pot: a container used for urination and defecation in one's chambers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The legislature or division of the legislature itself.",
                  "examples": [
                    "The resolution, which speedily passed the Senate, was unable to gain a majority in the lower chamber."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any enclosed space occupying or similar to a room.",
                  "examples": [
                    "A canal lock chamber; a furnace chamber; a test chamber"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) An enlarged space in an underground tunnel of a burrowing animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) The area holding the ammunition round at the initiation of its discharge.",
                  "examples": [
                    "Dianne loaded a cartridge into the chamber of the rifle, then prepared to take aim at the target."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) One of the bullet-holding compartments in the cylinder of a revolver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A short piece of ordnance or cannon which stood on its breech without any carriage, formerly used chiefly for celebrations and theatrical cannonades.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the two atria or two ventricles of the heart.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chamber (third-person singular simple present chambers, present participle chambering, simple past and past participle chambered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To enclose in a room.",
                  "examples": [
                    "She had chambered herself in her room, and wouldn't come out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reside in or occupy a chamber or chambers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To place in a chamber, as a round of ammunition.",
                  "examples": [
                    "The hunter fired at the geese and missed, then shrugged his shoulders and chambered another cartridge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To create or modify a gun to be a specific caliber.",
                  "examples": [
                    "The rifle was originally chambered for 9mm, but had since been modified for a larger, wildcat caliber."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(martial arts) To prepare an offensive, defensive, or counteroffensive action by drawing a limb or weapon to a position where it may be charged with kinetic energy.",
                  "examples": [
                    "Bob chambered his fist for a blow, but Sheila struck first."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be lascivious.",
                  "examples": [
                    ""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}