{
  "word": "species",
  "etymologies": [
    {
      "description": [
        "From Latin speciēs (“appearance; quality”), from speciō (“see”) + -iēs suffix signifying abstract noun. Doublet of spice."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "species (plural species or (rare, nonstandard) specieses)",
          "definitionGroups": [
            {
              "group": "Type or kind. (Compare race.)",
              "entries": [
                {
                  "meaning": "A group of plants or animals having similar appearance.",
                  "examples": [
                    "This species of animal is unique to the area."
                  ]
                },
                {
                  "meaning": "(biology, taxonomy) A category in the classification of organisms, ranking below genus; a taxon at that rank.",
                  "examples": []
                },
                {
                  "meaning": "(chemistry, physics) A particular type of atom, molecule, ion or other particle.",
                  "examples": []
                },
                {
                  "meaning": "(mineralogy) A mineral with a unique chemical formula whose crystals belong to a unique crystallographic system.",
                  "examples": []
                }
              ]
            },
            {
              "group": "An image, an appearance, a spectacle.",
              "entries": [
                {
                  "meaning": "(obsolete) The image of something cast on a surface, or reflected from a surface, or refracted through a lens or telescope; a reflection.",
                  "examples": [
                    "I cast the species of the Sun onto a sheet of paper through a telescope."
                  ]
                },
                {
                  "meaning": "Visible or perceptible presentation; appearance; something perceived.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) Either of the two elements of the Eucharist after they have been consecrated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Coin, or coined silver, gold, or other metal, used as a circulating medium; specie.",
                  "examples": [
                    "There was, in the splendour of the Roman empire, a less quantity of current species in Europe than there is now."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A component part of compound medicine; a simple.",
                  "examples": []
                }
              ]
            }
          ]
        },
        {
          "description": "species",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "plural of specie",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}