{
  "word": "shoehorn",
  "etymologies": [
    {
      "description": [
        "shoe +‎ horn"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shoehorn (plural shoehorns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A smooth tool that assists in putting the foot into a shoe, by sliding the heel in after the toe is in place. This reduces discomfort and damage to the back of the shoe. By slipping it into the back of the shoe behind the heel, the user prevents the heel from squashing down the back of the shoe and causing difficulty; instead the heel slides down the smooth shoehorn, which then comes out easily once the foot is in place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) Anything by which a transaction is facilitated; a medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Anything which draws on or allures; an inducement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shoehorn (third-person singular simple present shoehorns, present participle shoehorning, simple past and past participle shoehorned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literally) To use a shoehorn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To force (something) into (a tight space); to squeeze (something) into (a schedule, etc); to exert great effort to insert or include (something); to include (something) despite potent reasons not to.",
                  "examples": [
                    "I shoehorned his dozen burgeoning bags into the backseat of my tiny car, and off we went.",
                    "His staff want to shoehorn an extra stop into his already packed campaigning schedule."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To force some current event into alignment with some (usually unconnected) agenda, especially when it is fallacious.",
                  "examples": [
                    "People claiming to be psychic may shoehorn an event into fulfillment of some vague past prediction."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}