{
  "word": "coop",
  "etymologies": [
    {
      "description": [
        "From Middle English cǒupe, cupe, from Old English cȳpe (“basket, cask”) or possibly from Middle Dutch cûpe (compare modern Dutch kuip, Saterland Frisian kupe, Middle Low German kûpe), from Old Saxon *kûpa, côpa (“cask”) (compare Middle Low German kôpe, Old High German chôfa, chuofa, Middle High German kuofe, modern German Kufe (“cask (feminine)”), probably from Latin cūpa, Medieval Latin cōpa (“cask”) (thus a doublet of coupe, cup, and keeve). However, the Oxford English Dictionary notes that if the word is from Latin, “it is difficult to account for the umlaut in Old English cýpe”."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coop (plural coops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A basket, pen or enclosure for birds or small animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wickerwork basket (kipe) or other enclosure for catching fish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, slang) A narrow place of confinement, a cage; a jail, a prison.",
                  "examples": [
                    "'Tis the cruel gripe, / That lean hard-handed poverty inflicts, / The hope of better things, the chance to win, / The wiſh to ſhine, the thirſt to be amus'd, / That at the found of Winter's hoary wing, / Unpeople all our counties, of ſuch herds, / Of flutt'ring, loit'ring, cringing, begging, looſe, / And wanton vagrants, as make London, vaſt / And boundless as it is, a crowded coop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A barrel or cask for holding liquids.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "coop (third-person singular simple present coops, present participle cooping, simple past and past participle cooped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep in a coop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shut up or confine in a narrow space; to cramp.",
                  "examples": [
                    "But the contempt of all other knowledge, as if it were nothing in comparison of law or physic, of astronomy or chemistry, or perhaps some yet meaner part of knowledge, wherein I have got some smattering, or am somewhat advanced, is not only the mark of a vain or little mind; but does this prejudice in the conduct of the understanding, that it coops it up within narrow bounds, and hinders it from looking abroad into other provinces of the intellectual world,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, politics, historical) To unlawfully confine one or more voters to prevent them from casting their ballots in an election.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, law enforcement, slang) Of a police officer: to sleep or relax while on duty. [from 1960s.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To make or repair barrels, casks and other wooden vessels; to work upon in the manner of a cooper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from coop, above. Sense 2 may be from English coup (“to tilt, overturn, upset”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coop (plural coops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional, England, Scotland) A cart with sides and ends made from boards, enabling it to carry manure, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional, England, Scotland) A cart which opens at the back to release its load; a tumbril.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; compare English cop (“top, summit (especially of a hill); head”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coop (plural coops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A small heap.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From cooperative, by shortening."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coop (plural coops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of co-op.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}