{
  "word": "radish",
  "etymologies": [
    {
      "description": [
        "From Middle English radiche, from Old English rǣdiċ, from Proto-West Germanic *rādik, borrowed from Latin rādīcem (“root of a plant; radish”); later influenced by Anglo-Norman radich and Middle French radice, borrowed from Italian radice, from the same Latin source."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "radish (plural radishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plant of the Brassicaceae family, Raphanus sativus or Raphanus raphanistrum subsp. sativus, having an edible root.",
                  "examples": [
                    "Many times they ſow divers ſeeds in a Bed together, as Radiſhes and Carrots, that by ſuch time as the Carrots come up, the Radiſhes may be gone. Upon beds newly ſet with Licorice they ſow Onions or Radiſh, or Lettice if their Licorice plants or ground be but weak, ſo as not quickly to cauſe a ſhadow with their leaves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The root of this plant used as food. Some varieties are pungent and usually eaten raw in salads, etc., while others have a milder taste and are cooked.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With a distinguishing word: some other plant of the Raphanus genus or Brassicaceae family.",
                  "examples": [
                    "rat-tail radish (Raphanus caudatus); wild radish (Raphanus raphanistrum)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}