{
  "word": "grey",
  "etymologies": [
    {
      "description": [
        "From Middle English grey, from Old English grǣġ, from Proto-Germanic *grēwaz (compare Dutch grauw, German grau, Old Norse grár), from Proto-Indo-European *ǵʰreh₁- (“to green, to grow”) (compare Latin rāvus (“grey”), Old Church Slavonic зьрѭ (zĭrjǫ, “to see, to glance”), Russian зреть (zretʹ, “to watch, to look at”) (archaic), Lithuanian žeriù (“to shine”))."
      ],
      "adjectives": [
        {
          "description": "grey (comparative greyer or more grey, superlative greyest or most grey)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "UK and Commonwealth standard spelling of gray.",
                  "examples": [
                    "These grey and dun colors may be also produced by mixing whites and blacks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(South Africa, slang) Synonym of coloured (pertaining to the mixed race of black and white).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "grey (plural greys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "UK and Commonwealth standard spelling of gray.",
                  "examples": [
                    "Pioneer seemed now to have the game in his own hands; but the Captain, by taking two desperate leaps, cut off a corner, by which he regained the ground he had lost by the fall, and was up with the grey the remainder of the chase."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grey (third-person singular simple present greys, present participle greying, simple past and past participle greyed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "UK and Commonwealth standard spelling of gray.",
                  "examples": [
                    "Now only a few hand-hewn cedar planks and roof beams remained, moss-grown and sagging—a few totem poles, greyed and split."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}