{
  "word": "weave",
  "etymologies": [
    {
      "description": [
        "From Middle English weven (“to weave”), from Old English wefan (“to weave”), from Proto-West Germanic *weban, from Proto-Germanic *webaną, from Proto-Indo-European *webʰ- (“to weave, braid”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "weave (plural weaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type or way of weaving.",
                  "examples": [
                    "That rug has a very tight weave."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cosmetics) Human or artificial hair worn to alter one's appearance, either to supplement or to cover the natural hair.",
                  "examples": [
                    "The physician should evaluate for a history of tight ponytails, buns, chignons, braids, twists, weaves, cornrows, dreadlocks, sisterlocks, and hair wefts in addition to the usage of religious hair coverings."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "weave (third-person singular simple present weaves, present participle weaving, simple past wove or weaved, past participle woven or weaved or (now colloquial and nonstandard) wove)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form something by passing lengths or strands of material over and under one another.",
                  "examples": [
                    "This loom weaves yarn into sweaters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To spin a cocoon or a web.",
                  "examples": [
                    "Spiders weave beautiful but deadly webs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To unite by close connection or intermixture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To compose creatively and intricately; to fabricate.",
                  "examples": [
                    "to weave the plot of a story"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English weven (“to wander”); probably from Old Norse veifa (“move around, wave”), related to Latin vibrare."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "weave (third-person singular simple present weaves, present participle weaving, simple past and past participle weaved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move by turning and twisting.",
                  "examples": [
                    "The drunk weaved into another bar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (a path or way) by winding in and out or from side to side.",
                  "examples": [
                    "The ambulance weaved its way through the heavy traffic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of an animal) To move the head back and forth in a stereotyped pattern, typically as a symptom of stress.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}