{
  "word": "spandrel",
  "etymologies": [
    {
      "description": [
        "From a diminutive in -el of Anglo-Norman spaundre, of uncertain origin, perhaps from Old French espandre (“to expand, extend, spread”). More at spawn, expand.\nIn the field of biology first used by Stephen Jay Gould and Richard Lewontin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spandrel (plural spandrels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The space (often more or less triangular) between the outer curve of an arch (the extrados) and a straight-sided figure that bounds it; the space between two contiguous arches and a straight feature above them.",
                  "examples": [
                    "Coordinate term: pendentive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) Horizontal member between the windows of successive storeys of a tall building.",
                  "examples": [
                    "Due to the fact that the walls are joined by floors and spandrels, a coupling effect is produced. Depending on the extent of the spandrels, this coupling effect will be bigger or smaller."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The triangular space under a stair; the material that fills the space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An oriental rug having a pattern of arches; the design in the corners of such a rug, especially in a prayer rug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(evolutionary theory) A phenotypic characteristic that evolved as a side effect of an adaptation in response to evolutionary pressure.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}