{
  "word": "thimble",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English thymbyll, thimel (“thimble”) [and other forms], from Old English þȳmel (“thimble, thumbstall; fingerstall”), then either:",
        "The English word is analysable as thumb +‎ -le (suffix forming agent nouns), and is cognate with Dutch duimeling (“thumbstall”), German Däumling (“thumbstall”), German Low German Dümelke (“thumbstall”), Saterland Frisian Düümelke (“thumbstall”), Scots thummle, thumble (“thimble”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thimble (plural thimbles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sewing) A pitted, now usually metal, cup-shaped cap worn on the tip of a finger, which is used in sewing to push the needle through material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "As much as fills a thimble (sense 1); a thimbleful.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(also attributively) An object which resembles a thimble (sense 1) in shape or size.",
              "entries": [
                {
                  "meaning": "(games) A thimble or similar object used in thimblerig (“a game of skill which requires the bettor to guess under which of three thimbles or small cups a pea-sized object has been placed after the person operating the game rapidly rearranges them”).",
                  "examples": []
                },
                {
                  "meaning": "(technology) A socket in machinery shaped like a thimble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A metal ring which a cable or rope intended for attaching to other things is looped around as a protection against chafing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(technology) A ring- or tube-shaped component such as a ferrule.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "thimble (third-person singular simple present thimbles, present participle thimbling, simple past and past participle thimbled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use a thimble (noun sense 1).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, by extension) To sew.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}