{
  "word": "twill",
  "etymologies": [
    {
      "description": [
        "From Middle English twyll, twylle, from Old English twilic (“two-threaded”), a partial calque of Latin bilix, bilic-, from bis (“twice”) + licium (“thread”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "twill (countable and uncountable, plural twills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving) A pattern, characterised by diagonal ridges, created by the regular interlacing of threads of the warp and weft during weaving.",
                  "examples": [
                    "The twill weave is always given a direction; a right-hand twill is one in which the twill line runs from bottom left to top right and a left-hand twill is one in which the twill line runs from bottom right to top left. The angle of the twill is determined by the amount of shift in the points of interlacing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cloth or portion of cloth woven in such a pattern.",
                  "examples": [
                    "Plain cotton twills, such as canvas, sailcloth, and denim, in mediumweight fabrics, can be a good choice for informal rooms that receive considerable wear and tear, such as rec rooms, dens, playrooms, or children's bedrooms."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "twill (third-person singular simple present twills, present participle twilling, simple past and past participle twilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To weave (cloth, etc.) so as to produce the appearance of diagonal lines or ribs on the surface.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}