{
  "word": "bit",
  "etymologies": [
    {
      "description": [
        "From Middle English bitte, bite, from Old English bita (“bit; fragment; morsel”) and bite (“a bite; cut”), from Proto-Germanic *bitô and *bitiz; both from Proto-Indo-European *bʰeyd- (“to split”). More at bite."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bit (plural bits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of metal placed in a horse's mouth and connected to the reins to direct the animal.",
                  "examples": [
                    "A horse hates having a bit put in its mouth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rotary cutting tool fitted to a drill, used to bore holes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, Britain) A coin of a specified value.",
                  "examples": [
                    "a threepenny bit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Canada) A ten-cent piece, dime.",
                  "examples": [
                    "The smallest coin we had in Canada in early days was a dime, worth ten cents. The Indians called this coin \"a Bit\". Our next coin, double in buying power and in size, was a twenty-five cent piece and this the Indians called \"Two Bits\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now US) A unit of currency or coin in the Americas worth a fraction of a Spanish dollar; now specifically, an eighth of a US dollar.",
                  "examples": [
                    "A quarter is two bits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, US) In the southern and southwestern states, a small silver coin (such as the real) formerly current; commonly, one worth about 12½ cents; also, the sum of 12½ cents.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small amount of something.",
                  "examples": [
                    "There were bits of paper all over the floor.",
                    "Does your leg still hurt? —Just a bit now.",
                    "I've done my bit; I expect you to do yours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Specifically, a small amount of time.",
                  "examples": [
                    "I'll be there in a bit; I need to take care of something first.",
                    "He was here just a bit ago, but it looks like he's stepped out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, informal, sports) Fractions of a second.",
                  "examples": [
                    "The 400 metres race was won in 47 seconds and bits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A portion of something.",
                  "examples": [
                    "I'd like a big bit of cake, please."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Somewhat; something, but not very great; also used like jot and whit to express the smallest degree. See also a bit.",
                  "examples": [
                    "Am I bored? Not a bit of it!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A prison sentence, especially a short one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An excerpt of material making up part of a show, comedy routine, etc.",
                  "examples": [
                    "His bit about video games was not nearly as entertaining as the other segments of his show."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for bit part.",
                  "examples": [
                    "She acted her bit in the opening scene."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a key which enters the lock and acts upon the bolt and tumblers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cutting iron of a plane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bevelled front edge of an axehead along which the cutting edge runs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM) A gag of a style similar to a bridle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(MLE) A gun.",
                  "examples": [
                    "2013 December 23,  Stephen Reynolds; Stephen Reynolds, director,  Vendetta, spoken by Jimmy Vickers (Danny Dyer), 46:53 from the start:JIMMY: I need to get my hands on some bits. If you’re still in the business. RONNIE (played by Nick Nevern): Oi! TROJAN (played by Jean-Paul Van Cauwelaert): Ronnie. {…} TROJAN: Now that is a SIG Sauer P226."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bit (third-person singular simple present bits, present participle bitting, simple past and past participle bitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put a bridle upon; to put the bit in the mouth of (a horse).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See bite"
      ],
      "adjectives": [
        {
          "description": "bit (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in combination) Having been bitten.",
                  "examples": [
                    "Even though he's bit, of course the zombies would still chase him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bit",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense of bite",
                  "examples": [
                    "Your dog bit me!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal in US, archaic in UK) past participle of bite, bitten",
                  "examples": [
                    "I have been bit by your dog!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Coined by John Tukey in 1946 as an abbreviation of binary digit, probably influenced by connotations of “small portion”. First used in print 1948 by Claude Shannon. Compare byte and nybble, with similar food associations."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bit (plural bits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, computing) A binary digit, generally represented as a 1 or 0.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The smallest unit of storage in a digital computer, consisting of a binary digit.",
                  "examples": [
                    "Synonym: b"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(information theory, cryptography) Any datum that may take on one of exactly two values.",
                  "examples": [
                    "status bits on IRC",
                    "permission bits in a file system"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(information theory) A unit of measure for information entropy.",
                  "examples": [
                    "The researchers found that the original texts spanned a variety of entropy values in different languages, reflecting differences in grammar and structure.But strangely, the difference in entropy between the original, ordered text and the randomly scrambled text was constant across languages. This difference is a way to measure the amount of information encoded in word order, Montemurro says. The amount of information lost when they scrambled the text was about 3.5 bits per word."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A microbitcoin, or a millionth of a bitcoin (0.000001 BTC).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}