{
  "word": "physiognomy",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English phisonomie, from Anglo-Norman phisenomie, Middle French phisonomie et al., ultimately from Late Latin physiognomia, from Ancient Greek φυσιογνωμονία (phusiognōmonía, “the science or art of judging a man by his features”), from φύσις (phúsis, “physique, appearance”) + γνώμων (gnṓmōn, “one that knows or examines, an interpreter, discerner”).",
        "Middle English phisonomie would regularly develop into *physnomy /ˈfɪznəmi/ (forms of this type are common in Early Modern English, such as fisnomie in All's Well that Ends Well); the modern spelling and pronunciation are due to learned influence."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "physiognomy (countable and uncountable, plural physiognomies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The art or pseudoscience of deducing the predominant temper and other characteristic qualities of the mind from the outward appearance, especially from the features of the face.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The face or countenance, with respect to the temper of the mind; particular configuration, cast, or expression of countenance, as denoting character.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The art of telling fortunes by inspection of the features.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The general appearance or aspect of a thing, without reference to its scientific characteristics.",
                  "examples": [
                    "the physiognomy of a plant; of a meteor"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}