{
  "word": "sturdy",
  "etymologies": [
    {
      "description": [
        "From Middle English sturdy, stourdy, stordy (“bold, valiant, strong, stern, fierce, rebellious”) (perhaps influenced by Middle English sture, stoure, stor (“strong, robust, harsh, stern, violent, fierce, sturdy”); see English stour), from Old French estourdi (“dazed”), form of estourdir, originally “to daze, to make tipsy (almost drunk)” (Modern French étourdir (“to daze, to make tipsy”)), from Vulgar Latin *exturdire. Latin etymology is unclear – presumably it is ex- + turdus (“thrush (bird)”), but how this should mean “daze” is unclear. A speculative theory is that thrushes eat leftover winery grapes and thus became drunk, but this meets with objections.",
        "Disease in cows and sheep is by extension of sense of “daze”, while sense of “strongly built” is of late 14th century, and relationship to earlier sense is less clear, perhaps from sense of a firm strike (causing a daze) or a strong, violent person."
      ],
      "adjectives": [
        {
          "description": "sturdy (comparative sturdier, superlative sturdiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of firm build; stiff; stout; strong.",
                  "examples": [
                    "a sturdy oak tree"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Solid in structure or person.",
                  "examples": [
                    "It was a sturdy building, able to withstand strong winds and cold weather.",
                    "The dog was sturdy and could work all day without getting tired."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Foolishly obstinate or resolute; stubborn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Resolute, in a good sense; or firm, unyielding quality.",
                  "examples": [
                    "a man of sturdy piety or patriotism"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "sturdy (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A disease caused by a coenurus infestation in the brain of an animal, especially a sheep or canid; coenurosis.",
                  "examples": [
                    "Synonyms: gid, (obsolete) turnsick"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}