{
  "word": "crutch",
  "etymologies": [
    {
      "description": [
        "From Middle English crucche, from Old English cryċċ (“crutch, staff”), from Proto-West Germanic *krukkju, from Proto-Germanic *krukjō (“crutch, staff”), from Proto-Indo-European *grewg- (“wrinkle, bend”), from Proto-Indo-European *ger- (“to turn, bend”).",
        "Cognate with Scots curche, crutch (“crutch, stilts”), Dutch kruk (“crutch”), Low German krukke, Krück (“crutch”), German Krücke (“crutch”), Swedish krycka (“crutch”). Latin crucia, crucca, croccia, crocia (“crutch”), and its descendants are ultimately from the Germanic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crutch (plural crutches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device to assist in motion as a cane, especially one that provides support under the arm to reduce weight on a leg.",
                  "examples": [
                    "He walked on crutches for a month until the cast was removed from his leg."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that supports, often used negatively to indicate that it is not needed and causes an unhealthful dependency; a prop",
                  "examples": [
                    "Alcohol became a crutch to help him through the long nights; eventually it killed him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A crotch; the area of body where the legs fork from the trunk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A form of pommel for a woman's saddle, consisting of a forked rest to hold the leg of the rider.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A knee, or piece of knee timber.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A forked stanchion or post; a crotch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A type of cross formed from two C-shapes joined back to back.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crutch (third-person singular simple present crutches, present participle crutching, simple past and past participle crutched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To support on crutches; to prop up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move on crutches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shear the hindquarters of a sheep; to dag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, in soap-making) to stir with a crutch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}