{
  "word": "perspective",
  "etymologies": [
    {
      "description": [
        "From Middle English perspective, perspectif, attested since 1381, from Old French or Middle French, from the first word of the Medieval Latin perspectiva ars (“science of optics”), the feminine of Latin perspectivus (“of sight, optical”), from perspectus, the past participle of perspicere (“to inspect, look through”), itself from per- (“through”) + specere (“to look at”); the noun sense was influenced or mediated by Italian prospettiva, from prospetto (“prospect”)."
      ],
      "adjectives": [
        {
          "description": "perspective (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, in or relating to perspective.",
                  "examples": [
                    "a perspective drawing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Providing visual aid; of or relating to the science of vision; optical.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "perspective (countable and uncountable, plural perspectives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A view, vista or outlook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The appearance of depth in objects, especially as perceived using binocular vision.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The technique of representing three-dimensional objects on a two-dimensional surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) An artwork that represents three-dimensional objects in this way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The choice of a single angle or point of view from which to sense, categorize, measure or codify experience.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to consider things in such relative perspective.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A perspective glass.",
                  "examples": [
                    "[…]  our predecessors; who could never have believed, that there were such lunets about some of the planets, as our late perspectives have descried  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sound recording technique to adjust and integrate sound sources seemingly naturally.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}