{
  "word": "modus",
  "etymologies": [
    {
      "description": [
        "From Latin. Doublet of mode."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "modus (plural modi)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, obsolete) The arrangement of, or mode of expressing, the terms of a contract or conveyance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A qualification involving the idea of variation or departure from some general rule or form, in the way of either restriction or enlargement, according to the circumstances of the case, as in the will of a donor, an agreement between parties, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A fixed compensation or equivalent given instead of payment of tithes in kind, expressed in full by the phrase modus decimandi.",
                  "examples": [
                    "When, instead either of a certain portion of the produce of land, or of the price of a certain portion, a certain sum of money is to be paid in full compensation for all tax or tythe; the tax becomes, in this case, exactly of the same nature with the land tax of England. It neither rises nor falls with the rent of the land. It neither encourages nor discourages improvement. The tythe in the greater part of those parishes which pay what is called a modus, in lieu of all other tythe is a tax of this kind. During the Mahometan government of Bengal, instead of the payment in kind of the fifth part of the produce, a modus, and, it is said, a very moderate one, was established in the greater part of the districts or zemindaries of the country. Some of the servants of the East India company, under pretence of restoring the public revenue to its proper value, have, in some provinces, exchanged this modus for a payment in kind. Under their management, this change is likely both to discourage cultivation, and to give new opportunities for abuse in the collection of the public revenue, which has fallen very much below what it was said to have been when it first fell under the management of the company. The servants of the company may, perhaps, have profited by the change, but at the expense, it is probable, both of their masters and of the country."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}