{
  "word": "blunket",
  "etymologies": [
    {
      "description": [
        "From Middle English plunket (noun), from plunket (“of a blue or greyish colour”, adj), perhaps the past participle of *plunken (“to cover with lead or lead-colouring”), from Old French plonquier, plonchier (“to cover with lead”), in imitation of Old French plunkié, plonquié (“lead-coloured\", also \"grey cloth”); ultimately from Latin plumbum (“lead”). The adjective is attested earlier than the noun, yet it remains unclear whether the fabric (which often retained the spelling plunket) gave its name to the color or the other way around. The word is similar to blanket (“cloth”), inviting speculation that it derives (like that word) from Old French blanchet, blanquet (“whitish”), but the most common form even as late as Early Modern English was blunket, and some early works seem to identify it as dark red or violet, which makes that theory phonologically and semantically problematic."
      ],
      "adjectives": [
        {
          "description": "blunket (comparative more blunket, superlative most blunket)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Gray; grayish or light blue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "blunket (countable and uncountable, plural blunkets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A color, generally a light bluish gray or blue or gray, but sometimes seemingly a dark red or violet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A cloth, or kind of cloth (blanket cloth), generally but not always of this color.",
                  "examples": [
                    "some of a watchet [like blue blunkets]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}