{
  "word": "umpire",
  "etymologies": [
    {
      "description": [
        "From a Middle English rebracketing of a noumpere as an oumpere, from Old French nonper (“odd number, not even (as a tie-breaking arbitrator)”), from non (“not”) + per (“equal”), from Latin par (“equal”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "umpire (plural umpires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis, badminton) The official who presides over a tennis match sat on a high chair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) One of the two white-coated officials who preside over a cricket match.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) One of the officials who preside over a baseball game.",
                  "examples": [
                    "The umpire called the pitch a strike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) The official who stands behind the line on the defensive side or next to the referee on the offensive side.",
                  "examples": [
                    "The umpire must keep on his toes as the play often occurs around him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australian rules football) A match official on the ground deciding and enforcing the rules during play. As of 2007 the Australian Football League uses three; in the past there were two or just one. The other officials, the goal umpires and boundary umpires, are usually referred to by those phrases.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A person who arbitrates between contending parties.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) The official who presides over a curling game.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "umpire (third-person singular simple present umpires, present participle umpiring, simple past and past participle umpired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, intransitive) To act as an umpire in a game.",
                  "examples": [
                    "Coordinate term: referee"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To decide as an umpire.",
                  "examples": [
                    "Synonyms: arbitrate, settle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}