{
  "word": "fike",
  "etymologies": [
    {
      "description": [
        "From Middle English fiken (“to feign, dissemble, flatter”), from Old English fician (“to wheedle, flatter”) (also found in compound befician (“to deceive”)), from Proto-Germanic *fikōną (“to deceive”), from Proto-Indo-European *peyǵ- (“ill-meaning, evil-minded, treacherous, hostile, bad”). Related to Old English ġefic (“fraud, deceit, deception”), Old English fācen (“deceit, fraud, treachery, sin, evil, crime, blemish, fault”), Middle High German veichen (“dissembling, deceit, fraud”), Latin piget (“it irks, it annoys”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fike (third-person singular simple present fikes, present participle fiking, simple past and past participle fiked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To feign; dissemble; flatter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English fiken, fyken (“to fidget, move about restlessly, hasten away”), from Old Norse fíkjast (“to be eager or restless”), from fíka (“to climb, move”). Cognate with Scots fyke (“to move about restlessly, fidget, itch”), Norwegian fika (“to strive, take trouble”), Icelandic fikinn (“eager, greedy”). Related to fig and fidget."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fike (plural fikes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Restlessness or agitation caused by trifling annoyance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Any trifling peculiarity in regard to work which causes unnecessary trouble; teasing exactness of operation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fike (third-person singular simple present fikes, present participle fiking, simple past and past participle fiked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move about in a quick, uneasy way; be constantly in motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give trouble to; vex; perplex.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English fike, from Old English fīc (“fig, fig-tree, fig-disease, venereal ulcer, hemorrhoids”), from Proto-Germanic *fīkaz, *fīgō (“fig”), from Latin fīcus, fīca (“fig, fig-tree”). Cognate with Dutch vijg (“fig”), German Feige (“fig”), Swedish fikon (“fig”), Icelandic fikja (“ficus”). More at fig."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fike (plural fikes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A fig.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) A sore place on the foot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}