{
  "word": "labyrinth",
  "etymologies": [
    {
      "description": [
        "Borrowed from French labyrinthe or Latin labyrinthus, from Ancient Greek λᾰβύρῐνθος (labúrinthos, “a maze”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "labyrinth (plural labyrinths)",
          "definitionGroups": [
            {
              "group": "(Greek mythology) A maze-like structure built by Daedalus in Knossos, containing the Minotaur.",
              "entries": [
                {
                  "meaning": "A complicated irregular network of passages or paths, especially underground or covered, in which it is difficult to find one's way.",
                  "examples": [
                    "Synonym: maze"
                  ]
                },
                {
                  "meaning": "(horticulture) A maze formed by paths separated by high hedges.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) Anything complicated and confusing in structure, arrangement, or character.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(anatomy) A tortuous anatomical structure:",
              "entries": [
                {
                  "meaning": "(anatomy) A complex structure in the inner ear which contains the organs of hearing and balance. It consists of bony cavities (the bony labyrinth) filled with fluid and lined with sensitive membranes (the membranous labyrinth).",
                  "examples": []
                },
                {
                  "meaning": "(zoology) An accessory respiratory organ of certain fish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various satyrine butterflies of the genus Neope.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "labyrinth (third-person singular simple present labyrinths, present participle labyrinthing, simple past and past participle labyrinthed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to enclose in a labyrinth, or as though in a labyrinth",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to arrange in the form of a labyrinth",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to twist and wind, following a labyrinthine path",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to render lost and confused, as if in a labyrinth",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}