{
  "word": "wheel",
  "etymologies": [
    {
      "description": [
        "From Middle English whele, from Old English hwēol, from Proto-West Germanic *hwehwl, from Proto-Germanic *hwehwlą, *hweulō, from Proto-Indo-European *kʷekʷlóm, *kʷékʷlos, *kʷékʷléh₂, reduplication of *kʷel- (“to turn”) and a suffix (literally \"(the thing that) turns and turns.\"",
        "See also West Frisian tsjil, Dutch wiel, Danish hjul; also Tocharian B kokale (“cart, wagon”), Ancient Greek κύκλος (kúklos, “cycle, wheel”), Avestan 𐬗𐬀𐬑𐬭𐬀‎ (caxra), Sanskrit चक्र (cakrá)); and Latin colō (“to till, cultivate”), Tocharian A and Tocharian B käl- (“to bear; bring”), Ancient Greek πέλω (pélō, “to come into existence, become”), Old Church Slavonic коло (kolo, “wheel”), Albanian sjell (“to bring, carry, turn around”), Avestan 𐬗𐬀𐬭𐬀𐬌𐬙𐬌‎ (caraiti, “it circulates”), Sanskrit चरति (cárati, “it moves, wanders”)). Doublet of charkha, cycle, and chakra."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wheel (plural wheels)",
          "definitionGroups": [
            {
              "group": "A circular device capable of rotating on its axis, facilitating movement or transportation or performing labour in machines.",
              "entries": [
                {
                  "meaning": "(informal, with \"the\") A steering wheel and its implied control of a vehicle.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) The instrument attached to the rudder by which a vessel is steered.",
                  "examples": []
                },
                {
                  "meaning": "A spinning wheel.",
                  "examples": []
                },
                {
                  "meaning": "A potter's wheel.",
                  "examples": [
                    "Then I went down to the potter's house, and, behold, he wrought a work on the wheels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The breaking wheel, an old instrument of torture.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(slang) A person with a great deal of power or influence; a big wheel.",
              "entries": [
                {
                  "meaning": "(computing, dated) A superuser on certain systems.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) The lowest straight in poker: ace, 2, 3, 4, 5.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) A wheelrim.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A round portion of cheese.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Catherine wheel firework.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A rolling or revolving body; anything of a circular form; a disk; an orb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A turn or revolution; rotation; compass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A recurring or cyclical course of events.",
                  "examples": [
                    "the wheel of life"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) A dollar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, archaic) A crown coin; a \"cartwheel\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, informal) A bicycle or tricycle.",
                  "examples": [
                    "There was no vehicle of any sort, on land or water, in those days, that could go as fast as a bicycle, except a railroad train.  […]  Hammondsport and Glenn Curtiss had never even heard of the not yet quite born automobile. But Glenn Curtiss could push his \"wheel,\" with those long legs of his, uphill, downhill or on the level, faster than any other boy in Hammondsport."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A manoeuvre in marching in which the marchers turn in a curving fashion to right or left so that the order of marchers does not change.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wheel (third-person singular simple present wheels, present participle wheeling, simple past and past participle wheeled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To roll along on wheels.",
                  "examples": [
                    "Wheel that trolley over here, would you?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To transport something or someone using any wheeled mechanism, such as a wheelchair.",
                  "examples": [
                    "She wheeled the dung in the wheelbarrow",
                    "Along a stretch of road;",
                    "But she always ran away and left",
                    "Her not-nice load,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To ride a bicycle or tricycle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change direction quickly, turn, pivot, whirl, wheel around.",
                  "examples": [
                    "The dog screamed, and, wheeling in terror, galloped headlong in a new direction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to change direction quickly, turn.",
                  "examples": [
                    "[…]  he did as Menelaus had said, and set off running as soon as he had given his armour to a comrade, Laodocus, who was wheeling his horses round, close beside him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel around in large circles, particularly in the air.",
                  "examples": [
                    "The vulture wheeled above us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put into a rotatory motion; to cause to turn or revolve; to make or perform in a circle.",
                  "examples": [
                    "Now fades the glimmering landscape on the sight,",
                    "And all the air a solemn stillness holds,",
                    "Save where the beetle wheels his droning flight,",
                    "And drowsy tinklings lull the distant folds:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}