{
  "word": "participate",
  "etymologies": [
    {
      "description": [
        "From the participle stem of Latin participare (“to take part in, share in, give part in, impart”), from particeps (“taking part in, sharing in”), from pars (“part”) + capiō (“to take”); see part and capable."
      ],
      "adjectives": [
        {
          "description": "participate (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Acting in common; participating.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "participate (third-person singular simple present participates, present participle participating, simple past and past participle participated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To join in, to take part, to involve oneself (in something). [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To share, to take part in (something). [16th–19th c.]",
                  "examples": [
                    "[The Persees] are tollerated all sorts of meat; but (in obedience to the Mahomitan and Bannyan ’mongst whom they live) refraine Beefe and Hog flesh: they seldome feed together, lest they might participate one anothers impurity: each has his owne cup  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To share (something) with others; to transfer (something) to or unto others. [16th–18th c.]",
                  "examples": [
                    "Make the Earth  […]  turn round its own axis in twenty four hours, and towards the same point with all the other Spheres; and without participating this same motion to any other Planet or Star, all shall have their risings, settings, and in a word, all their other appearances."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}