{
  "word": "boondock",
  "etymologies": [
    {
      "description": [
        "1910s during or around the Philippine–American War after the Spanish–American War, from Tagalog bundok (“mountain”), adopted by occupying American soldiers serving in the mountains or rural countryside of the American-occupied Philippines under the United States Military Government of the Philippine Islands. The term was reinforced or re-adopted during World War II under the U.S. military, where terms like boondockers (“shoes suited for rough terrain”) came originally in 1944 as U.S. services slang word for field boots. It was later shortened to boonies by 1964 originally among U.S. troops serving in the Vietnam War in reference to the rural areas of Vietnam, as opposed to Saigon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boondock (plural boondocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, with article, in the plural) A brushy, rural area or location.",
                  "examples": [
                    "We got lost out in the boondocks, miles from anywhere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tiddlywinks) A shot that strikes a squopped wink and sends it flying far away.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "boondock (third-person singular simple present boondocks, present participle boondocking, simple past and past participle boondocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) To camp in a dry brushy location.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) To stay in a self-contained recreational vehicle without connections to water, electricity, or sewer services, especially in a remote location.",
                  "examples": [
                    "When traveling in the American Southwest, we avoid other people by boondocking in the desert."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tiddlywinks) To strike a squopped wink and send it flying far away.",
                  "examples": [
                    "The wise winker also engages in boondocking, a defensive strategy. It involves sending an opponent's winks far from the cup."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}