{
  "word": "banger",
  "etymologies": [
    {
      "description": [
        "From bang +‎ -er. The sausages were so called because of their excess water content and impervious skin, leading to the risk of explosion if not punctured before cooking."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "banger (plural bangers)",
          "definitionGroups": [
            {
              "group": "A thing or person which bangs, in any sense.",
              "entries": [
                {
                  "meaning": "(Britain) A firework that makes a bang.",
                  "examples": []
                },
                {
                  "meaning": "(sexuality, slang) A person who has sex.",
                  "examples": [
                    "Coordinate terms: bang, gangbang, gangbanger"
                  ]
                },
                {
                  "meaning": "(automotive, slang) An old, worn-out car. From a stereotypical one backfiring, making banging noises.",
                  "examples": [
                    "Synonyms: bucket, beater, hooptie, jalopy, wreck, crock, shitbox, rustbucket; see also Thesaurus:old car"
                  ]
                },
                {
                  "meaning": "(US, automotive, slang) A car or an engine; referring to the cylinders of an engine in a car. From the explosive bangs on every cylinder firing.",
                  "examples": [
                    "He drives a little four-banger to work."
                  ]
                },
                {
                  "meaning": "(curling) One of the rocks that end up crashing against another, making banging sounds, after a throw.",
                  "examples": []
                },
                {
                  "meaning": "(curling) One of the rocks that results in a score at the finish of an end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, sexuality, slang) A woman's breast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, sexuality, slang) A man's penis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, New Zealand, Australia, food, slang) A sausage.",
                  "examples": [
                    "Synonym: (Australia) snag",
                    "bangers and mash"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, crime, slang) Clipping of gangbanger; a member of a gang.",
                  "examples": [
                    "Just as the gang peace movement desired to mainstream hardcore bangers into civic society, The Chronic wanted to drive hardcore rap into the popstream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, slang) A powerfully energetic piece of music, especially dance music.",
                  "examples": [
                    "Morris' melding of influences ranging from mid-'80s computer technology to Baltimore club bangers to the U.K. rave scene has cemented his reputation as one of London's most formidable DJs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, by extension) Any particularly good or pleasing thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, slang) A Bangalore torpedo.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}