{
  "word": "mad",
  "etymologies": [
    {
      "description": [
        "From Middle English mad, madde, madd, medd, from Old English ġemǣdd, ġemǣded (“enraged”), past participle of ġemǣdan, *mǣdan (“to make insane or foolish”), from Proto-Germanic *maidijaną (“to change; damage; cripple; injure; make mad”), from Proto-Germanic *maidaz (\"weak; crippled\"; compare Old English gemād (“silly, mad”), Old High German gimeit (“foolish, crazy”), literary German gemeit (“mad, insane”), Gothic 𐌲𐌰𐌼𐌰𐌹𐌸𐍃 (gamaiþs, “crippled”)), from Proto-Indo-European *mey- (\"to change\"; compare Old Irish máel (“bald, dull”), Old Lithuanian ap-maitinti (“to wound”), Sanskrit मेथति (méthati, “he hurts, comes to blows”))."
      ],
      "adjectives": [
        {
          "description": "mad (comparative madder, superlative maddest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Insane; crazy, mentally deranged.",
                  "examples": [
                    "You want to spend $1000 on a pair of shoes? Are you mad?",
                    "He's got this mad idea that he's irresistible to women."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US; informal in UK) Angry, annoyed.",
                  "examples": [
                    "Are you mad at me?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the negative, informal) Used litotically to indicate satisfaction or approval.",
                  "examples": [
                    "Wow, you really made this pie from scratch? I'm not mad at it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, informal) Bizarre; incredible.",
                  "examples": [
                    "It's mad that I got that job back a day after being fired."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wildly confused or excited.",
                  "examples": [
                    "to be mad with terror, lust, or hatred"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Extremely foolish or unwise; irrational; imprudent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, usually with for or about) Extremely enthusiastic about; crazy about; infatuated with; overcome with desire for.",
                  "examples": [
                    "Aren't you just mad for that red dress?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of animals) Abnormally ferocious or furious; or, rabid, affected with rabies.",
                  "examples": [
                    "a mad dog"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, New England, New York) Intensifier, signifying abundance or high quality of a thing; very, much or many.",
                  "examples": [
                    "I gotta give you mad props for scoring us those tickets. Their lead guitarist has mad skills. There are always mad girls at those parties."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a compass needle) Having impaired polarity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "mad (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, New England, New York and UK, dialect) Intensifier; to a large degree; extremely; exceedingly; very; unbelievably.",
                  "examples": [
                    "He was driving mad slow.",
                    "It's mad hot today.",
                    "He seems mad keen on her."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "mad (third-person singular simple present mads, present participle madding, simple past and past participle madded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To be or become mad. [14th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now colloquial US, Jamaica) To madden, to anger, to frustrate. [from 15th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}