{
  "word": "clanger",
  "etymologies": [
    {
      "description": [
        "From clang (“loud ringing sound”) +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clanger (plural clangers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that clangs; an alarm bell (also figuratively).",
                  "examples": [
                    "The front and patio doors are bugged. When you open one a contact breaks and off goes the clanger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The clapper of a bell, anything that strikes a bell or other metal object to make a ringing sound.",
                  "examples": [
                    "He showed me where to pull the clanger, and I pulled and pulled and the clanging joined the music of the bombardment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Australia, New Zealand, Ireland, informal, often in the phrase drop a clanger) A very noticeable mistake; an attention-getting faux pas.",
                  "examples": [
                    "In his speech, the best man got the bride's name wrong. What a clanger!",
                    "He dropped a real clanger when he criticized the paraplegic for not standing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Australian rules football) A mistake made by a player; counted in the game statistics in the category \"errors including frees against\".",
                  "examples": [
                    "Geelong could not get their running game going and lapsed into clanger after clanger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An early hi-hat consisting of cymbals mounted on the rim of a bass drum and struck with an arm on the drum's pedal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, entomology) A cicada, Psaltoda claripennis, of New South Wales and Queensland, having an upper body of green and brown and clear wings with green veins.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening of Bedfordshire clanger."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clanger (plural clangers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for Bedfordshire clanger.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}