{
  "word": "fart",
  "etymologies": [
    {
      "description": [
        "From Middle English ferten, farten, from Old English feortan, from Proto-Germanic *fertaną, from Proto-Indo-European *perd-.",
        "The noun is from Middle English fert, fart, from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fart (plural farts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An emission of digestive gases from the anus; a flatus. [from 15th c.]",
                  "examples": [
                    "I think I heard a fart. Was it you, Nigel?",
                    "Silent farts are often the smelliest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, impolite, derogatory) An irritating person; a fool.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, impolite, derogatory, potentially offensive) (usually as \"old fart\") An elderly person; especially one perceived to hold old-fashioned views.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fart (third-person singular simple present farts, present participle farting, simple past and past participle farted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, impolite, intransitive) To emit digestive gases from the anus; to flatulate.",
                  "examples": [
                    "Synonyms: beef, blow off, break wind, cut one loose, cut the cheese, flatulate, toot, pass gas, pass wind; see also Thesaurus:flatulate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, intransitive, usually as \"fart around\") To waste time with idle and inconsequential tasks; to go about one's activities in a lackadaisical manner; to be lazy or over-relaxed in one's manner or bearing.",
                  "examples": [
                    "Synonyms: futz, fool around, fool about"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, transitive) To emit (fumes, gases, etc.).",
                  "examples": [
                    "Above his head the funnel farted black soot into the sky."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}