{
  "word": "masquerade",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Middle French mascarade, masquarade, masquerade (modern French mascarade (“masquerade, masque; farce”)), and its etymon Italian mascherata (“masquerade”), from maschera (“mask”) + -ata. Maschera is derived from Medieval Latin masca (“mask”): see further there. The English word is cognate with Late Latin masquarata, Portuguese mascarada, Spanish mascarada.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "masquerade (plural masquerades) (also attributively)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An assembly or party of people wearing (usually elaborate or fanciful) masks and costumes, and amusing themselves with dancing, conversation, or other diversions.",
                  "examples": [
                    "Synonym: (obsolete) masque",
                    "I was invited to the masquerade party at their home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of wearing a mask or dressing up in a costume for, or as if for, a masquerade ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An act of living under false pretenses; a concealment of something by a false or unreal show; a disguise, a pretence; also, a pretentious display.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An assembly of varied, often fanciful, things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fandom slang) A cosplay event at which costumed attendees perform skits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A dramatic performance by actors in masks; a mask or masque.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A Spanish entertainment or military exercise in which squadrons of horses charge at each other, the riders fighting with bucklers and canes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "masquerade (third-person singular simple present masquerades, present participle masquerading, simple past and past participle masqueraded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take part in a masquerade; to assemble in masks and costumes; (loosely) to wear a disguise.",
                  "examples": [
                    "I’m going to masquerade as an old-fashioned pilot. What are you going to dress up as?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To pass off as a different person or a person with qualities that one does not possess; also, to make a pretentious show of being what one is not.",
                  "examples": [
                    "He masqueraded as my friend until the truth finally came out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To conceal (someone) with, or as if with, a mask; to disguise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}