{
  "word": "deadline",
  "etymologies": [
    {
      "description": [
        "According to the Oxford English Dictionary, early usage refers simply to lines that do not move, such as one used in angling. Slightly later American usage refers to a boundary in a prison which prisoners must not cross. There is only indirect evidence that the sense of \"due date\" may be connected with this use of the term in prison camps during the American Civil War, when it referred to a physical line or boundary beyond which prisoners were shot. In fact, the term is no longer found in print by the end of the 19th century, but it soon resurfaces in writing in 1917 as a printing term for a guideline on the bed of a printing press beyond which text will not print. Three years later, the term is found in print in the sense of \"time limit\" in the closely connected publishing industry, indicating the time after which material would not make it into a newspaper or periodical."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "deadline (plural deadlines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A time limit in the form of a date on or before which something must be completed.",
                  "examples": [
                    "I must make this deadline or my boss will kill me!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A guideline marked on a plate for a printing press.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A line that does not move.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A boundary around a prison, prisoners crossing which would be shot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "deadline (third-person singular simple present deadlines, present participle deadlining, simple past and past participle deadlined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) To render an item non-mission-capable; to ground an aircraft, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}