{
  "word": "blush",
  "etymologies": [
    {
      "description": [
        "From Middle English blusshen, bluschen, blusschen, blisshen, from Old English blysċan (“to be red; shine”), perhaps from Proto-Germanic *blaskijaną, from *blasǭ (“burning candle; torch”) or alternatively from Proto-Germanic *bluskijaną, from *blusjǭ (“torch”). Cognate with Middle Low German blöschen (“to blush”). Compare also Old English blysian (“to burn; blaze”), Dutch blozen (“to blush”), Danish blusse (“to blush”), Old Norse blys (“torch”), Danish blus (“blaze”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blush (countable and uncountable, plural blushes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of blushing; a red glow on the face caused by shame, modesty, etc.",
                  "examples": [
                    "It was a sudden revelation, a tinge like a blush which one tried to check and then, as it spread, one yielded to its expansion  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A glow; a flush of colour, especially pink or red.",
                  "examples": [
                    "Each painting consists of a white aluminum disk, sprayed at the edges with a subtle blush of blue, pink or grey."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Feeling or appearance of optimism.",
                  "examples": [
                    "The independence ceremony could not keep the blush of April's revolution, when carnations had seemed to sprout from every buttonhole, from fading."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, countable) A sort of makeup, frequently a powder, used to redden the cheeks.",
                  "examples": [
                    "Synonyms: blusher, rouge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A color between pink and cream.",
                  "examples": [
                    "blush:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) A pale pink wine made by removing the dark grape skins at the required point during fermentation.",
                  "examples": [
                    "Synonyms: blush wine, rosé"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blush (third-person singular simple present blushes, present participle blushing, simple past and past participle blushed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become red in the face (and sometimes experience an associated feeling of warmth), especially due to shyness, shame, excitement, or embarrassment.",
                  "examples": [
                    "The love scene made him blush to the roots of his hair / to the tips of his ears.",
                    "He wasn't used to this much attention, so he blushed as he saw dozens of pairs of eyes watching him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To be ashamed or embarrassed (to do something).",
                  "examples": [
                    "He never blushed to rob a slave mother of her children, no matter how young or small."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become red.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To suffuse with a blush; to redden; to make rosy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative) To change skin color in the face (to a particular shade).",
                  "examples": [
                    "When he saw it, he blushed a beet red.",
                    "I wasn't surprised, but it was embarrassing enough that I blushed a little pink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To express or make known by blushing.",
                  "examples": [
                    "Looking at me with a knowing glare, she blushed her discomfort with the situation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have a warm and delicate colour, like some roses and other flowers.",
                  "examples": [
                    "The garden was full of blossoms that blushed in myriad shades to form a beautiful carpet of color."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To glance with the eye, cast a glance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, intransitive) Of dope or varnish: to develop an undesirable white precipitate on the surface, due to being applied in humid conditions.",
                  "examples": [
                    "Blushing is caused by doping under high relative humidity conditions."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unknown; attested in the late 15th century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blush (plural blushes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The collective noun for a group of boys.",
                  "examples": [
                    "A blush of boys."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}