{
  "word": "squirt",
  "etymologies": [
    {
      "description": [
        "From Middle English squirten, squyrten, of uncertain origin; probably imitative. Akin to swirl. Compare Low German swirtjen (“to squirt”) and Swedish water onomatopoeias skvala, skvalp, skvimpa, and skvätta; Icelandic skvetta; and Norwegian skvette."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squirt (countable and uncountable, plural squirts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instrument from which a liquid is forcefully ejected in a small, quick stream.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, quick stream; a jet.",
                  "examples": [
                    "Chances are you′ll get a squirt of citrus juice in your eye."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hydrodynamics) The whole system of flow in the vicinity of a source.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A burst of noise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An annoyingly pretentious person; a whippersnapper. [From 1839.]",
                  "examples": [
                    "He was still there when I came up, a squirt with his hat over one eye and a camera hung round his neck and a grin on his squirt face. I thought maybe I had seen him around town, but maybe not, the squirts look so much alike when they grind them out of journalism school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, US, Australia, slang) A small child.",
                  "examples": [
                    "Hey squirt! Where you been?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar, uncountable) Female ejaculate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An act of urination.",
                  "examples": [
                    "Excuse me, I need to take a squirt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(kayaking) A maneuver in which the boat is forced into a nearly vertical position.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "squirt (third-person singular simple present squirts, present participle squirting, simple past and past participle squirted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a liquid) To be thrown out, or ejected, in a rapid stream, from a narrow orifice.",
                  "examples": [
                    "The toothpaste squirted from the tube."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a liquid) To cause to be ejected, in a rapid stream, from a narrow orifice.",
                  "examples": [
                    "It can squirt this poison in jets up to a distance of one metre and usually aims at the eyes of its victim."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To emit, eject or excrete (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit with a rapid stream of liquid.",
                  "examples": [
                    "Ask the child to squirt the target with water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively, obsolete) To throw out or utter words rapidly; to prate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, vulgar, of a female) To ejaculate.",
                  "examples": [
                    "Women who squirt rhapsodize about the experience, reporting that it elicits feelings of empowerment and a deeper connection to their own bodies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(kayaking) To forcefully maneuver against the current so that the end of the boat is forced nearly vertical.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}