{
  "word": "zubr",
  "etymologies": [
    {
      "description": [
        "From Polish żubr, from Proto-Slavic *zǫbrъ, *izǫbrъ, possibly from Proto-Indo-European *ǵómbʰos (“tooth, horn, peg”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "zubr (plural zubrs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One of several species of European bison or aurochs, which were unclearly delineated in the 1800s when this sense was in use. [from the 1820s onwards]",
                  "examples": [
                    "Herberstein and Martin Cronner assert that the name of Bison is always bestowed on the animal called Zubr or Zumbr by the Poles that the name of Aurochs or Urus is improperly bestowed upon it by the Germans; that these last mentioned names apply solely to the urus or Thur of the Polish nation and they add, that the thur was at that period found only in Massovia, near Warsaw; and they even name the particular villages the inhabitants of which were charged with its conservation. During their days, the thur or wild bull appears to have been kept as a curiosity, as the zubr or modern aurochs is at this day, Anthony Schneebergen designates by the name of Thur a species of wild bull, differing from the domestic breed in few particulars, except its greater size, the uniformly black colour of the males, and the beauty of its coat; its horns were always directed forwards. This last character excludes the identity of the thur and buffalo presumed by Pallas. The forward direction of the horns, the greater size, the similarity of form to that of the domestic bull, all established and described by observers who were at the same time sufficiently familiar with the zubr or modern aurochs, prove it to have been a diiferent animal from that last named."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The wisent, the European bison (Bison bonasus).",
                  "examples": [
                    "THE European bison, wisent or zubr (Bison bonasus) seems to be coming back into circulation again, at least among menagerie keepers. The London Zoo has a pair of them..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}