{
  "word": "challenge",
  "etymologies": [
    {
      "description": [
        "From Middle English chalenge, variant with palatalization of Middle English kalange (“an accusation, claim”), from Old French chalenge, chalonge, palatalized Central French variants of Old Northern French calenge, calonge (see Continental Norman calengier), from Latin calumnia (“a false accusation, calumny”), from Proto-Indo-European *kēl-, *ḱēl- (“invocation; to beguile, feign, charm, cajole, deceive”). Cognate with Old English hōl (“calumny”). Doublet of calumny."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "challenge (plural challenges)",
          "definitionGroups": [
            {
              "group": "A confrontation; a dare.",
              "entries": [
                {
                  "meaning": "An antagonization or instigation intended to convince a person to perform an action they otherwise would not.",
                  "examples": []
                },
                {
                  "meaning": "A bid to overcome something.",
                  "examples": [
                    "a challenge to the king's authority"
                  ]
                },
                {
                  "meaning": "(sports) An attempt to take possession; a tackle.",
                  "examples": []
                },
                {
                  "meaning": "A summons to fight a duel; also, the letter or message conveying the summons.",
                  "examples": []
                },
                {
                  "meaning": "The act of a sentry in halting a person and demanding the countersign, or (by extension) the action of a computer system demanding a password, etc.",
                  "examples": []
                },
                {
                  "meaning": "An attempt to have a work of literature restricted or removed from a public library or school curriculum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A difficult task, especially one that the person making the attempt finds more enjoyable because of that difficulty.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(law) A procedure or action.",
              "entries": [
                {
                  "meaning": "(law, rare) A judge's interest in the result of a case, constituting grounds for them to not be allowed to sit the case (e.g., a conflict of interest).",
                  "examples": [
                    "Consanguinity in direct line is a challenge for a judge when he or she is sitting cases."
                  ]
                },
                {
                  "meaning": "The act of appealing a ruling or decision of a court of administrative agency.",
                  "examples": []
                },
                {
                  "meaning": "The act of seeking to remove a judge, arbitrator, or other judicial or semi-judicial figure for reasons of alleged bias or incapacity.",
                  "examples": [
                    "We're still waiting to hear how the court rules on our challenge of the arbitrator based on conflict of interest."
                  ]
                },
                {
                  "meaning": "(US) An act of seeking to have a certain person be declared not legally qualified to vote, made when the person offers their ballot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting) The opening and crying of hounds upon first finding the scent of their game.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "challenge (third-person singular simple present challenges, present participle challenging, simple past and past participle challenged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To invite (someone) to take part in a competition.",
                  "examples": [
                    "We challenged the boys next door to a game of football."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dare (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dispute (something).",
                  "examples": [
                    "to challenge the accuracy of a statement or of a quotation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To call something into question or dispute.",
                  "examples": [
                    "New information challenged old hypotheses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, transitive) To make a formal objection to a juror.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be difficult or challenging for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To claim as due; to demand as a right.",
                  "examples": [
                    "Challenge better terms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To censure; to blame.",
                  "examples": [
                    "I may be more challenged for my inconsiderate Boldness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, transitive) To question or demand the countersign from (one who attempts to pass the lines).",
                  "examples": [
                    "The sentinel challenged us with \"Who goes there?\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, transitive) To object to the reception of the vote of, e.g. on the ground that the person is not qualified as a voter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, transitive) To take (a final exam) in order to get credit for a course without taking it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}