{
  "word": "wafery",
  "etymologies": [
    {
      "description": [
        "wafer +‎ -y"
      ],
      "adjectives": [
        {
          "description": "wafery (comparative more wafery, superlative most wafery)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Like a wafer (especially, thin, brittle, light).",
                  "examples": [
                    "It is, however, much more dangerous to descend than to ascend a rapid; for it is then almost impossible to stop a canoe, when under full headway, and if you happen to strike a rock, you will find your wafery canoe no better than a sieve."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of bread) Sliced very thinly.",
                  "examples": [
                    "This was none of your stand-up, wafery, bread and butter teas, but a thorough-going, sit-down supper  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "wafery (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, historical) A kitchen or building in which wafers and other pastries are prepared; the department of the royal household responsible for the preparation of wafers.",
                  "examples": [
                    "One secundary clerke in this office of the greate spycery, sufficiaunt to resceive and trulye to keepe the Kinge’s stuffe of this office; and to wryte the dayly bookes of the delyveraunces thereof, and of all the other three offices, as it shall require; and he to awnswere to everye parcell of them into the counting-house, as for suger to the wafery, or to the sellare or kychyn, with all other manner of spices nedefull to the confectionarye and sawcerye  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}