{
  "word": "caramel",
  "etymologies": [
    {
      "description": [
        "Borrowed from French caramel, from Spanish caramelo, from Portuguese caramelo, dissimilated from Late Latin calamellus, diminutive of calamus (“reed”) (and therefore a doublet of chalumeau and shawm), from Ancient Greek κᾰ́λᾰμος (kálamos), ultimately from Proto-Indo-European *ḱolh₂mos. Alternatively from Medieval Latin cannamellis, which is a compound of canna + mellis."
      ],
      "adjectives": [
        {
          "description": "caramel (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a yellow-brown color.",
                  "examples": [
                    "Every time I saw this caramel cutie, she was working on a new proposal or business plan or flyer to promote herself and her event coordinating business."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "caramel (countable and uncountable, plural caramels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A smooth, chewy, sticky confection made by heating sugar and other ingredients until the sugars polymerize and become sticky.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A (sometimes hardened) piece of this confection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(color) A yellow-brown color, like that of caramel.",
                  "examples": [
                    "caramel:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "caramel (third-person singular simple present caramels, present participle caramelling or carameling, simple past and past participle caramelled or carameled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cooking, dated) To caramelize.",
                  "examples": [
                    "To turn out, place the dish over the mould, and invert both together, when, if the caramelling has been complete, the pudding should slip out without any difficulty at all."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}