{
  "word": "warp",
  "etymologies": [
    {
      "description": [
        "From Middle English warp, werp, from Old English wearp, warp (“a warp, threads stretched lengthwise in a loom, twig, osier”), from Proto-Germanic *warpą (“a warp”), from Proto-Indo-European *werb- (“to turn, bend”). Cognate with Middle Dutch warp, Middle Low German warp, German Warf, Danish varp, Swedish varp."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "warp (countable and uncountable, plural warps)",
          "definitionGroups": [
            {
              "group": "(uncountable) The state, quality, or condition of being twisted, physically or mentally:",
              "entries": [
                {
                  "meaning": "(uncountable) The state, quality, or condition of being physically bent or twisted out of shape.",
                  "examples": [
                    "All frames found to suffer from warp should be broken up straight away before the printer is tempted during a rush to make use of them."
                  ]
                },
                {
                  "meaning": "(uncountable) The state, quality, or condition of being deviant from what is right or proper morally or mentally.",
                  "examples": [
                    "He believed that we were suffering from warp or bias, that a blind spot contorted our mental vision."
                  ]
                }
              ]
            },
            {
              "group": "(countable) A distortion:",
              "entries": [
                {
                  "meaning": "(countable) A distortion or twist, such as in a piece of wood (also used figuratively).",
                  "examples": [
                    "Wills, too, was struck down by a pole but was saved because a warp in the wood bent upwards, creating a pocket for his body."
                  ]
                },
                {
                  "meaning": "(countable) A mental or moral distortion, deviation, or aberration.",
                  "examples": [
                    "It is interesting to note that it has been suggested by Lugaro to partially extirpate the thyroid in cases of moral insanity; an excessive secretion of thyroid being regarded as the cause of excessive amativeness, thieving, and other mental warps  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving) The threads that run lengthwise in a woven fabric; crossed by the woof or weft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) The foundation, the basis, the undergirding.",
                  "examples": [
                    "This stretch is typical of the Piedmont section, where the warp of the economic structure is agriculture and the woof industry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A line or cable or rode as is used in warping (mooring or hauling) a ship, and sometimes for other purposes such as deploying a seine or creating drag.",
                  "examples": [
                    "We finish’d the Raft that Night, and in the Morning sent Mr. Prat, our Chief Mate, and four Men in the Boat with a long Rope for a Warp, to fasten on the Land."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A theoretical construct that permits travel across a medium without passing through it normally, such as a teleporter or time warp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A situation or place which is or seems to be from another era; a time warp.",
                  "examples": [
                    "If Times Square nevertheless remained a metaphor for the city's changing dynamics, it was stuck in a warp of immobility, unable to push itself forward as it had in the early part of the twentieth century."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sediment which subsides from turbid water; the alluvial deposit of muddy water artificially introduced into low lands in order to enrich or fertilise them.",
                  "examples": [
                    "The silt is brought down and the strong tide of the Humber brings it up in very large quantities, so that the river the whole way through nearly is exceedingly thick. Added to that I may say that we suffer from warp to a tremendous extent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete outside dialects) A throw or cast, as of fish (in which case it is used as a unit of measure: about four fish, though sometimes three or even two), oysters, etc.",
                  "examples": [
                    "a warp of fish"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English werpen, weorpen, worpen, from Old English weorpan (“to throw”), from Proto-Germanic *werpaną (“to throw, turn”), from Proto-Indo-European *werb- (“to bend, turn”). Cognate with Scots warp (“to throw, warp”), North Frisian werpen (“to throw”), Dutch werpen (“to throw, cast”), German werfen (“to throw, cast”), Icelandic verpa (“to throw”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "warp (third-person singular simple present warps, present participle warping, simple past and past participle warped)",
          "definitionGroups": [
            {
              "group": "To twist or become twisted, physically or mentally:",
              "entries": [
                {
                  "meaning": "(transitive) To twist or turn (something) out of shape; to deform.",
                  "examples": [
                    "The moisture warped the board badly.",
                    "to warp space and time",
                    "The trauma had permanently warped her mind."
                  ]
                },
                {
                  "meaning": "(intransitive) To become twisted out of shape; to deform.",
                  "examples": [
                    "Over the years the post had warped and checked and needed to be replaced."
                  ]
                },
                {
                  "meaning": "(transitive) To deflect or turn (something) away from a true, proper or moral course; to pervert; to bias.",
                  "examples": [
                    "His perspective had warped after his extreme experiences."
                  ]
                },
                {
                  "meaning": "(intransitive) To go astray or be deflected from a true, proper or moral course; to deviate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete, ropemaking) To run (yarn) off the reel into hauls to be tarred.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To arrange (strands of thread, etc) so that they run lengthwise in weaving.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, rare, obsolete, figurative) To plot; to fabricate or weave (a plot or scheme).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare, obsolete, poetic) To change or fix (make fixed, for example by freezing).",
                  "examples": []
                }
              ]
            },
            {
              "group": "To move:",
              "entries": [
                {
                  "meaning": "(transitive, nautical) To move a vessel by hauling on a line or cable that is fastened to an anchor or pier; (especially) to move a sailing ship through a restricted place such as a harbour.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, nautical, of a ship) To move or be moved by this method.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, rare, dated) To fly with a bending or waving motion, like a flock of birds or insects.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, intransitive, science fiction) To travel or transport across a medium without passing through it normally, as by using a teleporter or time warp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete outside dialects, of an animal) To bring forth (young) prematurely.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, agriculture) To fertilize (low-lying land) by letting the tide, a river, or other water in upon it to deposit silt and alluvial matter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, very rare, obsolete) To throw.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}