{
  "word": "cylinder",
  "etymologies": [
    {
      "description": [
        "From Middle French chilindre, cylindre, from Latin cylindrus, from Ancient Greek κύλινδρος (kúlindros), from κυλίνδω (kulíndō) \"I roll or wallow\" (intransitive). Doublet of calender."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cylinder (plural cylinders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A surface created by projecting a closed two-dimensional curve along an axis intersecting the plane of the curve.",
                  "examples": [
                    "When the two-dimensional curve is a circle, the cylinder is called a circular cylinder. When the axis is perpendicular to the plane of the curve, the cylinder is called a right cylinder. In non-mathematical usage, both right and circular are usually implied."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A solid figure bounded by a cylinder and two parallel planes intersecting the cylinder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any object in the form of a circular cylinder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cylindrical cavity or chamber in a mechanism, such as the counterpart to a piston found in a piston-driven engine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) The space in which a piston travels inside a reciprocating engine or pump.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A container in the form of a cylinder with rounded ends for storing pressurized gas; a gas cylinder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An early form of phonograph recording, made on a wax cylinder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a revolver that contains chambers for the cartridges.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The corresponding tracks on a vertical arrangement of disks in a disk drive considered as a unit of data capacity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cylinder (third-person singular simple present cylinders, present participle cylindering, simple past and past participle cylindered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To calender; to press (paper, etc.) between rollers to make it glossy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}