{
  "word": "courtship",
  "etymologies": [
    {
      "description": [
        "From court (“demonstration of such respect as is traditionally given at court; attention directed to a person in power; behaviour designed to gain favour; politeness of manner; civility towards someone”) +‎ -ship (suffix forming nouns indicating a property or state of being)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "courtship (countable and uncountable, plural courtships)",
          "definitionGroups": [
            {
              "group": "(countable, uncountable) The act of paying court, that is, demonstrating such politeness and respect as is traditionally given at a court (“a formal assembly of a sovereign's retinue”).",
              "entries": [
                {
                  "meaning": "(obsolete) The ceremonial performance of acts of courtesy to a dignitary, etc.",
                  "examples": []
                },
                {
                  "meaning": "The act of wooing a person to enter into a romantic relationship or marriage; hence, the period during which a couple fall in love before their marriage.",
                  "examples": [
                    "Synonyms: see Thesaurus:courtship"
                  ]
                },
                {
                  "meaning": "(by extension) The behaviour exhibited by an animal to attract a mate.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) The act of trying to solicit a favour or support from someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, obsolete) Elegance or propriety of manners fitting for a court; courtliness; (by extension) courteous or polite behaviour; courtesy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) The pursuit of being a courtier, such as exercising diplomacy, finesse, etc.; also, the artifices and intrigues of a court; courtcraft.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}