{
  "word": "muffle",
  "etymologies": [
    {
      "description": [
        "From Middle English muflen (“to muffle”), aphetic alteration of Anglo-Norman amoufler, from Old French enmoufler (“to wrap up, muffle”), from moufle (“mitten”), from Medieval Latin muffula (“a muff”), of Germanic origin (—first recorded in the Capitulary of Aachen in 817 C.E.), from Frankish *muffël (“a muff, wrap, envelope”) from *mauwa (“sleeve, wrap”) (from Proto-Germanic *mawwō (“sleeve”)) + *vël (“skin, hide”) (from Proto-Germanic *fellą (“skin, film, fleece”). Alternate etymology traces the Medieval Latin word to Frankish *molfell (“soft garment made of hide”) from *mol (“softened, forworn”) (akin to Old High German molawēn (“to soften”), Middle High German molwic (“soft”), English mulch) + *fell (“hide, skin”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "muffle (plural muffles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything that mutes or deadens sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A warm piece of clothing for the hands.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) A boxing glove.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kiln or furnace, often electric, with no direct flames (a muffle furnace)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bare end of the nose between the nostrils, especially in ruminants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine with two pulleys to hoist load by spinning wheels, polyspast, block and tackle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "muffle (third-person singular simple present muffles, present participle muffling, simple past and past participle muffled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wrap (a person, face etc.) in fabric or another covering, for warmth or protection; often with up.",
                  "examples": [
                    "He muffled with a cloud his mournful eyes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wrap up or cover (a source of noise) in order to deaden the sound.",
                  "examples": [
                    "to muffle the strings of a drum, or that part of an oar which rests in the rowlock"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mute or deaden (a sound etc.).",
                  "examples": [
                    "The singer's voice was muffled by the thick walls, yet Tyrion knew the verse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To speak indistinctly, or without clear articulation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To prevent seeing, or hearing, or speaking, by wraps bound about the head; to blindfold; to deafen.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}