{
  "word": "foray",
  "etymologies": [
    {
      "description": [
        "From Middle English forrayen (“to pillage”), a back-formation of forrayour, forreour, forrier (“raider, pillager”), from Old French forrier, fourrier, a derivative of fuerre (“provender, fodder, straw”), from Frankish *fōdar (“fodder, sheath”), from Proto-Germanic *fōdrą (“fodder, feed, sheath”), from Proto-Indo-European *patrom (“fodder”), *pat- (“to feed”), *pāy- (“to guard, graze, feed”).",
        "Cognate with Old High German fuotar (German Futter (“fodder, feed”)), Old English fōdor, fōþor (“food, fodder, covering, case, basket”), Dutch voeder (“forage, food, feed”), Danish foder (“fodder, feed”), Icelandic fóður (“fodder, sheath”). More at fodder, food, forage."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "foray (plural forays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden or irregular incursion in border warfare; hence, any irregular incursion for war or spoils; a raid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief excursion or attempt, especially outside one's accustomed sphere.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "foray (third-person singular simple present forays, present participle foraying, simple past and past participle forayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To participate in a foray.",
                  "examples": [
                    "The people of Granada resumed all at once their ancient activity, foraying into the Christian territories, surprising Alhendin and some other places of less importance, and stirring up the spirit of revolt in Guadix and other conquered cities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To do or attempt something outside one's typical area of expertise.",
                  "examples": [
                    "Over the summer, I'd been following the news cycle, foraying into online journalism, and I wrote a couple of pieces on male victims of sexual violence, who are often left to the margins or forgotten altogether in feminist accounts of rape culture."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To scour an area for goods as part of a foray.",
                  "examples": [
                    "He bad to open wyde his brazen gate,  Which long time had bene shut, and out of hond  Proclaymed joy and peace through all his state;  For dead now was their foe which them forrayed late."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}