{
  "word": "alight",
  "etymologies": [
    {
      "description": [
        "From Middle English alighten (“to descend from a place: to dismount, get off; to descend to a place: to arrive or stop (at a place); to land; to drop; to attack; of lightning: to strike; to leap on to, mount; to descend in rank; to cause (someone) to lose rank; to come forth, spring from; to alleviate, relieve; (Christianity) of Jesus: to come down to earth from heaven, become incarnate; to descend (to hell); of the Holy Spirit, angels, miracles, etc.: to descend (from heaven); to descend (upon someone); to appear in a place”) [and other forms], from a merger of:",
        "The English word is analysable as a- (prefix meaning ‘away, from, off, out’) +‎ light (“to ease, lighten; to take off; to unload; to dismount; (archaic) to come down, land; to dismount”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "alight (third-person singular simple present alights, present participle alighting, simple past and past participle alighted or alit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figuratively, obsolete) To make less heavy; to lighten; to alleviate, to relieve.",
                  "examples": [
                    "Synonym: (archaic) alighten"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "Often followed by from or off: to get off an animal which one has been riding; to dismount; to descend or exit from a vehicle; hence, to complete one's journey; to stop.",
                  "examples": [
                    "Synonyms: (archaic) alighten, (archaic) light, disembark, debark, get off, get out, unlight",
                    "He alighted from his horse.",
                    "Passengers are alighting from the carriage."
                  ]
                },
                {
                  "meaning": "(also figuratively) Often followed by at, on, or upon: of something aloft: to descend and settle; to land, to lodge, to rest.",
                  "examples": [
                    "A flying bird alights upon a tree.",
                    "Snow alights on a roof."
                  ]
                },
                {
                  "meaning": "(archaic)",
                  "examples": []
                },
                {
                  "meaning": "To come down or go down; to descend.",
                  "examples": []
                },
                {
                  "meaning": "Often followed by on or upon: of a blow, something thrown, etc.: to land heavily.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) Often followed by on or upon: to find by accident; to chance upon, to come upon.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To arrive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is probably derived partly:",
        "The English word is analysable as a- (prefix meaning ‘away, from, off, out’) +‎ light (“to start (a fire); to burn, set fire to; to become ignited, take fire; to provide light, illuminate; to show the way by means of a light”).",
        "The adjective and adverb are derived from Late Middle English alight (adjective) [and other forms], from Old English ālīht, ālȳht, a past participle form of Old English ālīhtan, ālȳhtan (verb) (see above); but have also been subsequently interpreted as a- (prefix meaning ‘at; in; on’, used to show a condition, manner, or state) +‎ light (“not dark or obscure, bright, clear; highly luminous”)."
      ],
      "adjectives": [
        {
          "description": "alight (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Burning, lit, on fire.",
                  "examples": [
                    "The burning embers and the dry wind quickly set the whole neighbourhood alight.",
                    "The sticks were damp and wouldn’t catch alight."
                  ]
                }
              ]
            },
            {
              "group": "Often followed by with: shining with light; luminous, radiant; also, brightly coloured; vivid.",
              "entries": [
                {
                  "meaning": "Of an electrical light source: switched on and emitting light.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Aglow with activity or emotion.",
                  "examples": [
                    "Her face was alight with happiness."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "alight (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) Chiefly in set alight: in flames, on fire; aflame.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "alight (third-person singular simple present alights, present participle alighting, simple past and past participle alit or alighted) (transitive, also figuratively, archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cast light on (something); to illuminate, to light up.",
                  "examples": [
                    "Synonyms: see Thesaurus:illuminate",
                    "Antonym: darken"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To set light to (something); to set (something) on fire; to ignite, to light.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}