{
  "word": "beak",
  "etymologies": [
    {
      "description": [
        "From Middle English bec, borrowed from Anglo-Norman bec, from Latin beccus, from Gaulish *bekkos, from Proto-Celtic *bekkos (“beak, snout”), possibly from Proto-Indo-European *bak-, *baḱ- (“pointed stick, peg”). Cognate with Breton beg (“beak”). Compare Saterland Frisian Bäk (“mouth; muzzle; beak”); Dutch bek (“beak; bill; neb”)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "beak (plural beaks)",
          "definitionGroups": [
            {
              "group": "Anatomical uses.",
              "entries": [
                {
                  "meaning": "A rigid structure projecting from the front of a bird's face, used for pecking, grooming, foraging, carrying items, eating food, etc.",
                  "examples": []
                },
                {
                  "meaning": "A similar structure forming the jaws of an octopus, turtle, etc.",
                  "examples": []
                },
                {
                  "meaning": "The long projecting sucking mouth of some insects and other invertebrates, as in the Hemiptera.",
                  "examples": []
                },
                {
                  "meaning": "The upper or projecting part of the shell, near the hinge of a bivalve.",
                  "examples": []
                },
                {
                  "meaning": "The prolongation of certain univalve shells containing the canal.",
                  "examples": []
                },
                {
                  "meaning": "(botany) Any process somewhat like the beak of a bird, terminating the fruit or other parts of a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Figurative uses.",
              "entries": [
                {
                  "meaning": "Anything projecting or ending in a point like a beak, such as a promontory of land.",
                  "examples": [
                    "At the townes end, Cuddenbeak, an ancient house of the Bishops, from a well aduanced Promontory, which intituled it Beak"
                  ]
                },
                {
                  "meaning": "(architecture) A continuous slight projection ending in an arris or narrow fillet; that part of a drip from which the water is thrown off.",
                  "examples": []
                },
                {
                  "meaning": "(farriery) A toe clip.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) That part of a ship, before the forecastle, which is fastened to the stem, and supported by the main knee.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) A beam, shod or armed at the end with a metal head or point, and projecting from the prow of an ancient galley, used as a ram to pierce the vessel of an enemy; a beakhead.",
                  "examples": []
                },
                {
                  "meaning": "(entomology) Any of various nymphalid butterflies of the genus Libythea, notable for the beak-like elongation on their heads.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Colloquial uses.",
              "entries": [
                {
                  "meaning": "(slang) The human nose, especially one that is large and pointed.",
                  "examples": []
                },
                {
                  "meaning": "(slang, Southern England) cocaine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "beak (third-person singular simple present beaks, present participle beaking, simple past and past participle beaked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Strike with the beak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Seize with the beak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Northern Ireland) To play truant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unknown; originally cant; first recorded in 17thC; probably related to obsolete cant beck \"constable\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "beak (plural beaks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain) A justice of the peace; a magistrate.",
                  "examples": [
                    "Harry looked rather bulky, you know, Tom, and the slop (policeman) says, 'Hallo, what you got here?' and by [blank] he took us both before the beak."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, British public schools) A schoolmaster (originally, at Eton).",
                  "examples": [
                    "It’s easy enough to be a beak when you’re young and athletic, and can offer the latest University smattering. The difficulty is to keep your place when you get old and stiff, and younger smatterers are pushing up behind you. Crawl into a boarding-house and you’re safe. A master’s life is frightfully tragic."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}