{
  "word": "twilight",
  "etymologies": [
    {
      "description": [
        "From Middle English twilight, twyelyghte, equivalent to twi- (“double, half-”) +‎ light, literally ‘second light, half-light’. Cognate to Scots twa licht, twylicht, twielicht (“twilight”), Low German twilecht, twelecht (“twilight”), Dutch tweelicht (“twilight, dusk”), German Zwielicht (“twilight, dusk”). Compare Old English twēone lēoht (“twilight”)."
      ],
      "adjectives": [
        {
          "description": "twilight (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to or resembling twilight; faintly illuminated; obscure.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "twilight (countable and uncountable, plural twilights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The soft light in the sky seen before the rising and (especially) after the setting of the sun, occasioned by the illumination of the earth’s atmosphere by the direct rays of the sun and their reflection on the earth.",
                  "examples": [
                    "I could just make out her face in the twilight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The time when this light is visible; the period between daylight and darkness.",
                  "examples": [
                    "It was twilight by the time I got back home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) The time when the sun is less than 18° below the horizon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any faint light through which something is seen; an in-between or fading condition.",
                  "examples": [
                    "The twilight of one's life"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "twilight (third-person singular simple present twilights, present participle twilighting, simple past and past participle twilit or twilighted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, poetic) To illuminate faintly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}