{
  "word": "command",
  "etymologies": [
    {
      "description": [
        "From Middle English commanden, commaunden, comaunden, comanden, from Old French comander, from Late Latin commandāre, from Latin commendāre. Compare commend (a doublet), and mandate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "command (countable and uncountable, plural commands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An order to do something.",
                  "examples": [
                    "I was given a command to cease shooting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The right or authority to order, control or dispose of; the right to be obeyed or to compel obedience.",
                  "examples": [
                    "to have command of an army"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "power of control, direction or disposal; mastery.",
                  "examples": [
                    "he had command of the situation",
                    "England has long held command of the sea",
                    "a good command of language"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A position of chief authority; a position involving the right or power to order or control.",
                  "examples": [
                    "General Smith was placed in command."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of commanding; exercise or authority of influence.",
                  "examples": [
                    "Command cannot be otherwise than savage, for it implies an appeal to force, should force be needful."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A body or troops, or any naval or military force, under the control of a particular officer; by extension, any object or body in someone's charge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dominating situation; range or control or oversight; extent of view or outlook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A directive to a computer program acting as an interpreter of some kind, in order to perform a specific task.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The degree of control a pitcher has over his pitches.",
                  "examples": [
                    "He's got good command tonight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A command performance.",
                  "examples": [
                    "Atkinson  […]  had hinted to me that the Duke of Richmond was so delighted with my acting that he should not be surprised if there was a second command."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "command (third-person singular simple present commands, present participle commanding, simple past and past participle commanded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To order, give orders; to compel or direct with authority.",
                  "examples": [
                    "The soldier was commanded to cease firing.",
                    "The king commanded his servant to bring him dinner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To have or exercise supreme power, control or authority over, especially military; to have under direction or control.",
                  "examples": [
                    "to command an army or a ship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To require with authority; to demand, order, enjoin.",
                  "examples": [
                    "he commanded silence"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to dominate through ability, resources, position etc.; to overlook.",
                  "examples": [
                    "Bridges commanded by a fortified house. (Motley.)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exact, compel or secure by influence; to deserve, claim.",
                  "examples": [
                    "A good magistrate commands the respect and affections of the people.",
                    "Justice commands the respect and affections of the people.",
                    "The best goods command the best price.",
                    "This job commands a salary of £30,000."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hold, to control the use of.",
                  "examples": [
                    "The fort commanded the bay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To have a view, as from a superior position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To direct to come; to bestow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}