{
  "word": "please",
  "etymologies": [
    {
      "description": [
        "From Middle English plesen, plaisen, borrowed from Old French plaise, conjugated form of plaisir or plaire, from Latin placeō (“to please, to seem good”), from the Proto-Indo-European *pleHk- (“pleasingness, permission”). Displaced native English queme (“to please, satisfy”), Middle English biluvien (“to please, delight”), Middle English liken (“to like, please”), Middle English lusten, listen (“to be pleasing, delight”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "please (third-person singular simple present pleases, present participle pleasing, simple past and past participle pleased)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make happy or satisfy; to give pleasure to.",
                  "examples": [
                    "Her presentation pleased the executives.",
                    "I'm pleased to see you've been behaving yourself.",
                    "Our new range of organic foods is sure to please."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, ergative) To desire; to will; to be pleased by.",
                  "examples": [
                    "Just do as you please.",
                    "He doesn't think, he just says whatever he pleases."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Short for if you please, an intransitive, ergative form taken from if it please you which is a calque of French s'il vous plaît, which replaced pray."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "please (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used to make a polite request.",
                  "examples": [
                    "Please, pass the bread.",
                    "Would you please sign this form?",
                    "Could you tell me the time, please?",
                    "May I take your order, please?",
                    "Give, please, directions to White House. (nonstandard usage)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used as an affirmative to an offer.",
                  "examples": [
                    "—May I help you? —(Yes,) please."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An expression of annoyance or impatience.",
                  "examples": [
                    "Oh, please, do we have to hear that again?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Semantic loan from German bitte (“please; excuse me”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}