{
  "word": "overly",
  "etymologies": [
    {
      "description": [
        "over +‎ -ly"
      ],
      "adjectives": [
        {
          "description": "overly (comparative more overly, superlative most overly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Superficial; not thorough; careless, negligent, inattentive.",
                  "examples": [
                    "The curteous Citizen bad me to his feast,",
                    "With hollow words, and ouerly request:",
                    "Come, will ye dine with me this Holy day?",
                    "I yeelded, tho he hop’d I would say Nay:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Having a sense of superiority, haughty.",
                  "examples": [
                    "Those that know no better, may rejoyce and exult in these worldly contentments; but those, who have had but a blink of the beauty of heaven, can look upon them no otherwise, than with an overly contemptuousnesse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Excessive; too great.",
                  "examples": [
                    "[…]  there appears a very chilling want of open-heartedness on the part of Owen, produced perhaps by the somewhat overly and certainly most ungracious resentments of Baxter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "overly (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes proscribed) To an excessive degree.",
                  "examples": [
                    "Parents can be overly protective of their children.",
                    "Synonyms: too, excessively, superfluously"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Superficially.",
                  "examples": [
                    "[…]  let him not touche the quarters nor the heeles at al, vnlesse it be to make the seat of the shoe playne, & let that be done so superficially or ouerly as maye be, so shall the houes remayne alwayes strong."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Carelessly, without due attention.",
                  "examples": [
                    "[…]  you shall finde this, that all remissenesse, when a man doth a thing remissely, and ouerly, and perfunctorily, it argues alway a diuided intention, it is an argument that the whole minde is not set on it, but that the intention is distracted, and bestowed on other things:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) With a sense of superiority, haughtily.",
                  "examples": [
                    "The third [vice] is Arrogancie, and the fourth Pride, two vices neer a kinne, Cosen germans  […]  when men shall arrogate much unto themselves; looking overly and superciliously upon others."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}