{
  "word": "occupy",
  "etymologies": [
    {
      "description": [
        "From Middle English occupien, occupyen, borrowed from Old French occuper, from Latin occupāre (“to take possession of, seize, occupy, take up, employ”), from ob (“to, on”) + capiō (“to take”), ultimately from Proto-Indo-European *keh₂p- (“to seize, grab”). Doublet of occupate, now obsolete."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "occupy (third-person singular simple present occupies, present participle occupying, simple past and past participle occupied)",
          "definitionGroups": [
            {
              "group": "(transitive, of time) To take or use.",
              "entries": [
                {
                  "meaning": "To fill.",
                  "examples": [
                    "The film occupied three hours of my time."
                  ]
                },
                {
                  "meaning": "To possess or use the time or capacity of; to engage the service of.",
                  "examples": [
                    "The film occupied me for three hours.",
                    "I occupy myself with gardening for a few hours every day."
                  ]
                },
                {
                  "meaning": "To fill or hold (an official position or role).",
                  "examples": [
                    "I occupy the post of deputy cat catcher."
                  ]
                },
                {
                  "meaning": "To hold the attention of.",
                  "examples": [
                    "I occupied her friend while he made his proposal."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To take or use space.",
              "entries": [
                {
                  "meaning": "To fill space.",
                  "examples": [
                    "The historic mansion occupied two city blocks."
                  ]
                },
                {
                  "meaning": "To live or reside in.",
                  "examples": []
                },
                {
                  "meaning": "(military) To have, or to have taken, possession or control of (a territory).",
                  "examples": [
                    "The Japanese can occupy but cannot hold, and what they can hold they cannot hold long, was the opinion of General Pai Chung-hsi, Chief of the General Staff of the Chinese Army,  […]"
                  ]
                },
                {
                  "meaning": "(surveying) To place the theodolite or total station at (a point).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To have sexual intercourse with.",
                  "examples": [
                    "OCCUPY, [sensu obsc.] To possess, or enjoy.\nThese villains will make the word captain, as odious as the word occupy. 2 Hen. IV, ii, 4.\nGroyne, come of age, his state sold out of hand\nFor 's whore; Groyne still doth occupy his land. B. Jons. Epigr., 117.\nMany, out of their own obscene apprehensions, refuse proper and fit words, as occupy, nature, and the like. Ibid., Discoveries, vol. vii, p. 119.",
                    "It is so used also in Rowley's New Wonder, Anc. Dr., v, 278."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To do business in; to busy oneself with.",
                  "examples": [
                    "not able to occupy their old crafts"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To use; to expend; to make use of.",
                  "examples": [
                    "They occupy not money themselves."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}