{
  "word": "democracy",
  "etymologies": [
    {
      "description": [
        "From Middle French democratie (French démocratie), from Medieval Latin dēmocratia, from Ancient Greek δημοκρᾰτῐ́ᾱ (dēmokratíā).\nSurface analysis: demo- (“people”) +‎ -cracy (“rule”)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "democracy (countable and uncountable, plural democracies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Rule by the people, especially as a form of government; either directly or through elected representatives (representative democracy).",
                  "examples": [
                    "And the essential value and power of Democracy consists in this,—that it combines, as far as possible, power and organization ; THE SPIRIT, MANHOOD, is at one with THE BODY, ORGANIZATION. [....] Democracy is Government by the People."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, government) A government under the direct or representative rule of the people of its jurisdiction.",
                  "examples": [
                    "Of course, the Russians think it is something else because they say the Russians have a democracy and it is plain that their government is not what the Americans regard as a democracy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A state with a democratic system of government.",
                  "examples": [
                    "The United States was founded as a republic, not a democracy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Belief in political freedom and equality; the \"spirit of democracy\".",
                  "examples": [
                    "As states of the human spirit democracy, righteousness, and faith have much in common and may be cultivated by the same means..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}