{
  "word": "accommodation",
  "etymologies": [
    {
      "description": [
        "From French accommodation, from Latin accommodātiō (“adjustment, accommodation, compliance”), from accommodō (“adapt, put in order”). Superficially accommodate +‎ -ion. The sense of \"lodging\" was first attested in 1600."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "accommodation (countable and uncountable, plural accommodations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, usually a mass noun) Lodging in a dwelling or similar living quarters afforded to travellers in hotels or on cruise ships, or prisoners, etc.",
                  "examples": [
                    "The accommodations at that hotel were quite luxurious."
                  ]
                }
              ]
            },
            {
              "group": "(physical) Adaptation or adjustment.",
              "entries": [
                {
                  "meaning": "(countable, uncountable, followed by to) The act of fitting or adapting, or the state of being fitted or adapted; adaptation; adjustment.",
                  "examples": [
                    "It is true, the organization of the humane and animal Body, with accommodation to their several functions and offices, is certainly fitted with the most curious and exact Mechanism imaginable"
                  ]
                },
                {
                  "meaning": "(countable, uncountable) A convenience, a fitting, something satisfying a need.",
                  "examples": []
                },
                {
                  "meaning": "(countable, physiology, biology) The adaptation or adjustment of an organism, organ, or part.",
                  "examples": []
                },
                {
                  "meaning": "(countable, medicine) The adjustment of the eye to a change of the distance from an observed object.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(personal) Adaptation or adjustment.",
              "entries": [
                {
                  "meaning": "(countable, uncountable) Willingness to accommodate; obligingness.",
                  "examples": []
                },
                {
                  "meaning": "(countable, uncountable) Adjustment of differences; state of agreement; reconciliation; settlement; compromise.",
                  "examples": [
                    "Some of the recent literature on the Germanic settlements reads like an account of a tea party at the Roman vicarage. A shy newcomer to the village, who is a useful prospect for the cricket team, is invited in. There is a brief moment of awkwardness, while the host finds an empty chair and pours a fresh cup of tea; but the conversation, and village life, soon flow on. The accommodation that was reached between invaders and invaded in the fifth- and sixth-century West was very much more difficult, and more interesting, than this."
                  ]
                },
                {
                  "meaning": "(countable) The application of a writer's language, on the ground of analogy, to something not originally referred to or intended.",
                  "examples": [
                    "It is probable to my apprehension, that many of those quotations were intended by the writers of the New Testament as nothing more than accommodations."
                  ]
                },
                {
                  "meaning": "(countable, commerce) A loan of money.",
                  "examples": []
                },
                {
                  "meaning": "(countable, commerce) An accommodation bill or note.",
                  "examples": []
                },
                {
                  "meaning": "(countable, law) An offer of substitute goods to fulfill a contract, which will bind the purchaser if accepted.",
                  "examples": []
                },
                {
                  "meaning": "(theology) An adaptation or method of interpretation which explains the special form in which the revelation is presented as unessential to its contents, or rather as often adopted by way of compromise with human ignorance or weakness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, geology) The place where sediments can make, or have made, a sedimentation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, sociolinguistics) Modification(s) to make one's way of communicating similar to others involved in a conversation or discourse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}