{
  "word": "yoke",
  "etymologies": [
    {
      "description": [
        "From Middle English yok, yoke, ȝok from Old English ġeoc (“yoke”), from Proto-Germanic *juką (“yoke”), from Proto-Indo-European *yugóm (“yoke”), from *yewg- (“to join; to tie together, yoke”). Doublet of yuga, jugum, yoga and possibly yogh.",
        "Senses 3.1 (“area of arable land”) and 3.2 (“amount of work done with draught animals”) probably referred to the area of land that could generally be ploughed by yoked draught animals within a given time."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "yoke (plural yokes)",
          "definitionGroups": [
            {
              "group": "Senses relating to a frame around the neck.",
              "entries": [
                {
                  "meaning": "A bar or frame by which two oxen or other draught animals are joined at their necks enabling them to pull a cart, plough, etc.; (by extension) a device attached to a single draught animal for the same purpose.",
                  "examples": []
                },
                {
                  "meaning": "Any of various linking or supporting objects that resembles a yoke (sense 1.1); a crosspiece, a curved bar, etc.",
                  "examples": [
                    "Synonyms: (Sri Lanka, dated) pingo, milkmaid's yoke, shoulder pole"
                  ]
                },
                {
                  "meaning": "A pole carried on the neck and shoulders of a person, used for carrying a pair of buckets, etc., one at each end of the pole; a carrying pole. [from 17th c.]",
                  "examples": [
                    "Synonyms: (Sri Lanka, dated) pingo, milkmaid's yoke, shoulder pole"
                  ]
                },
                {
                  "meaning": "(aviation) Any of various devices with crosspieces used to control an aircraft; specifically, the control column. [from 20th c.]",
                  "examples": [
                    "Synonym: control wheel"
                  ]
                },
                {
                  "meaning": "(video games) A similar device used as a game controller.",
                  "examples": []
                },
                {
                  "meaning": "(bodybuilding) Well-developed muscles of the neck and shoulders.",
                  "examples": []
                },
                {
                  "meaning": "(clothing) The part of an item of clothing which fits around the shoulders or the hips from which the rest of the garment hangs, and which is often distinguished by having a double thickness of material, or decorative flourishes. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(electrical engineering) Originally, a metal piece connecting the poles of a magnet or electromagnet; later, a part of magnetic circuit (such as in a generator or motor) not surrounded by windings (“wires wound around the cores of electrical transformers”).",
                  "examples": []
                },
                {
                  "meaning": "(electronics) The electromagnetic coil that deflects the electron beam in a cathode ray tube. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(glassblowing) A Y-shaped stand used to support a blowpipe or punty while reheating in the glory hole.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) A fitting placed across the head of the rudder with a line attached at each end by which a boat may be steered; in modern use it is primarily found in sailing canoes and kayaks. [from 18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(chiefly US) A frame or convex crosspiece from which a bell is hung.",
                  "examples": []
                },
                {
                  "meaning": "(historical)",
                  "examples": []
                },
                {
                  "meaning": "A collar placed on the neck of a conquered person or prisoner to restrain movement.",
                  "examples": []
                },
                {
                  "meaning": "(agriculture) A frame placed on the neck of an animal such as a cow, pig, or goose to prevent passage through a fence or other barrier. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Ancient Rome) Chiefly in pass under the yoke: a raised yoke (sense 1.1), or a symbolic yoke formed from two spears installed upright in the ground with another spear connecting their tops, under which a defeated army was made to march as a sign of subjugation.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Senses relating to a pair of harnessed draught animals.",
              "entries": [
                {
                  "meaning": "(chiefly historical) A pair of draught animals, especially oxen, yoked together to pull something.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) A pair of things linked in some way.",
                  "examples": []
                },
                {
                  "meaning": "(Ireland, Scotland) A carriage, a horse and cart; (by extension, generally) a car or other vehicle. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Ireland, informal) A miscellaneous object; a gadget. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Ireland, informal) A chap, a fellow.",
                  "examples": []
                },
                {
                  "meaning": "(Ireland, slang) A pill of a psychoactive drug.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Senses relating to quantities, and other extended uses.",
              "entries": [
                {
                  "meaning": "(chiefly Kent, archaic) An area of arable land, specifically one consisting of a quarter of a suling, or around 50–60 acres (20–24 hectares); hence, a small manor or piece of land.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly England, regional (especially Kent), and Scotland, historical) An amount of work done with draught animals, lasting about half a day; (by extension) an amount or shift of any work. [from 18th c.]",
                  "examples": [
                    "to work two yokes(literally, “to work both morning and afternoon”)"
                  ]
                },
                {
                  "meaning": "(figuratively)",
                  "examples": []
                },
                {
                  "meaning": "From sense 1.1: a bond of love, especially marriage; also, a bond of friendship or partnership; an obligation or task borne by two or more people.",
                  "examples": []
                },
                {
                  "meaning": "From sense 1.3.1: something which oppresses or restrains a person; a burden.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English yoken, yoke, ȝoken (“to put a harness or yoke on a draught animal or pair of such animals, to yoke; to attach (an animal to a cart, plough, etc.) with a yoke; to lock (arms) in wrestling; to bind (oneself or someone) to something”) [and other forms], from Old English ġeocian, iucian, from Old English ġeoc (“yoke”) (see etymology 1) + -ian (suffix forming verbs from adjectives and nouns)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "yoke (third-person singular simple present yokes, present participle yoking, simple past and past participle yoked)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To join (several draught animals) together with a yoke; also, to fasten a yoke (on one or more draught animals) to pull a cart, plough, etc.; or to attach (a cart, plough, etc.) to a draught animal.",
                  "examples": []
                },
                {
                  "meaning": "To put (one's arm or arms) around someone's neck, waist, etc.; also, to surround (someone's neck, waist, etc.) with one's arms.",
                  "examples": []
                },
                {
                  "meaning": "To put (something) around someone's neck like a yoke; also, to surround (someone's neck) with something.",
                  "examples": []
                },
                {
                  "meaning": "(historical)",
                  "examples": []
                },
                {
                  "meaning": "To place a collar on the neck of (a conquered person or prisoner) to restrain movement.",
                  "examples": []
                },
                {
                  "meaning": "(agriculture) To place a frame on the neck of (an animal such as a cow, pig, or goose) to prevent passage through a fence or other barrier.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": []
                },
                {
                  "meaning": "To bring (two or more people or things) into a close relationship (often one that is undesired); to connect, to link, to unite.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To bring into or keep (someone) in bondage or a state of submission; to enslave; to confine, to restrain; to oppress, to subjugate.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Scotland, archaic, passive) To be joined to (another person) in wedlock (often with the implication that it is a burdensome state); to be or become married to (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To be or become connected, linked, or united in a relationship; to have dealings with.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Scotland, obsolete) To be or become joined in wedlock; to be married, to wed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See yolk."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "yoke",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of yolk.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}