{
  "word": "flue",
  "etymologies": [
    {
      "description": [
        "From Middle English flue, flewe (“mouthpiece of a hunting horn”), of uncertain origin. Perhaps a back-formation from Middle English *flews (mistaken as a plural), from Old English flēwsa (“a flow, flowing, flux”). Alternatively, perhaps an alteration of Middle English floute, fleute, flote (“a pipe”), see English flute. Compare also Middle Dutch vloegh (“groove, channel, flute of a fluted column”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flue (plural flues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pipe or duct that carries gaseous combustion products away from the point of combustion (such as a furnace).",
                  "examples": [
                    "It has frequently been a subject of inquiry, whether the ancients were acquainted with chimneys, or open fire-places. In the houses discovered at Herculaneum and Pompeii, there are no chimneys; they all appear to have been warmed by furnaces and flues."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enclosed passageway in which to direct air or other gaseous current along.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, countable and uncountable) A woolly or downy substance; down, nap; a piece of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In an organ flue pipe, the opening between the lower lip and the languet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [
        {
          "description": "flue (comparative more flue, superlative most flue)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) Alternative form of flew (“shallow, flat”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}