{
  "word": "man",
  "etymologies": [
    {
      "description": [
        "From Middle English man, from Old English mann m (“human being, person, man”), from Proto-West Germanic *mann, from Proto-Germanic *mann- m (“human being, man”). Doublet of Manu."
      ],
      "adjectives": [
        {
          "description": "man (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Only used in man enough",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "man (plural men)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An adult male human.",
                  "examples": [
                    "The show is especially popular with middle-aged men."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) All human males collectively: mankind.",
                  "examples": [
                    "Unsurprisingly, if modern man is a sort of camera, modern woman is a picture."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A human, a person regardless of gender or sex, usually an adult. (See usage notes.)",
                  "examples": [
                    "every man for himself"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) All humans collectively: mankind, humankind, humanity. (Sometimes capitalized as Man.)",
                  "examples": [
                    "How did God create man?",
                    "God created man male and female, after his own image, in knowledge, righteousness, and holiness, with dominion over the creatures."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anthropology, archaeology, paleontology) A member of the genus Homo, especially of the species Homo sapiens.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male person, usually an adult; a (generally adult male) sentient being, whether human, supernatural, elf, alien, etc.",
                  "examples": [
                    "For God is holde a ryghtwys man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An adult male who has, to an eminent degree, qualities considered masculine, such as strength, integrity, and devotion to family; a mensch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete, uncommon) Manliness; the quality or state of being manly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A husband.",
                  "examples": [
                    "In the next place, every wife ought to answer for her man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male lover; a boyfriend.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male enthusiast or devotee; a male who is very fond of or devoted to a specified kind of thing. (Used as the last element of a compound.)",
                  "examples": [
                    "Some people prefer apple pie, but me, I’m a cherry pie man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, usually male, who has duties or skills associated with a specified thing. (Used as the last element of a compound.)",
                  "examples": [
                    "I wanted to be a guitar man on a road tour, but instead I’m a flag man on a road crew."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, usually male, who can fulfill one's requirements with regard to a specified matter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male who belongs to a particular group: an employee, a student or alumnus, a representative, etc.",
                  "examples": [
                    "When President Roosevelt goes walking in the country about Washington he is always accompanied by two Secret Service men."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An adult male servant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A vassal; a subject.",
                  "examples": [
                    "Like master, like man. (old proverb)",
                    "all the king's men"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece or token used in board games such as chess.",
                  "examples": [
                    "The white men are always put on that side of the board which commences by row I, and the black men are placed opposite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A term of familiar address often implying on the part of the speaker some degree of authority, impatience, or haste.",
                  "examples": [
                    "Come on, man, we've got no time to lose!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A friendly term of address usually reserved for other adult males.",
                  "examples": [
                    "Hey, man, how's it goin'?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A player on whom another is playing, with the intent of limiting their attacking impact.",
                  "examples": [
                    "\"It was a brutal return to football for Brisbane Lions defender Harris Andrews as his man Tom Hawkins booted seven goals but Lions Coach Chris Fagan said the team's defensive faults, rather than the backman's, allowed the big Cat to dominate.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English mannen, from Old English mannian, ġemannian (“to man, supply with men, populate, garrison”), from mann (“human being, man”). Cognate with Dutch bemannen (“to man”), German bemannen (“to man”), Danish bemande (“to man”), Swedish bemanna (“to man”), Icelandic manna (“to supply with men, man”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "man (third-person singular simple present mans, present participle manning, simple past and past participle manned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To supply (something) with staff or crew (of either sex).",
                  "examples": [
                    "The ship was manned with a small crew."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take up position in order to operate (something).",
                  "examples": [
                    "Man the machine guns!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, possibly dated) To brace (oneself), to fortify or steel (oneself) in a manly way. (Compare man up.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To wait on, attend to or escort.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, chiefly falconry) To accustom (a raptor or other type of bird) to the presence of people.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of manual"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}