{
  "word": "becket",
  "etymologies": [
    {
      "description": [
        "Compare Dutch bek (“beak”) beak, and English beak."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "becket (plural beckets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A short piece of rope spliced to form a circle",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A loop of rope with a knot at one end to catch in an eye at the other end. Used to secure oars etc. at their place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sewing) A loop of thread, typically braided, attached at each end to a jacket. Used to pass through the brooch bar of medals to affix them to the jacket without damaging it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The clevis of a pulley block.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An eye in the end of a rope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, slang) A pocket in clothing.",
                  "examples": [
                    "At the same time, mind, I must have a bit of a frolic occasionally, for that's all the pleasure I has, when I gets a little chink in my becket; and ye know, too, that I don t care much for that stuff, for a dollar goes with me as fur as a gold ounce does with you, when ye put on your grand airs, and shower it about like a nabob."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A method of joining fabric, for example the doors of a tent, by interlacing loops of cord (beckets) through eyelet holes and adjacent loops.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(England, dialect, historical) A spade for digging turf in the Fens.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) chough (the bird)",
                  "examples": [
                    "Cornish choughs, or \"beckets\" as they are sometimes known, are seen on Thomas Wolsey's coat of arms, they are a reference to his namesake, Thomas Becket."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}