{
  "word": "drove",
  "etymologies": [
    {
      "description": [
        "From Middle English drove, drof, draf, from Old English drāf (“action of driving; a driving out, expulsion; drove, herd, band; company, band; road along which cattle are driven”), from Proto-Germanic *draibō (“a drive, push, movement, drove”), from Proto-Indo-European *dʰreybʰ- (“to drive, push”), from Proto-Indo-European *dʰer- (“to support”). Cognate with Scots drave, dreef (“drove, crowd”), Dutch dreef (“a walkway, wide road with trees, drove”), Middle High German treip (“a drove”), Swedish drev (“a drive, drove”), Icelandic dreif (“a scattering, distribution”). More at drive."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drove (plural droves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cattle drive or the herd being driven by it; thus, a number of cattle driven to market or new pastures.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, by extension, usually in the plural) A large number of people on the move (literally or figuratively).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) A group of hares.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A road or track along which cattle are habitually driven; a drove road.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A narrow drain or channel used in the irrigation of land.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broad chisel used to bring stone to a nearly smooth surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The grooved surface of stone finished by the drove chisel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From earlier drave, from Middle English drave, draf, from Old English drāf, first and third person singular indicative preterite of drīfan (“to drive”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "drove",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense of drive",
                  "examples": []
                }
              ]
            }
          ]
        },
        {
          "description": "drove (third-person singular simple present droves, present participle droving, simple past and past participle droved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To herd cattle; particularly over a long distance.",
                  "examples": [
                    "Synonym: drive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To finish (stone) with a drove chisel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}