{
  "word": "rooted",
  "etymologies": [
    {
      "description": [],
      "adjectives": [
        {
          "description": "rooted (comparative more rooted, superlative most rooted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having roots, or certain type of roots.",
                  "examples": [
                    "deep-rooted"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fixed in one position; immobile; unable to move.",
                  "examples": [
                    "She stayed rooted in place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Ingrained, as through repeated use; entrenched; habitual or instinctive.",
                  "examples": [
                    "He will immediately break in on their moſt rooted prejudices ; and with a kind of malignant ſatisfaction hack their darling notions with unſparing rigour and unbluſhing inſolence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, usually with \"in\") Having a basic or fundamental connection (to a thing); based, originating (from).",
                  "examples": [
                    "Proper Philadelphians, especially before they became Episcopalians, and the unfashionable branches of their families to this day are surely more rooted in Westtown than St. Paul′s, the fashionable favorite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, graph theory, of a tree or graph) Having a root.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) In trouble or in strife, screwed.",
                  "examples": [
                    "I am absolutely rooted if Ferris finds out about this"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, slang) Broken, damaged, non-functional.",
                  "examples": [
                    "I'm going to have to call a mechanic, my car's rooted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, not comparable) Having a root (superuser) account that has been compromised.",
                  "examples": [
                    "You are rooted. All your base are belong to us."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rooted",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense and past participle of root",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}