{
  "word": "hunch",
  "etymologies": [
    {
      "description": [
        "Assibilated variant of hunk, of uncertain origin.",
        "Alternatively, a derivative of hump, via an earlier Middle English *hunche, *humpchin, from *hump +‎ -chin, -chen (diminutive suffix), equivalent to hump +‎ -kin. In the sense of an intuitive impression, said to be from the old gambling superstition that it brings luck to touch the hump of a hunchback."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hunch (plural hunches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hump; a protuberance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stooped or curled posture; a slouch.",
                  "examples": [
                    "The old man walked with a hunch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A theory, idea, or guess; an intuitive impression that something will happen.",
                  "examples": [
                    "I have a hunch they'll find a way to solve the problem."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hunk; a lump; a thick piece.",
                  "examples": [
                    "a hunch of bread"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A push or thrust, as with the elbow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hunch (third-person singular simple present hunches, present participle hunching, simple past and past participle hunched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bend the top of one's body forward while raising one's shoulders.",
                  "examples": [
                    "Synonyms: slouch, stoop, lean",
                    "Don't hunch over your computer if you want to avoid neck problems."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise (one's shoulders) (while lowering one's head or bending the top of one's body forward); to curve (one's body) forward (sometimes followed by up).",
                  "examples": [
                    "They stood outside the door hunching themselves against the rain and puffing on their cigarettes.",
                    "He hunched up his shoulders and stared down at the ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To walk (somewhere) while hunching one's shoulders.",
                  "examples": [
                    "Synonym: slouch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To thrust a hump or protuberance out of (something); to crook, as the back.",
                  "examples": [
                    "[…]  thou art all one errour; soul and body.",
                    "The first young tryal of some unskill’d Pow’r;",
                    "Rude in the making Art, and Ape of Jove.",
                    "Thy crooked mind within hunch’d out thy back;",
                    "And wander’d in thy limbs:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To push or jostle with the elbow; to push or thrust against (someone).",
                  "examples": [
                    "Synonyms: elbow, nudge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial) To have a hunch, or make an intuitive guess.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}