{
  "word": "calve",
  "etymologies": [
    {
      "description": [
        "From Old English cealfian, from cealf (“calf”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "calve (third-person singular simple present calves, present participle calving, simple past and past participle calved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) to give birth to a calf",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) to assist in a cow's giving birth to a calf",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to give birth to (a calf)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively, especially of an ice shelf, a glacier, an ice sheet, or even an iceberg) to shed a large piece, e.g. an iceberg or a smaller block of ice (coming off an iceberg)",
                  "examples": [
                    "The glacier was starting to calve even as we watched."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively, especially of an iceberg) to break off",
                  "examples": [
                    "The sea was dangerous because of icebergs calving off the nearby glacier.",
                    "When an iceberg breaks off from a large ice shelf along an existing fissure, it looks like a large, flat rectangle. Typically, only 10 percent of an iceberg is visible above the water. As it calved, the iceberg may have been smooth and flat underneath, but ocean currents would have quickly changed it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively, especially of an ice shelf, a glacier, an ice sheet, or even an iceberg) to shed (a large piece, e.g. an iceberg); to set loose (a mass of ice), e.g. a block of ice (coming off an iceberg)",
                  "examples": [
                    "The glacier was starting to calve an iceberg even as we watched."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}