{
  "word": "apparel",
  "etymologies": [
    {
      "description": [
        "Old French apareillier"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "apparel (countable and uncountable, plural apparels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clothing.",
                  "examples": [
                    "fresh in his new apparel, proud and young"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Aspect, guise, form.",
                  "examples": [
                    "At public devotions, her winning modesty, her resigned carriage, made virtue and religion appear with new ornaments, and in the natural apparel of simplicity and beauty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small ornamental piece of embroidery worn on albs and some other ecclesiastical vestments.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The furniture of a ship, such as masts, sails, rigging, anchors, guns, etc.",
                  "examples": [
                    "And if there is need of any thing, such as ship's apparel or other necessaries, and the merchants desire to purchase them, they may do so, and when the voyage is concluded, the merchants may claim for themselves the things which they have bought for the ship or vessel"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "apparel (third-person singular simple present apparels, present participle appareling or apparelling, simple past and past participle appareled or apparelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dress or clothe; to attire.",
                  "examples": [
                    "They which are gorgeously appareled, and live delicately, are in kings' courts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with apparatus; to equip; to fit out.",
                  "examples": [
                    "ships appareled to fight"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dress with external ornaments; to cover with something ornamental",
                  "examples": [
                    "trees appareled with flowers",
                    "a garden appareled with greenery"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}