{
  "word": "expansion",
  "etymologies": [
    {
      "description": [
        "From French expansion, from Latin expānsiō. Surface analysis: expand +‎ -sion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "expansion (countable and uncountable, plural expansions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "An act, process, or instance of expanding.",
              "entries": [
                {
                  "meaning": "The fractional change in unit length per unit length per unit temperature change.",
                  "examples": [
                    "Look up the expansion of 1018 steel at stick welding temps and figure out how far this thing's gonna bend once we weld it up.",
                    "Synonym: coefficient of thermal expansion",
                    "Hypernym: temperature coefficient"
                  ]
                },
                {
                  "meaning": "(building) A new addition.",
                  "examples": [
                    "My new office is in the expansion behind the main building.",
                    "Synonym: annex"
                  ]
                },
                {
                  "meaning": "A product to be used with a previous product.",
                  "examples": [
                    "This expansion requires the original game board."
                  ]
                },
                {
                  "meaning": "That which is expanded; expanse; extended surface.",
                  "examples": []
                },
                {
                  "meaning": "(steam engines) The operation of steam in a cylinder after its communication with the boiler has been cut off, by which it continues to exert pressure upon the moving piston.",
                  "examples": []
                },
                {
                  "meaning": "(writing, editing, audio content) The replacement of a short name (e.g., acronym, initialism, alphanumeric symbol, abbreviation) with the longer name that is synonymous with it, as when spelling out acronyms to ensure clarity for a general audience.",
                  "examples": [
                    "Expansion of acronyms is often helpful for nonexpert readers (anacronyms excluded)."
                  ]
                },
                {
                  "meaning": "The string of text thus substituted.",
                  "examples": [
                    "The acronym \"FNDs\" can mean either \"functional neurologic disorders\" or \"focal neurologic deficits\", so you'd better use the expansion instead of the acronym, for clarity in this context; readers of this paragraph may not have read, or remember, which definition you used 40 pages earlier."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}