{
  "word": "sew",
  "etymologies": [
    {
      "description": [
        "From Middle English sewen, seowen, sowen, from Old English siwian, seowian, seowan (“to sew, mend, patch, knit together, link, unite”), from Proto-Germanic *siwjaną (“to sew”), from Proto-Indo-European *syewh₁- (“to sew”). Cognate with Scots sew (“to sew”), North Frisian saie, sei (“to sew”), Saterland Frisian säie (“to sew”), Danish sy, Polish szyć, Russian шить (šitʹ), Swedish sy, Latin suō, Sanskrit सीव्यति (sī́vyati). Related to seam."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sew (third-person singular simple present sews, present participle sewing, simple past sewed, past participle sewn or sewed or (obsolete) sewen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use a needle to pass thread repeatedly through (pieces of fabric) in order to join them together.",
                  "examples": [
                    "Balls were first made of grass or leaves held together by strings, and later of pieces of animal skin sewn together and stuffed with feathers or hay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use a needle to pass thread repeatedly through pieces of fabric in order to join them together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Followed by into: to enclose by sewing.",
                  "examples": [
                    "to sew money into a bag"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Back-formation from sewer (“a drain”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sew (third-person singular simple present sews, present participle sewing, simple past and past participle sewed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To drain the water from.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Of a ship, to be grounded.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English sew (“broth”), from Old English sēaw (“sap, juice”), from Proto-West Germanic *sauw."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sew (plural sews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Broth, gravy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}