{
  "word": "organ",
  "etymologies": [
    {
      "description": [
        "From Middle English organe, from Old French organe, from Latin organum, from Ancient Greek ὄργανον (órganon, “an instrument, implement, tool, also an organ of sense or apprehension, an organ of the body, also a musical instrument, an organ”), from Proto-Indo-European *werǵ-. Doublet of organon, organum, and orgue."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "organ (plural organs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The larger part of an organism, composed of tissues that perform similar functions.",
                  "examples": [
                    "bodily organs",
                    "vital organ"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A body of an organization dedicated to the performing of certain functions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical instrument that has multiple pipes which play when a key is pressed (the pipe organ), or an electronic instrument designed to replicate such.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An official magazine, newsletter, or similar publication of an organization.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for organ pipe cactus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A government organization; agency; authority.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The penis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, military) An Asian form of mitrailleuse.",
                  "examples": [
                    "Lieutenant Roberts was also severely wounded by a missile, or weapon called an Organ, which is composed of about thirty-six gun barrels so joined as to fire at once."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "organ (third-person singular simple present organs, present participle organing, simple past and past participle organed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To supply with an organ or organs; to fit with organs.",
                  "examples": [
                    "Thou art elemented and organ'd for other apprehensions."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}