{
  "word": "unravel",
  "etymologies": [
    {
      "description": [
        "From un- +‎ ravel. Compare Dutch ontrafelen (“to unravel”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "unravel (third-person singular simple present unravels, present participle unravelling or (US) unraveling, simple past and past participle unravelled or (US) unraveled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To separate the threads (of); disentangle.",
                  "examples": [
                    "Synonyms: disentangle, unsnarl",
                    "Stop playing with the seam of the tablecloth! You'll unravel it.",
                    "Mother couldn't unravel the ball of wool after the cat had played with it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of threads etc.) To become separated; (of something woven, knitted, etc.) to come apart.",
                  "examples": [
                    "[…]  the burning threads",
                    "Of woven cloud unravel in pale air:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To clear from complication or difficulty; to unfold; to solve.",
                  "examples": [
                    "Synonyms: solve, unriddle",
                    "to unravel a plot",
                    "to unravel a mystery",
                    "to unravel the confusion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To separate the connected or united parts of; to throw into disorder; to confuse.",
                  "examples": [
                    "Art shall be conjured for it, and nature all unravelled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To become undone; to collapse.",
                  "examples": [
                    "The great Ponzi scheme that lies behind our State pension is unravelling – as they all do eventually – because money being taken from new investors is insufficient to honour promises issued to earlier generations."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}