{
  "word": "socialism",
  "etymologies": [
    {
      "description": [
        "Attested since 1832; either from French socialisme or from social +‎ -ism."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "socialism (usually uncountable, plural socialisms)",
          "definitionGroups": [
            {
              "group": "Any of various economic and political theories advocating collective or governmental ownership and administration of the means of production and distribution of goods.",
              "entries": [
                {
                  "meaning": "A system of social and economic equality in which there is no private property.",
                  "examples": [
                    "…Americans as a rule have no faith in the fundamental doctrine of socialism — no private  property. To be sure, that fundamental doctrine is not expressly maintained in this  program of the British Labor Party ; but all its proposals lead straight to the adoption by the nation of that doctrine…"
                  ]
                },
                {
                  "meaning": "A system or condition of society in which the means of production are owned and controlled by the state.",
                  "examples": [
                    "Socialism is usually defined as \"common ownership of the means of production\". Crudely: the State, representing the whole nation, owns everything, and everyone is a State employee. This does not mean that people are stripped of private possessions such as clothes and furniture, but it does mean that all productive goods, such as land, mines, ships and machinery, are the property of the State... One must also add the following: approximate equality of incomes (it need be no more than approximate), political democracy, and abolition of all hereditary privilege, especially in education. These are simply the necessary safeguards against the reappearance of a class-system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Marxism-Leninism) The intermediate phase of social development between capitalism and communism in Marxist theory in which the state has control of the means of production.",
                  "examples": [
                    "For me, socialism is not statism, or the collective ownership of the means of production. It is a judgment on the priorities of economic policy…the community takes precedence over the individual in legitimate economic policy. The first lien on the resources of a society therefore should be to establish that \"social minimum\" which would allow individuals to lead a life of self-respect, to be members of the community."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of a group of later political philosophies such democratic socialism and social democracy which do not envisage the need for full state ownership of the means of production nor transition to full communism, and which are typically based on principles of community decision making, social equality and the avoidance of economic and social exclusion, with economic policy giving first preference to community goals over individual ones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Western, often derogatory, colloquial) Any left-wing ideology, government regulations, or policies promoting a welfare state, nationalisation, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}