{
  "word": "barbecue",
  "etymologies": [
    {
      "description": [
        "From mid-17th century.  Borrowed from Spanish barbacoa, from Taíno barbakoa (“framework of sticks”), the raised wooden structure the natives used to either sleep on or cure meat. Originally “meal of roasted meat or fish”. Doublet of barbacoa."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "barbecue (countable and uncountable, plural barbecues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fireplace or pit for grilling food, typically used outdoors and traditionally employing hot charcoal as the heating medium.",
                  "examples": [
                    "Coordinate terms: grill, boucan",
                    "We cooked our food on the barbecue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A meal or event highlighted by food cooked in such an apparatus.",
                  "examples": [
                    "We're having a barbecue on Saturday, and you're invited."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Meat, especially pork or beef, which has been cooked in such an apparatus (i.e. smoked over indirect heat from high-smoke fuels) and then chopped up or shredded.",
                  "examples": [
                    "She ordered a plate of barbecue with a side of slaw."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A hog, ox, or other large animal roasted or broiled whole for a feast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A floor on which coffee beans are sun-dried.",
                  "examples": [
                    "Drying the coffee beans took place in a barbecue, basically a large, flat platform, where the pulped coffee beans could be laid out and turned as they dried. Barbecues were often walled around and raised above ground level."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A framework of sticks.",
                  "examples": [
                    "We found no Houses of Entertainment on the Road, yet at every Village we came we got Houseroom, and a Barbacue of split Bambooes to sleep on."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "barbecue (third-person singular simple present barbecues, present participle barbecuing or barbecueing, simple past and past participle barbecued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cook food on a barbecue; to smoke it over indirect heat from high-smoke fuels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To grill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}