{
  "word": "wagon",
  "etymologies": [
    {
      "description": [
        "Borrowed from Dutch wagen, from Middle Dutch wagen, from Old Dutch *wagan, from Proto-West Germanic *wagn, from Proto-Germanic *wagnaz (“wagon”), from Proto-Indo-European *woǵʰnos (“wagon, primitive carriage”), from *weǵʰ- (“to transport”).",
        "Cognate with Danish vogn (“wagon”), German Wagen (“vehicle; wagon”), Saterland Frisian Woain (“wagon”), West Frisian wein (“wagon”), Swedish vagn (“wagon”). Doublet of wain (inherited from Old English wæġn) and related also to way, weigh.",
        "Sense 9 (“woman of loose morals; obnoxious woman”) is probably a derogatory and jocular reference to a woman being “ridden”, that is, mounted for the purpose of sexual intercourse.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wagon (plural wagons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heavier four-wheeled (normally horse-drawn) vehicle designed to carry goods (or sometimes people). [from late 15th c.]",
                  "examples": [
                    "Antonym: (lighter four-wheeled vehicle) carriage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Abbreviation of toy wagon; A child's riding toy, with the same structure as a wagon (sense 1), pulled or steered by a long handle attached to the front.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A vehicle (wagon) designed to transport goods or people on railway.",
                  "examples": [
                    "Synonyms: (American) railroad car, car, (British:) railway wagon, railway carriage, carriage, railtruck, truck, (only about a passenger railcar) coach",
                    "Hypernym: rolling stock"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for dinner wagon (“set of light shelves mounted on castors so that it can be pushed around a dining room and used for serving”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Short for paddy wagon (“police van for transporting prisoners”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia, US, slang) Short for station wagon (“type of car in which the roof extends rearward to produce an enclosed area in the position of and serving the function of the boot (trunk)”); (by extension) a sport utility vehicle (SUV); any car.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, slang, derogatory, dated) A woman of loose morals, a promiscuous woman, a slapper; (by extension) a woman regarded as obnoxious; a bitch, a cow.",
                  "examples": [
                    "Synonyms: see Thesaurus:promiscuous woman"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A kind of prefix used in de Bruijn notation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Buttocks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wagon (third-person singular simple present wagons, present participle wagoning, simple past and past participle wagoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly US) To load into a wagon in preparation for transportation; to transport by means of a wagon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly US) To travel in a wagon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}