{
  "word": "hackle",
  "etymologies": [
    {
      "description": [
        "From Middle English hakle (compare the compound meshakele), from Old English hæcla, hacele, from Proto-Germanic *hakulǭ, equivalent to hack +‎ -le. Cognate with Dutch hekel, German Hechel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hackle (plural hackles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instrument with steel pins used to comb out flax or hemp. [from 15th c.]",
                  "examples": [
                    "Synonyms: heckle, hatchel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually now in the plural) One of the long, narrow feathers on the neck of birds, most noticeable on the rooster. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A feather used to make a fishing lure or a fishing lure incorporating a feather. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually now in the plural) By extension (because the hackles of a rooster are lifted when it is angry), the hair on the nape of the neck in dogs and other animals; also used figuratively for humans. [from 19th c.]",
                  "examples": [
                    "When the dog got angry, his hackles rose and he growled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of jagged crack extending inwards from the broken surface of a fractured material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plate with rows of pointed needles used to blend or straighten hair. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A feather plume on some soldier's uniforms, especially the hat or helmet.",
                  "examples": [
                    "Synonyms: panache, plume"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any flimsy substance unspun, such as raw silk.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hackle (third-person singular simple present hackles, present participle hackling, simple past and past participle hackled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dress (flax or hemp) with a hackle; to prepare fibres of flax or hemp for spinning. [from 17th c.]",
                  "examples": [
                    "Then, with a smile that seemed to have all the freshness of the matutinal hour in it, she bent again to her work of hackling flax."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To separate, as the coarse part of flax or hemp from the fine, by drawing it through the teeth of a hackle or hatchel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To tear asunder; to break into pieces.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}