{
  "word": "litter",
  "etymologies": [
    {
      "description": [
        "From Middle English lytere, litere, from Anglo-Norman litiere (modern French litière), from Medieval Latin lectaria, from Latin lectus (“bed”); compare Ancient Greek λέκτρον (léktron). Had the sense ‘bed’ in very early English, but then came to mean ‘portable couch’, ‘bedding’, ‘strewn rushes (for animals)’, etc."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "litter (countable and uncountable, plural litters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A platform mounted on two shafts, or a more elaborate construction, designed to be carried by two (or more) people to transport one (in luxury models sometimes more) third person(s) or (occasionally in the elaborate version) a cargo, such as a religious idol.",
                  "examples": [
                    "Synonyms: palanquin, sedan chair, stretcher, cacolet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective, countable) The offspring of a mammal born in one birth.",
                  "examples": [
                    "The runt of the litter is a puppy that is the smallest or weakest among the newborn dogs in a litter ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Material used as bedding for animals.",
                  "examples": [
                    "sleep in the litter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Collectively, items discarded on the ground.",
                  "examples": [
                    "Synonyms: waste, rubbish, (US) garbage, (US) trash, junk",
                    "Don't drop litter",
                    "Put litter in the bin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Absorbent material used in an animal's litter tray",
                  "examples": [
                    "the cat's litter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Layer of fallen leaves and similar organic matter in a forest floor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A covering of straw for plants.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "litter (third-person singular simple present litters, present participle littering, simple past and past participle littered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To drop or throw trash without properly disposing of it (as discarding in public areas rather than trash receptacles).",
                  "examples": [
                    "By tossing the bottle out the window, he was littering."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To scatter carelessly about.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strew (a place) with scattered articles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give birth to, used of animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce a litter of young.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To supply (cattle etc.) with litter; to cover with litter, as the floor of a stall.",
                  "examples": [
                    "Tell them how they litter their jades."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be supplied with litter as bedding; to sleep or make one's bed in litter.",
                  "examples": [
                    "The inn where he and his horse litter'd."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}