{
  "word": "tail",
  "etymologies": [
    {
      "description": [
        "From Middle English tail, tayl, teil, from Old English tæġl (“tail”), from Proto-Germanic *taglaz, *taglą (“hair, fiber; hair of a tail”), from Proto-Indo-European *doḱ- (“hair of the tail”), from Proto-Indo-European *deḱ- (“to tear, fray, shred”). Cognate with Scots tail (“tail”), Dutch teil (“tail, haulm, blade”), Low German Tagel (“twisted scourge, whip of thongs and ropes; end of a rope”), German Zagel (“tail”), dialectal Danish tavl (“hair of the tail”), Swedish tagel (“hair of the tail, horsehair”), Norwegian tagl (“tail”), Icelandic tagl (“tail, horsetail, ponytail”), Gothic 𐍄𐌰𐌲𐌻 (tagl, “hair”). In some senses, apparently by a generalization of the usual opposition between head and tail."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tail (plural tails)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The caudal appendage of an animal that is attached to its posterior and near the anus.",
                  "examples": [
                    "Most primates have a tail and fangs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object or part of an object resembling a tail in shape, such as the thongs on a cat-o'-nine-tails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The back, last, lower, or inferior part of anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The feathers attached to the pygostyle of a bird.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tail-end of an object, e.g. the rear of an aircraft's fuselage, containing the tailfin.",
                  "examples": [
                    "It was soon over, and the unmoved magistrate calmly ordained that Deborah Williams, Elizabeth and Faith Wilson, should be tied to a cart's tail, and thus led through the principal streets of the town, receiving during their progress twenty lashes each, well laid on, upon the naked back."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The rear structure of an aircraft, the empennage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) The visible stream of dust and gases blown from a comet by the solar wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The latter part of a time period or event, or (collectively) persons or objects represented in this part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics) The part of a distribution most distant from the mode; as, a long tail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who surreptitiously follows another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The lower order of batsmen in the batting order, usually specialist bowlers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) The lower loop of the letters in the Roman alphabet, as in g, q or y.",
                  "examples": [
                    "Synonym: descender"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) The side of a coin not bearing the head; normally the side on which the monetary value of the coin is indicated; the reverse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) All the last terms of a sequence, from some term on.",
                  "examples": [
                    "A sequence \n  \n    \n      \n        (\n        \n          a\n          \n            n\n          \n        \n        )\n      \n    \n    {\\displaystyle (a_{n})}\n  \n is said to be frequently \n  \n    \n      \n        0\n      \n    \n    {\\displaystyle 0}\n  \n if every tail of the sequence contains \n  \n    \n      \n        0\n      \n    \n    {\\displaystyle 0}\n  \n."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now colloquial, chiefly US) The buttocks or backside.",
                  "examples": [
                    "By Goddis sydes, syns I her thyder broughte, / She hath gote me more money with her tayle / Than hath some shyppe that into Bordews sayle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The penis of a person or animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Sexual intercourse.",
                  "examples": [
                    "Synonyms: see Thesaurus:copulation",
                    "I'm gonna get me some tail tonight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(kayaking) The stern; the back of the kayak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A train or company of attendants; a retinue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The distal tendon of a muscle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) A filamentous projection on the tornal section of each hind wing of certain butterflies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A downy or feathery appendage of certain achens, formed of the permanent elongated style.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surgery) A portion of an incision, at its beginning or end, which does not go through the whole thickness of the skin, and is more painful than a complete incision; called also tailing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the strips at the end of a bandage formed by splitting the bandage one or more times.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A rope spliced to the strap of a block, by which it may be lashed to anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The part of a note which runs perpendicularly upward or downward from the head; the stem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A tailing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The bottom or lower portion of a member or part such as a slate or tile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, dated) A tailcoat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical engineering) Synonym of pigtail (“a short length of twisted electrical wire”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tail (third-person singular simple present tails, present participle tailing, simple past and past participle tailed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To follow and observe surreptitiously.",
                  "examples": [
                    "Tail that car!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) To hold by the end; said of a timber when it rests upon a wall or other support; with in or into",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To swing with the stern in a certain direction; said of a vessel at anchor.",
                  "examples": [
                    "This vessel tails downstream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To follow or hang to, like a tail; to be attached closely to, as that which can not be evaded.",
                  "examples": [
                    "Nevertheless his bond of two thousand pounds, wherewith he was tailed, continued uncancelled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pull or draw by the tail.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Anglo-Norman, probably from a shortened form of entail."
      ],
      "adjectives": [
        {
          "description": "tail",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Limited; abridged; reduced; curtailed.",
                  "examples": [
                    "estate tail"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tail",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Limitation of inheritance to certain heirs.",
                  "examples": [
                    "tail male — limitation to male heirs",
                    "in tail — subject to such a limitation"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}