{
  "word": "wont",
  "etymologies": [
    {
      "description": [
        "Origin uncertain; apparently a conflation of wone (“custom, habit, practice”) and wont (participle adjective, below). Compare German Low German Gewohnte (“custom, habit”) and Dutch gewoonte. Likely related to wone, wonder, wean, and win, ultimately from Proto-Indo-European *wenh₁- (“to wish for, strive for, pursue; to succeed, win”); more there."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wont (usually uncountable, plural wonts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) One's habitual way of doing things; custom, habit, practice.",
                  "examples": [
                    "He awoke at the crack of dawn, as was his wont."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English wont, iwoned, from Old English ġewunod, past participle of ġewunian."
      ],
      "adjectives": [
        {
          "description": "wont (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Accustomed or used (to or with a thing), accustomed or apt (to do something).",
                  "examples": [
                    "He is wont to complain loudly about his job."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English wonten (“to accustom”), from wont (adjective). See above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wont (third-person singular simple present wonts, present participle wonting, simple past and past participle wonted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To make (someone) used to; to accustom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To be accustomed (to something), to be in the habit (of doing something).",
                  "examples": [
                    "On ſome fond breaſt the parting ſoul relies, / Some pious drops the cloſing eye requires; / Ev'n from the tomb the voice of Nature cries, / Ev'n in our Aſhes live their wonted Fires."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}