{
  "word": "unmanly",
  "etymologies": [
    {
      "description": [
        "From un- +‎ manly."
      ],
      "adjectives": [
        {
          "description": "unmanly (comparative unmanlier or more unmanly, superlative unmanliest or most unmanly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Showing characteristics that are not manly, such as being immature, effeminate or cowardly, which might be construed as an indicator of weakness or of baseness of character.",
                  "examples": [
                    "'I do not know which is the worse,' he cried, 'the fraudulent old villain or the unmanly young cub.  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to something not human.",
                  "examples": [
                    "I had bought a toy in the street for my own amusement. It represented a woman, a young mother, flinging her little son over her head with one hand and catching him in the other ... The unmanly chuckle always came, I found, when the poor lady dropped her babe,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a behaviour or action) Cowardly, base.",
                  "examples": [
                    "Full many mischiefes follow cruell Wrath;Abhorred bloodshed and tumultuous strife,Unmanly murder, and unthrifty scath,Bitter despight, with rancours rusty knife,And fretting griefe the enemy of life;All these, and many evils moe haunt ire,The swelling Splene, and Frenzy raging rife,The shaking Palsey, and Saint Fraunces fire:Such one was Wrath, the last of this ungodly tire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a behaviour or action) Not acceptable from a man.",
                  "examples": [
                    "Mr. Coverley was quite brutal: he swore at her with unmanly rage, and seemed scarce able to refrain even from striking her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a behaviour or action) Not becoming of a man.",
                  "examples": [
                    "Jo wanted to lay her head down on that motherly bosom, and cry her grief and anger all away, but tears were an unmanly weakness, and she felt so deeply injured that she really couldn’t quite forgive yet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "unmanly (comparative more unmanly, superlative most unmanly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a manner that is unmanly.",
                  "examples": [
                    "He had acted unmanly, unworthy of a gentleman."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}