{
  "word": "porcelain",
  "etymologies": [
    {
      "description": [
        "From Middle French porcelaine (“cowrie, wampum; china, chinaware”), from Old Italian porcellana (“cowrie; china, chinaware”), from porcella (“mussel or cockle shell used to hold pigments while painting”) from porco (“pig”) with -ella (suffix forming diminutives)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "porcelain (countable and uncountable, plural porcelains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually uncountable) A hard white translucent ceramic, originally made by firing kaolin, quartz, and feldspar at high temperatures but now also inclusive of similar artificial materials; also often (figurative) such a material as a symbol of the fragility, elegance, etc. traditionally associated with porcelain goods.",
                  "examples": [
                    "Tableware and toilets are both made of porcelain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually uncountable) Synonym of china: porcelain tableware.",
                  "examples": [
                    "iij. potts of Erthe payntid, callyd Porseland."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Synonym of kaolin: the kind of clay traditionally used in China to manufacture porcelain.",
                  "examples": [
                    "[...] that earthen or pliable matter commonly called porcellan, which is pure white,... wherof vessels of all kinds are very curiously framed..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, now usually in the plural) An object made of porcelain, (particularly) art objects or items of tableware.",
                  "examples": [
                    "The museum has an extensive collection of rare Chinese porcelains."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, rare) Synonym of cowrie.",
                  "examples": [
                    "In the kingdomes of Caiacan and Carazan, certaine sea shels are currant, which some men terme Porcelline."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete or historical) Synonym of wampum: strings of shells, beads, etc. used as ornamentation or currency; the composite shells, beads, etc.",
                  "examples": [
                    "We mett severall gangs of men to our greatest disadvantage, ffor we weare forced to sing, and those that came to see us gave porcelaine to those that most did us injury."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, often capitalized) A kind of pigeon with deep brown and off-white feathers.",
                  "examples": [
                    "Those pretty spangled Toys [...] known by various names, as Porcelains, Hyacinths, Ermines, &c."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}