{
  "word": "loophole",
  "etymologies": [
    {
      "description": [
        "From Middle English loupe (“opening in a wall”) +‎ hole, from a Germanic source. Compare Medieval Latin loupa, lobia and Middle Dutch lupen (“to watch”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loophole (plural loopholes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A slit in a castle wall; today, any similar window for shooting a ranged weapon or letting in light. Also written loop hole.",
                  "examples": [
                    "There was a loophole in this wall, to let the light in, just at the height of a person's head, who was sitting near the chimney."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A method of escape, especially an ambiguity or exception in a rule or law that can be exploited in order to avoid its effect.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "loophole (third-person singular simple present loopholes, present participle loopholing, simple past and past participle loopholed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, transitive) To prepare a building for defense by preparing slits or holes through which to fire on attackers",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exploit (a law, etc.) by means of loopholes.",
                  "examples": [
                    "De-moralizing the subject can be, quite simply, demoralizing, as stirring statements of ideals turn into persnickety rules with exceptions crying out to be loopholed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}