{
  "word": "garnish",
  "etymologies": [
    {
      "description": [
        "From Middle English garnysshen, from Old French garniss-, stem of certain forms of the verb garnir, guarnir, warnir (“to provide, furnish, avert, defend, warn, fortify, garnish”), from a conflation of Old Frankish *warnijan (“to refuse, deny”) and *warnōn (“warn, protect, prepare, beware, guard oneself”), from Proto-Germanic *warnijaną (“to worry, care, heed”) and Proto-Germanic *warnōną (“to warn”); both from Proto-Indo-European *wer- (“to defend, protect, cover”). Cognate with Old English wiernan (“to withhold, be sparing of, deny, refuse, reject, decline, forbid, prevent from, avert”) and warnian (“to warn, caution, take warning, take heed, guard oneself against, deny”). More at warn."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "garnish (plural garnishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of dishes, often pewter, containing a dozen pieces of several types.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pewter vessels in general.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something added for embellishment.",
                  "examples": [
                    "Synonyms: decoration, ornament"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clothes; garments, especially when showy or decorative.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) Something set round or upon a dish as an embellishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, obsolete) Fetters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, historical) A fee; specifically, in English jails, formerly an unauthorized fee demanded from a newcomer by the older prisoners.",
                  "examples": [
                    "Garnish money, what is customarily spent among the Prisoners at first coming in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) Cash.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "garnish (third-person singular simple present garnishes, present participle garnishing, simple past and past participle garnished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To decorate with ornaments; to adorn; to embellish.",
                  "examples": [
                    "[…]  as that admirable writer has the best and worst verses of any among our English poets, Ned Softly has got all the bad ones without book, which he repeats upon occasion, to shew his reading, and garnish his conversation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) To ornament with something placed around it.",
                  "examples": [
                    "a dish garnished with parsley"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To furnish; to supply.",
                  "examples": [
                    "[…]  the good-humoured, affectionate-hearted Godfrey Cass was fast becoming a bitter man, visited by cruel wishes, that seemed to enter, and depart, and enter again, like demons who had found in him a ready-garnished home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) To fit with fetters; to fetter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To warn by garnishment; to give notice to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To have (money) set aside by court order (particularly for the payment of alleged debts); to garnishee.",
                  "examples": [
                    "When the editorial board of Fire met again, we did not plan a new issue, but emptied our pockets to help poor Thurman whose wages were being garnished weekly because he had signed for the printer’s bills."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}