{
  "word": "freight",
  "etymologies": [
    {
      "description": [
        "From Late Middle English freight, freght, freyght [and other forms], a variant of fraught, fraght (“transport of goods or people, usually by water; transportation fee; transportation facilities; cargo or passengers of a ship; (figuratively) burden; ballast of a ship; goods; a charge”), from Middle Dutch vracht, vrecht, and Middle Low German vrecht (“cargo, freight; transportation fee”), from Proto-West Germanic *fra- (from Proto-Germanic *fra- (prefix meaning ‘completely, fully’)) + *aihti (from Proto-Germanic *aihtiz (“possessions, property”), ultimately from Proto-Indo-European *h₂eyḱ- (“to come into possession of, obtain; to own, possess”)). The English word can be analysed as for- +‎ aught, and is a doublet of fraught."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "freight (usually uncountable, plural freights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The transportation of goods (originally by water; now also (chiefly US) by land); also, the hiring of a vehicle or vessel for such transportation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Goods or items in transport; cargo, luggage.",
                  "examples": [
                    "The freight shifted and the trailer turned over on the highway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Payment for transportation.",
                  "examples": [
                    "The freight was more expensive for cars than for coal."
                  ]
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "(countable) A burden, a load.",
                  "examples": []
                },
                {
                  "meaning": "(specifically, uncountable) Cultural or emotional associations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, originally US, rail transport) Short for freight train.",
                  "examples": [
                    "They shipped it ordinary freight to spare the expense."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Late Middle English freighten, freghten, a variant of fraughten, fraghten (“to load (a ship with cargo or passengers); to hire (a ship) for transporting goods; to provide fully (with goods, money, etc.); to stow away”), and then either:",
        "The adjective is:"
      ],
      "adjectives": [
        {
          "description": "freight (comparative more freight, superlative most freight)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Freighted; laden.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "freight (third-person singular simple present freights, present participle freighting, simple past and past participle freighted)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To load (a vehicle or vessel) with freight (cargo); also, to hire or rent out (a vehicle or vessel) to carry cargo or passengers.",
                  "examples": []
                },
                {
                  "meaning": "To transport (goods).",
                  "examples": []
                },
                {
                  "meaning": "(by extension) To load or store (goods, etc.).",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To carry (something) as if it is a burden or load.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, also figuratively) Chiefly followed by up: to carry as part of a cargo.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}