{
  "word": "salary",
  "etymologies": [
    {
      "description": [
        "From Middle English salarie, from Anglo-Norman salarie, from Old French salaire, from Latin salārium (“wages”), the neuter form of the adjective salārius (“related to salt”), from sal (“salt”). There have been various attempts to explain how the Latin term for “wages” came from the adjective “related to salt”. It is generally assumed that salārium was an abbreviation of salārium argentum (“salt money”), though that phrase is not attested. A commonly cited theory is that the phrase meant “money consisting of salt”, because Roman soldiers were sometimes paid in salt, but there is no evidence for this from ancient sources. Another is that the phrase meant “money used to buy salt [and other miscellaneous items]”."
      ],
      "adjectives": [
        {
          "description": "salary (comparative more salary, superlative most salary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Saline.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "salary (plural salaries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fixed amount of money paid to a worker, usually calculated on a monthly or annual basis, not hourly, as wages. Implies a degree of professionalism and/or autonomy.",
                  "examples": [
                    "Andrew Houſtoun and Adam Muſhet, being Tackſmen of the Excize, did Imploy Thomas Rue to be their Collector, and gave him a Sallary of 30. pound Sterling for a year."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "salary (third-person singular simple present salaries, present participle salarying, simple past and past participle salaried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pay on the basis of a period of a week or longer, especially to convert from another form of compensation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}