{
  "word": "necklace",
  "etymologies": [
    {
      "description": [
        "neck +‎ lace"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "necklace (plural necklaces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An article of jewelry that is worn around the neck, most often made of a string of precious metal, pearls, gems, beads or shells, and sometimes having a pendant attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Anything resembling a necklace in shape.",
                  "examples": [
                    "a necklace of coral islands"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(South Africa) A device used in necklacing (an informal execution); a rubber tyre that is filled with petrol. It is placed around the victim's chest and arms, and set on fire.",
                  "examples": [
                    "Seven people have been arrested in connection with Saturday's \"necklace\" murder of three men in the Tjokville informal settlement at Jeffrey's Bay."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "necklace (third-person singular simple present necklaces, present participle necklacing, simple past and past participle necklaced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(South Africa) To informally execute by necklacing; by setting on fire a petrol-filled rubber tyre which has been put around the bound victim's neck.",
                  "examples": [
                    "Frustrated residents tied the hands of two suspected criminals, put tyres around their necks and then set them alight. In a manifestation of growing disillusionment with the criminal justice system, residents of Bramfischerville, west of Johannesburg, on Tuesday abducted and necklaced two suspected burglars."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}