{
  "word": "wave",
  "etymologies": [
    {
      "description": [
        "From Middle English waven, from Old English wafian (“to wave, fluctuate, waver in mind, wonder”), from Proto-West Germanic *wabbjan, from Proto-Germanic *wabōną, *wabjaną (“to wander, sway”), from Proto-Indo-European *webʰ- (“to move to and from, wander”).",
        "Cognate with Middle High German waben (“to wave”), German wabern (“to waft”), Icelandic váfa (“to fluctuate, waver, doubt”). See also waver."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wave (third-person singular simple present waves, present participle waving, simple past and past participle waved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move back and forth repeatedly and somewhat loosely.",
                  "examples": [
                    "The flag waved in the gentle breeze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move one’s hand back and forth (generally above the shoulders) in greeting or departure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, metonymically) To call attention to, or give a direction or command to, by a waving motion, as of the hand; to signify by waving; to beckon; to signal; to indicate.",
                  "examples": [
                    "She spoke, and bowing waved / Dismissal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have an undulating or wavy form.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise into inequalities of surface; to give an undulating form or surface to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To produce waves to the hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, baseball) To swing and miss at a pitch.",
                  "examples": [
                    "Jones waves at strike one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to move back and forth repeatedly.",
                  "examples": [
                    "The starter waved the flag to begin the race."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, metonymically) To signal (someone or something) with a waving movement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To fluctuate; to waver; to be in an unsettled state.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, ergative) To move like a wave, or by floating; to waft.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English *wave, partially from waven (“to fluctuate, wave”) (see above) and partially from Middle English wawe, waghe (“wave”), from Old English wǣg (“a wave, billow, motion, water, flood, sea”), from Proto-Germanic *wēgaz (“motion, storm, wave”), from Proto-Indo-European *weǵʰ- (“to drag, carry”). Cognate with North Frisian weage (“wave, flood, sea”), German Woge (“wave”), French vague (“wave”) (from Germanic), Gothic 𐍅𐌴𐌲𐍃 (wēgs, “a wave”). See also waw."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wave (plural waves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A moving disturbance in the level of a body of liquid; an undulation.",
                  "examples": [
                    "The wave traveled from the center of the lake before breaking on the shore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic) The ocean.",
                  "examples": [
                    "[…]  your father Murtagh Ross, and his lawful childless wife, Dionaid, and his sister Anna—one and all, they lie beneath the green wave or in the brown mould."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A moving disturbance in the energy level of a field.",
                  "examples": [
                    "Gravity waves, while predicted by theory for decades, have been notoriously difficult to detect."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shape that alternatingly curves in opposite directions.",
                  "examples": [
                    "Her hair had a nice wave to it.",
                    "sine wave"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of a number of species of moths in the geometrid subfamily Sterrhinae, which have wavy markings on the wings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose back-and-forth movement, as of the hands.",
                  "examples": [
                    "He dismissed her with a wave of the hand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A sudden, but temporary, uptick in something.",
                  "examples": [
                    "Synonym: rush",
                    "A wave of shoppers stampeded through the door when the store opened for its Christmas discount special.",
                    "A wave of retirees began moving to the coastal area.",
                    "A wave of emotion overcame her when she thought about her son who was killed in battle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, by extension) One of the successive swarms of enemies sent to attack the player in certain games.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually \"the wave\") A group activity in a crowd imitating a wave going through water, where people in successive parts of the crowd stand and stretch upward, then sit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wave (third-person singular simple present waves, present participle waving, simple past and past participle waved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To generate a wave.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "See waive."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wave (third-person singular simple present waves, present participle waving, simple past and past participle waved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of waive",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}