{
  "word": "trough",
  "etymologies": [
    {
      "description": [
        "From Middle English trogh, from Old English troh, trog (“a trough, tub, basin, vessel for containing liquids or other materials”), from Proto-West Germanic *trog, from Proto-Germanic *trugą, *trugaz, from Proto-Indo-European *drukós, enlargement of *dóru (“tree”).",
        "See also West Frisian trôch, Dutch trog, German Trog, Danish trug, Swedish tråg; also Middle Irish drochta (“wooden basin”), Old Armenian տարգալ (targal, “ladle, spoon”). More at tree."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trough (plural troughs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, narrow container, open on top, for feeding or watering animals.",
                  "examples": [
                    "One of Hank's chores was to slop the pigs' trough each morning and evening."
                  ]
                }
              ]
            },
            {
              "group": "Any similarly shaped container.",
              "entries": [
                {
                  "meaning": "(Australia, New Zealand) A rectangular container used for washing or rinsing clothes.",
                  "examples": [
                    "Ernest threw his paint brushes into a kind of trough he had fashioned from sheet metal that he kept in the sink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short, narrow canal designed to hold water until it drains or evaporates.",
                  "examples": [
                    "There was a small trough that the sump pump emptied into; it was filled with mosquito larvae."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) A gutter under the eaves of a building; an eaves trough.",
                  "examples": [
                    "The troughs were filled with leaves and needed clearing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture, Australia, New Zealand) A channel for conveying water or other farm liquids (such as milk) from place to place by gravity; any ‘U’ or ‘V’ cross-sectioned irrigation channel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, narrow depression between waves or ridges; the low portion of a wave cycle.",
                  "examples": [
                    "The buoy bobbed between the crests and troughs of the waves moving across the bay.",
                    "The neurologist pointed to a troubling trough in the pattern of his brain-waves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economy) low turning point or a local minimum of a business cycle",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) A linear atmospheric depression associated with a weather front.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trough (third-person singular simple present troughs, present participle troughing, simple past and past participle troughed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To eat in a vulgar style, as if from a trough.",
                  "examples": [
                    "He troughed his way through three meat pies."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}