{
  "word": "womb",
  "etymologies": [
    {
      "description": [
        "From Middle English wombe, wambe, from Old English womb, wamb (“belly, stomach; bowels; heart; womb; hollow”), from Proto-West Germanic *wambu, from Proto-Germanic *wambō (“belly, stomach, abdomen”). Cognate with Scots wam, wame (“womb”), Dutch wam (“dewlap of beef; belly of a fish”), German Wamme, Wampe (“paunch, belly”), Danish vom (“belly, paunch, rumen”), Swedish våmb (“belly, stomach, rumen”), Norwegian vom (“rumen”), Icelandic vömb (“belly, abdomen, stomach”), Old Welsh gumbelauc (“womb”), Breton gwamm (“woman, wife”), Sanskrit वपा (vapā́, “the skin or membrane lining the intestines or parts of the viscera, the caul or omentum”). Superseded non-native Middle English mater, matere (“womb”) and matris, matrice (“womb”) borrowed from Latin māter (“womb”) and Old French matrice (“womb”), respectively."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "womb (plural wombs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) In female mammals, the organ in which the young are conceived and grow until birth; the uterus. [from 8th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The abdomen or stomach. [8th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The stomach of a person or creature. [8th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A place where something is made or formed. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any cavity containing and enveloping anything.",
                  "examples": [
                    "The centre spike of gold  Which burns deep in the blue-bell's womb."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "womb (third-person singular simple present wombs, present participle wombing, simple past and past participle wombed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To enclose in a womb, or as if in a womb; to breed or hold in secret.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}