{
  "word": "period",
  "etymologies": [
    {
      "description": [
        "From Middle English periode, from Middle French periode, from Medieval Latin periodus, from Ancient Greek περίοδος (períodos, “circuit, an interval of time, path around”), from περί- (perí-, “around”) + ὁδός (hodós, “way”). Displaced native Middle English tide (“interval, period, season”), from Old English tīd (“time, period, season”), as well as Middle English elde (“age, period”), from Old English ieldu (“age, period of time”)."
      ],
      "adjectives": [
        {
          "description": "period (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Designating anything from a given historical era.",
                  "examples": [
                    "a period car",
                    "a period TV commercial"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Evoking, or appropriate for, a particular historical period, especially through the use of elaborate costumes and scenery.",
                  "examples": [
                    "As the guests arrived — there were about a hundred, a majority in period attire — I began to feel out of place in my beige summer suit, white shirt, and red necktie. Then I got over it. I certainly didn't suffer from Confederate-uniform envy."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "period (plural periods)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A length of time. [from 17th c.]",
                  "examples": [
                    "There was a period of confusion following the announcement.",
                    "You'll be on probation for a six-month period."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of time in history seen as a single coherent entity; an epoch, era. [from 16th c.]",
                  "examples": [
                    "Food rationing continued in the post-war period."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly Canada, US, Philippines) The punctuation mark “.” (indicating the ending of a sentence or marking an abbreviation).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A decisive end to something; a stop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The length of time during which the same characteristics of a periodic phenomenon recur, such as the repetition of a wave or the rotation of a planet. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) Female menstruation; an episode of this. [from 18th c.]",
                  "examples": [
                    "When she is on her period, she prefers not to go swimming."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A section of an artist's, writer's (etc.) career distinguished by a given quality, preoccupation etc. [from 19th c.]",
                  "examples": [
                    "This is one of the last paintings Picasso created during his Blue Period."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Each of the divisions into which a school day is split, allocated to a given subject or activity. [from 19th c.]",
                  "examples": [
                    "I have math class in second period."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, chiefly ice hockey) Each of the intervals, typically three, of which a game is divided. [from 19th c.]",
                  "examples": [
                    "Gretzky scored in the last minute of the second period."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, chiefly ice hockey) One or more additional intervals to decide a tied game, an overtime period.",
                  "examples": [
                    "They won in the first overtime period."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, medicine) The length of time for a disease to run its course. [15th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An end or conclusion; the final point of a process etc. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric) A complete sentence, especially one expressing a single thought or making a balanced, rhythmic whole. [from 16th c.]",
                  "examples": [
                    "Periods are beautiful when they are not too long."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A specific moment during a given process; a point, a stage. [17th–19th c.]",
                  "examples": [
                    "The Death of Patroclus was the most eminent Period; and consequently the most proper Time for such Games."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A row in the periodic table of the elements. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A geochronologic unit of millions to tens of millions of years; a subdivision of an era, and subdivided into epochs.",
                  "examples": [
                    "These fossils are from the Jurassic period."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A Drosophila gene, the gene product of which is involved in regulation of the circadian rhythm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Two phrases (an antecedent and a consequent phrase).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The length of an interval over which a periodic function, periodic sequence or repeating decimal repeats; often the least such length.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) End point, conclusion.",
                  "examples": [
                    "As thus all gazed on hir, so she glaunced hir lookes on all, surueying them as curiously, as they noted hir exactly, but at last she set downe her period on the face of Alexis  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "period (third-person singular simple present periods, present participle perioding, simple past and past participle perioded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To come to a period; to conclude.",
                  "examples": [
                    "For you may period upon this, that where there is the most pity for others, there is the greatest misery in the party pitied."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, rare) To put an end to.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}