{
  "word": "waffle",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Dutch wafel (“waffle; wafer”), from Middle Dutch wafel, wafele, wavel, from Old Dutch *wāvila, from Proto-Germanic *wēbilǭ, *wēbilō, possibly related to Proto-Indo-European *webʰ- (“to braid, weave”) (whence Dutch weven (“to weave”) and English weave), and possibly reinforced by German Waffel (“waffle; wafer”). The English word is a doublet of wafer and gauffre.",
        "The verb (“to smash”) derives from the manner in which batter is pressed into the shape of a waffle between the two halves of a waffle iron."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waffle (plural waffles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A flat pastry pressed with a grid pattern, often eaten hot with butter and/or honey or syrup.",
                  "examples": [
                    "The brunch was waffles with strawberries and whipped cream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Britain) In full potato waffle: a savoury flat potato cake with the same kind of grid pattern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction, also attributively) A concrete slab used in flooring with a gridlike structure of ribs running at right angles to each other on its underside.",
                  "examples": [
                    "Both joists and slab are cast in place to form a monolithic unit, integral with the supporting beams and columns. The joists form a characteristic waffle pattern on the underside. Structural design of joist construction: one-way or waffle flat slab  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textiles, chiefly attributively) A type of fabric woven with a honeycomb texture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "waffle (third-person singular simple present waffles, present participle waffling, simple past and past participle waffled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To smash (something).",
                  "examples": [
                    "These were not the Cowboys who were waffled, 45–14, here at mid-season. They came prepared to play a championship football game, with an ultra-conservative game plan suited to the horrendous turf conditions, and came close to pulling it off [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is borrowed from Scots waffle (“to waver, flap, flutter”), from waff (“to wag, wave; to flap, flutter”) + -le (diminutive or frequentative suffix). Waff is derived from Early Scots waff (“signal; gust of wind; glimpse; a flapping, waving”), from Northern Middle English wafe, waffe, a variant of waven (“to move to and fro, sway; to stray, wander; (figuratively) to follow a weaving course; (figuratively) to vacillate, waver; to move something to and fro, wave”) (whence wave), from Old English wafian (“to wave”), from Proto-Germanic *wabōną, *wabjaną (“to sway; to wander”), from Proto-Indo-European *webʰ- (“to braid, weave”).",
        "Regarding sense 5 (“to speak or write (something) at length without any clear aim or point”), compare Old English wæflian (“to talk foolishly”), possibly ultimately from Proto-Germanic *babalōną (“to babble, chatter”), from Proto-Indo-European *bʰā- (“to say”) and/or Proto-Indo-European *baba- (“to talk vaguely; to mumble”). The Oxford English Dictionary does not derive the English word waffle from this Old English word.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waffle (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) (Often lengthy) speech or writing that is evasive or vague, or pretentious.",
                  "examples": [
                    "Synonyms: see Thesaurus:chatter",
                    "This interesting point seems to get lost a little within a lot of self-important waffle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "waffle (third-person singular simple present waffles, present participle waffling, simple past and past participle waffled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To speak or write evasively or vaguely.",
                  "examples": [
                    "Synonym: beat around the bush"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a bird: to move in a side-to-side motion while descending before landing.",
                  "examples": [
                    "Synonym: whiffle",
                    "The geese waffled as they approached the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, aviation, road transport, colloquial) Of an aircraft or motor vehicle: to travel in a slow and unhurried manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, originally Northern England, Scotland, colloquial) To be indecisive about something; to dither, to vacillate, to waver.",
                  "examples": [
                    "Synonym: blow hot and cold"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) Often followed by on: to speak or write (something) at length without any clear aim or point; to ramble.",
                  "examples": [
                    "Synonyms: see Thesaurus:prattle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hold horizontally and rotate (one's hand) back and forth in a gesture of ambivalence or vacillation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from waff (“(dialectal) to bark, woof”) (imitative of a dog’s yelp) + -le (diminutive or frequentative suffix)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waffle (plural waffles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialectal) The high-pitched sound made by a young dog; also, a muffled bark.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "waffle (third-person singular simple present waffles, present participle waffling, simple past and past participle waffled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Britain, dialectal) Of a dog: to bark with a high pitch like a puppy, or in muffled manner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}