{
  "word": "discount",
  "etymologies": [
    {
      "description": [
        "Alteration of French descompte, décompte, from Old French disconter, desconter (“reckon off, account back, discount”), from Medieval Latin discomputō (“I deduct, discount”), from Latin dis- (“away”) + computō (“I reckon, count”)."
      ],
      "adjectives": [
        {
          "description": "discount (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a store) Specializing in selling goods at reduced prices.",
                  "examples": [
                    "If you're looking for cheap clothes, there's a discount clothier around the corner."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "discount (plural discounts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reduction in price.",
                  "examples": [
                    "This store offers discounts on all its wares. That store specializes in discount wares, too."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A deduction made for interest, in advancing money upon, or purchasing, a bill or note not due; payment in advance of interest upon money.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The rate of interest charged in discounting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A lack or shortcoming.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology, transactional analysis) The act of one who believes, or act as though they believe, that their own feelings are more important than the reality of a situation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "discount (third-person singular simple present discounts, present participle discounting, simple past and past participle discounted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deduct from an account, debt, charge, and the like.",
                  "examples": [
                    "Merchants sometimes discount five or six per cent for prompt payment of bills."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lend money upon, deducting the discount or allowance for interest",
                  "examples": [
                    "the banks discount notes and bills of exchange"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take into consideration beforehand; to anticipate and form conclusions concerning (an event).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To leave out of account or regard as unimportant.",
                  "examples": [
                    "Of the three opinions, (I discount Brown's), under this head, one supposes that the law of Causality is a positive affirmation, and a primary fact of thought, incapable of all further analysis."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lend, or make a practice of lending, money, abating the discount",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology, transactional analysis) To believe, or act as though one believes, that one's own feelings are more important than the reality of a situation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}