{
  "word": "garage",
  "etymologies": [
    {
      "description": [
        "Borrowed from French garage (“keeping under cover, protection, shelter”), derivative of French garer (“to keep under cover, dock, shunt, guard, keep”), from Middle French garer, garrer, guerrer; partly from Old French garir, warir (from Old Frankish *warjan); and partly from Old French varer (“to fight, defend oneself, protect”), from Old Norse varask (“to defend oneself”), reflexive of vara (“to ware, watch out, defend”); both ultimately from Proto-Germanic *warjaną (“to defend, ward off”), *warōną (“to watch, protect”), from Proto-Indo-European *wer- (“to close, cover, protect, save, defend”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "garage (countable and uncountable, plural garages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A building (or section of a building) used to store a car or cars, tools and other miscellaneous items.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, Ireland, Canada, Australia, New Zealand and dated, 20th century, in Canada, US) A place where cars are serviced and repaired.",
                  "examples": [
                    "(North America) Synonyms: auto shop, car workshop, vehicle workshop"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, Ireland, Canada, Australia, New Zealand) A petrol filling station.",
                  "examples": [
                    "(Britain, Ireland, Australia) Synonym: petrol station",
                    "(North America) Synonyms: filling station, gas station, service station"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A shed for housing an airship or aeroplane or a launchable missile; a hangar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A side way or space in a canal to enable vessels to pass each other; a siding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive, music) A type of guitar rock music, personified by amateur bands playing in the basement or garage; garage rock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, music) A type of electronic dance music related to house music, with warped and time-stretched sounds; UK garage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "garage (third-person singular simple present garages, present participle garaging, simple past and past participle garaged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To store in a garage.",
                  "examples": [
                    "We garaged the convertible during the monsoon months."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}