{
  "word": "fun",
  "etymologies": [
    {
      "description": [
        "From Middle English fonne, fon (“foolish, simple, silly”) or fonnen (“make a fool of”), from Middle English fonne (“a fool, dupe”), probably of North Germanic origin, related to Swedish fånig (“foolish”), Swedish fåne (“a fool”). Compare also Norwegian fomme, fume (“a fool”). More at fon, fond.",
        "As a noun, fun is recorded from 1700, with a meaning “a cheat, trick, hoax”, from a verb fun meaning “to cheat, trick” (1680s). The meaning “diversion, amusement” dates to the 1720s. The older meaning is preserved in the phrase to make fun of (1737) and in usage of the adjective funny. The use of fun as adjective is newest and is due to reanalysis of the noun; this was incipient in the mid-19th century.",
        "Alternative etymology connected Middle English fonne with Old Frisian fonna, fone, fomne, variant forms of fāmne, fēmne (“young woman, virgin”), from Proto-West Germanic *faimnijā, from Proto-Germanic *faimnijǭ (“maiden”), from Proto-Indo-European *peymen- (“girl”), *poymen- (“breast milk”). If so, then cognate with Old English fǣmne (“maid, virgin, damsel, bride”), West Frisian famke (“girl”), Saterland Frisian fone, fon (“woman, maid, servant,\" also \"weakling, simpleton”)."
      ],
      "adjectives": [
        {
          "description": "fun (comparative more fun or funner, superlative most fun or funnest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Enjoyable or amusing.",
                  "examples": [
                    "We had a fun time at the party.",
                    "He is such a fun person to be with."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Whimsical or flamboyant.",
                  "examples": [
                    "This year's fashion style is much more fun than recent seasons."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "fun (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "amusement, enjoyment or pleasure",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "playful, often noisy, activity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fun (third-person singular simple present funs, present participle funning, simple past and past participle funned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) To tease, kid, poke fun at, make fun of.",
                  "examples": [
                    "Hey, don't get bent out of shape over it; I was just funning you."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}