{
  "word": "forage",
  "etymologies": [
    {
      "description": [
        "From Middle English forage, from Old French fourage, forage, a derivative of fuerre (“fodder, straw”), from Frankish *fōdar (“fodder, sheath”), from Proto-Germanic *fōdrą (“fodder, feed, sheath”), ultimately from Proto-Indo-European *peh₂- (“to protect, to feed”).",
        "Cognate with Old High German fuotar (German Futter (“fodder, feed”)), Old English fōdor, fōþor (“food, fodder, covering, case, basket”), Dutch voeder (“forage, food, feed”), Danish foder (“fodder, feed”), Icelandic fóðr (“fodder, sheath”). More at fodder, food."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "forage (countable and uncountable, plural forages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fodder for animals, especially cattle and horses.",
                  "examples": [
                    "To invade the corn, and to their cells convey The plundered forage of their yellow prey"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or instance of foraging.",
                  "examples": [
                    "Mawhood completed his forage unmolested."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The demand for fodder etc by an army from the local population",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "forage (third-person singular simple present forages, present participle foraging, simple past and past participle foraged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To search for and gather food for animals, particularly cattle and horses.",
                  "examples": [
                    "The message said that the party intended to hunt and forage through this region, for a month or two, afore it went back into the Canadas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To rampage through, gathering and destroying as one goes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To rummage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of an animal: to seek out and eat food.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}