{
  "word": "mechanic",
  "etymologies": [
    {
      "description": [
        "From Middle English mekanyk (“mechanical”), from Old French mecanique, from Latin mechanicus (“of or belonging to machines or mechanics, inventive”), from Ancient Greek μηχανικός (mēkhanikós, “pertaining to machines or contrivance, mechanic, ingenious, inventive”), from μηχανή (mēkhanḗ, “a machine, contrivance”); see machine."
      ],
      "adjectives": [
        {
          "description": "mechanic",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) mechanical; relating to the laws of motion in the art of constructing things",
                  "examples": [
                    "these mechanic philosophers"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Of or relating to a mechanic or artificer, or to the class of artisans; hence, rude; common; vulgar; base.",
                  "examples": [
                    "Authors both Sacred and Profane we see complain of the Level of Learning, with Mechanick Ignorance: [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mechanic (plural mechanics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly historical) A manual worker; a labourer or artisan. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who builds or repairs machinery, a technician; now specifically, someone who works with and repairs the mechanical parts of a motor vehicle, aircraft or similar. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device, command, or feature which allows someone to achieve a specific task. [from 20th c.]",
                  "examples": [
                    "This game has a mechanic where if you run toward a ledge you automatically jump off rather than just falling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A hitman. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) A cheat who manipulates the cards or dice.",
                  "examples": [
                    "Hyponyms: card mechanic, dice mechanic"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}