{
  "word": "age",
  "etymologies": [
    {
      "description": [
        "From Middle English age, Old French aage, eage, edage, from an assumed Vulgar Latin *aetāticum, derived from Latin aetātem, itself derived from aevum (“lifetime”), ultimately from Proto-Indo-European *h₂eyu- (“vital force”). Compare French âge.",
        "Displaced native Old English ieldu."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "age (countable and uncountable, plural ages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The whole duration of a being, whether human, animal, plant, or other kind, being alive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The number of full years, months, days, hours, etc., that someone, or something, has been alive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) One of the stages of life.",
                  "examples": [
                    "the age of infancy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The time of life at which some particular power or capacity is understood to become vested.",
                  "examples": [
                    "the age of consent; the age of discretion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A particular period of time in history, as distinguished from others.",
                  "examples": [
                    "the golden age; the age of Pericles"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A great period in the history of the Earth.",
                  "examples": [
                    "the Bronze Age was followed by the Iron Age; the Tithonian Age was the last in the Late Jurassic epoch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) One of the twelve divisions of a Great Year, equal to roughly 2000 years and goverened by one of the zodiacal signs; a Platonic month.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A period of one hundred years; a century.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The people who live during a particular period.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A generation.",
                  "examples": [
                    "There are three ages living in her house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, hyperbolic) A long time.",
                  "examples": [
                    "It’s been an age since we last saw you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, geology) The shortest geochronologic unit, being a period of thousands to millions of years; a subdivision of an epoch (or sometimes a subepoch).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, poker) The right of the player to the left of the dealer to pass the first round in betting, and then to come in last or stay out; also, the player holding this position; the eldest hand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) That part of the duration of a being or a thing which is between its beginning and any given time; specifically the size of that part.",
                  "examples": [
                    "What is the present age of a man, or of the earth?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Mature age; especially, the time of life at which one attains full personal rights and capacities.",
                  "examples": [
                    "to come of age; she is now of age"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) An advanced period of life; the latter part of life; the state of being old, old age, senility; seniority.",
                  "examples": [
                    "Feel awfully about Scott... It was a terrible thing for him to love youth so much that he jumped straight from youth to senility without going through manhood. The minute he felt youth going he was frightened again and thought there was nothing between youth and age."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "age (third-person singular simple present ages, present participle ageing or (US) aging, simple past and past participle aged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To grow aged; to become old; to show marks of age.",
                  "examples": [
                    "He grew fat as he aged."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal, of a statement, prediction) To be viewed or turn out in some way after a certain time has passed.",
                  "examples": [
                    "His prediction that we didn't stand a chance hasn't aged well, now that we've won the cup."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to grow old; to impart the characteristics of age to.",
                  "examples": [
                    "Grief ages us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To postpone an action that would extinguish something, as a debt.",
                  "examples": [
                    "Money's a little tight right now, let's age our bills for a week or so."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, accounting) To categorize by age.",
                  "examples": [
                    "One his first assignments was to age the accounts receivable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To indicate that a person has been alive for a certain period of time, especially a long one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}