{
  "word": "scribe",
  "etymologies": [
    {
      "description": [
        "From Middle English scribe, from Old French scribe (“scribe”), from Late Latin usage of scriba (“secretary”) (used in the Vulgate Bible translation to render Ancient Greek γραμματεύς (grammateús, “scribe, secretary”), which had been used in its turn to render the Hebrew סופר‎ (“writer, scholar”)) from scribere (“to write, draw, draw up, draft (a paper), enlist, enroll, levy; orig. to scratch”), probably akin to scrobs (“a ditch, trench, grave”). Doublet of shrive.",
        "The verb sense used in carpentry comes from the way a workman uses a compass to mark a line before cutting."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scribe (plural scribes)",
          "definitionGroups": [
            {
              "group": "Someone who writes; a draughtsperson; a writer for another; especially, an official or public writer; an amanuensis, secretary, notary, or copyist.",
              "entries": [
                {
                  "meaning": "A person who writes books or documents by hand as a profession.W",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A journalist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A writer and doctor of the law; one skilled in the law and traditions; one who read and explained the law to the people.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very sharp, steel drawing implement used in engraving and etching, a scriber.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scribe (third-person singular simple present scribes, present participle scribing, simple past and past participle scribed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To write.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To write, engrave, or mark upon; to inscribe.",
                  "examples": [
                    "he scribed his name on the mould, and wrote it on the two pieces of pasteboard"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To record, as a scribe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To write or draw with a scribe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(carpentry) To cut (something) in order to fit it closely to an irregular surface, as a baseboard to a floor which is out of level, a board to the curves of a moulding, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To score or mark with compasses or a scribing iron.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}