{
  "word": "intention",
  "etymologies": [
    {
      "description": [
        "From Middle English entencioun, intention, from Old French entencion, from Latin intentiō, intentiōnem. Compare intent."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "intention (countable and uncountable, plural intentions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A course of action that a person intends to follow.",
                  "examples": [
                    "My intention was to marry a wealthy widow.",
                    "It’s easy to promise anything when you have no intention of fulfilling any of it.",
                    "Synonyms: see Thesaurus:intention"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The goal or purpose.",
                  "examples": [
                    "The intention of this legislation is to boost the economy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Tension; straining, stretching.",
                  "examples": [
                    "cold in those inner parts, cold belly, and hot liver, causeth crudity, and intention proceeds from perturbations […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stretching or bending of the mind toward an object or a purpose (an intent); closeness of application; fixedness of attention; earnestness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The object toward which the thoughts are directed; end; aim.",
                  "examples": [
                    "In a Word, the most part of chronical Distempers proceed from Laxity of Fibres; in which Case the principal Intention is to restore the Tone of the solid Parts; […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any mental apprehension of an object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The process of the healing of a wound.",
                  "examples": [
                    "When healing occurs by primary intention, the wound is basically closed with all areas of the wound connecting and healing simultaneously."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "intention (third-person singular simple present intentions, present participle intentioning, simple past and past participle intentioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To intend.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}