{
  "word": "skid",
  "etymologies": [
    {
      "description": [
        "From Middle English *skid, from Old Norse skíð (“a billet of wood, a beam or plank on which something rests”), from Proto-Germanic *skīdą (“log, clapboard”), from Proto-Indo-European *skey-t-, *skey- (“to split, divide, separate”). Cognate with English shide, from Middle English schyd, schyde, schide (“plank, beam”), German Scheit (“piece of wood, log”). Doublet of ski."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skid (plural skids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An out-of-control sliding motion as would result from applying the brakes too hard in a car.",
                  "examples": [
                    "Just before hitting the guardrail the driver was able to regain control and pull out of the skid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shoe or clog, as of iron, attached to a chain, and placed under the wheel of a wagon to prevent its turning when descending a steep hill.",
                  "examples": [
                    "Synonyms: drag, skidpan"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A hook attached to a chain, used for the same purpose.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A piece of timber or other material used as a support, or to receive pressure.",
              "entries": [
                {
                  "meaning": "A runner of a sled.",
                  "examples": [
                    "In the hours before daylight he sharpened the skids and tightened the lashings to prepare for the long dogsled journey."
                  ]
                },
                {
                  "meaning": "A ski-shaped runner or supporting surface as found on a helicopter or other aircraft in place of wheels.",
                  "examples": [
                    "Due to frequent arctic travel, the plane was equipped with long skids for snow and ice landings."
                  ]
                },
                {
                  "meaning": "A basic platform for the storage and transport of goods, machinery or equipment, later developed into the pallet.",
                  "examples": [
                    "He unloaded six skids of boxes from the truck."
                  ]
                },
                {
                  "meaning": "(nautical, in the plural) Large fenders hung over a vessel's side to protect it when handling cargo.",
                  "examples": []
                },
                {
                  "meaning": "One of a pair of horizontal rails or timbers for supporting anything, such as a boat or barrel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A banked sideslip where the aircraft's nose is yawed towards the low wing, often due to excessive rudder input.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) (also losing skid) A losing streak.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "skid (third-person singular simple present skids, present participle skidding, simple past and past participle skidded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) (of a wheel, sled runner, or vehicle tracks) To slide along the ground, without the rotary motion that wheels or tracks would normally have.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To slide in an uncontrolled manner as in a car with the brakes applied too hard, the wheels sliding with limited spinning.",
                  "examples": [
                    "They skidded around the corner and accelerated up the street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive, aviation) To operate an aircraft in a banked sideslip with the nose yawed towards the low wing.",
                  "examples": [
                    "Don't use excessive rudder when turning, especially at low airspeed, as this causes your plane to skid through the turn, which can cause you to very rapidly enter a spin if the inner wing stalls.",
                    "Because of the jammed ailerons, the pilot had to use careful rudder inputs to skid his plane in order to turn it so he could get lined up with the runway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To protect or support with a skid or skids.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to move on skids.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To check or halt (wagon wheels, etc.) with a skid.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening of stepkid."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skid (plural skids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang) A stepchild.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortened from script kiddie, probably via skiddie."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skid (plural skids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang) A script kiddie.",
                  "examples": [
                    "[…]  it is something that differentiates an elite hacker from skids (script kiddies)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "skid (plural skids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A sovereign (old coin).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}