{
  "word": "bullshit",
  "etymologies": [
    {
      "description": [
        "From bull +‎ shit. In use since 1914."
      ],
      "adjectives": [
        {
          "description": "bullshit (comparative more bullshit, superlative most bullshit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) absurd, irrational, or nonsensical (Most often said of speech, information, or content.)",
                  "examples": [
                    "That's the most bullshit excuse I've ever heard.",
                    "bulllshit jobs"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bullshit (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, literally) Feces produced by a bull.",
                  "examples": [
                    "Synonym: manure"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang, usual sense) Statements that are false or exaggerated to impress or cheat the listener.",
                  "examples": [
                    "Don't pay any attention to him. He talks a lot of bullshit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) Statements that are transparently or offensively false.",
                  "examples": [
                    "That's total bullshit! I called your office and they said that you didn't come in!",
                    "Fucking load of bullshit! You smashed his skull and dropped the F-bomb at him, and now you're claiming that he assaulted you?!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric) Statements that are intentionally misleading, whether true or not.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) Statements made without regard for their truth value.",
                  "examples": [
                    "Synonym: nonsense"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) Synonym of shit (in its sense of any stuff, especially when viewed negatively or with collegial vulgarity).",
                  "examples": [
                    "These rules cover how to do your laundry, how to fold your shirts, how to shine your shoes... You know, all that bullshit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games, possibly vulgar) A card game in which players try to discard their hands first, following rules that encourage bluffing, calling others' bluffs, and penalizing others by tricking them into inaccurate accusations.",
                  "examples": [
                    "Anyone want to play a few hands of bullshit?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bullshit (third-person singular simple present bullshits, present participle bullshitting, simple past and past participle bullshitted or bullshit or (rare) bullshat)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, vulgar, slang) To tell lies, exaggerate; to mislead; to deceive.",
                  "examples": [
                    "I think you're bullshitting. Let’s just call your office and see if you even came in.",
                    "You’re bullshitting me. I called your office and you never even came in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, vulgar, slang) To have casual conversation with no real point; to shoot the breeze.",
                  "examples": [
                    "I will probably just go and bullshit with Joe for awhile."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, vulgar, slang) To come up with on the spot; to improvise.",
                  "examples": [
                    "We just went on stage and bullshitted the whole concert because we didn't know any songs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}