{
  "word": "asterisk",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English asterisk [and other forms], from Late Latin asteriscus (“asterisk; small star”), from Ancient Greek ἀστερῐ́σκος (asterískos, “asterisk; small star”), from ᾰ̓στήρ (astḗr, “celestial body (star, planet, and other lights in the sky such as meteors)”) (ultimately from Proto-Indo-European *h₂eHs- (“to burn; to glow”)) + -ῐ́σκος (-ískos, diminutive suffix).",
        "Sense 1.1.2 (“something which is of little importance or which is marginal”) refers to the use of an asterisk to denote a footnote or marginal note in a text; in other words, information that is not important enough to be incorporated into the main text. Sense 1.1.3 (“blemish in an otherwise outstanding achievement”) refers to the use of an asterisk in a sporting record to indicate that the record is qualified in some manner (for example, that the sportsperson was found to have taken performance-enhancing drugs at the time).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "asterisk (plural asterisks)",
          "definitionGroups": [
            {
              "group": "(dated) A small star; also (by extension), something resembling or shaped like a star.",
              "entries": [
                {
                  "meaning": "The star-shaped symbol *, which is used in printing and writing for various purposes, including to refer a reader to a note at the bottom of a page or in a margin, and to indicate the omission of letters or words; a star.",
                  "examples": [
                    "They came into the tournament highly ranked, but with a little bit of an asterisk as their last two wins had been unconvincing."
                  ]
                },
                {
                  "meaning": "Something resembling or shaped like an asterisk symbol.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) Something which is of little importance or which is marginal; a footnote.",
                  "examples": []
                },
                {
                  "meaning": "(US, sports, figuratively) A blemish in an otherwise outstanding achievement.",
                  "examples": [
                    "They came into the tournament highly ranked, but with a little bit of an asterisk as their last two wins had been unconvincing."
                  ]
                },
                {
                  "meaning": "(Eastern Orthodoxy, Roman Catholicism) An instrument with radiating arms resembling a star which is placed over the diskos (or paten) used during the Eucharist to prevent the veil covering the chalice and diskos from touching the host on the diskos.",
                  "examples": [
                    "Synonym: star-cover"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "asterisk (third-person singular simple present asterisks, present participle asterisking, simple past and past participle asterisked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark or replace (text, etc.) with an asterisk symbol (*; noun sense 1.1); to star.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}