{
  "word": "apple",
  "etymologies": [
    {
      "description": [
        "From Middle English appel, from Old English æppel (“apple, fruit in general, ball”), from Proto-West Germanic *applu, from Proto-Germanic *aplaz (“apple”) (compare Scots aipple, West Frisian apel, Dutch appel, German Apfel, Swedish äpple, Danish æble), from Proto-Indo-European *h₂ébōl, *h₂ébl̥ (“apple”) (compare Welsh afal, Irish úll, Lithuanian óbuolỹs, Russian я́блоко (jábloko), possibly Ancient Greek ἄμπελος (ámpelos, “vine”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "apple (plural apples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A common, round fruit produced by the tree Malus domestica, cultivated in temperate climates. [from 9th c.]",
                  "examples": [
                    "I prayed pieres to pulle adown an apple."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any fruit or vegetable, or any other thing produced by a plant such as a gall or cone, especially if produced by a tree and similar to the fruit of Malus domestica; also (with qualifying words) used to form the names of specific fruits such as custard apple, rose apple, thorn apple etc. [from 9th c.]",
                  "examples": [
                    "Venemous apples wherwith they poyson theyr arrows."
                  ]
                }
              ]
            },
            {
              "group": "Something which resembles the fruit of Malus domestica, such as a globe, ball, or breast.",
              "entries": [
                {
                  "meaning": "(baseball, slang, obsolete) The ball in baseball. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "(informal) When smiling, the round, fleshy part of the cheeks between the eyes and the corners of the mouth.",
                  "examples": []
                },
                {
                  "meaning": "The Adam's apple.",
                  "examples": [
                    "The sweat of fear and exertion was streaming down his face and chest, and his breath came in short, tearing, hard-drawn gasps and gulps, while the apple in his throat leaped up and down ceaselessly  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The fruit of the Tree of Knowledge, eaten by Adam and Eve according to post-Biblical Christian tradition; the forbidden fruit. [from 11th c.]",
                  "examples": [
                    "Sharon you've got a husband",
                    "And a family and a farm",
                    "I've got the apple of temptation",
                    "And a diamond snake around my arm"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tree of the genus Malus, especially one cultivated for its edible fruit; the apple tree. [from 15th c.]",
                  "examples": [
                    "This allows a weak plant to benefit from the strong roots of another, or a vigorous tree (such as an apple) to be kept small by growing on 'dwarfing rootstock'."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The wood of the apple tree. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, Cockney rhyming slang) Short for apples and pears, slang for stairs. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, ethnic slur) A Native American or red-skinned person who acts and/or thinks like a white (Caucasian) person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey, slang) An assist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A CB radio enthusiast.",
                  "examples": [
                    "Because of overcrowding, many a CB enthusiast (called an \"apple\") is strapping an illegal linear amplifier (\"boots\") on to his transceiver (\"ears\")  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "apple (third-person singular simple present apples, present participle appling, simple past and past participle appled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make or become apple-like.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To form buds, bulbs, or fruit.",
                  "examples": [
                    "Either they floure, or they apple or els be ready to bring forth fruit."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}