{
  "word": "foam",
  "etymologies": [
    {
      "description": [
        "From Middle English fom, foom, from Old English fām, from Proto-West Germanic *faim, from Proto-Germanic *faimaz, from Proto-Indo-European *(s)poHy-m-os, from *(s)poH(y)- (“foam”). Cognate with German Feim (“foam”), Latin spūma (“foam”), Latin pūmex (“pumice”), Sanskrit फेन (phéna, “foam”), possibly Northern Kurdish fê (“epilepsy”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "foam (countable and uncountable, plural foams)",
          "definitionGroups": [
            {
              "group": "A substance composed of a large collection of bubbles or their solidified remains, especially:",
              "entries": [
                {
                  "meaning": "A collection of small bubbles created when the surface of a body of water is moved by tides, wind, etc.",
                  "examples": [
                    "Synonyms: surf, spindrift, spume, spray"
                  ]
                },
                {
                  "meaning": "A collection of small bubbles formed from bodily fluids such as saliva or sweat.",
                  "examples": [
                    "The horses were flecked with foam and their breathing was noisy."
                  ]
                },
                {
                  "meaning": "A collection of small bubbles on the surface of a liquid that is heated, fermented or carbonated.",
                  "examples": [
                    "Synonyms: effervescence, fizz, head, mousse"
                  ]
                },
                {
                  "meaning": "A collection of small bubbles created by mixing soap with water.",
                  "examples": [
                    "Synonyms: lather, suds"
                  ]
                },
                {
                  "meaning": "(firefighting) A collection of small bubbles formed by mixing an extinguishing agent with water, used to cover and extinguish fires.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A material formed by trapping pockets of gas in a liquid or solid.",
                  "examples": [
                    "A foam mat can soften a hard seat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, poetic) The sea.",
                  "examples": [
                    "He is in Europe, across the foam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fury.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "foam (third-person singular simple present foams, present participle foaming, simple past and past participle foamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form or emit foam.",
                  "examples": [
                    "When the fierce North-wind with his airy forces",
                    "Rears up the Baltic to a foaming fury;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To spew saliva as foam; to foam at the mouth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firefighting) To coat or cover with foam.",
                  "examples": [
                    "It used to be common practice to foam the runway prior to an emergency landing, in case a fuel-fed fire occurred."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}