{
  "word": "reclaim",
  "etymologies": [
    {
      "description": [
        "From Middle English reclaymen, recleymen, reclamen, from Anglo-Norman reclamer (noun reclaim and Middle French reclamer (noun reclaim), from Latin reclāmō, reclāmāre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reclaim (plural reclaims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, falconry) The calling back of a hawk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The bringing back or recalling of a person; the fetching of someone back.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An effort to take something back, to reclaim something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "reclaim (third-person singular simple present reclaims, present participle reclaiming, simple past and past participle reclaimed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To return land to a suitable condition for use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To obtain useful products from waste; to recycle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To claim something back; to repossess.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To return someone to a proper course of action, or correct an error; to reform.",
                  "examples": [
                    "Your errour, in time reclaimed, will be veniall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To tame or domesticate a wild animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To call back from flight or disorderly action; to call to, for the purpose of subduing or quieting.",
                  "examples": [
                    "They were the head-strong horses, who hurried Octavius  […]  along, and were deaf to his reclaiming them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To cry out in opposition or contradiction; to exclaim against anything; to contradict; to take exceptions.",
                  "examples": [
                    "Scripture reclaims, and the whole Catholic church reclaims, and Christian ears would not bear it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) To draw back; to give way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, law, Scotland) To appeal from the Lord Ordinary to the inner house of the Court of Session.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology) To bring back a term into acceptable usage, usually of a slur, and usually by the group that was once targeted by that slur.",
                  "examples": [
                    "Once a term of homophobic abuse, the term “queer” has been reclaimed as a marker for some gay, lesbian, bisexual, transgender (GLBT), and other marginalized sexual identities."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}