{
  "word": "avalanche",
  "etymologies": [
    {
      "description": [
        "From French avalanche, from Franco-Provençal (Savoy) avalançhe, blend of aval (“downhill”) and standard lavençhe, from Vulgar Latin *labanka (compare Occitan lavanca, Italian valanga), of uncertain origin, perhaps an alteration of Late Latin lābīna (“landslide”) (compare Franco-Provençal (Dauphiné) lavino, Romansch lavina), from Latin lābēs, from lābor (“to slip, slide”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "avalanche (plural avalanches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large mass or body of snow and ice sliding swiftly down a mountain side, or falling down a precipice.",
                  "examples": [
                    "Synonyms: snowslide, snowslip"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fall of earth, rocks, etc., similar to that of an avalanche of snow or ice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A sudden, great, or irresistible descent or influx; anything like an avalanche in suddenness and overwhelming quantity.",
                  "examples": [
                    "Synonyms: barrage, blitz"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "avalanche (third-person singular simple present avalanches, present participle avalanching, simple past and past participle avalanched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To descend like an avalanche.",
                  "examples": [
                    "Soon the sun’s warmth makes them shed crystal shells",
                    "Shattering and avalanching on the snow-crust—"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To come down upon; to overwhelm.",
                  "examples": [
                    "The applications were doubtless snowed under in the maze of official correspondence which avalanched the new government."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To propel downward like an avalanche.",
                  "examples": [
                    "When our artist and I were dropped down our first coal-mine, we felt a leetle bit anxious. It was something new. But we have been avalanched down the incline from Peak Forest, and boomeranged round the sudden curve at Rowsley, and have run the gauntlet at Penistone and King’s Cross without ever taking the precaution to say “God help us.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}