{
  "word": "cinder",
  "etymologies": [
    {
      "description": [
        "From Middle English cinder, sinder, from Old English sinder (“cinder, dross, slag, scoria, dross of iron, impurity of metal”), from Proto-West Germanic *sindr, from Proto-Germanic *sindrą, *sindraz (“dross, cinder, slag”), from Proto-Indo-European *sendʰro- (“coagulating fluid, liquid slag, scale, cinder”). Cognate with Scots sinder (“ember, cinder”), West Frisian sindel, sintel (“cinder, slag”), Dutch sintel (“cinder, ember, slag”), Middle Low German sinder, sinter (“cinder, slag”), German Sinter (“dross of iron, scale”), Danish sinder (“spark of ignited iron, cinder”), Swedish sinder (“slag or dross from a forge”), Icelandic sindur (“scoring”), Old Church Slavonic сѧдра (sędra, “lime cinder, gypsum”). Spelling (c- for s-) influenced by unrelated French cendre (“ashes”). Doublet of sinter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cinder (plural cinders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Partially or mostly burnt material that results from incomplete combustion of coal or wood etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ember.",
                  "examples": [
                    "If from adown the hopeful chopsThe fat upon the cinder drops,To stinking smoke it turns the flame,Poisoning the flesh from whence it came"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Slag from a metal furnace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, colloquial) Any strong stimulant added to tea, soda water, etc.",
                  "examples": [
                    "Oh, horrid proposition! One would imagine, Tom, that you had been a coal-heaver. Had you said soda and cinder, I would have seconded the motion."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cinder (third-person singular simple present cinders, present participle cindering, simple past and past participle cindered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce to cinders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with cinders.",
                  "examples": [
                    "We plan to cinder this path."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}