{
  "word": "art",
  "etymologies": [
    {
      "description": [
        "From Middle English art, from Old French art, from Latin artem, accusative of ars (“art”). Partly displaced native Old English cræft, whence Modern English craft."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "art (countable and uncountable, plural arts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The conscious production or arrangement of sounds, colours, forms, movements, or other elements in a manner that affects the senses and emotions, usually specifically the production of the beautiful in a graphic or plastic medium.",
                  "examples": [
                    "There is a debate as to whether graffiti is art or vandalism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The creative and emotional expression of mental imagery, such as visual, auditory, social, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Skillful creative activity, usually with an aesthetic focus.",
                  "examples": [
                    "She's mastered the art of programming."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The study and the product of these processes.",
                  "examples": [
                    "He's at university to study art."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Aesthetic value.",
                  "examples": [
                    "Her photographs are nice, but there's no art in them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Artwork.",
                  "examples": [
                    "Sotheby's regularly auctions art for millions.",
                    "art collection"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A field or category of art, such as painting, sculpture, music, ballet, or literature.",
                  "examples": [
                    "I'm a great supporter of the arts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A nonscientific branch of learning; one of the liberal arts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Skill that is attained by study, practice, or observation.",
                  "examples": [
                    "A physician was immediately sent for; but on the first moment of beholding the corpse, he declared that Elvira's recovery was beyond the power of art."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, dated) Contrivance, scheming, manipulation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English art, from Old English eart (“(thou) art”), second-person singular present indicative of wesan, from Proto-Germanic *art (“(thou) art\", originally, \"(thou) becamest”), second-person singular preterite indicative form of *iraną (“to rise, be quick, become active”), from Proto-Indo-European *er-, *or(w)- (“to lift, rise, set in motion”).",
        "Cognate with Faroese ert (“art”), Icelandic ert (“art”), Old English earon (“are”), from the same preterite-present Germanic verb. More at are."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "art",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) second-person singular simple present form of be",
                  "examples": [
                    "How great thou art!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}