{
  "word": "determination",
  "etymologies": [
    {
      "description": [
        "From Middle English determinacion, determynacioun, from Old French determinacion, from Latin dēterminātiō.\nMorphologically determine +‎ -ation"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "determination (countable and uncountable, plural determinations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of determining, or the state of being determined.",
                  "examples": [
                    "Through sheer determination, we managed to escape from the tornado."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Direction or tendency to a certain end; impulsion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality of mind which reaches definite conclusions; decision of character; resoluteness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The state of decision; a judicial decision, or ending of controversy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) That which is determined upon; result of deliberation; purpose; conclusion formed; fixed resolution.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flow, rush, or tendency to a particular part",
                  "examples": [
                    "a determination of blood to the head"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The act, process, or result of any accurate measurement, as of length, volume, weight, intensity, etc.",
                  "examples": [
                    "the determination of the wavelength of light",
                    "the determination of the level of salt in sea water",
                    "the determination of the oxygen in the air"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of defining a concept or notion by giving its essential constituents.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The addition of a distinguishing feature to a concept or notion, thus limiting its extent.",
                  "examples": [
                    "Antonym: generalization"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of determining the relations of an object, such as genus and species; the referring of minerals, plants, or animals, to the species to which they belong; classification",
                  "examples": [
                    "I am indebted to a friend for the determination of most of these shells."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, otherwise obsolete) Bringing to an end; termination; limit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}