{
  "word": "plural",
  "etymologies": [
    {
      "description": [
        "From Middle English plurelle, from Old French plurel (“plural”), borrowed from Latin pluralis (“of or belonging to more than one, belonging to many”, adjective), from plus, pluris (“more”) + -alis."
      ],
      "adjectives": [
        {
          "description": "plural (comparative more plural, superlative most plural)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Consisting of or containing more than one of something.",
                  "examples": [
                    "The notion of culture is one whose meanings are plural and shifting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) In systems of number, not singular or not singular or dual.",
                  "examples": [
                    "English nouns usually have singular and plural forms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Pluralistic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "plural (plural plurals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, uncountable) The plural number. In English, referring to more or less than one of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, countable) A word in the form in which it potentially refers to something other than one person or thing; and other than two things if the language has a dual form.",
                  "examples": [
                    "The plural of 'cat' is 'cats', but the plural of 'child' is 'children'."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology, informal, countable) A person with some form of multiplicity, particularly dissociative identity disorder.",
                  "examples": [
                    "Singlet and monocultural identity is so normalized that many voice hearers and plurals don’t share their experiences with anyone, living in isolation (and sometimes in poverty) and spending considerable inner resources to manage postures and performances of ‘mental health’."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}