{
  "word": "flog",
  "etymologies": [
    {
      "description": [
        "From Middle English *floggen (suggested by flogge (“hammer, sledge”), from Old English *floggian, a stem variant of Proto-Germanic *flukkōną (“to beat”), itself a secondary zero-grade iterative with unetymological -u-, derived from *flōkaną. The original zero-grade iterative *flakkōną had been misinterpreted as an o-grade. See flack (“to beat”), also as a dialectal noun \"a blow, slap\". Cognate with Scots flog (“a blow, stripe, flogging”, noun), Scots flog (“thin strip of wood”), Norwegian flak (“a piece torn off, strip”).",
        "Alternatively, a back-formation from flogger, from Low German flogger (“a flail”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flog (plural flogs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, informal, derogatory) A contemptible, often arrogant person; a wanker.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flog (third-person singular simple present flogs, present participle flogging, simple past and past participle flogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To whip or scourge as punishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use something to extreme; to abuse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, slang) To sell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Australia, New Zealand) To steal something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Australia, New Zealand) To defeat easily or convincingly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Australia, agriculture) To overexploit (land), as by overgrazing, overstocking, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) To beat away charcoal dust etc. using a flogger.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Blend of fake +‎ blog"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flog (plural flogs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang) A weblog designed to look authentic, but actually developed as part of a commercial marketing strategy to promote some product or service.",
                  "examples": [
                    "Though a handful of viral videos and flogs have captured significant interest, the vast majority hardly register with consumers."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}