{
  "word": "acceptance",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "acceptance (countable and uncountable, plural acceptances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act of accepting; the receiving of something offered, with acquiescence, approbation, or satisfaction; especially, favourable reception; approval.",
                  "examples": [
                    "the acceptance of a gift, office, doctrine, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An instance of that act.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Belief in something; agreement, assent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being accepted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The usual or accepted meaning of a word or expression.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, finance) An assent and engagement by the person on whom a bill of exchange is drawn, to pay it when due according to the terms of the acceptance; the bill of exchange itself when accepted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An agreeing to the action, proposals, or terms of another by some act which results in the conclusion of a legally binding contract; the reception or taking of a thing bought as that for which it was bought, or as that agreed to be delivered, or the taking of possession of a thing as owner.",
                  "examples": [
                    "What acts shall amount to such an acceptance is often a question of great nicety and difficulty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(government, US) The act of an authorized representative of the government by which the government assents to ownership of existing and identified supplies, or approves specific services rendered, as partial or complete performance of a contract.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horse racing, Australia, New Zealand, plural only) A list of horses accepted as starters in a race.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(optics) Synonym of etendue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}