{
  "word": "recondite",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Latin reconditus (“concealed, hidden; difficult to understand, unintelligible; shy, withdrawn”), perfect passive participle of recondō (“to conceal, hide; to put away; to re-establish, put back”) + -tus (suffix forming adjectives having the sense ‘provided with’). Recondō is derived from re- (prefix meaning ‘again’) + condō (“to conceal, hide; to put away, store; to put together; to build, establish; to fashion, form”) (ultimately from Proto-Indo-European *dʰeh₁- (“to do, make; to place, put”)). The English word is cognate with Catalan recòndit (“hidden; private”), Italian recondito (“hidden, recondite”), Middle French recondit (“hidden; secret”), Portuguese recôndito (“hidden, secluded; isolated, remote”), Spanish recóndito (“hidden, recondite”).",
        "The noun is probably derived from the adjective.",
        "The verb is derived from Latin recondere, the present active infinitive of recondō; see above."
      ],
      "adjectives": [
        {
          "description": "recondite (comparative more recondite, superlative most recondite)",
          "definitionGroups": [
            {
              "group": "(of areas of discussion or research) Difficult, obscure.",
              "entries": [
                {
                  "meaning": "Difficult to grasp or understand; abstruse, profound.",
                  "examples": []
                },
                {
                  "meaning": "Little known; esoteric, secret.",
                  "examples": []
                },
                {
                  "meaning": "(of scholars) Having mastery over one's field, including its esoteric minutiae; learned.",
                  "examples": []
                },
                {
                  "meaning": "(of writers) Deliberately employing abstruse or esoteric allusions or references; intentionally obscure.",
                  "examples": [
                    "They afford a lesson to the modern metaphysical and recondite writers not to overvalue their works."
                  ]
                }
              ]
            },
            {
              "group": "(somewhat archaic) Hidden or removed from view.",
              "entries": [
                {
                  "meaning": "(botany, entomology, obsolete, rare, of a structure) Difficult to see, especially because it is hidden by another structure.",
                  "examples": [
                    "Recondite, (aculeus) concealed within the abdomen, seldom exposed to view."
                  ]
                },
                {
                  "meaning": "(chiefly zoology, rare) Avoiding notice (particularly human notice); having a tendency to hide; shy.",
                  "examples": [
                    "Synonym: retiring"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "recondite (plural recondites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A recondite (hidden or obscure) person or thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A scholar or other person who is recondite, that is, who has mastery over his or her field, including its esoteric minutiae.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "recondite (third-person singular simple present recondites, present participle reconditing, simple past and past participle recondited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, rare) To conceal, cover up, hide.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}