{
  "word": "dock",
  "etymologies": [
    {
      "description": [
        "From Middle English dokke, from Old English docce, from Proto-West Germanic *dokkā, from Proto-Germanic *dukkǭ (compare Old Danish dokke (“water-dock”), West Flemish dokke, dokkebladeren (“coltsfoot, butterbur”)), from Proto-Indo-European *dʰew- (“dark”) (compare Latvian duga (“scum, slime on water”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dock (countable and uncountable, plural docks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the genus Rumex of coarse weedy plants with small green flowers related to buckwheat, especially bitter dock (Rumex obtusifolius), and used as potherbs and in folk medicine, especially in curing nettle rash.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A burdock plant, or the leaves of that plant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English dok (“trimmed hair, dock”), from Old English *docce, *docca (as in fingirdoccana (“finger muscles”, genitive plural)), from Proto-West Germanic *dokkā, from Proto-Germanic *dukkǭ (compare West Frisian dok (“bunch, ball (twine)”), Low German Dokke (“bundle of straw”), Icelandic dokkur (“stumpy tail”)), from Proto-Indo-European *dʰeu-k- (“to spin, shake”) (compare Lithuanian dvė̃kti (“to breathe, wheeze”), dvãkas (“breath”), Albanian dak (“big ram”), Sanskrit धुक्षति (dhukṣati, “to blow”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dock (plural docks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fleshy root of an animal's tail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of the tail which remains after the tail has been docked.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The buttocks or anus.",
                  "examples": [
                    "And on a Cuſhion ſtuffed with Flocks, / She clapt her dainty pair of Docks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A leather case to cover the clipped or cut tail of a horse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English dokken (“to cut short, dock, curtail”), from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "dock (third-person singular simple present docks, present participle docking, simple past and past participle docked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut off a section of an animal's tail, to practise a caudectomy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce (wages); to deduct from.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut off, bar, or destroy.",
                  "examples": [
                    "to dock an entail"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From early modern English \"area of mud in which a ship can rest at low tide, dock\", borrowed from Dutch dok (“dock”) or Middle Low German docke (“dock, ship's dock”), both from Middle Dutch docke (“port, harbour, roadstead”), of uncertain origin. The original sense may have been \"the furrow a grounded vessel makes in a mud bank\" . Compare modern Dutch dok, modern German Low German Dock, West Frisian dok, German Dock, Danish dok, Swedish docka.",
        "Some sources link this word to an unattested Middle Dutch *docke (“watercourse, trench, canal”), which is a ghost word, only being inferred from Mediaeval Latin documents in the form of ducta, doctus, doccia (“conduit, canal”). However, if this theory is correct, then it would relate the word to Italian doccia (“drainpipe”), making dock a doublet of douche and duct.",
        "An alternative theory ties Middle Dutch docke to a North Germanic/Scandinavian source, notably Old Norse dǫkk (“depression in the landscape, pit, pool, trench”), related to Norwegian dokk (“hollow, low ground”), Old Icelandic dökk, dökð (“pit, pool”), Swedish dank (“marshy ground”). If so, this would make dock a doublet of dank."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dock (plural docks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A fixed structure attached to shore to which a vessel is secured when in port.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A structure attached to shore for loading and unloading vessels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The body of water between two piers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The place of arrival and departure of a train in a railway station.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A section of a hotel or restaurant.",
                  "examples": [
                    "coffee dock"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A device designed as a base for holding a connected portable appliance such as a laptop computer (in this case, referred to as a docking station), or a mobile telephone, for providing the necessary electrical charge for its autonomy, or as a hardware extension for additional capabilities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, graphical user interface) A toolbar that provides the user with a way of launching applications, and switching between running applications.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of docking; joining two things together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) Short for scene-dock.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dock (third-person singular simple present docks, present participle docking, simple past and past participle docked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To land at a harbour.",
                  "examples": [
                    "On 28 February, for example, a US Navy ship docked in Nampo, the port for Pyongyang, with equipment for joint searches for remains of US soldiers missing from the 1950-1953 Korean War. China may look askance at the US and North Korean militaries working together like this."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To join two moving items.",
                  "examples": [
                    "to dock spacecraft"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronautics) To move a spaceship into its dock/berth under its own power.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, sex) To engage in the sexual practice of docking (where the tip of one participant's penis is inserted into the foreskin of the other participant).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To drag a user interface element (such as a toolbar) to a position on screen where it snaps into place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place (an electronic device) in its dock.",
                  "examples": [
                    "I docked the laptop and allowed it to recharge for an hour."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Originally criminal slang; from or akin to obsolete Dutch (West Flemish) dok (“cage, hutch”) or docke (“cage”), from Middle Dutch docke (“coop for animals”), from Proto-Germanic *dukją, *dugją (“enclosed or contained space”) (compare Old High German dogga (“barrel”), Middle Low German docke (“small house”), of uncertain origin, possibly borrowed from a non-Indo-European substrate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dock (plural docks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Part of a courtroom where the accused sits.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Etymology 3 above, referring to puncturing the dough to shorten or prevent excessive rising during baking, similar to the original meaning of cutting off parts of plants."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "dock (third-person singular simple present docks, present participle docking, simple past and past participle docked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) To pierce with holes, as pricking pastry or dough with a fork to prevent excessive rising in the oven.",
                  "examples": [
                    "Pricking holes in the rolled-out pie dough allows the steam to escape while it's baking. Without this, the steam would puff up in bubbles and pockets throughout the crust, which would make some parts of the crust cook too quickly and also result in an uneven surface for your filling. Docking is simple. Just roll out your pie dough and lift it into the pan. After pressing it in and shaping the edge, prick it all over with a fork."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}