{
  "word": "uncle",
  "etymologies": [
    {
      "description": [
        "From Middle English uncle, borrowed from Anglo-Norman uncle and Old French oncle, from Vulgar Latin *aunclum, from Latin avunculus (“maternal uncle”, literally “little grandfather”), from Proto-Indo-European *h₂euh₂-n-tlo- (“little grandfather”), a dialectal diminutive of *h₂éwh₂ō (“grandfather, adult male relative other than one’s father”) (whence also Latin avus (“grandfather”)). Displaced native Middle English em (“uncle”) from Old English ēam (“maternal uncle”), containing the same Proto-Indo-European root, and Old English fædera (“paternal uncle”). Compare Saterland Frisian Unkel (“uncle”), Dutch nonkel (“uncle”), German Low German Unkel (“uncle”), German Onkel (“uncle”), Danish onkel (“uncle”). More at eam and eame."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "uncle (plural uncles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The brother or brother-in-law of one’s parent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The male cousin of one’s parent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(endearing) Used as a fictive kinship title for a close male friend of one's parent or parents.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) Used as a title for the male companion to one's (usually unmarried) parent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A source of advice, encouragement, or help.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, informal, dated) A pawnbroker.",
                  "examples": [
                    "A chain hangs out of the pocket of his velvet waistcoat , by which we may conclude that he has a watch , though we have known many gents whose watches were at their uncle's (as the fashionable term for the pawnbroker goes)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially in the Southern US, parts of UK and South Asia) An affectionate term for a man of an older generation than oneself, especially a friend of one's parents, by means of fictive kin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Southern US, slang, archaic) An older African-American male.",
                  "examples": [
                    "Plain old uncle as he [Socrates] was, with his great ears, — an immense talker."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Malaysia, Myanmar, Singapore, informal) Any middle-aged or elderly man older than the speaker and/or listener.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "uncle (third-person singular simple present uncles, present participle uncling, simple past and past participle uncled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To address somebody by the term uncle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial) To act like, or as, an uncle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}