{
  "word": "launch",
  "etymologies": [
    {
      "description": [
        "From Middle English launchen (“to throw as a lance”), Old French lanchier, another form (Old Northern French/Norman variant, compare Jèrriais lanchi) of lancier, French lancer, from lance."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "launch (plural launches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The movement of a vessel from land into the water; especially, the sliding on ways from the stocks on which it is built. (Compare: to splash a ship.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or fact of launching (a ship/vessel, a project, a new book, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An event held to celebrate the launch of a ship/vessel, project, a new book, etc.; a launch party.",
                  "examples": [
                    "product launch",
                    "book launch"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "launch (third-person singular simple present launches, present participle launching, simple past and past participle launched or (obsolete) launcht)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To throw (a projectile such as a lance, dart or ball); to hurl; to propel with force.",
                  "examples": [
                    "There they were met by four thousand Ha'apa'a warriors, who launched a volley of stones and spears […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To pierce with, or as with, a lance.",
                  "examples": [
                    "Synonyms: lance, pierce"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (a vessel) to move or slide from the land or a larger vessel into the water; to set afloat.",
                  "examples": [
                    "With stays and cordage last he rigged the ship, / And rolled on levers, launched her in the deep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (a rocket, balloon, etc., or the payload thereof) to begin its flight upward from the ground.",
                  "examples": [
                    "A cheap rocket that could launch military reconnaisance satellites for developing countries has become involved in a tangled web of Nazi rocket scientists, Penthouse magazine, KGB disinformation, and a treaty reminiscent of the height of colonialism in Africa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send out; to start (someone) on a mission or project; to give a start to (something); to put in operation",
                  "examples": [
                    "Our business launched a new project."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To start (a program or feature); to execute or bring into operation.",
                  "examples": [
                    "Double-click an icon to launch the associated application."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To release; to put onto the market for sale",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a ship, rocket, balloon, etc.: to depart on a voyage; to take off.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, often with out) To move with force and swiftness like a sliding from the stocks into the water; to plunge; to begin.",
                  "examples": [
                    "In our language, Spenſer has not contented himſelf with this ſubmiſſive manner of imitation : he launches out into very flowery paths […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, computing, of a program) To start to operate.",
                  "examples": [
                    "After clicking the icon, the application will launch."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Portuguese lancha (“barge, launch”), apparently from Malay lancar (“quick, agile”). Spelling influenced by the verb above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "launch (plural launches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The boat of the largest size and/or of most importance belonging to a ship of war, and often called the \"captain's boat\" or \"captain's launch\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A boat used to convey guests to and from a yacht.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) An open boat of any size powered by steam, petrol, electricity, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}