{
  "word": "bugger",
  "etymologies": [
    {
      "description": [
        "From Middle English bougre (“heretic”), from Old French bougre, from Medieval Latin Bulgarus (“Bulgar”), from Old Church Slavonic блъгаринъ (blŭgarinŭ, “Bulgarian”), used in designation of heretics (especially the Bogomils, who arose around the 10th century AD in the First Bulgarian Empire), to whom various sexual practices such as anal sex were ascribed. Doublet of Bulgar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bugger (plural buggers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A heretic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain law) Someone who commits buggery; a sodomite.",
                  "examples": [
                    "The British Sexual Offences Act of 1967 is a buggers’ charter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory, UK, Ireland, Australia, New Zealand, Hawaii, South Africa) A foolish or worthless person or thing; a despicable person.",
                  "examples": [
                    "He's a silly bugger for losing his keys.",
                    "The bugger’s given me the wrong change.",
                    "My computer's being a bit of a bugger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, UK, Ireland, Australia, New Zealand, Hawaii, South Africa) A situation that is aggravating or causes dismay; a pain.",
                  "examples": [
                    "So you're stuck out in the woop-woop and the next train back is Thursday next week. Well, that's a bit of a bugger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, UK, Ireland, Australia, New Zealand, Hawaii, South Africa) Someone viewed with affection; a chap.",
                  "examples": [
                    "How are you, you old bugger?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A damn, anything at all.",
                  "examples": [
                    "I don't give a bugger how important you think it is."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain, Ireland, Australia, New Zealand) Someone who is very fond of something",
                  "examples": [
                    "I'm a bugger for Welsh cakes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, US) A whippersnapper, a tyke.",
                  "examples": [
                    "What is that little bugger up to now?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bugger (third-person singular simple present buggers, present participle buggering, simple past and past participle buggered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, Britain, Ireland, Australia, New Zealand) To have anal sex with, sodomize.",
                  "examples": [
                    "To be buggered sore like a hobo's whore (Attributed to Harry Mclintock's 1920s era Big Rock Candy Mountain)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar in, Britain, Ireland, Australia, New Zealand) To break or ruin.",
                  "examples": [
                    "This computer is buggered! Oh no! I've buggered it up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain, Ireland, Australia, New Zealand) To be surprised.",
                  "examples": [
                    "Bugger me sideways!",
                    "Bugger me, here's my bus.",
                    "Well, I'm buggered!.",
                    "Buggered if I know the answer to that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain, Ireland, Australia, New Zealand) To feel contempt for some person or thing.",
                  "examples": [
                    "Bugger Bognor. (Alleged to be the last words of King George V of the United Kingdom in response to a suggestion that he might recover from his illness and visit Bognor Regis.)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain, Australia, New Zealand) To feel frustration with something, or to consider that something is futile.",
                  "examples": [
                    "Bugger this for a lark.",
                    "Bugger this for a game of soldiers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Britain, Ireland, Australia, New Zealand) To be fatigued.",
                  "examples": [
                    "I'm buggered from all that walking."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From bug (noun) +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bugger (plural buggers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who sets a bug (surveillance device); one who bugs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}