{
  "word": "coral",
  "etymologies": [
    {
      "description": [
        "From Old French coral (French corail), from Latin corallium, from Ancient Greek κοράλλιον (korállion, “coral”). Probably ultimately of Semitic origin, compare Hebrew גּוֹרָל‎ (goral, “small pebble”), Arabic جَرَل‎ (jaral, “small stone”), originally referring to the red variety found in the Mediterranean. Since ancient times, a common folk etymology, accepted by some earlier scholars, connected the word instead to Ancient Greek κόρη (kórē) (referring to Medusa). Beekes mentions both theories and considers the Semitic one convincing."
      ],
      "adjectives": [
        {
          "description": "coral (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of coral.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the orange-pink colour of coral.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "coral (countable and uncountable, plural corals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any of many species of marine invertebrates in the class Anthozoa, most of which build hard calcium carbonate skeletons and form colonies, or a colony belonging to one of those species.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A hard substance made of the skeletons of these organisms.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A somewhat yellowish orange-pink colour; the colour of red coral (Corallium rubrum) of the Mediterranean Sea, commonly used as an ornament or gem.",
                  "examples": [
                    "coral:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ovaries of a cooked lobster; so called from their colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A piece of coral, usually fitted with small bells and other appurtenances, used by children as a plaything.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}