{
  "word": "platform",
  "etymologies": [
    {
      "description": [
        "From Middle French plateforme (“a flat form”), from plate (“flat”) (from Old French plat, from Ancient Greek πλατύς (platús, “flat”)) + forme (“form”) (from Latin fōrma (“shape; figure; form”)); compare flatscape."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "platform (plural platforms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A raised stage from which speeches are made and on which musical and other performances are made.",
                  "examples": [
                    "Synonyms: dais, (speeches) podium"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A raised floor for any purpose, e.g. for workmen during construction, or formerly for military cannon.",
                  "examples": [
                    "Hyponyms: oil platform, work platform"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A place or an opportunity to express one's opinion.",
                  "examples": [
                    "Synonym: tribune",
                    "This new talk show will give a platform to everyday men and women."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Something that allows an enterprise to advance.",
                  "examples": [
                    "Synonyms: foundation, stage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, figurative) A political stance on a broad set of issues, which are called planks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A raised structure from which passengers can enter or leave a train, metro etc.",
                  "examples": [
                    "Hyponym: island platform"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(footwear, in the plural) Ellipsis of platform shoe: a kind of high shoe with an extra layer between the inner and outer soles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) Ellipsis of digital platform: a software system used to provide online services to clients, such as social media, e-commerce, cloud computing etc.",
                  "examples": [
                    "Hyponyms: container platform, microservices platform"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Ellipsis of computing platform: a particular type of operating system or environment such as a database or other specific software, and/or a particular type of computer or microprocessor, used to describe a particular environment for running other software.",
                  "examples": [
                    "That program runs on the X Window System platform."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) Ellipsis of car platform: a set of components shared by several vehicle models.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A flat expanse of rock, often the result of wave erosion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A light deck, usually placed in a section of the hold or over the floor of the magazine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A plan; a sketch; a model; a pattern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Myanmar) sidewalk",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "platform (third-person singular simple present platforms, present participle platforming, simple past and past participle platformed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with or shape into a platform",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place on, or as if on, a platform.",
                  "examples": [
                    "And this dog was satisfied / If a pale thin hand would glide / Down his dewlaps sloping / Which he pushed his nose within, / After—platforming his chin / On the palm left open."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) To place a train alongside a station platform.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, transitive) To include in a political platform",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To publish or make visible; to provide a platform for (a topic etc.).",
                  "examples": [
                    "Antonyms: deplatform, no-platform"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, transitive) To open (a film) in a small number of theaters before a broader release in order to generate enthusiasm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To form a plan of; to model; to lay out.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}