{
  "word": "metaphysics",
  "etymologies": [
    {
      "description": [
        "1560s; plural of metaphysic, from Middle English methaphesik, methaphisik, methaphisique, metaphesyk, methafisik, metaphesyk, methephysyk, from Old French metafisique, methaphisique and Medieval Latin metaphysica, methephisica, from Byzantine Greek μεταφυσικά (metaphusiká), from the title of the collection by Aristotle μετὰ τὰ φυσικά (metà tà phusiká), a collection that comes after (μετά (metá)) Aristotle's collection entitled τὰ φυσικά (tà phusiká), from φυσικός (phusikós, “natural”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "metaphysics (countable and uncountable, plural metaphysics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, uncountable) The branch of philosophy which studies fundamental principles intended to describe or explain all that is, and which are not themselves explained by anything more fundamental; the study of first principles; the study of being insofar as it is being (Latin: ens in quantum ens).",
                  "examples": [
                    "Philosophers sometimes say that metaphysics is the study of the ultimate nature of the universe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, countable) The view or theory of a particular philosopher or school of thinkers concerning the first principles which describe or explain all that is.",
                  "examples": [
                    "The metaphysics of Thomas Aquinas holds that all real beings have both essence and existence.",
                    "In Aristotelian metaphysics physical objects have both form and matter.",
                    "In his Pensées, Pascal mentioned some first principles recognized within his metaphysics: space, time, motion, and number."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic, uncountable, by extension from the philosophical sense) The metalogic of physics; the logical framework of physics.",
                  "examples": [
                    "Even other universes should be a result of different physics. Without rules, these universes wouldn't exist, because they will have an undefined, thus impossible, nature. We will never understand or guess all possible forms of physics. That's why we have to understand the generic metaphysics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, by extension from the philosophical sense) Any fundamental principles or rules.",
                  "examples": [
                    "The metaphysics of global power has changed. Markets are now more valuable than territory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The study of a supersensual realm or of phenomena which transcend the physical world.",
                  "examples": [
                    "I have a collection of books on metaphysics, covering astral projection, reincarnation, and communication with spirits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, derogatory) Displeasingly abstruse, complex material on any subject.",
                  "examples": [
                    "This political polemic strikes me as a protracted piece of overwrought, fog-shrouded metaphysics!"
                  ]
                }
              ]
            }
          ]
        },
        {
          "description": "metaphysics",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "plural of metaphysic",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}