{
  "word": "bailiff",
  "etymologies": [
    {
      "description": [
        "From Middle English baillif, baylyf, from Anglo-Norman and Old French bailif (plural bailis), probably from Vulgar Latin *bāiulivus (“castellan”), from Latin bāiulus (“porter; steward”), whence also bail. As a translation of foreign titles, semantic loan from French bailli, Scots bailie, Dutch baljuw, etc. Mostly replaced the role of native reeve. Doublet of bailo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bailiff (plural bailiffs)",
          "definitionGroups": [
            {
              "group": "(law enforcement) An officer of the court, particularly:",
              "entries": [
                {
                  "meaning": "(historical, Norman term) A reeve, (specifically) the chief officer executing the decisions of any English court in the period following the Norman Conquest or executing the decisions of lower courts in the late medieval and early modern period.",
                  "examples": []
                },
                {
                  "meaning": "(UK) A high bailiff: an officer of the county courts responsible for executing warrants and court orders, appointed by the judge and removable by the Lord Chancellor.",
                  "examples": []
                },
                {
                  "meaning": "(UK) A bound bailiff: a deputy bailiff charged with debt collection.",
                  "examples": []
                },
                {
                  "meaning": "(US) Any law enforcement officer charged with courtroom security and order.",
                  "examples": []
                },
                {
                  "meaning": "A huissier de justice or other foreign officer of the court acting as either a process server or as courtroom security.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A public administrator, particularly:",
              "entries": [
                {
                  "meaning": "(obsolete) A king's man: any officer nominated by the English Crown.",
                  "examples": []
                },
                {
                  "meaning": "(historical) Synonym of hundredman: The chief officer of a hundred in medieval England.",
                  "examples": []
                },
                {
                  "meaning": "The title of the mayor of certain English towns.",
                  "examples": []
                },
                {
                  "meaning": "The title of the castellan of certain royal castles in England.",
                  "examples": []
                },
                {
                  "meaning": "The chief justice and president of the legislature on Jersey and Guernsey in the Channel Islands.",
                  "examples": []
                },
                {
                  "meaning": "The High Bailiff of the Isle of Man.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A bailie: an alderman in certain Scottish towns.",
                  "examples": []
                },
                {
                  "meaning": "(historical) An appointee of the French king administering certain districts of northern France in the Middle Ages.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A head of a district (\"bailiwick\") of the Knights Hospitaller; a head of one of the national associations (\"tongues\") of the Hospitallers' headquarters on Rhodes or Malta.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A landvogt in the medieval German states.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A private administrator, particularly",
              "entries": [
                {
                  "meaning": "(historical) A steward: the manager of a medieval manor charged with collecting its rents, etc.",
                  "examples": []
                },
                {
                  "meaning": "(historical) An overseer: a supervisor of tenant farmers, serfs, or slaves, usually as part of his role as steward (see above).",
                  "examples": []
                },
                {
                  "meaning": "(historical, mining) The foreman or overman of a mine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang) Any debt collector, regardless of his or her official status.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}