{
  "word": "chameleon",
  "etymologies": [
    {
      "description": [
        "From Middle English camelion, from Old French cameleon, from Latin chamaeleon, from Ancient Greek χαμαιλέων (khamailéōn), from χαμαί (khamaí, “on the earth, on the ground”) + λέων (léōn, “lion”); ultimately a calque from Akkadian 𒌨𒈤𒊭𒆠 (nēšu ša qaqqari, “chameleon, reptile”, literally “lion of the ground\", \"predator that crawls upon the ground”). The spelling was re-latinized in the early 18th century. The physics sense was coined by Justin Khoury and Amanda Weltman in 2003 in a paper in Physical Review Letters."
      ],
      "adjectives": [
        {
          "description": "chameleon (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Describing something that changes color.",
                  "examples": [
                    "The wall was covered with a chameleon paint."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "chameleon (plural chameleons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small to mid-size reptile, of the family Chamaeleonidae, and one of the best known lizard families able to change color and project its long tongue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A person with inconstant behavior; one able to quickly adjust to new circumstances.",
                  "examples": [
                    "He is a political chameleon, as charming to business leaders he met privately in Aberdeen on Friday night as he has been inspiring to distressed and desperate Labour defectors in Glasgow and beyond."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A hypothetical scalar particle with a non-linear self-interaction, giving it an effective mass that depends on its environment: the presence of other fields.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}