{
  "word": "dolphin",
  "etymologies": [
    {
      "description": [
        "From Middle English delphyn, from Latin delphīnus, from Ancient Greek δελφίς (delphís), from δελφύς (delphús, “womb”); the modern form in -ol- is probably influenced by the pronunciation of Middle French dauphin. Compare Swedish delfin. Doublet of dauphin. Displaced native Old English mereswīn (literally “sea pig”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dolphin (plural dolphins)",
          "definitionGroups": [
            {
              "group": "A carnivorous aquatic mammal in one of several families of order Cetacea, famed for its intelligence and occasional willingness to approach humans.",
              "entries": [
                {
                  "meaning": "Tursiops truncatus, (Atlantic bottlenose dolphin) the most well-known species.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fish, the mahi-mahi or dorado, Coryphaena hippurus, with a dorsal fin that runs the length of the body, also known for iridescent coloration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A depiction of a fish, with a broad indented fin, usually embowed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The dauphin, eldest son of the kings of France.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(history) A mass of iron or lead hung from the yardarm, in readiness to be dropped through the deck and the hull of an enemy's vessel to sink it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A kind of wreath or strap of plaited cordage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A spar or buoy held by an anchor and furnished with a ring to which ships may fasten their cables.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A mooring post on a wharf or beach.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A permanent fender designed to protect a heavy boat or coastal structure from the impact of large floating objects such as ice or floating logs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, obsolete) One of the handles above the trunnions by which a gun was lifted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Ultimately from 3rd Duke of Alba (duc-d'Albe in French), who was the first to build this type of structure in the Spanish Netherlands in the 16th century.  Possibly from Dutch dukdalf, or the plural dukdalven, through elision of the initial duk-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dolphin (plural dolphins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A man-made semi submerged maritime structure, usually installed to provide a fixed structure for temporary mooring, to prevent ships from drifting to shallow water or to serve as base for navigational aids.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}