{
  "word": "tramp",
  "etymologies": [
    {
      "description": [
        "From Middle English trampen (“to walk heavily”), from Middle Low German trampen (“to stamp”) (trampeln (“to walk with heavy steps”), see trample), or Middle Dutch trampen (“to stamp”), from Proto-West Germanic *trampan (“to step”), from an extension of Proto-Indo-European *dr-, *drem-, *dreh₂-. Doublet of tremp.",
        "The noun sense “vagabond” evolved from the sense “one who tramps”, from 1664. The sense \"ship\" is from about 1880, sense \"promiscuous woman\" is from 1922.",
        "Cognate to Dutch trampen (“to stamp, kick, step”), dialectal German trampen (“to step, walk, tread”), whence commoner German trampeln (“to trample”). Probably related to trap."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tramp (plural tramps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes derogatory) A homeless person; a vagabond.",
                  "examples": [
                    "[S]he had thought to discover a burglar of one or another accepted type—either a dashing cracksman in full-blown evening dress, lithe, polished, pantherish, or a common yegg, a red-eyed, unshaven burly brute in the rags and tatters of a tramp."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A disreputable, promiscuous woman; a slut.",
                  "examples": [
                    "\"I can't believe you'd let yourself be seen with that tramp.\"",
                    "\"Claudia is such a tramp; making out with all those men when she has a boyfriend.\"\nSee also Thesaurus:promiscuous woman"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any ship which does not have a fixed schedule or published ports of call.",
                  "examples": [
                    "I was so happy on board that ship, I could not have believed it possible. We had the beastliest weather, and many discomforts; but the mere fact of its being a tramp-ship gave us many comforts; we could cut about with the men and officers, stay in the wheel-house, discuss all manner of things, and really be a little at sea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand) A long walk, possibly of more than one day, in a scenic or wilderness area.",
                  "examples": [
                    "The starting place for the tramp is reached over a gravel road that begins on Route 3 about a mile south of Gorham spur."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clipping of trampoline, especially a very small one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in apposition) Of objects, stray and intrusive and unwanted",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A metal plate worn by diggers under the hollow of the foot to save the shoe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tramp (third-person singular simple present tramps, present participle tramping, simple past and past participle tramped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To walk with heavy footsteps.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To walk for a long time (usually through difficult terrain).",
                  "examples": [
                    "We tramped through the woods for hours before we found the main path again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hitchhike.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tread upon forcibly and repeatedly; to trample.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To travel or wander through.",
                  "examples": [
                    "to tramp the country"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland) To cleanse, as clothes, by treading upon them in water.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}