{
  "word": "derivation",
  "etymologies": [
    {
      "description": [
        "From Middle English derivacioun, borrowed from Middle French dérivation, from Latin dērīvātiō, dērīvātiōnem.\nMorphologically derive +‎ -ation"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "derivation (countable and uncountable, plural derivations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A leading or drawing off of water from a stream or source.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of receiving anything from a source; the act of procuring an effect from a cause, means, or condition, as profits from capital, conclusions or opinions from evidence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genealogy, linguistics) The act of tracing origin or descent.",
                  "examples": [
                    "the derivation of a word from an Indo-European root"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Forming a new word by changing the base of another word or by adding affixes to it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or method of being derived; the relation of origin when established or asserted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That from which a thing is derived.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is derived; a derivative; a deduction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The operation of deducing one function from another according to a fixed definition, referred to as derivation or differentiation; this is the inverse operation to integration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A drawing of humors or fluids from one part of the body to another, to relieve or lessen a morbid process.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}