{
  "word": "lyric",
  "etymologies": [
    {
      "description": [
        "From French lyrique, or its source, Latin lyricus, from Ancient Greek λυρικός (lurikós), from λύρα (lúra, “lyre”). Its English equivalent would be lyre +‎ -ic.",
        "The original Greek sense of \"lyric poetry\"—\"poetry accompanied by the lyre\" i.e. \"words set to music\"—eventually led to its use as \"lyrics\", first attested in Stainer and Barrett's 1876 Dictionary of Musical Terms. Stainer and Barrett used the word as a singular substantive: \"Lyric, poetry or blank verse intended to be set to music and sung\". By the 1930s, the present use of the plurale tantum \"lyrics\" had begun; it has been standard since the 1950s for many writers. The singular form \"lyric\" is still used to mean the complete words to a song by authorities such as Alec Wilder, Robert Gottlieb, and Stephen Sondheim. However, the singular form is also commonly used to refer to a specific line (or phrase) within a song's lyrics."
      ],
      "adjectives": [
        {
          "description": "lyric (comparative more lyric, superlative most lyric)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetry) Of, or relating to a type of poetry (such as a sonnet or ode) that expresses subjective thoughts and feelings, often in a songlike style",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to a writer of such poetry",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "lyrical",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a light singing voice of modest range",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to musical drama and opera",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "melodious",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to the lyre (or sometimes the harp)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lyric (plural lyrics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lyric poem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) The words of a song or other vocal music.",
                  "examples": [
                    "Synonym: songword",
                    "The lyric in line 3 doesn't rhyme.",
                    "The lyrics were written by the composer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}