{
  "word": "wreak",
  "etymologies": [
    {
      "description": [
        "From Middle English wreken, from Old English wrecan, from Proto-West Germanic *wrekan, from Proto-Germanic *wrekaną, from root *wrek-, from Proto-Indo-European *wreg- (“push, shove, drive, track down”). Cognate via Proto-Germanic with Dutch wreken, German rächen, Swedish vräka; cognate via PIE with Latin Latin urgere (English urge), and distantly cognate with English wreck."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wreak (third-person singular simple present wreaks, present participle wreaking, simple past wreaked or wrought or (rare) wroke, past participle wreaked or wrought or (rare) wroken)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause harm; to afflict; to inflict; to harm or injure; to let out harm.",
                  "examples": [
                    "The earthquake wreaked havoc in the city.",
                    "She wreaked her anger on his car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To chasten, or chastise/chastize, or castigate, or punish, or smite.",
                  "examples": [
                    "The police abused their authority to wreak an innocent.",
                    "The criminal has been wreaked by the Judge to spend a year in prison."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To inflict or take vengeance on.",
                  "examples": [
                    "their woe / Broods maddening inwardly and scorns to wreak / Itself abroad;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To take vengeance for.",
                  "examples": [
                    "Come wreak his loss, whom bootless ye complain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Misspelling of reek.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English wreke, wrake, Northern Middle English variants of wreche, influenced later by Etymology 1, above. Compare Dutch wraak."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wreak (plural wreaks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, literary) Revenge; vengeance; furious passion; resentment.",
                  "examples": [
                    "Would that before my death I might but see my son The empery in my stead over the people hold",
                    "And rush upon his foes and take on them his wreak, At push of sword and pike, in fury uncontrolled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, literary) Punishment; retribution; payback.",
                  "examples": [
                    "Of a surety none murdered the damsel but I; take her wreak on me this moment; for, an thou do not thus, I will require it of thee before Almighty Allah."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}