{
  "word": "companion",
  "etymologies": [
    {
      "description": [
        "From Middle English companion, from Old French compaignon (“companion”) (modern French compagnon), from Late Latin compāniōn- (nominative singular compāniō, whence French copain), from com- +‎ pānis (literally, with + bread), a word first attested in the Frankish Lex Salica as a calque of a Germanic word, probably Frankish *galaibo, *gahlaibō (“messmate”, literally “with-bread”), from Proto-Germanic *gahlaibô. Compare also Old High German galeipo (“messmate”) and Gothic 𐌲𐌰𐌷𐌻𐌰𐌹𐌱𐌰 (gahlaiba, “messmate”); and, for the semantics, compare Old Armenian ընկեր (ənker, “friend”, literally “messmate”). More at co-, loaf. Displaced native Old English ġefēra (literally “fellow traveler”). Doublet of company"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "companion (plural companions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A friend, acquaintance, or partner; someone with whom one spends time or accompanies",
                  "examples": [
                    "His dog has been his trusted companion for the last five years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A person employed to accompany or travel with another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The framework on the quarterdeck of a sailing ship through which daylight entered the cabins below.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The covering of a hatchway on an upper deck which leads to the companionway; the stairs themselves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(topology) A knot in whose neighborhood another, specified knot meets every meridian disk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A thing or phenomenon that is closely associated with another thing, phenomenon, or person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive) An appended source of media or information, designed to be used in conjunction with and to enhance the main material.",
                  "examples": [
                    "The companion guide gives an in-depth analysis of this particular translation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A celestial object that is associated with another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A knight of the lowest rank in certain orders.",
                  "examples": [
                    "a companion of the Bath"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, derogatory) A fellow; a rogue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "companion (third-person singular simple present companions, present participle companioning, simple past and past participle companioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be a companion to; to attend on; to accompany.",
                  "examples": [
                    "we had better turn south quickly and compare the elements of education which formed , and of creation which companioned , Salvator ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To qualify as a companion; to make equal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}