{
  "word": "flat",
  "etymologies": [
    {
      "description": [
        "From Middle English flat, a borrowing from Old Norse flatr (compare Norwegian and Swedish flat, Danish flad), from Proto-Germanic *flataz, from Proto-Indo-European *pleth₂- (“flat”); akin to Saterland Frisian flot (“smooth”), German Flöz (“a geological layer”), Ancient Greek πλατύς (platús), Latvian plats, Sanskrit प्रथस् (prathas, “extension”). Doublet of plat and pleyt.",
        "The noun is from Middle English flat (“level piece of ground, flat edge of a weapon”), from the adjective."
      ],
      "adjectives": [
        {
          "description": "flat (comparative flatter, superlative flattest)",
          "definitionGroups": [
            {
              "group": "Having no variations in height.",
              "entries": [
                {
                  "meaning": "In a horizontal line or plane; not sloping.",
                  "examples": [
                    "a flat roof"
                  ]
                },
                {
                  "meaning": "Smooth; having no protrusions, indentations or other surface irregularities, or relatively so.",
                  "examples": [
                    "The surface of the mirror must be completely flat.",
                    "The carpet isn't properly flat in that corner.",
                    "She has quite a flat face."
                  ]
                },
                {
                  "meaning": "(slang) Having small or invisible breasts and/or buttocks.",
                  "examples": [
                    "That girl is completely flat on both sides."
                  ]
                }
              ]
            },
            {
              "group": "Without variation in level, quantity, value, tone etc.",
              "entries": [
                {
                  "meaning": "At a consistently depressed level; consistently lacklustre.",
                  "examples": [
                    "Sales have been flat all year, and we've barely broken even."
                  ]
                },
                {
                  "meaning": "(not comparable, commerce) Of fees, fares etc., fixed; unvarying.",
                  "examples": [
                    "a flat fee",
                    "flat rates",
                    "a flat fare on public transport"
                  ]
                },
                {
                  "meaning": "(music, voice) Without variations in pitch.",
                  "examples": [
                    "He delivered the speech in a flat tone."
                  ]
                },
                {
                  "meaning": "(of colours) Without variation in tone or hue (uniform), and dull (not glossy).",
                  "examples": [
                    "The walls were painted a flat gray.",
                    "Synonym: matte"
                  ]
                }
              ]
            },
            {
              "group": "(figurative) Lacking liveliness or action; depressed; uninteresting; dull and boring.",
              "entries": [
                {
                  "meaning": "(authorship, figuratively, especially of a character) Lacking in depth, substance, or believability; underdeveloped; one-dimensional.",
                  "examples": [
                    "Antonym: round",
                    "The author added a chapter to flesh out the book's flatter characters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, note) Lowered by one semitone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Of a note or voice, lower in pitch than it should be.",
                  "examples": [
                    "Your A string is flat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Absolute; downright; peremptory.",
                  "examples": [
                    "His claim was in flat contradiction to experimental results.",
                    "I'm not going to the party and that's flat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a tire or other inflated object) Deflated, especially because of a puncture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a carbonated drink) With all or most of its carbon dioxide having come out of solution so that the drink no longer fizzes or contains any bubbles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(wine) Lacking acidity without being sweet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a battery) Unable to emit power; dead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling, of a throw) Without spin; spinless.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics, dated, of a consonant) Sonant; vocal, as distinguished from a sharp (non-sonant) consonant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Not having an inflectional ending or sign, such as a noun used as an adjective, or an adjective as an adverb, without the addition of a formative suffix; or an infinitive without the sign \"to\".",
                  "examples": [
                    "Many flat adverbs, as in 'run fast', 'buy cheap', etc. are from Old English."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf, of a golf club) Having a head at a very obtuse angle to the shaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture, of certain fruits) Flattening at the ends.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of measurements of time) Exact.",
                  "examples": [
                    "He finished the race in a flat four minutes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "flat (comparative more flat, superlative most flat)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "So as to be flat.",
                  "examples": [
                    "Spread the tablecloth flat over the table."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bluntly.",
                  "examples": [
                    "I asked him if he wanted to marry me and he turned me down flat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of accurately measured timings) Exactly, precisely.",
                  "examples": [
                    "In the mile race, Smith's time was 3:58.56, and Brown's was four minutes flat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with units of time, distance, etc) Used to emphasize the smallness of the measurement.",
                  "examples": [
                    "He can run a mile in four minutes flat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Completely.",
                  "examples": [
                    "I am flat broke this month."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Directly; flatly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, slang) Without allowance for accrued interest.",
                  "examples": [
                    "The bonds are trading flat."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "flat (plural flats)",
          "definitionGroups": [
            {
              "group": "An area of level ground (sometimes covered with water).",
              "entries": [
                {
                  "meaning": "(in the phrase 'the flat') Level ground in general.",
                  "examples": [
                    "I can run on the flat but not up hills.",
                    "The going will be easier once we're through these mountains and onto the flat."
                  ]
                },
                {
                  "meaning": "(horse racing, with 'the' or attributively, sometimes with capital) Level horse-racing ground, as contrasted with courses incorporating jumps, or the racing done on such ground.",
                  "examples": [
                    "This horse will do better over the flat.",
                    "flat racing, the flat season"
                  ]
                },
                {
                  "meaning": "(Australia, horse racing, with 'the' or attributively, sometimes with capital) the area in the centre of a racecourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A note played a semitone lower than a natural, denoted by the symbol ♭ placed after the letter representing the note (e.g., B♭) or in front of the note symbol (e.g. ♭♪).",
                  "examples": [
                    "The key of E♭ has three flats."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, automotive) A flat tyre/flat tire.",
                  "examples": [
                    "The next one surrendered his bike, only for that, too, to give him a second flat as he started the descent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A type of ladies' shoe with a very low heel.",
                  "examples": [
                    "She liked to walk in her flats more than in her high heels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A type of flat-soled running shoe without spikes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(painting) A thin, broad brush used in oil and watercolour painting.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The flat part of something:",
              "entries": [
                {
                  "meaning": "(swordfighting) The flat side of a blade, as opposed to the sharp edge.",
                  "examples": []
                },
                {
                  "meaning": "The palm of the hand, with the adjacent part of the fingers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wide, shallow container or pallet.",
                  "examples": [
                    "a flat of strawberries"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mail) A large mail piece measuring at least 8 1/2 by 11 inches, such as catalogs, magazines, and unfolded paper enclosed in large envelopes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, US) A railroad car without a roof, and whose body is a platform without sides; a platform car or flatcar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat-bottomed boat, without keel, and of small draught.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A subset of n-dimensional space that is congruent to a Euclidean space of lower dimension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A straw hat, broad-brimmed and low-crowned.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat sheet for use on a bed.",
                  "examples": [
                    "You might think that Americans buy roughly the same number of fitted sheets as flats. Or, considering the market for electric blankets, duvets, and other covers, that consumers buy even more bottom sheets, simply forgoing the tops."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(publishing) A flat, glossy children's book with few pages.",
                  "examples": [
                    "This same publisher notes pricing is a crucial factor in the mass market field of $1, $1.95 and $2.95 \"flats.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A platform on a wheel, upon which emblematic designs etc. are carried in processions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A horizontal vein or ore deposit auxiliary to a main vein; also, any horizontal portion of a vein not elsewhere horizontal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(technical, theatre, stagecraft) A rectangular wooden structure covered with masonite, lauan, or muslin, often produced in standard modules, that is used to build wall surfaces on stage. Flats can be painted and outfitted with doors and/or windows to depict a building or other part of a scene. It's a hard-surfaced alternative to a backcloth orbackdrop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Any of various hesperiid butterflies that spread their wings open when they land.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An early kind of toy soldier having a flat design.",
                  "examples": [
                    "Among the many US museums hosting flats, we may mention the Toy Soldier Museum in the Pocono Mountains, supervised by the historian, collector and dealer J. Hillestad."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A dull fellow; a simpleton.",
                  "examples": [
                    "[…]  if you cannot make a speech,",
                    "Because you are a flat,",
                    "Go very quietly and drop",
                    "A button in the hat!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for flat ride (“spinning amusement ride”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(optics) A flat (i.e. plane) mirror",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling, slang) A cheater's die with the edges shaved to make certain rolls more likely.",
                  "examples": [
                    "He would slip in his six-ace flats, shaved dice that were made to bring up sevens. He'd throw them just long enough to get well, and then replace them with legitimate cubes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flat (third-person singular simple present flats, present participle flatting, simple past and past participle flatted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) To make a flat call; to call without raising.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become flat or flattened; to sink or fall to an even surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, music, colloquial) To fall from the pitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To depress in tone, as a musical note; especially, to lower in pitch by half a tone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To make flat; to flatten; to level.",
                  "examples": [
                    "The pods, which seldom contain less than thirty nuts of the size of a flatted olive, grow upon the stem and principal branches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To render dull, insipid, or spiritless; to depress.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From 1795, alteration of Scots flet (“inner part of a house”), from Middle English flet (“dwelling”), from Old English flet, flett (“ground floor, dwelling”), from Proto-Germanic *flatją (“floor”), from Proto-Germanic *flataz (“flat”), from Proto-Indo-European *pleth₂- (“flat”). Akin to Old Frisian flet, flette (“dwelling, house”). More at flet, flat1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flat (plural flats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, New England, New Zealand and Australia, archaic elsewhere) An apartment, usually on one level and usually consisting of more than one room.",
                  "examples": [
                    "The excellence of French flats is so well known in America, that the owner will often refer to his property as \"first class French flats.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English flatten, from Old French flatir (“to knock or strike down, dash”), from Frankish *flattjan (“to move the palm of the hand”), from Proto-Germanic *flatjaną (“to make flat, flatten”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "flat (third-person singular simple present flats, present participle flatting, simple past and past participle flatted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To beat or strike; pound",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dash or throw",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dash, rush",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}