{
  "word": "incommode",
  "etymologies": [
    {
      "description": [
        "Learned borrowing from French incommoder (“to bother, disconcert, incommode”), from Latin incommodāre, the present active infinitive of incommodō (“to inconvenience”), from in- (prefix meaning ‘not’) + commodō (“to accommodate, adapt; to bestow, provide; to hire, lend”) (from com- (a variant of con- (prefix indicating completeness or intensification)) + modō (the ablative or singular of modus (“manner, method, way; bound, limit; measure”), ultimately from Proto-Indo-European *med- (“to measure”))). The English word is analysable as in- (prefix meaning ‘not’) +‎ commode (“(archaic or obsolete) to provide (someone or something) with an appropriate, suitable, or necessary thing; to meet the requirements of (someone or something), suit; to repair (something)”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "incommode (third-person singular simple present incommodes, present participle incommoding, simple past and past participle incommoded) (transitive, formal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make (someone) uncomfortable; to discomfort, to disturb, to trouble.",
                  "examples": [
                    "Synonyms: (obsolete) discommodate, discommode"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause (someone or something) inconvenience; to hinder, to impede, to inconvenience, to obstruct.",
                  "examples": [
                    "Synonyms: see Thesaurus:hinder",
                    "Antonyms: see Thesaurus:help"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The adjective is a learned borrowing from French incommode (“causing discomfort; inconvenient; troublesome; undesirable, unwanted, unwelcome”), from Latin incommodus (“inconvenient; disagreeable, troublesome; unfit, unsuitable, unseasonable”), from in- (prefix meaning ‘not’) + commodus (“becoming, suitable; comfortable, commodious; convenient; useful; opportune, timely; friendly, pleasant”) (from com- (a variant of con-) + modus): see further at etymology 1. The English word is analysable as in- (prefix meaning ‘not’) +‎ commode (“(obsolete) convenient, opportune; suitable”).",
        "The noun is derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "incommode (comparative more incommode, superlative most incommode)",
          "definitionGroups": [
            {
              "group": "(formal, obsolete) Synonym of incommodious",
              "entries": [
                {
                  "meaning": "Inapt; unsuitable.",
                  "examples": []
                },
                {
                  "meaning": "Inconvenient; troublesome.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "incommode (plural incommodes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(formal, obsolete) Something which causes inconvenience or trouble; a bother, an incommodity, an inconvenience.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}