{
  "word": "acropolitan",
  "etymologies": [
    {
      "description": [
        "acropolis + -an"
      ],
      "adjectives": [
        {
          "description": "acropolitan (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or befitting an acropolis, especially in lofty glory and in the capacity to inspire awe; compare Acropolitan.",
                  "examples": [
                    "And then, this enduring ocean of houses, of palaces, temples, porticoes, colonnades, which floated before her eyes from the Western Necropolis to the Gardens of the Goddess: Bruchion, the Hellenic town, dazzling and regular; Rhacotis, the Egyptian town, before which the light-flooded Paneion rose like an acropolitan mountain; the Great Temple of Serapis whose façade was horned by two long rosy obelisks; the Great Temple of Aphrodite, surrounded by the murmurs of three hundred thousand palm trees and of numberless waters; the Temple of Persephone and the Temple of Arsinoe, the two sanctuaries of Poseidon, the three towers of Isis Pharis, the seven columns of Isis Lochias, and the Theater and the Hippodrome and the Stadion where Psittacos had run against Nicosthene and the tomb of Stratonice and the tomb of the god Alexander — Alexandria! Alexandria — the sea, the men, the colossal marble Pharos whose mirrors saved men from the sea! Alexandria — the city of Berenice and of the eleven Ptolemaic kings, Physcos, Philometor, Epiphanios, Philadelphos! Alexandria — fulfillment of all dreams, the crown of all glories conquered during three thousand years in Memphis, Thebes, Athens, Corinth, by the chisel, by the reed, by the compass and by the sword!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}