{
  "word": "belap",
  "etymologies": [
    {
      "description": [
        "From Middle English bilappen (“to envelop; to clothe; to surround; to blend, mix”), from bi- (completive, intensifying, or figurative prefix) + lappen (“to wrap; to place so as to enclose or enfold; to encase; to envelop; to clothe; to put on armour; to ensnare, snare”). Lappen is derived from lap, lappe (“loose part of a garment; folded or extended skirt, or loose sleeve, used to hold things; small piece of cloth or mail detached from a garment or coat of mail; a part, portion, share; a person’s lap; (also figuratively) a person’s bosom or breast; (anatomy) a loose part of the body (such as an earlobe or a lobe of the liver); female genitalia; cavity or sinus in the body; (in place names) piece of land at the edge of an estate or parish”) (from Old English læppa (“skirt; (anatomy) lobe”), from Proto-Germanic *lappô (“cloth; rag”); further etymology uncertain, perhaps from Proto-Indo-European *leb- (“to hang down loosely (?)”)) + -en (suffix forming the infinitive of verbs).",
        "The English word is analysable as be- (prefix meaning ‘about; around’ or ‘completely, utterly’) +‎ lap (“to lap or wrap around, envelop, surround”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "belap (third-person singular simple present belaps, present participle belapping, simple past and past participle belapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly passive, obsolete) To lap or wrap around (someone or something); to envelop, to surround.",
                  "examples": [
                    "Synonyms: enfold, environ, lap, (obsolete) umbelap"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}