{
  "word": "vote",
  "etymologies": [
    {
      "description": [
        "From Latin vōtum, a form of voveō (“I vow”) (cognate with Ancient Greek εὔχομαι (eúkhomai, “to vow”)), from Proto-Indo-European *h₁wegʷʰ-. The word is thus a doublet of vow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vote (plural votes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a formalized choice on legally relevant measures such as employment or appointment to office or a proceeding about a legal dispute.",
                  "examples": [
                    "The city council decided the matter should go to public vote.",
                    "Parliament will hold a vote of confidence regarding the minister.",
                    "One occasion indicative votes were used was in 2003 when MPs were presented with seven different options on how to reform the House of Lords."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "an act or instance of participating in such a choice, e.g., by submitting a ballot",
                  "examples": [
                    "The Supreme Court upheld the principle of one person, one vote."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) an ardent wish or desire; a vow; a prayer",
                  "examples": [
                    "Jol[ante]. In you, Sir, / I live; and when, or by the Courſe of Nature, / Or Violence you muſt fall, the End of my / Devotions is, that one and the ſame Hour / May make us fit for Heaven. // Server. I join with you / In my votes that way:  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) a formalized petition or request",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) any judgment of intellect leading to a formal opinion, a point of view",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "any judgment of intellect leading not only to a formal opinion but also to a particular choice in a legally relevant measure, a point of view as published",
                  "examples": [
                    "dissenting votei.e. in particular the differing opinion published with a judicial judgment considered as a source of information"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vote (third-person singular simple present votes, present participle voting, simple past and past participle voted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) to cast a vote; to assert a formalized choice in an election",
                  "examples": [
                    "Did you vote last month?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to choose or grant by means of a vote, or by general consent",
                  "examples": [
                    "The depository may vote shares on behalf of investors who have not submitted instruction to the bank."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}