{
  "word": "sodden",
  "etymologies": [
    {
      "description": [
        "From Middle English sodden, soden, from Old English soden, ġesoden, from Proto-Germanic *sudanaz, past participle of Proto-Germanic *seuþaną (“to seethe; boil”). Cognate with West Frisian sean, Dutch gezoden (“seethed, boiled”) (related to Dutch zode (“swampy land”)), Low German saden, söddt,\nGerman gesotten, Swedish sjuden, Icelandic soðinn. More at seethe."
      ],
      "adjectives": [
        {
          "description": "sodden (comparative more sodden, superlative most sodden)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Soaked or drenched with liquid; soggy, saturated.",
                  "examples": [
                    "It is found, indeed, that meat, roaſted by a fire of peat or turf, is more ſodden than when coal is employed for that purpoſe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Boiled.",
                  "examples": [
                    "The thirde [drynke] is of that kinde of hony named Pechmes, whiche is made of newe wine sodden, vntill the third parte be boyled awaye  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Drunk; stupid as a result of drunkenness.",
                  "examples": [
                    "You whoreson sodden headed sheepes-face  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Dull, expressionless (of a person’s appearance).",
                  "examples": [
                    "Remoue and march, soft and faire Gentlemen, soft and faire: double your files, as you were, faces about. Now you with the sodden face, keepe in there  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sodden (third-person singular simple present soddens, present participle soddening, simple past and past participle soddened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drench, soak or saturate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become soaked.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}