{
  "word": "date",
  "etymologies": [
    {
      "description": [
        "From Middle English date, from Old French date, datil, datille, from Latin dactylus, from Ancient Greek δάκτυλος (dáktulos, “finger”) (from the resemblance of the date to a human finger), probably a folk-etymological alteration of a word from a Semitic source such as Arabic دَقَل‎ (daqal, “variety of date palm”) or Hebrew דֶּקֶל‎ (deqel, “date palm”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "date (plural dates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fruit of the date palm, Phoenix dactylifera, somewhat in the shape of an olive, containing a soft, sweet pulp and enclosing a hard kernel.",
                  "examples": [
                    "We made a nice cake from dates."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The date palm.",
                  "examples": [
                    "There were a few dates planted around the house."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English date, from Old French date, from Late Latin data, from Latin datus (“given”), past participle of dare (“to give”); from Proto-Indo-European *deh₃- (“to give”). Doublet of data."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "date (plural dates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The addition to a writing, inscription, coin, etc., which specifies the time (especially the day, month, and year) when the writing or inscription was given, executed, or made.",
                  "examples": [
                    "the date of a letter, of a will, of a deed, of a coin, etc.",
                    "US date : 05/24/08 = Tuesday, May 24th, 2008. UK date : 24/05/08 = Tuesday 24th May 2008."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specific day in time at which a transaction or event takes place, or is appointed to take place; a given point of time.",
                  "examples": [
                    "the date for pleading",
                    "The start date for the festival is September 2."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A point in time.",
                  "examples": [
                    "You may need that at a later date."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Assigned end; conclusion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Given or assigned length of life; duration.",
                  "examples": [
                    "As now Saturnius, through his life's whole date,",
                    "Hath Nestor's bliss raised to as steep a state,",
                    "Both in his age to keep in peace his house,",
                    "And to have children wise and valorous."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pre-arranged meeting.",
                  "examples": [
                    "I arranged a date with my Australian business partners."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's companion for social activities or occasions.",
                  "examples": [
                    "I brought Melinda to the wedding as my date."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A romantic meeting or outing with a lover or potential lover, or the person so met.",
                  "examples": [
                    "We really hit it off on the first date, so we decided to meet the week after.",
                    "We slept together on the first date.",
                    "The cinema is a popular place to take someone on a date."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "date (third-person singular simple present dates, present participle dating, simple past and past participle dated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To note the time or place of writing or executing; to express in an instrument the time of its execution.",
                  "examples": [
                    "to date a letter, a bond, a deed, or a charter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To note or fix the time of (an event); to give the date of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To determine the age of something.",
                  "examples": [
                    "to date the building of the pyramids"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take (someone) on a date, or a series of dates.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To have a steady relationship with; to be romantically involved with.",
                  "examples": [
                    "Synonyms: go out, see; see also Thesaurus:date"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reciprocal, by extension) To have a steady relationship with each other; to be romantically involved with each other.",
                  "examples": [
                    "They met a couple of years ago, but have been dating for about five months.",
                    "Synonyms: go out, see; see also Thesaurus:date"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make or become old, especially in such a way as to fall out of fashion, become less appealing or attractive, etc.",
                  "examples": [
                    "This show hasn't dated well.",
                    "The comedian dated himself by making quips about bands from the 1960s.",
                    "Synonyms: age, elden, obsolesce; see also Thesaurus:to age"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with from) To have beginning; to begin; to be dated or reckoned.",
                  "examples": [
                    "The Batavian republic dates from the successes of the French arms."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}