{
  "word": "hostage",
  "etymologies": [
    {
      "description": [
        "From Middle English hostage, ostage, from Old French hostage, ostage. This, in turn, is either from Old French hoste (“host”) + -age (in which case the sense development is from taking someone into \"lodging\" to taking them into \"captivity\", to applying the term to a captive), or is from Vulgar Latin obsidāticum (“condition of being held captive”), from Latin obses (“hostage, captive”), with the initial h- added under the influence of hoste or another word. Displaced native Old English ġīsl."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hostage (plural hostages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person given as a pledge or security for the performance of the conditions of a treaty or similar agreement, such as to ensure the status of a vassal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person seized in order to compel another party to act (or refrain from acting) in a certain way, because of the threat of harm to the hostage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that constrains one's actions because it is at risk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is compelled by something, especially something that poses a threat; one who is not free to choose their own course of action.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The condition of being held as security or to compel someone else to act or not act in a particular way.",
                  "examples": [
                    "[…]  which number, in Januarye last, the better halfe were already sett free, and departed, and the rest attend the oportunitye of good passadge, except only some few ordayned to bee kept in hostage, for the redemption of Turkes, pretended from us;  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hostage (third-person singular simple present hostages, present participle hostaging, simple past and past participle hostaged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(possibly nonstandard) To give (someone or something) as a hostage to (someone or something else).",
                  "examples": [
                    "\" […]  in voting the prolongation of the military budget on a war estimate for a span of three years, contemplates, it is said, a speedy reoccupation of the six departments of France which were hostaged to the Germans at the termination of the war.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(possibly nonstandard) To hold (someone or something) hostage, especially in a way that constrains or controls the person or thing held, or in order to exchange for something else.",
                  "examples": [
                    "Flexibility of hours is now hostaged to availability of work. Yet, despite these obvious drawbacks the appeal to nurses of freelancing seems to live on. The chief advantage of agency work is the lack of commitment or not being bound by contract ..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}