{
  "word": "tyke",
  "etymologies": [
    {
      "description": [
        "From Middle English tike, tyke, from Old Norse tík (“bitch”). Compare modern Icelandic tík (“bitch, female dog”), Faroese tík (“bitch, female dog”), Swedish tik (“bitch, female dog”). For sense 5, early 20th century: alteration of Taig."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tyke (plural tykes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) A mongrel dog.",
                  "examples": [
                    "It was the day of warlocks and apparitions, now happily driven out by the zeal of the General Assembly. Witches pursued their wanchancy calling, bairns were spirited away, young lassies selled their souls to the Evil One, and the Accuser of the Brethren, in the shape of a black tyke, was seen about cottage doors in the gloaming."
                  ]
                }
              ]
            },
            {
              "group": "(colloquial) A small child, especially a cheeky or mischievous one",
              "entries": [
                {
                  "meaning": "(Canada) An initiation level of sports competition for young children",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, chiefly Britain) An uncultured, crude and unrefined or uncouth ill-bred person",
                  "examples": [
                    "Why, the inquiry thing, the yellow-dog thing—you wouldn’t think a mangy, native tyke would be allowed to trip up people in the verandah of a magistrate’s court, would you?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, informal) A person from Yorkshire; a Yorkshireman or Yorkshirewoman",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, informal, derogatory) A Roman Catholic",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}