{
  "word": "palliate",
  "etymologies": [
    {
      "description": [
        "From Latin palliatus (“cloaked”) (in Late Latin the past participle of palliare (“to cover with a cloak”)), from pallium (“cloak”)."
      ],
      "adjectives": [
        {
          "description": "palliate (comparative more palliate, superlative most palliate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Cloaked; hidden, concealed. [15th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Eased; mitigated; alleviated.",
                  "examples": [
                    "[the] most helpful method of its Cure, which yet if palliate and imperfect would onely make way to more fatal Sickness"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "palliate (third-person singular simple present palliates, present participle palliating, simple past and past participle palliated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To relieve the symptoms of; to ameliorate. [from 15th c.]",
                  "examples": [
                    "And if there are some bankers out there who are still embarrassed by the size of their bonuses, then I propose that they palliate their guilt by giving to the Mayor's Fund for London to help deprived children in London."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To hide or disguise. [16th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover or disguise the seriousness of (a mistake, offence etc.) by excuses and apologies. [from 17th c.]",
                  "examples": [
                    "We extenuate not our guilt : whatever we sin , we condemn it as mortal : they palliate wickedness , with the fair pretence of veniality"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To lessen the severity of; to extenuate, moderate, qualify. [17th–18th c.]",
                  "examples": [
                    "If, mindless of palliating circumstances, we are bound to regard the death of the Master-at-arms as the prisoner's deed, then does that deed constitute a capital crime whereof the penalty is a mortal one?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To placate or mollify. [from 17th c.]",
                  "examples": [
                    "Brown's options for the machinery of Whitehall are constrained, as for all prime ministers, by the need to palliate allies and hug enemies close (John Reid, say)."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}