{
  "word": "smug",
  "etymologies": [
    {
      "description": [
        "Possibly from Middle Low German smuk (“lithe, delicate, neat, trim”) although the g of the English word is not easily explained. From the Low German derived also North Frisian smok, Danish smuk and Swedish smukk (now obsolete or dialectal). The ultimate source should be Proto-Germanic *smeuganą.",
        "Compare Middle High German gesmuc (“ornament”) and smücken (“to dress, to adorn”), both ultimately from smiegen (“to press to, insert, wrap, to nestle”), hence German schmiegen, Schmuck and schmücken. The adjective schmuck, however, was borrowed from Low German. See smock for more."
      ],
      "adjectives": [
        {
          "description": "smug (comparative smugger, superlative smuggest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Irritatingly pleased with oneself; offensively self-complacent, self-satisfied.",
                  "examples": [
                    "Kate looked extremely smug this morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Showing smugness; showing self-complacency, self-satisfaction.",
                  "examples": [
                    "a smug look on her face"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Studiously neat or nice, especially in dress; spruce; affectedly precise; smooth and prim.",
                  "examples": [
                    "They be so smug and smooth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "smug (third-person singular simple present smugs, present participle smugging, simple past and past participle smugged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To make smug, or spruce.",
                  "examples": [
                    "Thus said, he smug'd his beard, and stroked up fair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, slang) To seize; to confiscate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, slang) To hush up.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}