{
  "word": "pomegranate",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English pome-garnet, pome-garnete, pome garnate, pome granat, pome-granate (“pomegranate fruit; pomegranate tree; pomegranate seeds (?)”) [and other forms], from Anglo-Norman pome gernate, pomme gernette, Middle French pomme granade, pomme granate, pomme grenade, and Old French pome grenade, pome grenate, pomme grenate [and other forms] (modern French grenade), probably from Italian pomogranato, pomo granato (though apparently first attested later), and then either:",
        "The adjective is derived from the noun."
      ],
      "adjectives": [
        {
          "description": "pomegranate (comparative more pomegranate, superlative most pomegranate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a colour like that of the pulp or skin of a pomegranate fruit; dark red or orange-red.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pomegranate (plural pomegranates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fruit of the Punica granatum, about the size of an orange with a thick, hard, reddish skin enclosing many seeds, each with an edible pink or red pulp tasting both sweet and tart.",
                  "examples": [
                    "The seeds of the pomegranate, for example, were widely used to prevent conception in the ancient world and they are still used in India, East Africa, and the Pacific."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The shrub or small tree that bears the fruit.",
                  "examples": [
                    "The pomegranate (Punica granatum L.) originates from Persia, and is cultivated in western and central Asia and in the Mediterranean region; it is also grown commercially in California.  […]  The predominant parasitic nematodes affecting pomegranate are the root knot nematodes, M.[Meloidogyne] incognita, M. acrita and M. javanica (McSorley, 1981)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dark red or orange-red colour, like that of the pulp or skin of a pomegranate fruit.",
                  "examples": [
                    "pomegranate:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, colloquial, derogatory, obsolete) A person of British descent, especially one who has (recently) immigrated to Australia; a pom, a pommy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}