{
  "word": "adhere",
  "etymologies": [
    {
      "description": [
        "From Middle English *adheren (suggested by Middle English adherande (“adhering, adherent”, present participle)), from Latin adhaerēre, adhaesum: ad (“to”) + haerēre (“to stick”). Compare French adhérer."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "adhere (third-person singular simple present adheres, present participle adhering, simple past and past participle adhered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stick fast or cleave, as a glutinous substance does; to become joined or united.",
                  "examples": [
                    "Synonyms: cleave, cling, stick; see also Thesaurus:adhere",
                    "wax adhered to his finger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To be attached or devoted by personal union, in belief, on principle, etc.",
                  "examples": [
                    "King Ferdinand adopted the magnanimous measure recommended by the queen, but he accompanied it with several shrewd conditions, exacting tribute, military services, and safe passages and maintenance for Christian troops throughout the places which should adhere to Boabdil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To be consistent or coherent; to be in accordance; to agree.",
                  "examples": [
                    "For the most part, Hefner's female companions all adhered to the same mold: twentysomething, bosomy and blonde. \"Well, I guess I know what I like,\" he once said when asked about his preferences."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, law) To affirm a judgment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}