{
  "word": "work",
  "etymologies": [
    {
      "description": [
        "From Middle English work, werk, from Old English weorc, from Proto-Germanic *werką, from Proto-Indo-European *wérǵom; akin to Scots wark, Saterland Frisian Wierk, West Frisian wurk, Dutch werk, German Werk, German Low German Wark, Danish værk, Norwegian Bokmål verk, Norwegian Nynorsk verk, Swedish verk and yrke, Icelandic verk, Gothic 𐌲𐌰𐍅𐌰𐌿𐍂𐌺𐌹 (gawaurki), Ancient Greek ἔργον (érgon, “work”) (from ϝέργον (wérgon)), Avestan 𐬬𐬆𐬭𐬆𐬰‎ (vərəz, “to work, to perform”), Armenian գործ (gorc, “work”), Albanian argëtoj (“entertain, reward, please”). English cognates include bulwark, boulevard, energy, erg, georgic, liturgy, metallurgy, organ, surgeon, wright. Doublet of ergon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "work (countable and uncountable, plural works)",
          "definitionGroups": [
            {
              "group": "(uncountable) Employment.",
              "entries": [
                {
                  "meaning": "labour, occupation, job.",
                  "examples": [
                    "Synonyms: see Thesaurus:occupation",
                    "My work involves a lot of travel."
                  ]
                },
                {
                  "meaning": "The place where one is employed.",
                  "examples": [
                    "He hasn’t come home yet; he’s still at work."
                  ]
                },
                {
                  "meaning": "(by extension) One's employer.",
                  "examples": [
                    "I want to go to the reunion concert, but I'm not sure if my work will give me the time off."
                  ]
                },
                {
                  "meaning": "(dated) A factory; a works.",
                  "examples": [
                    "In trials of a Martin furnace in a steel work at Remscheiden, Germany, a lining of zirconia was found in good condition after  […]"
                  ]
                }
              ]
            },
            {
              "group": "(uncountable) Effort.",
              "entries": [
                {
                  "meaning": "effort expended on a particular task.",
                  "examples": [
                    "Synonyms: see Thesaurus:work",
                    "Holding a brick over your head is hard work. It takes a lot of work to write a dictionary."
                  ]
                },
                {
                  "meaning": "Sustained effort to overcome obstacles and achieve a result.",
                  "examples": [
                    "We know what we must do. Let's go to work.",
                    "We don't have much time. Let's get to work piling up those sandbags."
                  ]
                },
                {
                  "meaning": "Something on which effort is expended.",
                  "examples": [
                    "There's lots of work waiting for me at the office."
                  ]
                },
                {
                  "meaning": "(physics) A measure of energy expended in moving an object; most commonly, force times distance. No work is done if the object does not move.",
                  "examples": [
                    "Work is done against friction to drag a bag along the ground."
                  ]
                },
                {
                  "meaning": "(physics, more generally) A measure of energy that is usefully extracted from a process.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Product; the result of effort.",
              "entries": [
                {
                  "meaning": "(uncountable, often in combination) The result of a particular manner of production.",
                  "examples": [
                    "There's a lot of guesswork involved."
                  ]
                },
                {
                  "meaning": "(uncountable, often in combination) Something produced using the specified material or tool.",
                  "examples": [
                    "We've got some paperwork to do before we can get started. The piece was decorated with intricate filigree work."
                  ]
                },
                {
                  "meaning": "(countable) A literary, artistic, or intellectual production.",
                  "examples": [
                    "It is a work of art.",
                    "the poetic works of Alexander Pope"
                  ]
                },
                {
                  "meaning": "(countable) A fortification.",
                  "examples": [
                    "William the Conqueror fortified many castles, throwing up new ramparts, bastions and all manner of works."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, professional wrestling) The staging of events to appear as real.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) Ore before it is dressed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, plural only) The equipment needed to inject a drug (syringes, needles, swabs etc.)",
                  "examples": [
                    "Tell me you're using clean works at least."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English werken and worchen, from Old English wyrċan and wircan (Mercian), from Proto-Germanic *wurkijaną (“to work”), from Proto-Indo-European *werǵ- (“to work”). Cognate with Old Frisian werka, wirka, Old Saxon wirkian, Low German warken, Dutch werken, Old High German wurken (German wirken, werken and werkeln), Old Norse yrkja and orka, (Swedish yrka and orka), Gothic 𐍅𐌰𐌿𐍂𐌺𐌾𐌰𐌽 (waurkjan)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "work (third-person singular simple present works, present participle working, simple past and past participle worked or (rare/archaic) wrought)",
          "definitionGroups": [
            {
              "group": "(intransitive) To do a specific task by employing physical or mental powers.",
              "entries": [
                {
                  "meaning": "Followed by in (or at, etc.) Said of one's workplace (building), or one's department, or one's trade (sphere of business).",
                  "examples": [
                    "I work in a national park",
                    "she works in the human resources department",
                    "he mostly works in logging, but sometimes works in carpentry"
                  ]
                },
                {
                  "meaning": "Followed by as. Said of one's job title",
                  "examples": [
                    "I work as a cleaner."
                  ]
                },
                {
                  "meaning": "Followed by for. Said of a company or individual who employs.",
                  "examples": [
                    "she works for Microsoft",
                    "he works for the president"
                  ]
                },
                {
                  "meaning": "Followed by with. General use, said of either fellow employees or instruments or clients.",
                  "examples": [
                    "I work closely with my Canadian counterparts",
                    "you work with computers",
                    "she works with the homeless people from the suburbs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To effect by gradual degrees;",
                  "examples": [
                    "to work into the earth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To effect by gradual degrees.",
                  "examples": [
                    "he worked his way through the crowd",
                    "the dye worked its way through",
                    "using some tweezers, she worked the bee sting out of her hand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To embroider with thread.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set into action.",
                  "examples": [
                    "He worked the levers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to ferment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To ferment.",
                  "examples": [
                    "the working of beer when the barm is put in"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exhaust, by working.",
                  "examples": [
                    "The mine was worked until the last scrap of ore had been extracted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shape, form, or improve a material.",
                  "examples": [
                    "He used pliers to work the wire into shape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To operate in a certain place, area, or speciality.",
                  "examples": [
                    "she works the night clubs",
                    "the salesman works the Midwest"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To operate in or through; as, to work the phones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provoke or excite; to influence.",
                  "examples": [
                    "The rock musician worked the crowd of young girls into a frenzy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use or manipulate to one’s advantage.",
                  "examples": [
                    "She knows how to work the system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To cause to happen or to occur as a consequence.",
                  "examples": [
                    "I cannot work a miracle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to work.",
                  "examples": [
                    "He is working his servants hard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To function correctly; to act as intended; to achieve the goal designed for.",
                  "examples": [
                    "he pointed at the car and asked, \"Does it work\"?;  he looked at the bottle of pain pills, wondering if they would work;  my plan didn’t work"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To influence.",
                  "examples": [
                    "They worked on her to join the group."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move in an agitated manner.",
                  "examples": [
                    "His fingers worked with tension.",
                    "A ship works in a heavy sea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To behave in a certain way when handled",
                  "examples": [
                    "this dough does not work easily;  the soft metal works well"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ditransitive, poetic) To cause (someone) to feel (something); to do unto somebody (something, whether good or bad).",
                  "examples": [
                    "And indeed I blamed myself and sore repented me of having taken compassion on him and continued in this condition, suffering fatigue not to be described, till I said to myself, \"I wrought him a weal and he requited me with my ill; by Allah, never more will I do any man a service so long as I live!\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To hurt; to ache.",
                  "examples": [
                    "‘I wolde hit were so,’ seyde the Kynge, ‘but I may nat stonde, my hede worchys so—’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To pull off; to wear, perform, etc. successfully or to advantage.",
                  "examples": [
                    "I would never have thought those pieces would go together, but she is working it like nobody's business."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}