{
  "word": "bar",
  "etymologies": [
    {
      "description": [
        "From Middle English barre, from Old French barre (“beam, bar, gate, barrier”), from Vulgar Latin *barra, of uncertain origin. Doublet of barre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bar (countable and uncountable, plural bars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A solid, more or less rigid object of metal or wood with a uniform cross-section smaller than its length.",
                  "examples": [
                    "The window was protected by steel bars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, metallurgy) A solid metal object with uniform (round, square, hexagonal, octagonal or rectangular) cross-section; in the US its smallest dimension is 1⁄4 inch or greater, a piece of thinner material being called a strip.",
                  "examples": [
                    "Ancient Sparta used iron bars instead of handy coins in more valuable alloy, to physically discourage the use of money.",
                    "We are expecting a carload of bar tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cuboid piece of any solid commodity.",
                  "examples": [
                    "bar of chocolate",
                    "bar of soap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broad shaft, band, or stripe.",
                  "examples": [
                    "a bar of light",
                    "a bar of colour"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, narrow drawn or printed rectangle, cuboid or cylinder, especially as used in a bar code or a bar chart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) Any of various lines used as punctuation or diacritics, such as the pipe ⟨|⟩, fraction bar (as in 12), and strikethrough (as in Ⱥ), formerly (obsolete) including oblique marks such as the slash.",
                  "examples": [
                    "Hyponyms: pipe, strikethrough, macron"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The sign indicating that the characteristic of a logarithm is negative, conventionally placed above the digit(s) to show that it applies to the characteristic only and not to the mantissa.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A similar sign indicating that the charge on a particle is the negative of its usual value (and that consequently the particle is in fact an antiparticle).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A business selling alcoholic drinks for consumption on the premises, or the premises themselves; a public house.",
                  "examples": [
                    "Synonyms: barroom, ginshop, (British) pub, public house, tavern; see also Thesaurus:pub",
                    "The street was lined with all-night bars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The counter of such premises.",
                  "examples": [
                    "Synonym: wet bar",
                    "Step up to the bar and order a drink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A counter, or simply a cabinet, from which alcoholic drinks are served in a private house or a hotel room.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, in combinations such as coffee bar, juice bar, etc.) Premises or a counter serving any type of beverage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An establishment where alcohol and sometimes other refreshments are served.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An informal establishment selling food to be consumed on the premises.",
                  "examples": [
                    "a burger bar",
                    "a local fish bar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An establishment offering cosmetic services.",
                  "examples": [
                    "a nail bar; a brow bar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An official order or pronouncement that prohibits some activity.",
                  "examples": [
                    "Synonyms: ban, prohibition",
                    "The club has lifted its bar on women members."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything that obstructs, hinders, or prevents; an obstruction; a barrier.",
                  "examples": [
                    "Mr Harding could look back on his initial judgement of Paul's talent with great satisfaction while Paul could reflect that to be Irish was not necessarily a bar to progress."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming, whimsical, derived from fubar) A metasyntactic variable representing an unspecified entity, often the second in a series, following foo.",
                  "examples": [
                    "Suppose we have four objects, foo, bar, baz and quux."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Parliament) A dividing line (physical or notional) in the chamber of a legislature beyond which only members and officials may pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, law) The railing surrounding the part of a courtroom in which the judges, lawyers, defendants and witnesses stay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Philippines, law, usually with the) The bar exam, the legal licensing exam.",
                  "examples": [
                    "He's studying hard to pass the Bar this time; he's failed it twice before."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, metonymically, \"the Bar\", \"the bar\") Collectively, lawyers or the legal profession; specifically applied to barristers in some countries, but including all lawyers in others.",
                  "examples": [
                    "He was called to the bar, he became a barrister."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telecommunications, electronics) One of an array of bar-shaped symbols that display the level of something, such as wireless signal strength or battery life remaining.",
                  "examples": [
                    "I don't have any bars in the middle of this desert."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A vertical line across a musical staff dividing written music into sections, typically of equal durational value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) One of those musical sections.",
                  "examples": [
                    "Synonym: measure"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A horizontal pole that must be crossed in the high jump and pole vault.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any level of achievement regarded as a challenge to be overcome.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer, most codes) The crossbar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(backgammon) The central divider between the inner and outer table of a backgammon board, where stones are placed if they are hit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An addition to a military medal, on account of a subsequent act.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A linear shoaling landform feature within a body of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography, nautical, hydrology) A ridge or succession of ridges of sand or other substance, especially a formation extending across the mouth of a river or harbor or off a beach, and which may obstruct navigation. (FM 55-501).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) One of the ordinaries in heraldry; a diminutive of a fess.",
                  "examples": [
                    "Coordinate terms: barrulet, closet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A city gate, in some British place names.",
                  "examples": [
                    "Temple Bar, London"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A drilling or tamping rod.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A vein or dike crossing a lode.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A gatehouse of a castle or fortified town.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(farriery) The part of the crust of a horse's hoof which is bent inwards towards the frog at the heel on each side, and extends into the centre of the sole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(farriery, in the plural) The space between the tusks and grinders in the upper jaw of a horse, in which the bit is placed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A measure of drugs, typically one ounce.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English barren, from Old French barrer, from Medieval Latin barrare (“to bar”), from the noun. Cognate to Occitan barrar, Spanish barrar, Portuguese barrar.",
        "Preposition properly imperative of the verb. Compare barring."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [
        {
          "description": "bar",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Except, other than, besides.",
                  "examples": [
                    "Synonyms: apart from, barring, except for, excepting, excluding, other than, save; see also Thesaurus:except",
                    "He invited everyone to his wedding bar his ex-wife."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horse racing) Denotes the minimum odds offered on other horses not mentioned by name.",
                  "examples": [
                    "Leg At Each Corner is at 3/1, Lost My Shirt 5/1, and it's 10/1 bar."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [
        {
          "description": "bar (third-person singular simple present bars, present participle barring, simple past and past participle barred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To obstruct the passage of (someone or something).",
                  "examples": [
                    "Our way was barred by a huge rockfall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prohibit.",
                  "examples": [
                    "I couldn't get into the nightclub because I had been barred."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lock or bolt with a bar.",
                  "examples": [
                    "bar the door"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To imprint or paint with bars, to stripe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Ancient Greek βάρος (báros, “weight”), coined circa 1900."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bar (plural bars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A non-SI unit of pressure equal to 100,000 pascals, approximately equal to atmospheric pressure at sea level.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}