{
  "word": "lunch",
  "etymologies": [
    {
      "description": [
        "Recorded since 1580; presumably short for luncheon, but earliest found also as lunshin, lunching, equivalent to lunch +‎ -ing, with the suffix -ing later modified to simulate a French origin. Lunch is possibly a derivative of lump (as hunch is from hump. See hunch for more), or represents an alteration of nuncheon, from Middle English nonechenche (“light midday meal”) (see nuncheon) and altered by northern English dialect lunch (“hunk of bread or cheese”) (1590), which perhaps is from lump or from Spanish lonja (“a slice”, literally “loin”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lunch (countable and uncountable, plural lunches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light meal usually eaten around midday, notably when not as main meal of the day.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A break in play between the first and second sessions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Minnesota, US) Any small meal, especially one eaten at a social gathering.",
                  "examples": [
                    "After the funeral there was a lunch for those who didn't go to the cemetery."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lunch (third-person singular simple present lunches, present participle lunching, simple past and past participle lunched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To eat lunch.",
                  "examples": [
                    "I like to lunch in Italian restaurants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat to lunch.",
                  "examples": [
                    "We dined him, we lunched him, we were photographed in his company by flashlight."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}