{
  "word": "parchment",
  "etymologies": [
    {
      "description": [
        "From Middle English parchemyn, parchement, from Old French parchemin, via Latin pergamīna, from Ancient Greek Περγαμηνός (Pergamēnós, “of Pergamon”), which is named for the Ancient city of Pergamon (modern Bergama) in Asia Minor, where it was invented as an expensive alternative for papyrus.  Cognate with Danish pergament, Dutch perkament, French parchemin, German Pergament, Greek περγαμηνή (pergaminí), Italian pergamena, Norwegian pergament, Portuguese pergaminho, Galician pergameo, Romanian pergament, Russian пергамент (pergament), Spanish pergamino, and Swedish pergament."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parchment (countable and uncountable, plural parchments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Material, made from the polished skin of a calf, sheep, goat or other animal, used like paper for writing.",
                  "examples": [
                    "At twilight in the summer there is never anybody to fear—man, woman, or cat—in the chambers and at that hour the mice come out. They do not eat parchment or foolscap or red tape, but they eat the luncheon crumbs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A document made on such material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A diploma (traditionally written on parchment).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Stiff paper imitating that material.",
                  "examples": [
                    "Synonyms: vegetal parchment, parchment paper, wax paper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The creamy to tanned color of parchment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The envelope of the coffee grains, inside the pulp.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}