{
  "word": "nightcap",
  "etymologies": [
    {
      "description": [
        "night +‎ cap"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nightcap (plural nightcaps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A warm cloth cap worn while sleeping, often with pajamas, being common attire in northern Europe before effective home heating became widespread. [From 14th c.]",
                  "examples": [
                    "Winston wore a nightcap to stave off the cold."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A beverage drunk before bed that is usually alcoholic. [From 1818.]",
                  "examples": [
                    "I'll make myself a nightcap of whisky and lemon before heading to bed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, figuratively) Something that a person reads or listens to before bed.",
                  "examples": [
                    "\" […]  and as a nightcap I happened to pick the copy of Plato  […] \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, sports, baseball) The final match of a sporting contest, especially the second game of a baseball doubleheader. [From 1939.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A cap drawn over the face of the condemned person before they are hanged.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nightcap (third-person singular simple present nightcaps, present participle nightcapping, simple past and past participle nightcapped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To drink an alcoholic beverage shortly before retiring to bed.",
                  "examples": [
                    "Even better than breakfast, though, is nightcapping at the Waffle House . Nightcapping happens after the bars close, but before the southern sunrise: the hours when their jukeboxes play “Freebird” on a continual loop,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}