{
  "word": "tierce",
  "etymologies": [
    {
      "description": [
        "From Old French tierce, from Latin tertia."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tierce (plural tierces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A third.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion, Roman Catholicism) Synonym of terce: the third canonical hour or its service.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical) A measure of capacity equal to a third of a pipe, or a cask or other vessel holding such a quantity; a cask larger than a barrel, and smaller than a hogshead or a puncheon, in which wine or salt provisions, rice, etc., are packed for shipment.",
                  "examples": [
                    "He then gave me a large piece of silver coin, such as I never had seen or had before, and told me to get ready for the voyage, and he would credit me with a tierce of sugar, and another of rum  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The third tone of the scale. See mediant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A sequence of three playing cards of the same suit. Tierce of ace, king and queen is called tierce-major.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) The third defensive position, with the sword hand held at waist height, and the tip of the sword at head height.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) An ordinary that covers the left or right third of the field of a shield or flag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One sixtieth of a second, i.e., the third in a series of fractional parts in a sexagesimal number system. (Also known as a third.)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}