{
  "word": "stagger",
  "etymologies": [
    {
      "description": [
        "From Middle English stageren, stakeren, from Old Norse stakra (“to push, stagger”). Cognate with dialectal Danish stagre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stagger (plural staggers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unsteady movement of the body in walking or standing as if one were about to fall; a reeling motion.",
                  "examples": [
                    "Put down the rosary beads folks, I believe hell may just have frozen over. Peyton Manning drops back, sees nothing open and runs for a first down. If you can call that running. More like the stagger of a wounded rhino. Did the job, though"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(veterinary medicine) A disease of horses and other animals, attended by reeling, unsteady gait or sudden falling.",
                  "examples": [
                    "parasitic staggers",
                    "apoplectic or sleepy staggers"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bewilderment; perplexity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The spacing out of various actions over time.",
                  "examples": [
                    "I don’t include cured pork, although it is very nice, and rather than putting everything in the pan at once I prefer a stagger of ingredients, which ensures each one gets the right amount of time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(motor racing) The difference in circumference between the left and right tires on a racing vehicle. It is used on oval tracks to make the car turn better in the corners.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The horizontal positioning of a biplane, triplane, or multiplane's wings in relation to one another.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stagger (third-person singular simple present staggers, present participle staggering, simple past and past participle staggered)",
          "definitionGroups": [
            {
              "group": "To sway unsteadily, reel, or totter.",
              "entries": [
                {
                  "meaning": "(intransitive) In standing or walking, to sway from one side to the other as if about to fall; to stand or walk unsteadily; to reel or totter.",
                  "examples": [
                    "She began to stagger across the room."
                  ]
                },
                {
                  "meaning": "(transitive) To cause to reel or totter.",
                  "examples": [
                    "The powerful blow of his opponent's fist staggered the boxer."
                  ]
                },
                {
                  "meaning": "(intransitive) To cease to stand firm; to begin to give way; to fail.",
                  "examples": [
                    "The enemy staggers."
                  ]
                }
              ]
            },
            {
              "group": "Doubt, waver, be shocked.",
              "entries": [
                {
                  "meaning": "(intransitive) To begin to doubt and waver in purposes; to become less confident or determined; to hesitate.",
                  "examples": [
                    "He [Abraham] staggered not at the promise of God through unbelief."
                  ]
                },
                {
                  "meaning": "(transitive) To cause to doubt and waver; to make to hesitate; to make less steady or confident; to shock.",
                  "examples": [
                    "He will stagger the committee when he presents his report."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) Have multiple groups doing the same thing in a uniform fashion, but starting at different, evenly spaced, times or places (attested from 1856).",
              "entries": [
                {
                  "meaning": "To arrange (a series of parts) on each side of a median line alternately, as the spokes of a wheel or the rivets of a boiler seam.",
                  "examples": []
                },
                {
                  "meaning": "To arrange similar objects such that each is ahead or above and to one side of the next.",
                  "examples": [
                    "We will stagger the starting positions for the race on the oval track."
                  ]
                },
                {
                  "meaning": "To schedule in intervals or at different times.",
                  "examples": [
                    "We will stagger the run so the faster runners can go first, then the joggers."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "stag +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stagger (plural staggers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) One who attends a stag night.",
                  "examples": [
                    "Tallinn no longer takes pride in the title of 'favourite destination of British staggers'."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}