{
  "word": "dust",
  "etymologies": [
    {
      "description": [
        "From Middle English dust, doust, from Old English dūst (“dust, dried earth reduced to powder; other dry material reduced to powder”), from the fusion of Proto-Germanic *dustą (“dust”) and *dunstą (“mist, dust, evaporation”), both from Proto-Indo-European *dʰewh₂- (“to smoke, raise dust”).",
        "Cognate with Scots dust, dist (“dust”), Dutch duist (“pollen, dust”) and dons (“down, fuzz”), German Dust (“dust”) and Dunst (“haze”), Swedish dust (“dust”), Icelandic dust (“dust”), Latin fūmus (“smoke, steam”). Also related to Swedish dun (“down, fluff”), Icelandic dúnn (“down, fluff”). See down."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dust (countable and uncountable, plural dusts)",
          "definitionGroups": [
            {
              "group": "Fine particles",
              "entries": [
                {
                  "meaning": "(uncountable) Fine, dry particles of matter found in the air and covering the surface of objects, typically consisting of soil lifted up by the wind, pollen, hair, etc.",
                  "examples": []
                },
                {
                  "meaning": "(astronomy, uncountable) Submicron particles in outer space, largely silicates and carbon compounds, that contribute greatly to extinction at visible wavelengths.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A single particle of earth or other material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The act of cleaning by dusting.",
                  "examples": [
                    "[…] once they start school, I mean you can do a room out one day, the next day it only needs a dust, doesn't it?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The earth, as the resting place of the dead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The earthy remains of bodies once alive; the remains of the human body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Something worthless.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A low or mean condition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) cash; money (in reference to gold dust).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A disturbance or uproar.",
                  "examples": [
                    "to raise, or kick up, a dust"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A totally disconnected set of points with a fractal structure.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dust (third-person singular simple present dusts, present participle dusting, simple past and past participle dusted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove dust from.",
                  "examples": [
                    "The cleaning lady needs a stool to dust the cupboard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To remove dust; to clean by removing dust.",
                  "examples": [
                    "Dusting always makes me cough."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a bird, to cover itself in sand or dry, dusty earth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spray or cover something with fine powder or liquid.",
                  "examples": [
                    "The mother dusted her baby's bum with talcum powder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US slang) To leave; to rush off.",
                  "examples": [
                    "He added in a casual tone: ‘The girl can dust. I'd like to talk to you a little, soldier.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reduce to a fine powder; to levigate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To kill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}