{
  "word": "mole",
  "etymologies": [
    {
      "description": [
        "From Middle English mole, mool, from Old English māl (“a mole, spot, mark, blemish”), from Proto-West Germanic *mail, from Proto-Germanic *mailą (“spot, wrinkle”), from Proto-Indo-European *mel-, *melw- (“dark, dirty”), from Proto-Indo-European *mey-, *my- (“to soil, sully”).",
        "Cognate with Scots mail (“spot, stain”), Saterland Frisian Moal (“scar”), German dialectal Meil (“spot, stain, blemish”), Gothic 𐌼𐌰𐌹𐌻 (mail, “spot, blemish”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mole (plural moles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pigmented spot on the skin, a naevus, slightly raised, and sometimes hairy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English molle (“mole”), molde, mole, ultimately from Proto-Germanic *mulaz, *mulhaz (“mole, salamander”), from Proto-Indo-European *molg-, *molk- (“slug, salamander”), from Proto-Indo-European *(s)melw- (“to grind, crush, beat”).",
        "Cognate with North Frisian mull (“mole”), Saterland Frisian molle (“mole”), Dutch mol (“mole”), Low German Mol, Mul (“mole”), German Molch (“salamander, newt”), Old Russian смолжь (smolžʹ, “snail”), Czech mlž (“clam”).",
        "Derivation as an abbreviation of Middle English molewarpe, a variation of moldewarpe, moldwerp (“mole”) in Middle English is unexplained and probably unlikely due to the simultaneous occurrence of both words. See mouldwarp."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mole (plural moles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several small, burrowing insectivores of the family Talpidae; also any of southern African mammals in the family Chrysochloridae (golden moles) and any of several Australian mammals in the family Notoryctidae (marsupial moles), similar to but not closely related to Talpidae moles",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the burrowing rodents also called mole-rats.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(espionage) An internal spy, a person who involves himself or herself with an enemy organisation, especially an intelligence or governmental organisation, to determine and betray its secrets from within.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of self-propelled excavator used to form underground drains, or to clear underground pipelines",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of underground drain used in farm fields, in which a mole plow creates an unlined channel through clay subsoil.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From moll (from Moll, an archaic nickname for Mary), influenced by the spelling of the word mole (“an internal spy”), and due to /mɒl/ and /məʊl/ merging as [moʊl] in the Australian accent."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mole (plural moles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) A moll, a bitch, a slut.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French môle or Latin mōles (“mass, heap, rock”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mole (plural moles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A massive structure, usually of stone, used as a pier, breakwater or junction between places separated by water.",
                  "examples": [
                    "[about Saint-Tropez] Yachts and fishing boats fill the little square of water, which is surrounded on two sides by quays, on the third by a small ship-repairing yard and on the fourth by the mole where the fishing boats moor and the nets are spread out to dry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A haven or harbour, protected with such a breakwater.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An Ancient Roman mausoleum.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Calqued from German Mol; spelled as if it had come directly from molecule or Latin moles (the ultimate source of Mol and molecule in any event)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mole (plural moles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry, physics) In the International System of Units, the base unit of amount of substance; the amount of substance of a system which contains exactly 6.02214076×1023 elementary entities (atoms, ions, molecules, etc.). Symbol: mol. The number of atoms is known as Avogadro’s number. [from 1897]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French môle f, from Latin mola (“millstone”), because it is a hardened mass."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mole (plural moles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hemorrhagic mass of tissue in the uterus caused by a dead ovum.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Spanish mole, from Classical Nahuatl mōlli (“sauce; stew; something ground”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mole (countable and uncountable, plural moles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of several spicy sauces typical of the cuisine of Mexico and neighboring Central America, especially a sauce which contains chocolate and which is used in cooking main dishes, not desserts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}