{
  "word": "sting",
  "etymologies": [
    {
      "description": [
        "From Middle English stynge, sting, stenge, from Old English sting, stinċġ (“a sting, stab, thrust made with a pointed instrument; the wound made by a stab or sting”), from Proto-Germanic *stangiz."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sting (plural stings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bump left on the skin after having been stung.",
                  "examples": [
                    "Look at this nasty hornet sting: it's turned blue!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A puncture made by an insect or arachnid in an attack, usually including the injection of venom.",
                  "examples": [
                    "She died from a bee sting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pointed portion of an insect or arachnid used for attack.",
                  "examples": [
                    "Synonym: stinger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp, localised pain primarily on the epidermis",
                  "examples": [
                    "That plant will give a little sting if you touch it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A sharp-pointed hollow hair seated on a gland which secretes an acrid fluid, as in nettles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The thrust of a sting into the flesh; the act of stinging; a wound inflicted by stinging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law enforcement) A police operation in which the police pretend to be criminals in order to catch a criminal.",
                  "examples": [
                    "The criminal gang was caught after a successful sting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short percussive phrase played by a drummer to accent the punchline in a comedy show.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief sequence of music used in films, TV, and video games as a form of scenic punctuation or to identify the broadcasting station.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A support for a wind tunnel model which extends parallel to the air flow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) The harmful or painful part of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A goad; incitement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The concluding point of an epigram or other sarcastic saying.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stingen, from Old English stingan, from Proto-Germanic *stinganą. Compare Swedish and Icelandic stinga."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sting (third-person singular simple present stings, present participle stinging, simple past stung or (rare, dialectal) stang, past participle stung)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To hurt, usually by introducing poison or a sharp point, or both.",
                  "examples": [
                    "An adder came out of a little heathbush, and it stung a man in the foot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of an insect or arachnid) To puncture with the stinger.",
                  "examples": [
                    "A mosquito stung me on the arm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, sometimes figurative) To hurt, to be in pain (physically or emotionally).",
                  "examples": [
                    "My hand stings after knocking on the door so long.",
                    "Still, it stung when a slightly older acquaintance asked me why I couldn't do any better."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To cause harm or pain to.",
                  "examples": [
                    "I thought I could park in front of the hotel, but they stung me for five pounds!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}