{
  "word": "erosion",
  "etymologies": [
    {
      "description": [
        "From Middle French erosion, from Latin ērōsiō (“eating away”), derived from ērōdō.",
        "The first known occurrence in English was in the 1541 translation by Robert Copland of Guy de Chauliac's medical text The Questyonary of Cyrurygens. Copland used erosion to describe how ulcers developed in the mouth. By 1774 erosion was used outside medical subjects. Oliver Goldsmith employed the term in the more contemporary geological context, in his book Natural History, with the quote"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "erosion (countable and uncountable, plural erosions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The result of having been worn away or eroded, as by a glacier on rock or the sea on a cliff face.",
                  "examples": [
                    "Father Ted: The cliffs were gone? How could they just disappear?Dougal: Erosion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The changing of a surface by mechanical action, friction, thermal expansion contraction, or impact.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figurative) The gradual loss of something as a result of an ongoing process.",
                  "examples": [
                    "the erosion of a person's trust",
                    "trademark erosion, caused by everyday use of the trademarked term"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Destruction by abrasive action of fluids.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, image processing) One of two fundamental operations in morphological image processing from which all other morphological operations are derived.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dentistry) Loss of tooth enamel due to non-bacteriogenic chemical processes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A shallow ulceration or lesion, usually involving skin or epithelial tissue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) In morphology, a basic operation (denoted ⊖); see Erosion (morphology).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}