{
  "word": "marble",
  "etymologies": [
    {
      "description": [
        "From Middle English marble, marbre, from Anglo-Norman and Old French marbre, from Latin marmor, from Ancient Greek μάρμαρος (mármaros), perhaps related to μαρμάρεος (marmáreos, “gleaming”). Much of the early classical marble came from the 'Marmaris' sea above the Aegean. The forms from French replaced Old English marma, which had previously been borrowed from Latin."
      ],
      "adjectives": [
        {
          "description": "marble (comparative more marble, superlative most marble)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of, or resembling, marble.",
                  "examples": [
                    "a marble mantel",
                    "marble paper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Cold; hard; unfeeling.",
                  "examples": [
                    "a marble heart"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "marble (countable and uncountable, plural marbles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, petrology) A metamorphic rock of crystalline limestone. [from 12th c.]",
                  "examples": [
                    "Hypernym: limestone"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, games) A small ball used in games, originally of marble but now usually of glass or ceramic. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, archaeology) Statues made from marble. [from 17th c.]",
                  "examples": [
                    "The Elgin Marbles were originally part of the temple of the Parthenon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "marble (third-person singular simple present marbles, present participle marbling, simple past and past participle marbled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (something to have) the streaked or swirled appearance of certain types of marble, for example by mixing viscous ingredients incompletely, or by applying paint or other colorants unevenly.",
                  "examples": [
                    "Synonym: marbleize"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To get or have the streaked or swirled appearance of certain types of marble, for example due to the incomplete mixing of viscous ingredients, or the uneven application of paint or other colorants.",
                  "examples": [
                    "Scent the entire batch and then color half with the blue colorant. Pour both parts back into your soap pot. Do not stir. Pour in a circular motion into a block mold. The pouring action will cause the soap to marble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause meat, usually beef, pork, or lamb, to be interlaced with fat so that its appearance resembles that of marble.",
                  "examples": [
                    "Synonym: marbleize"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of meat, especially beef) To become interlaced with fat; (of fat) to interlace through meat.",
                  "examples": [
                    "We've gone mostly to black bulls — Angus bulls because today the packers like black cattle. They seem to marble better."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, figurative) To lace or be laced throughout.",
                  "examples": [
                    "Was he the reason for the bitterness that seemed to marble her character?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}