{
  "word": "pleach",
  "etymologies": [
    {
      "description": [
        "The verb is from Late Middle English pleshe, Middle English plechen, pleche (“to layer; to propagate (a plant) by layering, to pleach”), possibly from Anglo-Norman and Middle French plesser, plessier, Middle French plescer, variants of Middle French, Old French plaissier, plessier (“to plash”), from Late Latin *plaxus, from Latin plexus (“braided, plaited, woven; bent, twisted”), perfect passive participle of plectō (“to braid, plait, weave; to bend, turn, twist”), ultimately from Proto-Indo-European *pleḱ- (“to fold, plait, weave”).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pleach (plural pleaches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or result of interweaving; specifically, (horticulture) a hedge or lattice created by interweaving the branches of shrubs, trees, etc.",
                  "examples": [
                    "Synonym: plash"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) A branch of a shrub, tree, etc., used for pleaching; a pleacher.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) A notch cut into a branch so that it can be bent when pleaching is carried out.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pleach (third-person singular simple present pleaches, present participle pleaching, simple past and past participle pleached)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To unite by interweaving, as (horticulture) branches of shrubs, trees, etc., to create a hedge; to interlock, to plash.",
                  "examples": [
                    "Synonyms: entwine, interlace, plait"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}