{
  "word": "waver",
  "etymologies": [
    {
      "description": [
        "From Middle English waveren, from Old Norse vafra (“to flicker”), akin to Old English wǣfre (“restless, wavering”). Related to wave."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waver (plural wavers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of wavering, vacillating, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who waves, enjoys waving, etc.",
                  "examples": [
                    "I felt encouraged by all the enthusiastic wavers in the crowd.",
                    "The Fourth of July brings out all the flag wavers.",
                    "Johnny is such a little waver; everyone who passes by receives his preferred greeting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who specializes in waving (hair treatment).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool that accomplishes hair waving.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect, dated) A sapling left standing in a fallen wood.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "waver (third-person singular simple present wavers, present participle wavering, simple past and past participle wavered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To sway back and forth; to totter or reel.",
                  "examples": [
                    "Flowers wavered in the breeze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To flicker, glimmer, quiver, as a weak light.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fluctuate or vary, as commodity prices or a poorly sustained musical pitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To shake or tremble, as the hands or voice.",
                  "examples": [
                    "His voice wavered when the reporter brought up the controversial topic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To falter; become unsteady; begin to fail or give way.",
                  "examples": [
                    "Although they believe they can overhaul their 2-0 deficit, they cannot afford to be as lethargic as this at Camp Nou, and the time is surely approaching when Manuel Pellegrini's faith in Martín Demichelis wavers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be indecisive between choices; to feel or show doubt or indecision; to vacillate.",
                  "examples": [
                    "Despite all the terrible things that happened to her, she never wavered from her beliefs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}