{
  "word": "surname",
  "etymologies": [
    {
      "description": [
        "From Middle English surname, a partial calque of Old French surnum, surnoun (“surname; nickname”) (whence Middle English surnoun), from Late Latin supernōmen, suprānōmen (“surname”), from super- (“over, above, beyond”) and nōmen (“name”).."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "surname (plural surnames)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An additional name, particularly those derived from a birthplace, quality, or achievement; an epithet.",
                  "examples": [
                    "My sirname is Peace-Maker, one that is but poorely regarded in England."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An additional name given to a person, place, or thing; a byname or nickname.",
                  "examples": [
                    "I have before declared that Baal was the Sun, and Baal Peor, a sirname, from a particular place of his worship."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The name a person shares with other members of that person's family, distinguished from that person's given name or names; a family name.",
                  "examples": [
                    "James is my first name, and Smith is my surname."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Classical studies) The cognomen of Roman names.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, obsolete) A clan.",
                  "examples": [
                    "The surnam and nerrest of blude to the said Williame."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "surname (third-person singular simple present surnames, present participle surnaming, simple past and past participle surnamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give a surname to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To call by a surname.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}