{
  "word": "dobber",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dobber (plural dobbers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of dauber (“marker pen used for bingo cards”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, derogatory) A member of the working class in Scotland or Ireland who is seen as undereducated, with poor taste, especially in clothes, and poor social skills; closely connected to chav.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, UK, derogatory) One who dobs (informs against or implicates to authority).",
                  "examples": [
                    "Nikki is such a dobber, she told the teacher that I hit Karen in the playground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, informal) Any small electronic device that plugs directly into a larger one, such as a wireless scoring system in fencing or a USB mass storage device.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Ireland, chiefly dialect) A large marble.",
                  "examples": [
                    "They were the biggest rosary beads I ever saw, the beads were the size of big marbles or dobbers or taws. Dobbers and taws we used to play with in the channels beside the footpaths, when we used to play the road games."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, regional) A float (as used by an angler).",
                  "examples": [
                    "In attaching this dobber or float, tie it on as short a tippet as you can manage and attach it to the leader from four to six feet above the nymph."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dabchick.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}