{
  "word": "orbit",
  "etymologies": [
    {
      "description": [
        "From Middle English orbite, orbita, from Latin orbita (“course, track, impression, mark”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "orbit (countable and uncountable, plural orbits)",
          "definitionGroups": [
            {
              "group": "(astronomy) A circular or elliptical path of a celestial object or spacecraft around a star, planet, moon, or Lagrange point, especially a periodic elliptical revolution.",
              "entries": [
                {
                  "meaning": "One complete circuit round an orbited body.",
                  "examples": [
                    "The Moon's orbit around the Earth takes nearly one month to complete."
                  ]
                },
                {
                  "meaning": "(uncountable) The state of moving in an orbit.",
                  "examples": []
                },
                {
                  "meaning": "(physics) The path of an electron around an atomic nucleus.",
                  "examples": []
                },
                {
                  "meaning": "(pinball) A path for the ball on the outer edge of the playfield, usually connected so that the ball entering in one end will come out of the other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sphere of influence; an area or extent of activity, interest, or control.",
                  "examples": [
                    "In the post WWII era, several eastern European countries came into the orbit of the Soviet Union.",
                    "The convenience store was a heavily travelled point in her daily orbit, as she purchased both cigarettes and lottery tickets there."
                  ]
                }
              ]
            },
            {
              "group": "(anatomy) The bony cavity in the skull of a vertebrate containing the eyeball.",
              "entries": [
                {
                  "meaning": "(zoology) The area around the eye of a bird or other animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A collection of points related by the evolution function of a dynamical system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry, group theory) The subset of elements of a set X to which a given element can be moved by members of a specified group of transformations that act on X.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A state of increased excitement, activity, or anger.",
                  "examples": [
                    "Dad went into orbit when I told him that I'd crashed the car."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "orbit (third-person singular simple present orbits, present participle orbiting, simple past and past participle orbited)",
          "definitionGroups": [
            {
              "group": "(astronomy) To circle or revolve around another object or position.",
              "entries": [
                {
                  "meaning": "To place an object (e.g. a satellite) into an orbit around a planet.",
                  "examples": [
                    "A rocket was used to orbit the satellite.",
                    "Synonym: launch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move around the general vicinity of something.",
                  "examples": [
                    "The harried mother had a cloud of children orbiting her, begging for sweets.",
                    "Synonyms: circumambulate, tag along"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move in a circle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To center (around).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dating) To continue to follow and/or engage with someone via social media after breaking up with them.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}