{
  "word": "halve",
  "etymologies": [
    {
      "description": [
        "From Middle English halven, helven, from Old English hilfan, helfan, *hielfan (“to halve, divide in two”), from Proto-West Germanic *halbijan, from Proto-Germanic *halbijaną (“to halve”), from Proto-Germanic *halbaz (“half”).",
        "Cognate with Middle Dutch halven (“to halve”), Middle High German halben, helben (“to halve”). Compare also West Frisian helte (“to halve”), Dutch halveren (“to halve”), German Low German halberen (“to halve”), German halbieren (“to halve”), Danish halvere (“to halve”), Swedish halvera (“to halve”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "halve (third-person singular simple present halves, present participle halving, simple past and past participle halved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce to half the original amount.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To divide into two halves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make up half of.",
                  "examples": [
                    "So far apart their lives are thrown / From the twin soul that halves their own."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture, transitive) To join two pieces of timber etc. by cutting away each for half its thickness at the joining place, and fitting together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf, transitive) In match play, to achieve a tie or draw on.",
                  "examples": [
                    "I, of course, had no difficulty in doing likewise, and we halved the hole; but the awkward fact remained that I must now gain every hole to win the match, for my opponent's score was \"nine up,\" and there only remained ten holes to play."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}