{
  "word": "scissors",
  "etymologies": [
    {
      "description": [
        "From Middle English sisours, sisoures (attested since 1350–1400), from Old French cisoires, from Vulgar Latin *cīsōria, plural of Late Latin cīsōrium (“cutting tool”) (compare chisel); from Latin word root -cīsus (compare excise) or caesus, past participle of caedō (“to cut”). Partially displaced native Old English sċēara (“scissors, shears”), whence shears."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scissors (plural scissors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, usually construed as plural) A tool used for cutting thin material, consisting of two crossing blades attached at a pivot point in such a way that the blades slide across each other when the handles are closed.",
                  "examples": [
                    "Those scissors are sharp. (indicating singular or plural scissors)",
                    "That scissors is sharp. (less commonly to indicate singular scissors)",
                    "Scissors are used to cut the flowers.",
                    "Use scissors to cut them if you don't have proper shears."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, aviation, military, with the) A type of defensive maneuver in dogfighting, involving repeatedly turning one's aircraft towards that of the attacker in order to force them to overshoot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, aviation, military) An instance of the above dogfighting maneuver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, rugby) An attacking move conducted by two players; the player without the ball runs from one side of the ball carrier, behind the ball carrier, and receives a pass from the ball carrier on the other side.",
                  "examples": [
                    "They executed a perfect scissors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, skating) A method of skating with one foot significantly in front of the other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, gymnastics) An exercise in which the legs are switched back and forth, suggesting the motion of scissors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, wrestling) A scissors hold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rock paper scissors) A hand with the index and middle fingers open (a handshape resembling scissors), that beats paper and loses to rock. It beats lizard and loses to Spock in rock-paper-scissors-lizard-Spock.",
                  "examples": []
                }
              ]
            }
          ]
        },
        {
          "description": "scissors",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) plural of scissor",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scissors (third-person singular simple present scissorses, present participle scissorsing, simple past and past participle scissorsed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Rare form of scissor (“To cut using, or as if using, scissors.”).",
                  "examples": []
                }
              ]
            }
          ]
        },
        {
          "description": "scissors",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "third-person singular simple present indicative form of scissor",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}