{
  "word": "win",
  "etymologies": [
    {
      "description": [
        "From Middle English winnen, from Old English winnan (“to labour, swink, toil, trouble oneself; resist, oppose, contradict; fight, strive, struggle, rage; endure”) (compare Old English ġewinnan (“conquer, obtain, gain; endure, bear, suffer; be ill”)), from Proto-Germanic *winnaną (“to swink, labour, win, gain, fight”), from Proto-Indo-European *wenh₁- (“to strive, wish, desire, love”). Cognate with Low German winnen, Dutch winnen, German gewinnen, Norwegian Bokmål vinne, Norwegian Nynorsk and Swedish vinna."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "win (third-person singular simple present wins, present participle winning, simple past won or (obsolete) wan, past participle won)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To conquer, defeat.",
                  "examples": [
                    "For and we doo bataille we two wyl fyghte with one knyȝt at ones  and therfore yf ye wille fyghte ſoo we wille be redy at what houre ye wille aſſigne  And yf ye wynne vs in bataille the lady ſhal haue her landes ageyne  ye ſay wel ſayd ſir Vwayne  therfor make yow redy ſo that ye be here to morne in the defence of the ladyes ryght"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To reach some destination or object, despite difficulty or toil (now usually intransitive, with preposition or locative adverb).",
                  "examples": [
                    "I well may gang out, love, but I'll never win home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To triumph or achieve victory in (a game, a war, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To gain (a prize) by succeeding in competition or contest.",
                  "examples": [
                    "to win the jackpot in a lottery;  to win a bottle of wine in a raffle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To obtain (someone) by wooing; to make an ally or friend of (frequently with over).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To achieve victory.",
                  "examples": [
                    "Who would win in a fight between an octopus and a dolphin?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have power, coercion or control.",
                  "examples": [
                    "Ever since the 2013 Boston Marathon bombing, Bostonians now run as \"One Boston.\" The terrorists did not win."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To obtain (something desired).",
                  "examples": [
                    "The company hopes to win an order from the government worth over 5 million dollars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause a victory for someone.",
                  "examples": [
                    "The success of the economic policies should win Mr. Smith the next elections.",
                    "The policy success should win the elections for Mr. Smith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mining) To extract (ore, coal, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To defeat or surpass someone or something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English winn, winne, from Old English winn (“toil, labor, trouble, hardship; profit, gain; conflict, strife, war”), from Proto-Germanic *winną (“labour, struggle, fight”), from Proto-Indo-European *wenh₁- (“to strive, desire, wish, love”). Cognate with German Gewinn (“profit, gain”), Dutch gewin (“profit, gain”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "win (plural wins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An individual victory.",
                  "examples": [
                    "Antonym: loss",
                    "Our first win of the season put us in high spirits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A feat carried out successfully; a victorious achievement.",
                  "examples": [
                    "Antonym: fail"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Gain; profit; income.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Wealth; goods owned.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English wynne, winne, wunne, from Old English wynn (“joy, rapture, pleasure, delight, gladness”), from Proto-West Germanic *wunnju, from Proto-Germanic *wunjō (“joy, delight, pleasure, lust”), from Proto-Indo-European *wenh₁- (“to strive, wish, desire, love”).",
        "Cognate with German Wonne (“bliss, joy, delight”), archaic Dutch wonne (“joy”), Danish ynde (“grace”), Icelandic yndi (“delight”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "win",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) Pleasure; joy; delight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From wind."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "win",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland) To dry by exposure to the wind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}