{
  "word": "gallery",
  "etymologies": [
    {
      "description": [
        "From Middle English galery, gallerye, from Middle French galerie, gallerie, from Old French galerie, gallerie (“a long portico, a gallery”), from Medieval Latin galeria (“gallery”), perhaps an alteration of galilea (“church porch”), probably from Latin Galilaea, Galilee, region of Palestine. More at Galilee."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gallery (plural galleries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An institution, building, or room for the exhibition and conservation of works of art.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An establishment that buys, sells, and displays works of art.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The uppermost seating area projecting from the rear or side walls of a theater, concert hall, or auditorium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, metonymically) The spectators of an event, collectively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The, often elevated and in the rear, part of a courtroom where seating for the public audience is facilitated during trial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A roofed promenade, especially one extending along the wall of a building and supported by arches or columns on the outer side",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A browsable collection of images, font styles, etc.",
                  "examples": [
                    "a gallery of image thumbnails",
                    "a clip-art gallery in a wordprocessor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fortification) A covered passage cut through the earth or masonry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A level or drive in a mine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) A channel that carries engine oil to parts of the engine that need lubrication, such as the main bearings.",
                  "examples": [
                    "At about 2500 r.p.m., as much oil is by-passed through the cooler as the amount delivered to the main gallery and at higher engine speeds the flow through the cooler is appreciably greater."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) The production control room.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of a monocle, a projection off the ring holding the lens, which helps secure the monocle in the eye socket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) The boring trails produced by an insect in wood.",
                  "examples": [
                    "beetle gallery"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for gallery forest.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gallery (third-person singular simple present galleries, present participle gallerying, simple past and past participle galleried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Trinidad and Tobago) To show off.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}