{
  "word": "tyrant",
  "etymologies": [
    {
      "description": [
        "From Middle English tyraunt, tiraunt, tyrant, tyrante, from Old French tyrant, from the addition of a terminal -t to tiran (cp. French tyran) via a back-formation related to the development of French present participles out of the Latin -ans form, from Latin tyrannus (“despot”), from Ancient Greek τύραννος (túrannos, “usurper, monarch, despot”), of uncertain origin."
      ],
      "adjectives": [
        {
          "description": "tyrant",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) Tyrannical, tyrannous; like, characteristic of, or in the manner of a tyrant.",
                  "examples": [
                    "He was most tirant & cruell of all emperours."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tyrant (plural tyrants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, Ancient Greece) A usurper; one who gains power and rules extralegally, distinguished from kings elevated by election or succession.",
                  "examples": [
                    "The reappearance of tyranny [in the 4th century BC] had many reasons... one of the main causes was the development of antagonism between rich and poor; tyrants came to power exploiting a social and political imbalance within the state."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any monarch or governor.",
                  "examples": [
                    "Cassius... set tyrants over all Syria."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A despot; a ruler who governs unjustly, cruelly, or harshly.",
                  "examples": [
                    "Tyrannes...be but Gods scourges which he will cast into the fyre when he hath done with them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any person who abuses the power of position or office to treat others unjustly, cruelly, or harshly.",
                  "examples": [
                    "[…]  a sad tyrant, as my friends the Democrats sometimes are."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A villain; a person or thing who uses strength or violence to treat others unjustly, cruelly, or harshly.",
                  "examples": [
                    "A pike (called the tyranne of fishes)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tyrant birds, members of the family Tyrannidae, which often fight or drive off other birds which approach their nests.",
                  "examples": [
                    "The Tyrant... The courage of this little Bird is singular."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tyrant (third-person singular simple present tyrants, present participle tyranting, simple past and past participle tyranted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To act like a tyrant; to be tyrannical.",
                  "examples": [
                    "Let thy judgment be king, but not tyrant over it"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To tyrannize.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}