{
  "word": "orient",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English orient, oriente, oryent, oryente, oryentte (“the east direction; eastern horizon or sky; eastern regions of the world, Asia, Orient; eastern edge of the world”), borrowed from Anglo-Norman orient, oriente, and Old French orient (“east direction; Asia, Orient”) (modern French orient), or directly from its etymon Latin oriēns (“the east; daybreak, dawn; sunrise; (participle) rising; appearing; originating”), present active participle of orior (“to get up, rise; to appear, become visible; to be born, come to exist, originate”), from Proto-Indo-European *h₃er- (“to move, stir; to rise, spring”).",
        "The adjective is derived from Middle English orient (“eastern; from Asia or the Orient; brilliant, shining (characteristic of jewels from the Orient)”), from Middle English orient (noun); see above."
      ],
      "adjectives": [
        {
          "description": "orient (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, poetic, also figuratively) Rising, like the morning sun.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, poetic) Of the colour of the sky at daybreak; bright in colour, from red to yellow.",
                  "examples": [
                    "Synonym: Orient red"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete except poetic) Of, facing, or located in the east; eastern, oriental.",
                  "examples": [
                    "Antonym: occidental"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete except poetic) Of a pearl or other gem: of great brilliance and value; (by extension) bright, lustrous.",
                  "examples": [
                    "Synonyms: see Thesaurus:shining"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "orient (plural orients)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of the horizon where the sun first appears in the morning; the east.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pearl originating from the Indian region, reputed to be of great brilliance; (by extension) any pearl of particular beauty and value. [19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The brilliance or colour of a high-quality pearl.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "The verb is derived from French orienter (“to orientate; to guide; to set to north”) from French orient (noun) (see above) + -er (suffix forming infinitives of first-conjugation verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "orient (third-person singular simple present orients, present participle orienting, simple past and past participle oriented) (often US)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To build or place (something) so as to face eastward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To align or place (a person or object) so that his, her, or its east side, north side, etc., is positioned toward the corresponding points of the compass; (specifically, surveying) to rotate (a map attached to a plane table) until the line of direction between any two of its points is parallel to the corresponding direction in nature.",
                  "examples": [
                    "Synonym: (commonly Britain) orientate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To direct towards or point at a particular direction.",
                  "examples": [
                    "Synonym: (commonly Britain) orientate",
                    "The workers oriented all the signs to face the road."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, reflexive) To determine which direction one is facing.",
                  "examples": [
                    "Let me just orient myself and we can be on our way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, often reflexive, figuratively) To familiarize (oneself or someone) with a circumstance or situation.",
                  "examples": [
                    "Synonym: (commonly Britain) orientate",
                    "Antonyms: disorient, disorientate",
                    "Give him time to orient himself within the new hierarchy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To set the focus of (something) so as to appeal or relate to a certain group.",
                  "examples": [
                    "We will orient our campaign to the youth who are often disinterested."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change direction to face a certain way.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}