{
  "word": "territory",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English territorie, from Latin territōrium."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "territory (countable and uncountable, plural territories)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large extent or tract of land; for example a region, country or district.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) One of three of Canada's federated entities, located in the country's Arctic, with fewer powers than a province and created by an act of Parliament rather than by the Constitution: Yukon, Northwest Territories, and Nunavut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) One of three of Australia's federated entities, located in the country's north and southeast, with fewer powers than a state and created by an act of Parliament rather than by the Constitution: Northern Territory, Australian Capital Territory and Jervis Bay Territory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A geographic area under control of a single governing entity such as state or municipality; an area whose borders are determined by the scope of political power rather than solely by natural features such as rivers and ridges.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecology) An area that an animal of a particular species consistently defends against its conspecifics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports and games) The part of the playing field or board over which a player or team has control.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A geographic area that a person or organization is responsible for in the course of work.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A location or logical space which someone owns or controls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A market segment or scope of professional practice over which an organization or type of practitioner has exclusive rights.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area of subject matter, knowledge, or experience.",
                  "examples": [
                    "The matter of whether the world needs a fourth Ice Age movie pales beside the question of why there were three before it, but Continental Drift feels less like an extension of a theatrical franchise than an episode of a middling TV cartoon, lolling around on territory that’s already been settled."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}