{
  "word": "imp",
  "etymologies": [
    {
      "description": [
        "From Middle English impen, ympen (“to plant; (figuratively) to bury; to graft; to add to, insert, put into, set in; to mend (a falcon’s feather) by attaching a new feather on to the broken stump”), from Old English impian, ġeimpian (“to graft”), from Proto-West Germanic *impōn (“to graft”), from Vulgar Latin *imputō (“to graft”), from Ancient Greek ἔμφῠτος (émphutos, “implanted; planted”), from ἐμφῠ́ω (emphúō, “to implant”) (from ἐν- (en-, prefix meaning ‘in’) + φῠ́ω (phúō, “to bring forth, produce; to grow”) (ultimately from Proto-Indo-European *bʰuH- (“to appear; to become; to grow”))) + -τος (-tos)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "imp (third-person singular simple present imps, present participle imping, simple past and past participle imped) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To engraft or plant (a plant or part of one, a sapling, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, archaic) To graft or implant (something other than a plant); to fix or set (something) in.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry, veterinary medicine) To engraft (a feather) on to a broken feather in a bird's wing or tail to repair it; to engraft (feathers) on to a bird, or a bird's wing or tail.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(figuratively, from sense 3) To provide (someone or something) with wings, hence enabling them or it to soar.",
                  "examples": []
                },
                {
                  "meaning": "To add to or unite a object with (something) to lengthen the latter out or repair it; to eke out, enlarge, strengthen.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English impe, ympe (“tree branch; shoot, sprig; graft, scion; young tree, sapling, seedling; tree”) [and other forms], from Old English impa, impe (“shoot, sprig; graft, scion; young tree, sapling, seedling”), from impian, ġeimpian (“to graft”) (see etymology 1)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "imp (plural imps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly fiction and mythology) A small, mischievous sprite or a malevolent supernatural creature, somewhat comparable to a demon but smaller and less powerful, formerly regarded as the child of the devil or a demon (see sense 3.2). [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(often humorous) A mischievous child. [from 17th c.]",
                  "examples": [
                    "Synonyms: brat, little dickens, scamp, urchin"
                  ]
                },
                {
                  "meaning": "A baby Tasmanian devil.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "A young shoot of a plant, a tree, etc.; a sapling; also, a part of a plant used for grafting; a graft. [9th–18th c.]",
                  "examples": []
                },
                {
                  "meaning": "An offspring or scion, especially of a noble family; (generally) a (usually male) child; a (young) man. [15th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Britain, dialectal) Something added to or united with another to lengthen it out or repair it (such as an eke or small stand on which a beehive is placed, or a length of twisted hair in a fishing line).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}