{
  "word": "step",
  "etymologies": [
    {
      "description": [
        "From Middle English steppen, from Old English steppan (“to step, go, proceed, advance”), stepe (“step”), from Proto-West Germanic *stappjan, from Proto-Germanic *stapjaną (“to step”), *stapiz (“step”), from Proto-Indo-European *stebʰ- (“to support, stomp, curse, be amazed”).",
        "Cognate with West Frisian stappe (“to step”), North Frisian stape (“to walk, trudge”), Dutch stappen (“to step, walk”), Walloon steper (“to walk away, leave”), German stapfen (“to trudge, stomp, plod”) and further to Slavic Polish stąpać (“to stomp, stamp, step, tread”), Russian ступать (stupatʹ) and Polish stopień (“step, stair, rung, degree”), Russian степень (stepenʹ). Related to stamp, stomp."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "step (plural steps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An advance or movement made from one foot to the other; a pace.",
                  "examples": [
                    "Turning back, then, toward the basement staircase, she began to grope her way through blinding darkness, but had taken only a few uncertain steps when, of a sudden, she stopped short and for a little stood like a stricken thing, quite motionless save that she quaked to her very marrow in the grasp of a great and enervating fear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rest, or one of a set of rests, for the foot in ascending or descending, as a stair, or a rung of a ladder.",
                  "examples": [
                    "The breadth of every single step or stair should be never less than one foot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a spade, digging stick or similar tool that a digger's foot rests against and presses on when digging; an ear, a foot-rest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distinct part of a process; stage; phase.",
                  "examples": [
                    "He improved step by step, or by steps.",
                    "The first step is to find a job."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A running board where passengers step to get on and off the bus.",
                  "examples": [
                    "The driver must have a clear view of the step in order to prevent accidents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The space passed over by one movement of the foot in walking or running.",
                  "examples": [
                    "One step is generally about three feet, but may be more or less."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small space or distance.",
                  "examples": [
                    "It is but a step."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A print of the foot; a footstep; a footprint; track.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gait; manner of walking.",
                  "examples": [
                    "The approach of a man is often known by his step."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Proceeding; measure; action; act.",
                  "examples": [
                    "The reputation of a man depends on the first steps he makes in the world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A walk; passage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A portable framework of stairs, much used indoors in reaching to a high position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A framing in wood or iron which is intended to receive an upright shaft; specifically, a block of wood, or a solid platform upon the keelson, supporting the heel of the mast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(machines) One of a series of offsets, or parts, resembling the steps of stairs, as one of the series of parts of a cone pulley on which the belt runs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(machines) A bearing in which the lower extremity of a spindle or a vertical shaft revolves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The interval between two contiguous degrees of the scale.",
                  "examples": [
                    "Usage note: The word tone is often used as the name of this interval; but there is evident incongruity in using tone for indicating the interval between tones. As the word scale is derived from the Italian scala, a ladder, the intervals may well be called steps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(kinematics) A change of position effected by a motion of translation.",
                  "examples": [
                    "A change of position effected by a motion of translation will be called a step."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) A constant difference between consecutive values in a series.",
                  "examples": [
                    "Printing from 0 to 9 with a step of 3 will display 0, 3, 6 and 9."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "step (third-person singular simple present steps, present participle stepping, simple past stepped or (dated) stept or (obsolete) stope, past participle stepped or (dated) stept)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move the foot in walking; to advance or recede by raising and moving one of the feet to another resting place, or by moving both feet in succession.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To walk; to go on foot; especially, to walk a little distance.",
                  "examples": [
                    "Some days later it happened that young Heriotside was stepping home over the Lang Muir about ten at night, it being his first jaunt from home since his arm had mended."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To walk slowly, gravely, or resolutely.",
                  "examples": [
                    "Home from his Morning-Task , the Swain retreats, His flock before him stepping to the fold."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To move mentally; to go in imagination.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set, as the foot.",
                  "examples": [
                    "One of the women, Elsie, stepped her foot inside to help the woman."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To fix the foot of (a mast) in its step; to erect.",
                  "examples": [
                    "We put everything straight, stepped the long-boat's mast for our skipper, who was in charge of her, and I was not sorry to sit down for a moment."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of stepchild.. Clipping of stepsibling."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "step (plural steps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A stepchild.",
                  "examples": [
                    "[Krazy Kat, after complimenting a woman on her nice polite little child:] Boy or girl?  [Woman:] Step – but well brung up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A stepsibling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}