{
  "word": "gist",
  "etymologies": [
    {
      "description": [
        "From Old French gist, third person singular indicative of the verb gesir (“to lie down”), from Latin iaceō. From such Law French phrases as cest action gist, \"this action lies.\" Compare French gésir (conjugated form gît) or gîte (“lodging”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gist (plural gists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The most essential part; the main idea or substance (of a longer or more complicated matter); the crux of a matter; the pith.",
                  "examples": [
                    "\"Should they live and build their church in the American wilderness, their worst dangers would rise in and among themselves rather than outside. That was the gist of the lesson from their pastor and \"wellwiller\" John Robinson.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, dated) The essential ground for action in a suit, without which there is no cause of action.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Resting place (especially of animals), lodging.",
                  "examples": [
                    "These Quailes have their set gists, to wit, ordinarie resting and baiting places. [These quails have their set gists, to wit, ordinary resting and baiting places.]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gist (third-person singular simple present gists, present participle gisting, simple past and past participle gisted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To summarize, to extract and present the most important parts of.",
                  "examples": [
                    "There are two general ways of getting information, and these two general ways may be summed up in this: take one branch of study and its principles are all gisted, they have been gisted by the accumulated thought of years gone by. These gisted thoughts are axioms, or received principles,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}