{
  "word": "sully",
  "etymologies": [
    {
      "description": [
        "From Middle English sulen, sulien (“to become dirty; to defile, pollute, taint”), from Old English sylian (“to soil, pollute; to sully”), from Proto-West Germanic *sulwōn, *sulwijan (“to make dirty; to sully”), from Proto-Indo-European *sūl- (“thick liquid, muck”), perhaps conflated partially with Old French souillier (“to soil”) (modern French souiller) from the same Germanic source. The word is cognate with Danish søle (“to sully”), West Flemish seulewen (“to sully”) (Middle Dutch soluwen (“to sully”)), German sühlen (“to sully”), Old Saxon sulian (“to sully”), Swedish söla (“to sully”). Also compare Middle English sulpen (“to defile, pollute”), Old English solian (“to soil, become defiled, make or become foul”), and see more at soil."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sully (plural sullies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, obsolete) A blemish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sully (third-person singular simple present sullies, present participle sullying, simple past and past participle sullied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To soil or stain; to dirty.",
                  "examples": [
                    "Synonym: (obsolete) sowl",
                    "He did not wish to sully his hands with gardening."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To corrupt or damage.",
                  "examples": [
                    "She tried to sully her rival’s reputation with a suggestive comment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, ergative) To become soiled or tarnished.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}