{
  "word": "gag",
  "etymologies": [
    {
      "description": [
        "The verb is from 15th-century Middle English gaggen, Early Modern English gagge, possibly imitative or perhaps related to or influenced by Old Norse gag-háls (\"with head thrown backwards\"; > Norwegian dialectal gaga (“bent backwards”)). The intransitive sense \"to retch\" is from 1707.",
        "The noun is from the 16th century, figurative use (for \"repression of speech\") from the 1620s. The secondary meaning \"(practical) joke\" is from 1863, of unclear origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gag (plural gags)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device to restrain speech, such as a rag in the mouth secured with tape or a rubber ball threaded onto a cord or strap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An order or rule forbidding discussion of a case or subject.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any suppression of freedom of speech.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A joke or other mischievous prank.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) a device or trick used to create a practical effect; a gimmick",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A convulsion of the upper digestive tract.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A mouthful that makes one retch or choke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mycteroperca microlepis, a species of grouper.",
                  "examples": [
                    "Synonym: gag grouper"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gag (third-person singular simple present gags, present participle gagging, simple past and past participle gagged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To experience the vomiting reflex.",
                  "examples": [
                    "He gagged when he saw the open wound."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to heave with nausea.",
                  "examples": [
                    "His empty stomach was suddenly full of butterflies, and for the first time since arriving here at scenic Durkin Grove Village, he felt an urge to gag himself. He would be able to think more clearly about this if he just stuck his fingers down his throat  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To restrain someone's speech by blocking his or her mouth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pry or hold open by means of a gag.",
                  "examples": [
                    "[…]  some have their mouths gagged to such a wideness, for a long time, whereat such quantities of water are poured in, that their bellies swell to a prodigious degree  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To restrain someone's speech without using physical means.",
                  "examples": [
                    "When the financial irregularities were discovered, the CEO gagged everyone in the accounting department."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To choke; to retch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete, slang) To deceive (someone); to con.",
                  "examples": [
                    "I endeavoured what I could to soften off the affectation of her sudden change of Disposition; and I gagged the Gentleman with as much ease as my very little ease would allow me to assume."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, slang, LGBT) To astonish (someone); to be at a loss for words.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}