{
  "word": "abase",
  "etymologies": [
    {
      "description": [
        "From Late Middle English abaishen, abashen, abaisse, abassen, abesse, abessen (“to be upset; to embarrass; to surprise; to confound; to bend down, stoop; to abase, degrade, disgrace”), from Middle French abaisser, from Old French abaissier, abessier (“to prostrate oneself; to lower, reduce”) (also compare Old French esbahir (“to amaze”), Vulgar Latin abbassiāre (“to lower”)), from a- (“prefix indicating movement towards something”) (from Latin ad (“toward, to”), ultimately from Proto-Indo-European *h₂éd (“at, to”)) + baissier (“to lower”) (from Medieval Latin bassus (“short of stature, low; base”), possibly from Ancient Greek βᾰ́σῐς (básis, “foot; base, foundation”), ultimately from Proto-Indo-European *gʷem- (“to step”)). The spelling of the English word has been influenced by base, thus ostensibly analyzable as a- (“towards”) +‎ base.\nThere exist verb cognates in galloromance languages such as Catalan abaixar (“lower; abase”) and Occitan abaissar, and similar word construction in other romance languages as Spanish abajo (“down, downstairs; below”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "abase (third-person singular simple present abases, present participle abasing, simple past and past participle abased)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lower, as in condition in life, office, rank, etc., so as to cause pain or hurt feelings; to degrade, to depress, to humble, to humiliate. [from c. 1350–1470]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To lower physically; to depress; to cast or throw down; to stoop. [from c. 1350–1470]",
                  "examples": [
                    "to abase the eye"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To lower in value, in particular by altering the content of alloys in coins; to debase. [from mid 16th – mid 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}