{
  "word": "wage",
  "etymologies": [
    {
      "description": [
        "From Middle English wage, from Anglo-Norman wage, from Old Northern French wage, a northern variant of Old French gauge, guage (whence modern French gage), Medieval Latin wadium, from Frankish *waddī (cognate with Old English wedd), from Proto-Germanic *wadją (“pledge”), from Proto-Indo-European *wedʰ- (“to pledge, redeem a pledge”). Akin to Old Norse veðja (“to pledge”), Gothic 𐍅𐌰𐌳𐌹 (wadi), Dutch wedde. Compare also the doublet gage. More at wed."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wage (plural wages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often in plural) An amount of money paid to a worker for a specified quantity of work, usually calculated on an hourly basis and expressed in an amount of money per hour.",
                  "examples": [
                    "Before her promotion, her wages were 20% less."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English wagen (“to pledge”), from Anglo-Norman, Old Northern French wagier, a northern variant of Old French guagier (whence modern French gager), itself either from guage or from a derivative of Frankish *waddī, possibly through a Vulgar Latin intermediate *wadiō from *wadium."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wage (third-person singular simple present wages, present participle waging, simple past and past participle waged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To wager, bet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To expose oneself to, as a risk; to incur, as a danger; to venture; to hazard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To employ for wages; to hire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To conduct or carry out (a war or other contest).",
                  "examples": [
                    "pond'ring which of all his Sons was fit / To Reign, and wage immortal War with Wit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adventure, or lay out, for hire or reward; to hire out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, law, UK) To give security for the performance of",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}