{
  "word": "noddy",
  "etymologies": [
    {
      "description": [
        "Probably a shortening of noddypoll, an obsolete alteration of hoddypoll (“fumbling inept person”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noddy (plural noddies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stupid or silly person.",
                  "examples": [
                    "Leo Decimus  […]  made  […]  soft fellowes, starke noddies; and such as we[r]e foolish, quite mad before hee left them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "nod +‎ -y?"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noddy (plural noddies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several stout-bodied, gregarious terns of the genera Anous and Procelsterna, found in tropical seas.",
                  "examples": [
                    "We saw no Land this day, but saw a great many Snakes and some Whales. We saw also some Boobies, and Noddy-birds; and in the night caught one of these last.  […]  The Top or Crown of the Head of this Noddy was Coal-black, having also small black streaks round about and close to the Eyes; and round these streaks on each side, a pretty broad white circle. The Breast, Belly, and under-part of the Wings of this Noddy were white: and the Back and upper-part of its Wings of a faint black or smoak Colour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A small two-wheeled vehicle drawn by a single horse.",
                  "examples": [
                    "Coun[sellor]. What do you mean by a new language?",
                    "O’Dogh[erty]. Why a new kind of a London English, that’s no more like our Irish English, than a coxcomb’ fine gilded chariot like a Glassmanogue noddy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inverted pendulum consisting of a short vertical flat spring which supports a rod having a bob at the top; used for detecting and measuring slight horizontal vibrations of a body to which it is attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) An old card game.",
                  "examples": [
                    "Let ’hem embrace more frugal pastimes. Why should not the thrifty and right worshipful game of Post and Pair content ’hem? Or the witty invention of Noddie, for counters? or God make them rich, at the Tables? but Masking, and Revelling?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "nod +‎ -y, coined by John Fiske in 1987."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noddy (plural noddies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A cutaway scene of a television interviewer nodding, used to cover an editing gap in an interview.",
                  "examples": [
                    "Synonym: nodder",
                    "Noddies are often filmed after the interview in question has finished."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}