{
  "word": "bolter",
  "etymologies": [
    {
      "description": [
        "From bolt +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bolter (plural bolters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing that bolts, or runs suddenly.",
                  "examples": [
                    "Bolting can be one of the worst problems in dogdom to solve. We′ve all seen a bolter — or rather, we haven't seen him. We released him to hunt, and he was gone for the day, the week, the month. I′ve known of bolters to be gone for years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, horticulture) A plant that grows larger and more rapidly than usual.",
                  "examples": [
                    "Evidence is accumulating that bolters are plants which have changed their long-day habit to that of short-day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(flour milling) A machine or mechanism that automatically sifts milled flour.",
                  "examples": [
                    "The bolter was basically a sheet or roll of wire mesh or cloth (most often canvas or linen, but sometimes silk or another fabric). The flour produced by the mill was fed through or over the device, which was shaken by a mechanism (several were possible) taking power from the drive train leading from the water wheel to the millstones."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who sifts flour or meal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(petroleum refining) A filter mechanism.",
                  "examples": [
                    "This first bolter contains a screen of eight meshes to the inch and separates the hard particles, dirt or scale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, sports) An obscure athlete who wins an upset victory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, horseracing) A horse that wins at long odds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New Zealand, sports) In team sports, a relatively little-known or inexperienced player who inspires the team to greater success.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, politics) A member of a political party who does not support the party's nominee.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, aviation) A missed landing on an aircraft carrier; an aircraft that has made a missed landing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of fishing line; a boulter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bolter (third-person singular simple present bolters, present participle boltering, simple past and past participle boltered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) To smear or become smeared with a grimy substance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sift or filter through a sieve or bolter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fish using a bolter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pound rapidly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a whale) To swim or turn sideways while eating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, aviation) To miss a landing on an aircraft carrier by failing to catch the arresting gear wires with the aircraft's tailhook.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}