{
  "word": "nim",
  "etymologies": [
    {
      "description": [
        "From Middle English nimen, from Old English niman (“to take”), from Proto-West Germanic *neman, from Proto-Germanic *nemaną (“to take”), from Proto-Indo-European *nem- (“to give or take one's due”). Cognate with Saterland Frisian nieme (“to take”), West Frisian nimme (“to take”), Dutch nemen (“to take”), Low German nehmen (“to take”), German nehmen (“to take”), Danish nemme (“to learn, grasp”). Related to numb and nimble."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nim (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A game in which players take turns removing objects from heaps.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nim (third-person singular simple present nims, present participle nimming, simple past nimmed or nam or nom, past participle nimmed or nom or nomen or num)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To take or seize.",
                  "examples": [
                    "Ich cham a Cornysche man, al[e] che can brew;  […]  Nym me a quart of ale, that iche may it of sup."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, slang, transitive) To filch, steal, pilfer.",
                  "examples": [
                    "They'll question Mars, and, by his look,  Detect who 'twas that nimm'd a cloak;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, UK dialectal) To walk with short, quick strides; trip along.",
                  "examples": [
                    "The old lady does nim along.",
                    "1949,  Wilfrid J. Halliday, Arthur Stanley Umpleby,  The White Rose Garland of Yorkshire Dialect Verse and Local and Folk-lore Rhymes (quoting Irene Sutcliffe), page 111:Ah had set myself doon where the aums meet aboon,  When Jinny jamp oop, and ganned nimming alang"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}