{
  "word": "chubby",
  "etymologies": [
    {
      "description": [
        "Recorded since 1611, from chub (“short, thick fish species used as bait\"; used metaphorically since 1558 for \"lazy person”), an assibilated form of cub (“a lump, heap, mass”) and cob, from Middle English *cubbe (found only in derivative cubbel (“a block to which an animal is tethered”)), from Old Norse kubbr, kumbr (“block, stump, log”) and/or Old Norse kumben (“stumpy”), equivalent to chub +‎ -y. Cognate with dialectal Swedish kubbug (“fat, plump, chubby”). More at chub."
      ],
      "adjectives": [
        {
          "description": "chubby (comparative chubbier, superlative chubbiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person: slightly overweight, somewhat fat, and hence plump, rounded, and soft.",
                  "examples": [
                    "Synonyms: chunky, plump, podgy, tubby",
                    "Obviously the chubby child was eating too much."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a body part: containing a moderate amount of fat.",
                  "examples": [
                    "Synonyms: chunky, plump, podgy",
                    "It’s quite normal for babies to have chubby cheeks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "chubby (plural chubbies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chubby, plump person",
                  "examples": [
                    "The chubby is the girl who cannot be fitted in the regular 7 to  14 size range because she is too stout. Sizes for these girls are 7*4 to 141/^, and  are specially styled and designed to give them better proportions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT slang) An overweight or obese gay man.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A penile erection, especially when short and with a large circumference; a boner.",
                  "examples": [
                    "Hey, Lucius, I just wanted to share a piece of personal information with you. I've got a... a chubby right now because [starts screaming] This is one of the most awesome experiences of my life!—Talladega Nights: The Ballad of Ricky Bobby"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}