{
  "word": "soap",
  "etymologies": [
    {
      "description": [
        "From Middle English sope, sape, from Old English sāpe (“soap, salve”), from Proto-West Germanic *saipā, from Proto-Germanic *saipǭ, from Proto-Indo-European *seyb-, *seyp- (“to pour out, drip, trickle, strain”).",
        "Cognate with Scots saip, sape (“soap”), Saterland Frisian Seepe (“soap”), West Frisian sjippe (“soap”), Dutch zeep (“soap”), German Low German Seep (“soap”), German Seife (“soap”), Danish sæbe (“soap”), Swedish såpa (“soap”), Norwegian Bokmål såpe (“soap”), Norwegian Nynorsk såpe (“soap”), Faroese sápa (“soap”), Icelandic sápa (“soap”). Related also to Old English sāp (“amber, resin, pomade, unguent”), Latin sēbum (“tallow, fat, grease”). See seep. Latin sāpō (“soap”) is a borrowing from the Germanic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "soap (countable and uncountable, plural soaps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A metallic salt derived from a fatty acid, commonly used in cleaning products.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, informal, by extension) Some other substance, often a detergent or another surfactant, able to mix with both oil and water, used for cleaning.",
                  "examples": [
                    "I tried washing my hands with soap, but the stain wouldn't go away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Money, specially when used as a bribe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) A soap opera.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A solid masonry unit or brick reduced in depth or height from standard dimensions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "soap (third-person singular simple present soaps, present participle soaping, simple past and past participle soaped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply soap to in washing.",
                  "examples": [
                    "Be sure to soap yourself well before rinsing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To cover, lather or in any other form treat with soap, often as a prank.",
                  "examples": [
                    "Those kids soaped my windows!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To be discreet about (a topic).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) To flatter; to wheedle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "soap (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) sodium pentothal",
                  "examples": [
                    "'Time? Doesn't have much meaning when they're trying to dry you out. I rather think they gave me a shot of soap at one point.' Soap is intelligence speak for sodium pentathol."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}