{
  "word": "honor",
  "etymologies": [
    {
      "description": [
        "From Middle English honour, honor, honur, from Anglo-Norman honour, honur, from Old French honor, from Latin honor.",
        "Displaced Middle English menske (“honor, dignity among men”), from Old Norse menskr (“honor”) (see mensk).",
        "The verb is from Middle English honouren, honuren (“to honor”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "honor (countable and uncountable, plural honors) (chiefly American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) recognition of importance or value; respect; veneration (of someone, usually for being morally upright or successful)",
                  "examples": [
                    "The crowds gave the returning general much honor and praise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) the state of being morally upright, honest, noble, virtuous, and magnanimous; excellence of character; the perception of such a state; favourable reputation; dignity",
                  "examples": [
                    "He was a most perfect knight, for he had great honor and chivalry.",
                    "His honor was unstained."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) a token of praise or respect; something that represents praiseworthiness or respect, such as a prize or award given by the state to a citizen",
                  "examples": [
                    "Honors are normally awarded twice a year: on The Queen's Birthday in June and at the New Year.",
                    "He wore an honor on his breast.",
                    "military honors; civil honors",
                    "Audie Murphy received many honors, such as the Distinguished Service Cross."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a privilege",
                  "examples": [
                    "I had the honour of dining with the ambassador."
                  ]
                }
              ]
            },
            {
              "group": "(in the plural) the privilege of going first",
              "entries": [
                {
                  "meaning": "(golf) the right to play one's ball before one's opponent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a cause of respect and fame; a glory; an excellency; an ornament.",
                  "examples": [
                    "He is an honour to his nation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(feudal law) a seigniory or lordship held of the king, on which other lordships and manors depended",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry, countable) the center point of the upper half of an armorial escutcheon (compare honour point)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, card games) In bridge, an ace, king, queen, jack, or ten especially of the trump suit. In some other games, an ace, king, queen or jack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) (courses for) an honours degree: a university qualification of the highest rank",
                  "examples": [
                    "At university I took honours in modern history."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "honor (third-person singular simple present honors, present participle honoring, simple past and past participle honored) (chiefly US)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to think of highly, to respect highly; to show respect for; to recognise the importance or spiritual value of",
                  "examples": [
                    "The freedom fighters will be forever remembered and honored by the people."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to conform to, abide by, act in accordance with (an agreement, treaty, promise, request, or the like)",
                  "examples": [
                    "I trusted you, but you have not honored your promise.",
                    "refuse to honor the test ban treaty"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to confer (bestow) an honour or privilege upon (someone)",
                  "examples": [
                    "Ten members of the profession were honored at the ceremony.",
                    "The prince honored me with an invitation to his birthday banquet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to make payment in respect of (a cheque, banker's draft, etc.)",
                  "examples": [
                    "I'm sorry Sir, but the bank did not honour your cheque."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}