{
  "word": "seep",
  "etymologies": [
    {
      "description": [
        "Variant of sipe, from Middle English *sipen, from Old English sipian, from Proto-Germanic *sipōną, derivative of *sīpaną (compare Middle Dutch sīpen (“to drip”), German Low German siepern (“to seep”), archaic German seifen (“to trickle blood”)), from Proto-Indo-European *seyb-, *sib- (“to pour out, drip, trickle”) (compare Latin sēbum (“suet, tallow”), Ancient Greek εἴβω (eíbō, “to drop, drip”)). See soap."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "seep (plural seeps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small spring, pool, or other spot where liquid from the ground (e.g. water, petroleum or tar) has oozed to the surface; a place of seeping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moisture, liquid, gas, etc. that seeps out; a seepage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The seeping away of a liquid, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A seafloor vent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "seep (third-person singular simple present seeps, present participle seeping, simple past and past participle seeped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To ooze or pass slowly through pores or other small openings, and in overly small quantities; said of liquids, etc.",
                  "examples": [
                    "Water has seeped through the roof.",
                    "The water steadily seeped in through the thirl."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To enter or penetrate slowly; to spread or diffuse.",
                  "examples": [
                    "Woe seeped through her heart thinking of what had befallen their ethnic group.",
                    "Fear began to seep into the local community over the contamination of their fishpond."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To diminish or wane away slowly.",
                  "examples": [
                    "The resistance movement against the invaders had slowly  seeped away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) (of a crack etc.) To allow a liquid to pass through, to leak.",
                  "examples": [
                    "The crack is seeping water."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}