{
  "word": "solemn",
  "etymologies": [
    {
      "description": [
        "From Middle English solempne, solemne (“performed with religious ceremony or reverence; devoted to religious observances, sacred; ceremonious, formal; of a vow: made under a religious sanction, binding; religious celebration, celebration of a feast day; famous, well-known; important; grand, imposing; awe-inspiring, impressive; grave, serious; dignified; enunciated or held formally”) [and other forms], from Old French solempne, solemne (“serious, solemn”) [and other forms], or from its etymon Late Latin sōlempnis, sōlennis, from Latin sōlemnis, from sollemnis (“appointed, established, fixed; common, customary, ordinary, ritual, traditional, usual; ceremonial, religious, solemn; festive; annual, yearly”) [and other forms]. The further etymology is uncertain; sollus (“entire, whole”) (ultimately from Proto-Indo-European *solh₂- (“whole”)) + epulum (“banquet, feast”) (in the sense of a ritual; perhaps ultimately from Proto-Indo-European *h₁ed- (“to eat”)) has been suggested."
      ],
      "adjectives": [
        {
          "description": "solemn (comparative solemner or more solemn, superlative solemnest or most solemn)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion, specifically Christianity) Of or pertaining to religious ceremonies and rites; (generally) religious in nature; sacred.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "Characterized by or performed with appropriate or great ceremony or formality.",
                  "examples": []
                },
                {
                  "meaning": "Deeply serious and sombre; grave.",
                  "examples": [
                    "Synonyms: see Thesaurus:serious",
                    "Antonyms: lighthearted, unserious"
                  ]
                },
                {
                  "meaning": "Inspiring serious feelings or thoughts; sombrely impressive.",
                  "examples": [
                    "Synonym: awe-inspiring"
                  ]
                },
                {
                  "meaning": "(obsolete) Cheerless, gloomy, sombre.",
                  "examples": [
                    "Synonyms: see Thesaurus:cheerless",
                    "Antonyms: cheerful; see also Thesaurus:blissful"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}