{
  "word": "envelope",
  "etymologies": [
    {
      "description": [
        "From French enveloppe.  The engineering sense is derived from flight envelope."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "envelope (plural envelopes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A paper or cardboard wrapper used to enclose small, flat items, especially letters, for mailing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that envelops; a wrapping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bag containing the lifting gas of a balloon or airship; fabric that encloses the gas-bags of an airship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A mathematical curve, surface, or higher-dimensional object that is the tangent to a given family of lines, curves, surfaces, or higher-dimensional objects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A curve that bounds another curve or set of curves, as the modulation envelope of an amplitude-modulated carrier wave in electronics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The shape of a sound, which may be controlled by a synthesizer or sampler.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The information used for routing a message  that is transmitted with the message but not part of its contents.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) An enclosing structure or cover, such as a membrane; a space between two membranes",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) The set of limitations within which a technological system can perform safely and effectively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) The nebulous covering of the head or nucleus of a comet; a coma.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An earthwork in the form of a single parapet or a small rampart, sometimes raised in the ditch and sometimes beyond it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See envelop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "envelope (third-person singular simple present envelopes, present participle enveloping, simple past and past participle enveloped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Archaic form of envelop.",
                  "examples": [
                    "Again, if the plane of the impressed couple intersects the mean plane between N and C, it will envelope the cone whose focals are ON, ON′, and whose internal axis is therefore OA."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}