{
  "word": "scathe",
  "etymologies": [
    {
      "description": [
        "From Middle English scath, scathe [and other forms], from Old Norse skaði (“damage, harm; loss; death; murder”), from Proto-Germanic *skaþô (“damage, scathe; one who causes damage, injurer”, noun) (whence Old English sceaþa, sceaþu (“scathe, harm, injury”)), from Proto-Indo-European *(s)keh₁t- (“damage, harm”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scathe (countable and uncountable, plural scathes) (archaic or Britain, dialectal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Damage, harm, hurt, injury.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Someone who, or something which, causes harm; an injurer.",
                  "examples": [
                    "Synonym: (very rare) harmer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Scotland, law, obsolete) An injury or loss for which compensation is sought in a lawsuit; damage; also, expenses incurred by a claimant; costs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Something to be mourned or regretted.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English scathen, skathen (“to harm; to cause loss; to assail, attack; to make war on; to defeat”) [and other forms], from Old Norse skaða (“to damage, harm; to hurt, injure”), from Proto-Germanic *skaþōną (“to damage, harm; to injure”) (whence Old English sceaþian, scaþan (“to harm, hurt, injure, scathe”)), from *skaþô (“damage, scathe; one who causes damage, injurer”, noun); see further at etymology 1.",
        "Sense 2 (“to harm, injure, or destroy (someone or something) by fire, lightning, or some other heat source”) appears to derive from Paradise Lost by the English poet John Milton (1608–1674), perhaps influenced by scorch: see the 1667 quotation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "scathe (third-person singular simple present scathes, present participle scathing, simple past and past participle scathed) (transitive)",
          "definitionGroups": [
            {
              "group": "(archaic or Scotland) To harm or injure (someone or something) physically.",
              "entries": [
                {
                  "meaning": "(specifically, obsolete) To cause monetary loss to (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, chiefly literary and poetic) To harm, injure, or destroy (someone or something) by fire, lightning, or some other heat source; to blast; to scorch; to wither.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To severely hurt (someone's feelings, soul, etc., or something intangible) through acts, words spoken, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}