{
  "word": "flabbergast",
  "etymologies": [
    {
      "description": [
        "The origin of the verb is uncertain; possibly dialectal (Suffolk), from flabby or flap (“to strike”) + aghast. The word may be related to Scottish flabrigast (“to boast”) or flabrigastit (“worn out with exertion”).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flabbergast (countable and uncountable, plural flabbergasts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An awkward person.",
                  "examples": [
                    "Synonyms: dork, dweeb, geek; see also Thesaurus:dork"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Overwhelming confusion, shock, or surprise.",
                  "examples": [
                    "Synonyms: astonishment, astoundedness, awe, dumbfoundedness, flabbergaster, flabbergastation, flabbergastment, stupefaction; see also Thesaurus:confusion, Thesaurus:surprise",
                    "When I saw my house on fire, the flabbergast overcame me and I just stood and stared, too shocked to comprehend what I was seeing.",
                    "His flabbergast was so great he couldn’t even come up with a plausible answer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flabbergast (third-person singular simple present flabbergasts, present participle flabbergasting, simple past flabbergasted, past participle flabbergasted or flabbergast)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To overwhelm with bewilderment; to amaze, confound, or stun, especially in a ludicrous manner. [from late 18th c.]",
                  "examples": [
                    "Synonyms: flabbergaster; see also Thesaurus:surprise",
                    "He was flabbergasted to find that his work had been done for him before he began.",
                    "Her stupidity flabbergasts me, and I have to force myself to keep a straight face while she explains her beliefs.",
                    "I love to flabbergast the little-minded by shattering their preconceptions about my nationality and gender.",
                    "The oddity of the situation was so flabbergasting I couldn’t react in time for anyone to see it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}