{
  "word": "vagrant",
  "etymologies": [
    {
      "description": [
        "From Late Middle English vagraunt (“person without proper employment; person without a fixed abode, tramp, vagabond”) [and other forms], probably from Anglo-Norman vagarant, wakerant, waucrant (“vagrant”) [and other forms] and Old French walcrant, waucrant (“roaming, wandering”) [and other forms], perhaps influenced by Latin vagārī, the present active infinitive of vagor (“to ramble, stroll about; to roam, rove, wander”). Old French walcrant is the present participle of vagrer, wacrer, walcrer (“to wander, wander about as a vagabond”) [and other forms], from Frankish *walkrōn (“to wander about”), the frequentative form of *walkōn (“to walk; to wander; to stomp, trample; to full (make cloth denser and firmer by soaking, beating and pressing)”), from Proto-Germanic *walkōną (“to roll about, wallow; to full”), *walkaną (“to turn, wind; to toss; to roll, roll about; to wend; to walk; to wander; to trample; to full”),\nfrom Proto-Indo-European *walg-, *walk-, *welgʰ-, *welk-, *wolg- (“to turn, twist; to move”), ultimately from *welH- (“to turn; to wind”).",
        "The English word is cognate with Latin valgus (“bandy-legged, bow-legged”), Middle Dutch walken (“to knead; to full”), Old English wealcan (“to roll”), ġewealcan (“to go; to walk about”), Old High German walchan, walkan (“to move up and down; to press together; to full; to walk; to wander”), Old Norse valka (“to wander”). See further at walk."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vagrant (plural vagrants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A person who wanders from place to place; a nomad, a wanderer.",
                  "examples": [
                    "Synonyms: itinerant, rover; see also Thesaurus:wanderer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically) A person without settled employment or habitation who usually supports himself or herself by begging or some dishonest means; a tramp, a vagabond.",
                  "examples": [
                    "Synonyms: drifter, hobo; see also Thesaurus:vagabond",
                    "Every morning before work, I see that poor vagrant around the neighbourhood begging for food."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Vagrans egista, a widely distributed Asian butterfly of the family Nymphalidae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, especially ornithology) An animal, typically a bird, found outside its species' usual range.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English vagraunt, vagaraunt (“having no proper employment; having a tendency to go astray or wander; wayward”), from Anglo-Norman vagarant, wakerant, waucrant (“vagrant”) and Old French walcrant, waucrant (“roaming, wandering”); see further at etymology 1."
      ],
      "adjectives": [
        {
          "description": "vagrant (comparative more vagrant, superlative most vagrant)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wandering from place to place, particularly when without any settled employment or habitation.",
                  "examples": [
                    "Synonyms: itinerant, nomadic, peripatetic, vagabond, (obsolete) vagrom, vague",
                    "a vagrant beggar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to a vagabond or vagrant, or a person fond of wandering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Moving without a certain direction; roving, wandering; also, erratic, unsettled.",
                  "examples": [
                    "Synonyms: inconstant, straggling, straying, vagabond, (obsolete) vagrom, vague, wayward"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}