{
  "word": "attentat",
  "etymologies": [
    {
      "description": [
        "From either French attentat or German Attentat."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "attentat (plural attentats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, obsolete) Anything whatsoever, as a ruling, by the judge of a lower court in a matter pending an appeal.",
                  "examples": [
                    "All the several acts of one court day constitute, with reference to attentats, but one act, notwithstanding an appeal intermediate between those acts (h)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, obsolete) Any step wrongly innovated or attempted by an inferior judge in a suit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An attempted assault or assassination of a political figure; a politically motivated attempted assault.",
                  "examples": [
                    "The first attempt was the enactment of the Belgian so-called attentat clause by Belgium in 1856, following the case of Jacquin 2 in 1854. A French manufaturer named Jules Jacquin, domiciled in Belgium, and a foreman of his factory named Célestin Jacquin, who was also a Frenchman, tried to cause an explosion on the railway line between Lille and Calais with the intention of murdering the Emperor Napolen III. France requested the extradition of the two criminals, but the Belgian Court of Appeal had to refuse the surrender on account of the Belgian extradition law interdicting the surrender of political prisoners."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}