{
  "word": "lion",
  "etymologies": [
    {
      "description": [
        "From Middle English lyoun, lion, leon, borrowed from Old French lion, from Latin leō, (accusative: leōnem), from Ancient Greek λέων (léōn). Some argue that it is a borrowing from a Semitic language; however evidence is not clear and the relation with Proto-Semitic *labiʾ- is not solid. Semitic \"labi/lavi\" could either be a parent term to the Greek one or both could have evolved independently from a now lost root. Doublet of Leo, leu, lev, and Lyon."
      ],
      "adjectives": [
        {
          "description": "lion (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of the light brown color that resembles the fur of a lion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lion (plural lions or lion, feminine lioness)",
          "definitionGroups": [
            {
              "group": "A big cat, Panthera leo, native to Africa, India and formerly much of Europe.",
              "entries": [
                {
                  "meaning": "(in particular) A male lion, as opposed to a lioness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any of various extant and extinct big cats, especially the mountain lion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Chinese foo dog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An individual who shows strength and courage, attributes associated with the lion.",
                  "examples": [
                    "It was said of [Edward Plantaganet] that 'he was a lion for pride and ferocity but a pard for inconstancy and changeableness, not keeping his word or promise but excusing himself with fair words'."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A famous person regarded with interest and curiosity.",
                  "examples": [
                    "During this period, we were the lions of the neighbourhood; and, no doubt, strangers from the ​distant villages were taken to see the \"Karhowrees\" (white men), in the same way that countrymen, in a city, are gallanted to the Zoological Gardens."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light brown color that resembles the fur of a lion.",
                  "examples": [
                    "lion:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An old Scottish coin, with a lion on the obverse, worth 74 shillings.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}