{
  "word": "vapor",
  "etymologies": [
    {
      "description": [
        "From Middle English vapour, from Anglo-Norman vapour, Old French vapor, from Latin vapor (“steam, heat”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vapor (countable and uncountable, plural vapors) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cloudy diffused matter such as mist, steam or fumes suspended in the air.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The gaseous state of a substance that is normally a solid or liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something insubstantial, fleeting, or transitory; unreal fancy; vain imagination; idle talk; boasting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Any medicinal agent designed for administration in the form of inhaled vapour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, in the plural) Hypochondria; melancholy; the blues; hysteria, or other nervous disorder.",
                  "examples": [
                    "He talks me into a fit of vapours twice or thrice a week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Wind; flatulence.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vapor (third-person singular simple present vapors, present participle vaporing, simple past and past participle vapored) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become vapor; to be emitted or circulated as vapor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To turn into vapor.",
                  "examples": [
                    "to vapor away a heated fluid"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To emit vapor or fumes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use insubstantial language; to boast or bluster.",
                  "examples": [
                    "He vapoured, and fretted, and fumed, and trotted up and down, and tried to make himself pleasing in Miss Hollis's big, quiet, grey eyes, and failed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give (someone) the vapors; to depress, to bore.",
                  "examples": [
                    "“I only mean,” cried she, giddily, “that he might have some place a little more pleasant to live in, for really that old moat and draw-bridge are enough to vapour him to death […].”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}