{
  "word": "bard",
  "etymologies": [
    {
      "description": [
        "(15th c.) from Scottish Gaelic bàrd, from Old Irish bard, from Proto-Celtic *bardos (“bard, poet”), from Proto-Indo-European *gʷerH- (“praise”), and reinforced by Latin bardus, borrowed from Celtic. Cognate with Latin grātus (“grateful, pleasant, delightful”), Sanskrit गृणाति (gṛṇāti, “calls, praises”), Old Church Slavonic жрьти (žrĭti, “to sacrifice”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bard (plural bards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A professional poet and singer, like among the ancient Celts, whose occupation was to compose and sing verses in honor of the heroic achievements of princes and brave men.",
                  "examples": [
                    "\"He is a Welsh bard, and a man full of animation, anecdote, and independence;  […] \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A poet.",
                  "examples": [
                    "Shakespeare is known as the bard of Avon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French barde. English since the late 15th century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bard (plural bards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of defensive (or, sometimes, ornamental) armor for a horse's neck, breast, and flanks; a barb. (Often in the plural.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Defensive armor formerly worn by a man at arms.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) A thin slice of fat bacon used to cover any meat or game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The exterior covering of the trunk and branches of a tree; the rind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specifically, Peruvian bark.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bard (third-person singular simple present bards, present participle barding, simple past and past participle barded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover a horse in defensive armor.",
                  "examples": [
                    "The defensive armor with which the horses of the ancient knights or men at arms were covered, or, to use the language of the time, barded, consisted of the following pieces made either of metal or jacked leather, the Chamfron, Chamfrein or Shaffron, the Criniere or Main Facre, the Poitrenal, Poitral or Breast Plate, and the Croupiere or Buttock Piece."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) To cover (meat or game) with a thin slice of fat bacon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}