{
  "word": "harass",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle French, Old French harasser (“to exhaust, tire out, wear out; to harry, torment, vex”) (modern French harasser (“to exhaust, tire out, wear out”)), possibly from Old French harer (“to set a dog on”), from Frankish *hara (“here, hither”) (a command for a dog to attack), from Proto-Germanic *hē₂r (“here, in this place”), ultimately from Proto-Indo-European *ḱe (“here; this”) + *ís (“the (person or thing just named)”) + *-r.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "harass (plural harasses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Harassment; pestering.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "harass (third-person singular simple present harasses, present participle harassing, simple past and past participle harassed) (transitive)",
          "definitionGroups": [
            {
              "group": "To annoy (someone) frequently or systematically; to pester.",
              "entries": [
                {
                  "meaning": "(specifically) To persistently bother (someone, or a group of people) physically or psychologically when such behaviour is illegal and/or unwanted, especially over an extended period.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put excessive burdens upon (someone); to subject (someone) to anxieties.",
                  "examples": [
                    "To harass good people is no different than speaking ill of them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To trouble (someone, or a group of people) through repeated military-style attacks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Often followed by out: to fatigue or tire (someone) with exhausting and repeated efforts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}