{
  "word": "materialism",
  "etymologies": [
    {
      "description": [
        "From French matérialisme; surface etymology is material +‎ -ism."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "materialism (countable and uncountable, plural materialisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Constant concern over material possessions and wealth; a great or excessive regard for worldly concerns.",
                  "examples": [
                    "We accept that a third of the population live on the poverty line. We accept that only a handful of the most exceptional of the children of the poor will make it through to a third-level education. We accept massive examples of greed and dishonesty in public life. We except the values of materialism. What do we expect then—to be left un-harassed, we who have all the privileges?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) The philosophical belief that nothing exists beyond what is physical.",
                  "examples": [
                    "The result of the labours of philosophy appeared to be a total scepticism on the most important subjects of hu man duty and expectation. The irregular fears of a future state had been supplanted by the materialism of Epicurus; and this system—if system it may be called, which left them without a God, a providence, a morality, or a retribution—was the fashionable philosophy of the more cultivated classes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) Material substances in the aggregate; matter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}