{
  "word": "ruse",
  "etymologies": [
    {
      "description": [
        "From Middle English rūse (“evasive movements of a pursued animal; circuitous course taken by a hunter to pursue a game animal”), from Old French rëuse, ruse (“evasive movements of a pursued animal; trickery”) (modern French ruse (“trick, ruse; cunning, guile”)), from ruser (“to use cunning, to be crafty, beguile”), possibly from Latin rursus (“backward; on the contrary; again, in return”) or Latin recūsāre, from recūsō (“to decline, refuse; to object to, protest, reject”). Doublet of recuse and rouse in the latter case.",
        "The verb is derived from the noun. Compare Middle French ruser (“to use cunning, to be crafty, beguile”); see further above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ruse (countable and uncountable, plural ruses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, often hunting, archaic, rare) A turning or doubling back, especially of animals to get out of the way of hunting dogs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, by extension) An action intended to deceive; a trick.",
                  "examples": [
                    "Synonym: stratagem"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Cunning, guile, trickery.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ruse (third-person singular simple present ruses, present participle rusing, simple past and past participle rused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To deceive or trick using a ruse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, hunting, archaic, rare) Of an animal: to turn or double back to elude hunters or their hunting dogs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}