{
  "word": "armor",
  "etymologies": [
    {
      "description": [
        "From Middle English armure, armour, armor, armeure, borrowed from Anglo-Norman armure and Old French armeüre, from Latin armātūra. Doublet of armature and armure."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "armor (countable and uncountable, plural armors) (chiefly American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A protective layer over a body, vehicle, or other object intended to deflect or diffuse damaging forces.",
                  "examples": [
                    "Hyponyms: body armor, mail, chain mail, plate, suit of armor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A natural form of this kind of protection on an animal's body.",
                  "examples": [
                    "Synonyms: carapace, chitin, horn"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Metal plate, protecting a ship, military vehicle, or aircraft.",
                  "examples": [
                    "Synonym: armor plate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A tank, or other heavy mobile assault vehicle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, uncountable) A military formation consisting primarily of tanks or other armoured fighting vehicles, collectively.",
                  "examples": [
                    "Synonyms: cavalry, mechanized"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hydrology, uncountable) The naturally occurring surface of pebbles, rocks or boulders that line the bed of a waterway or beach and provide protection against erosion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "armor (third-person singular simple present armors, present participle armoring, simple past and past participle armored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To equip something with armor or a protective coating or hardening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide something with an analogous form of protection.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}