{
  "word": "reform",
  "etymologies": [
    {
      "description": [
        "From Middle English reformen, from Old French reformer, from Latin reformo, reformare. As a noun since 1660s, from French réforme."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reform (countable and uncountable, plural reforms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The change of something that is defective, broken, inefficient or otherwise negative, in order to correct or improve it",
                  "examples": [
                    "...over the past two years, my administration has made education a top priority. We’ve launched a competition called “Race to the Top” – a reform that is lifting academic standards and getting results; not because Washington dictated the answers, but because states and local schools pursued innovative solutions."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "reform (third-person singular simple present reforms, present participle reforming, simple past and past participle reformed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put into a new and improved form or condition; to restore to a former good state, or bring from bad to good; to change from worse to better",
                  "examples": [
                    "In this interview with Law Editors and Correspondents, he speaks on the gains of reforming the Directorate of Public Prosecutions (DPP), efforts to keep underage persons out of jail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To return to a good state; to amend or correct one's own character or habits",
                  "examples": [
                    "It is hoped that many criminals, upon being freed, will eventually reform."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To form again or in a new configuration.",
                  "examples": [
                    "This product contains reformed meat.",
                    "The regiment reformed after surviving the first attack."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}