{
  "word": "mustard",
  "etymologies": [
    {
      "description": [
        "From Middle English mustard, from Old French moustarde (French: moutarde), from moust (“must”), from Latin mustum. Compare Saterland Frisian Muster (“mustard”), Dutch mosterd (“mustard”), German Low German Musterd (“mustard”), Icelandic mustarður (“mustard”). Displaced Middle English senep, from Old English senep, from Latin sināpi (“mustard”). Doublet of mostarda."
      ],
      "adjectives": [
        {
          "description": "mustard (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a dark yellow colour.",
                  "examples": [
                    "Everything about her year-old restaurant, from the minimalist menu (about a dozen items) with refreshingly drivel-free descriptions to the decor (unadorned warm mustard walls, unclothed bistro tables), reflects her love of bringing people to the table for good, simple food that's not eclipsed by bells and whistles."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mustard (usually uncountable, plural mustards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plant of certain species of the genus Brassica, or of related genera (especially Sinapis alba, in the family Brassicaceae, with yellow flowers, and linear seed pods).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Powder or paste made from seeds of the mustard plant, and used as a condiment or a spice.",
                  "examples": [
                    "When the waitress brought the food, I asked whether she had any Dijon mustard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The leaves of the mustard plant, used as a salad.",
                  "examples": [
                    "Mustard and cress sandwiches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dark yellow colour, the colour of mustard.",
                  "examples": [
                    "mustard:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of a family of vesicants containing one or more 2-chloroethyl (C2H4Cl) groups, commonly used in chemical warfare and cancer chemotherapy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tomalley of a crab, which resembles the condiment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}