{
  "word": "grace",
  "etymologies": [
    {
      "description": [
        "From Middle English grace, from Old French grace (modern French grâce), from Latin grātia (“kindness, favour, esteem”), from grātus (“pleasing”), from Proto-Indo-European *gʷerH- (“to praise, welcome”); compare grateful.",
        "The word displaced the native Middle English held, hield (“grace”) (from Old English held, hyld (“grace”)), Middle English este (“grace, favour, pleasure”) (from Old English ēste (“grace, kindness, favour”)), Middle English athmede(n) (“grace”) (from Old English ēadmēdu (“grace”)), Middle English are, ore (“grace, mercy, honour”) (from Old English ār (“honour, grace, kindness, mercy”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grace (countable and uncountable, plural graces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Charming, pleasing qualities.",
                  "examples": [
                    "The Princess brought grace to an otherwise dull and boring party."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A short prayer of thanks before or after a meal.",
                  "examples": [
                    "It has become less common to say grace before having dinner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, card games) In the games of patience or solitaire: a special move that is normally against the rules.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, music) A grace note.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Elegant movement; balance or poise.",
                  "examples": [
                    "The dancer moved with grace and strength."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, finance) An allowance of time granted to a debtor during which he or she is free of at least part of his normal obligations towards the creditor.",
                  "examples": [
                    "The repayment of the loan starts after a three-year grace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, theology) Free and undeserved favour, especially of God; unmerited divine assistance given to humans for their regeneration or sanctification, or for resisting sin.",
                  "examples": [
                    "When she sang in the kirk, folk have told me that they had a foretaste of the musick of the New Jerusalem, and when she came in by the village of Caulds old men stottered to their doors to look at her. Moreover, from her earliest days the bairn had some glimmerings of grace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or decree of the governing body of an English university.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grace (third-person singular simple present graces, present participle gracing, simple past and past participle graced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adorn; to decorate; to embellish and dignify.",
                  "examples": [
                    "He graced the room with his presence.",
                    "He graced the room by simply being there.",
                    "His portrait graced a landing on the stairway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dignify or raise by an act of favour; to honour.",
                  "examples": [
                    "He might, at his pleasure, grace  […] or disgrace whom he would in court."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To supply with heavenly grace.",
                  "examples": [
                    "Thy first publique miracle graceth a marriage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To add grace notes, cadenzas, etc., to.",
                  "examples": [
                    "For D and E, the G and A fingers are generally used for gracing, though E is sometimes more conveniently graced by F#."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}