{
  "word": "the",
  "etymologies": [
    {
      "description": [
        "From Middle English þe, from Old English þē m (“the, that”, demonstrative pronoun), a late variant of sē, the s- (which occurred in the masculine and feminine nominative singular only) having been replaced by the þ- from the oblique stem.",
        "Originally neutral nominative, in Middle English it superseded all previous Old English nominative forms (sē m, sēo f, þæt n, þā pl); sē is from Proto-West Germanic *siz, from Proto-Germanic *sa, ultimately from Proto-Indo-European *só.",
        "Cognate with Saterland Frisian die (“the”), West Frisian de (“the”), Dutch de (“the”), German Low German de (“the”), German der (“the”), Danish de (“the”), Swedish de (“the”), Icelandic sá (“that”) within Germanic and with Sanskrit sá (“the, that”), Ancient Greek ὁ (ho, “the”), Tocharian B se (“this”) among other Indo-European languages."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English the, thy, thi, from Old English þē̆, probably a neuter instrumental form (\"by that, thereby\")—alongside the more common þȳ and þon—of the demonstrative pronoun sē (\"that\"). Compare Dutch des te (\"the, the more\"), German desto (\"the, all the more\"), Norwegian fordi (\"because\"), Icelandic því (“the; because”), Faroese tí, Swedish ty."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "the (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With a comparative or with more and a verb phrase, establishes a correlation with one or more other such comparatives.",
                  "examples": [
                    "The hotter(,) the better. (comma usually omitted in such very short expressions)",
                    "The more I think about it, the weaker it looks.",
                    "The more money donated, the more books purchased, and the more happy children.",
                    "It looks weaker and weaker, the more I think about it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With a comparative, and often with for it, indicates a result more like said comparative. This can be negated with none.",
                  "examples": [
                    "It was a difficult time, but I’m the wiser for it.",
                    "It was a difficult time, and I’m {none - not any} the wiser for it.",
                    "I'm much the wiser for having had a difficult time like that."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [
        {
          "description": "the",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "For each; per.",
                  "examples": [
                    "valued at half a pound the bushel; paying seven dollars the year interest"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}