{
  "word": "crunk",
  "etymologies": [
    {
      "description": [
        "Attested in the Southern US since the late 1980s, originally in the sense of “rowdy, high energy out-of-control behavior by a crowd at Southern night clubs”. Popularized by its use in the fusion genre of crunk music in the 1990s and especially early 2000s. In this context, first used in music lyrics and notably popularized by Lil Jon & the East Side Boyz, on their 1997 debut album Get Crunk, Who U Wit: Da Album (Get Crunk, Who [are] You With[?]: The Album). Various possible origins have been proposed:",
        "See Crunk: etymology at Wikipedia for further information.",
        "There is no evidence of any connection with Yiddish or German krank (“sick, ill”), nor that it entered the Southern Black vernacular through the presence of European Jewish immigrant shopkeepers in black neighborhoods in cities such as Atlanta; the phonetic similarity of the words is considered a coincidence."
      ],
      "adjectives": [
        {
          "description": "crunk (comparative crunker, superlative crunkest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) Crazy and intoxicated.",
                  "examples": [
                    "Get crunk, who u wit’?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "crunk (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of hip hop that originated in the southern United States.",
                  "examples": [
                    "As Houston rap became a national sensation, spinning off into the “crunk” scene, it was hard to believe that just ten years earlier, the only Texas rap acts of any note were Donald “The D.O.C.” Curry, the Dallasite who hooked up with Dr. Dre and the N.W.A. crew, and the Geto Boys, who set out to make West Coast gangstas come off like Young MC."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Compare Icelandic krunka (“to croak”), English cronk (“the honk of a goose”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "crunk (third-person singular simple present crunks, present participle crunking, simple past and past participle crunked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To cry like a crane.",
                  "examples": [
                    "The crunking crane heard high amongst the clouds."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}