{
  "word": "tarantula",
  "etymologies": [
    {
      "description": [
        "From Medieval Latin tarantula, from Old Italian tarantola, from Taranto (“seaport in southern Italy”), from Latin Tarentum (“Latin name of the town”), from Ancient Greek Τάρᾱς (Tárās, “Greek name of the town”) (compare Modern Greek Τάραντας (Tárantas) and Tarantino Tarde), probably from Illyrian *darandos (“oak”).",
        "Sense 3 (“Lycosa tarantula”) is the original sense of the word, and refers to the fact that the spider was common in the Apulia region where Taranto is located. Sense 1 (“New World spider in the family Theraphosidae”), the main modern sense of the word, may have been a transferred use of Spanish tarántula (“tarantula (Lycosa tarantula)”) to describe large, hairy spiders found in the New World."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tarantula (plural tarantulas or tarantulae)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the large, hairy New World spiders comprising the family Theraphosidae.",
                  "examples": [
                    "Synonyms: bird spider, monkey spider, rain spider"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A member of certain other groups of spiders, generally characterized by large size, hairiness, or membership of infraorder Mygalomorphae to which Theraphosidae family also belongs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A species of wolf spider, Lycosa tarantula, native to southern Europe, the mildly poisonous bite of which was once thought to cause an extreme urge to dance (tarantism). [from mid 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}