{
  "word": "mouse",
  "etymologies": [
    {
      "description": [
        "From Middle English mous, from Old English mūs, from Proto-West Germanic *mūs, from Proto-Germanic *mūs, from Proto-Indo-European *muh₂s.",
        "The computing sense was coined by American engineer Bill English in 1965 and first used publicly in a publication titled \"Computer-Aided Display Control\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "mouse (plural mice)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any small rodent of the genus Mus.",
                  "examples": [
                    "At twilight in the summer there is never anybody to fear—man, woman, or cat—in the chambers and at that hour the mice come out. They do not eat parchment or foolscap or red tape, but they eat the luncheon crumbs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A member of the many small rodent and marsupial species resembling such a rodent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quiet or shy person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) (plural mice or, rarely, mouses) An input device that is moved over a pad or other flat surface to produce a corresponding movement of a pointer on a graphical display.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The cursor.",
                  "examples": [
                    "move the mouse over the icon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing) A facial hematoma or black eye.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A turn or lashing of spun yarn or small stuff, or a metallic clasp or fastening, uniting the point and shank of a hook to prevent its unhooking or straightening out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A familiar term of endearment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A match used in firing guns or blasting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(set theory) A small model of (a fragment of) Zermelo-Fraenkel set theory with desirable properties (depending on the context).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A small cushion for a woman's hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Part of a hind leg of beef, next to the round.",
                  "examples": [
                    "Synonym: mouse buttock"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "mouse (third-person singular simple present mouses, present participle mousing, simple past and past participle moused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move cautiously or furtively, in the manner of a mouse (the rodent) (frequently used in the phrasal verb to mouse around).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hunt or catch mice (the rodents), usually of cats. [from 12th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To close the mouth of a hook by a careful binding of marline or wire.",
                  "examples": [
                    "Captain Higgins moused the hook with a bit of marline to prevent the block beckets from falling out under slack."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, computing) To navigate by means of a computer mouse.",
                  "examples": [
                    "I had just moused to the File menu and the pull-down menu repeated the menu bar's hue a dozen shades lighter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, nonce word, transitive) To tear, as a cat devours a mouse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}