{
  "word": "cockle",
  "etymologies": [
    {
      "description": [
        "From Middle English cokel, cokkel, kokkel, cocle, of uncertain origin. Perhaps a diminutive of Middle English cokke, cok (“cockle”), from Old English cocc (found in sǣcocc (“cockle”))  +‎ -le; or perhaps from Old French coquille, from Vulgar Latin *cocchilia, from conchylia, from Ancient Greek κογχύλιον (konkhúlion), diminutive of κογχύλη (konkhúlē, “mussel”), from Proto-Indo-European *konkho."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cockle (plural cockles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various edible European bivalve mollusks, of the family Cardiidae, having heart-shaped shells.",
                  "examples": [
                    "His wife, a small woman who walked always on high heels, borrowed Gerhardie's primus stove several times a day to cook her husband gargantuan meals of cockles, mussels, snails, and other such unpalatables."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The shell of such a mollusk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) One’s innermost feelings (only in the expression “the cockles of one’s heart”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(directly from French coquille) A wrinkle, pucker",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A defect in sheepskin; firm dark nodules caused by the bites of keds on live sheep",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining, UK, Cornwall) The mineral black tourmaline or schorl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) The fire chamber of a furnace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A kiln for drying hops; an oast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) The dome of a heating furnace.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cockle (third-person singular simple present cockles, present participle cockling, simple past and past participle cockled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause to contract into wrinkles or ridges, as some kinds of cloth after a wetting; to pucker.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Wikispecies",
        "Wikispecies \nFrom Middle English cockil, cokil, cokylle, from Old English coccel (“darnel”), of unknown origin, perhaps from a diminutive of Latin coccus (“berry”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cockle (plural cockles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several field weeds, such as the common corncockle (Agrostemma githago) and darnel ryegrass (Lolium temulentum).",
                  "examples": [
                    "But cockle, spurge, according to their law / Might propagate their kind, with none to awe, / You'd think; a burr had been a treasure trove."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Rhyming slang, from cock and hen for ten."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cockle (plural cockles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cockney rhyming slang) A £10 note; a tenner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}