{
  "word": "parliament",
  "etymologies": [
    {
      "description": [
        "From Middle English parlement, from Anglo-Norman parliament, parlement, parliment and Old French parlement (“discussion, meeting, negotiation; assembly, council”), from parler (“to speak”) + -ment (“-ment”, suffix forming nouns from verbs, usually indicating an action or state resulting from them) (from Latin -mentum). Compare Medieval Latin parlamentum, parliamentum (“discussion, meeting; council or court summoned by the monarch”), Italian parlamento and Sicilian parramentu."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parliament (countable and uncountable, plural parliaments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly historical) A formal council summoned (especially by a monarch) to discuss important issues. [from 13th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In many countries, the legislative branch of government, a deliberative assembly or set of assemblies whose elected or appointed members meet to debate the major political issues of the day, make, amend, and repeal laws, authorize the executive branch of government to spend money, and in some cases exercise judicial powers; a legislature. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular assembly of the members of such a legislature, as convened for a specific purpose or period of time (commonly designated with an ordinal number – for example, first parliament or 12th parliament – or a descriptive adjective – for example, Long Parliament, Short Parliament and Rump Parliament). [from 14th c.]",
                  "examples": [
                    "Following the general election, Jane Doe took her oath of office as a member of the nation's fifth parliament."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gathering of birds, especially rooks or owls. [from 15th c.]",
                  "examples": [
                    "He'd seen a parliament of rooks a hundred strong fall on and kill one of their number amongst the nodding barley rows, and had been shown a yew that had the face of Jesus in its bark."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Parliament cake, a type of gingerbread. [from 19th c.]",
                  "examples": [
                    "The children had long ago found out that the kites and shuttlecocks were failures; and popular rumour spoke in deprecating terms of the parliament and gingerbread in general, comparing it to petrified sponge, or slices of pumice stone."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}