{
  "word": "exercise",
  "etymologies": [
    {
      "description": [
        "From Middle English exercise, from Old French exercise, from Latin exercitium."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "exercise (countable and uncountable, plural exercises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any activity designed to develop or hone a skill or ability.",
                  "examples": [
                    "The teacher told us that the next exercise is to write an essay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Activity intended to improve physical, or sometimes mental, strength and fitness.",
                  "examples": [
                    "Swimming is good exercise.",
                    "I like to do my exercises every morning before breakfast.",
                    "I do crosswords for mental exercise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A setting in action or practicing; employment in the proper mode of activity; exertion; application; use.",
                  "examples": [
                    "The law guarantees us the free exercise of our rights."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The performance of an office, ceremony, or duty.",
                  "examples": [
                    "I assisted the ailing vicar in the exercise of his parish duties."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which gives practice; a trial; a test.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "exercise (third-person singular simple present exercises, present participle exercising, simple past and past participle exercised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To exert for the sake of training or improvement; to practice in order to develop.",
                  "examples": [
                    "to exercise troops or horses;  to exercise one's brain with a puzzle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To perform physical activity for health or training.",
                  "examples": [
                    "I exercise at the gym every day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use (a right, an option, etc.); to put into practice.",
                  "examples": [
                    "The tenant exercised his option to renew the tenancy.",
                    "She is going to exercise her right to vote."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now often in passive) To occupy the attention and effort of; to task; to tax, especially in a painful or vexatious manner; harass; to vex; to worry or make anxious.",
                  "examples": [
                    "exercised with pain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To set in action; to cause to act, move, or make exertion; to give employment to.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}