{
  "word": "shovel",
  "etymologies": [
    {
      "description": [
        "From Middle English shovele, schovel, showell, shoule, shole (> English dialectal shoul, shool), from Old English scofl (“shovel”), from Proto-Germanic *skuflō, *skūflō (“shovel”), equivalent to shove +‎ -el (instrumental/agent suffix).",
        "Cognate with Scots shuffle, shule, shuil (“shovel”), Saterland Frisian Sköifel (“shovel”), West Frisian skoffel, schoffel (“hoe, spade, shovel”), Dutch schoffel (“spade, hoe”), Low German Schüfel, Schuffel (“shovel”), German Schaufel (“shovel”), Danish skovl (“shovel”), Swedish skyffel, skovel (“shovel”), Icelandic skófla (“shovel”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shovel (plural shovels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hand tool with a handle, used for moving portions of material such as earth, snow, and grain from one place to another, with some forms also used for digging. Not to be confused with a spade, which is designed solely for small-scale digging and incidental tasks such as chopping of small roots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanical part of an excavator with a similar function.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A spade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for shovel hat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shovel (third-person singular simple present shovels, present participle shoveling or shovelling, simple past and past participle shoveled or shovelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move materials with a shovel.",
                  "examples": [
                    "The workers were shovelling gravel and tarmac into the pothole in the road.",
                    "After the blizzard, we shoveled the driveway for the next two days.",
                    "I don't mind shoveling, but using a pickaxe hurts my back terribly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To move with a shoveling motion.",
                  "examples": [
                    "Already late for work, I shovelled breakfast into my mouth as fast as possible."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}