{
  "word": "hiccup",
  "etymologies": [
    {
      "description": [
        "From earlier hickop, alteration of earlier hicket, hyckock, from hic (onomatopoeic) + -ock (diminutive suffix).",
        "Akin to Scots hick, hix (“hiccup”), West Frisian hik (“hiccup”), Dutch hik (“hiccup”), Middle Low German hükup, huckup, hueckup (modern Low German hick (“hiccup”)), German hicksen (“to hiccup”, verb), Alemannic German Hidsgi (“hiccup”), Danish hikke (“hiccup”), Swedish hicka (“hiccup”), hicka (“to hiccup”, verb), Icelandic hiksti (“hiccup”).",
        "Displaced Middle English yexen, ȝisken, ȝixen, ȝoxen (“to hiccup”), from Old English ġiscian, ġeocsian (“to hiccup”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hiccup (plural hiccups)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spasm of the diaphragm, or the resulting sound.",
                  "examples": [
                    "There was a loud hiccup from the back of the room and the class erupted in laughter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any spasm or sudden change.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A minor setback.",
                  "examples": [
                    "There's been a slight hiccup in the processing of this quarter's results."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hiccup (third-person singular simple present hiccups, present participle hiccuping or hiccupping, simple past and past participle hiccuped or hiccupped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce a hiccup; have the hiccups.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say with a hiccup.",
                  "examples": [
                    "\"I haven't touched a drop, officer,\" the suspect hiccupped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce an abortive sound like a hiccup.",
                  "examples": [
                    "The car engine hiccupped but wouldn't start."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}