{
  "word": "glory",
  "etymologies": [
    {
      "description": [
        "From Middle English glory, glorie, from Old French glorie (“glory”), from Latin glōria (“glory, fame, renown, praise, ambition, boasting”). Doublet of gloria. Displaced native Old English wuldor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "glory (countable and uncountable, plural glories)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Great beauty and splendor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Honour, admiration, or distinction, accorded by common consent to a person or thing; high reputation; renown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That quality in a person or thing which secures general praise or honour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Worship or praise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology, optics) An optical phenomenon, consisting of concentric rings and somewhat similar to a rainbow, caused by sunlight or moonlight interacting with the water droplets that compose mist or clouds, centered on the antisolar or antilunar point.",
                  "examples": [
                    "Synonym: anticorona"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Victory; success.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An emanation of light supposed to shine from beings that are specially holy. It is represented in art by rays of gold, or the like, proceeding from the head or body, or by a disk, or a mere line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) The manifestation of the presence of God as perceived by humans in Abrahamic religions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Pride; boastfulness; arrogance.",
                  "examples": [
                    "[…]  But if thou declare",
                    "The Secrets, truth; and art so mad to dare",
                    "(In glory of thy fortunes) to approue,",
                    "That rich-crownd Venus, mixt with thee in loue;",
                    "Ioue (fir’d with my aspersion, so dispred)",
                    "Will, with a wreakefull lightning, dart thee dead."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "glory (third-person singular simple present glories, present participle glorying, simple past and past participle gloried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To exult with joy; to rejoice.",
                  "examples": [
                    "In what the Apostle did glory?—He gloried in a Cross. ... [T]o the Ear of a Galatian, it conveyed much the same Meaning, as if the Apostle had gloried in a Halter; gloried in the Gallows; gloried in a Gibbet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To boast; to be proud.",
                  "examples": [
                    "For if in anything I have gloried to him on your behalf, I was not put to shame; but as we spake all things to you in truth, so our glorying also, which I made before Titus, was found to be truth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, poetic) To shine radiantly.",
                  "examples": [
                    "Down in a casement sat,",
                    "A low sea-sunset glorying round her hair",
                    "And glossy-throated grace, Isolt the Queen."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}