{
  "word": "illumine",
  "etymologies": [
    {
      "description": [
        "From Middle English illuminen (“to light, light up; to shine; (figuratively) to enlighten spiritually; to make illustrious”) [and other forms], from Old French illuminer (“to light up, illuminate; (figuratively) to enlighten”) (modern French illuminer), from Latin illūmināre, the present active infinitive of illūminō (“to light up, illuminate; to brighten; to adorn; to make conspicuous”), from il- (variant of in- (prefix meaning ‘in, within’; intensifying prefix)) + lūminō (“to illuminate; to brighten; (figuratively) to reveal”) (from lūmen (“light; light source; (poetic) brightness; daylight”) (ultimately from Proto-Indo-European *lewk- (“to shine; to see; bright”)) + -ō (suffix forming regular first-conjugation verbs))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "illumine (third-person singular simple present illumines, present participle illumining, simple past and past participle illumined)",
          "definitionGroups": [
            {
              "group": "Synonym of illuminate",
              "entries": [
                {
                  "meaning": "(transitive)",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) To shine light on (something).",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) To cause (something) to glow or shine with light.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": []
                },
                {
                  "meaning": "To enlighten (someone) spiritually; to induce (someone) to adopt, or believe in the truth of, a religion, religious tenet, etc.",
                  "examples": []
                },
                {
                  "meaning": "To cause (the eyes) to see.",
                  "examples": []
                },
                {
                  "meaning": "To cause (a person or their face) to show enlightenment, happiness, etc.",
                  "examples": []
                },
                {
                  "meaning": "(rare) To enlighten (someone) intellectually.",
                  "examples": []
                },
                {
                  "meaning": "(art) To decorate (a page of a manuscript book) with ornamental designs.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive)",
                  "examples": []
                },
                {
                  "meaning": "To become bright; to light up.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": []
                },
                {
                  "meaning": "To enlighten intellectually.",
                  "examples": []
                },
                {
                  "meaning": "Of a person or their face: to show enlightenment, happiness, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}