{
  "word": "blunder",
  "etymologies": [
    {
      "description": [
        "From Middle English blunder, blonder (“disturbance, strife”), from Middle English blundren, blondren (verb), which itself is partly from Middle English blondren, a frequentative form of Middle English blonden, blanden (\"to mix; mix up\"; corresponding to blend +‎ -er); and partly from Middle English blundren, a frequentative form of Middle English blunden (“to stagger; stumble”), from Old Norse blunda (“to shut the eyes; doze”).",
        "Cognates include Norwegian blunda (“to shut the eyes; doze”), dialectal Swedish blundra (“to act blindly or rashly”), Danish blunde (“to blink”) or blunde (“to take a nap”). Related to English blind."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blunder (plural blunders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A clumsy or embarrassing mistake.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) A very bad move, usually caused by some tactical oversight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blunder (third-person singular simple present blunders, present participle blundering, simple past and past participle blundered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a clumsy or stupid mistake.",
                  "examples": [
                    "to blunder in preparing a medical prescription"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move blindly or clumsily.",
                  "examples": [
                    "I was never distinguished for address, and have often even blundered in making my bow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to make a mistake.",
                  "examples": [
                    "To blunder an adversary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To do or treat in a blundering manner; to confuse.",
                  "examples": [
                    "He blunders and confounds all these together."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}