{
  "word": "scruple",
  "etymologies": [
    {
      "description": [
        "From Old French scrupule, from Latin scrūpulus (“(literally) a small sharp or pointed stone; the twenty-fourth part of an ounce; uneasiness of mind, anxiety, doubt, trouble; scruple”), diminutive of scrūpus (“a rough or sharp stone; anxiety, uneasiness”); perhaps akin to Ancient Greek σκύρος (skúros, “the chippings of stone”), from ξυρόν (xurón, “razor”), from ξύω (xúō, “to scrape”), from Proto-Indo-European *ksunyo-. Doublet of escropulo and escrupulo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scruple (plural scruples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hesitation to act from the difficulty of determining what is right or expedient; doubt, hesitation or unwillingness due to motives of conscience.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pharmacy) A weight of 1⁄288 of a pound, that is, twenty grains or one third of a dram, about 1.3 grams (symbol: ℈).",
                  "examples": [
                    "Synonym: (abbreviation) s.ap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Hebrew unit of time equal to 1⁄1080 hour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, by extension) A very small quantity; a particle.",
                  "examples": [
                    "Synonyms: see Thesaurus:modicum"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A doubt or uncertainty concerning a matter of fact; intellectual perplexity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scruple (third-person singular simple present scruples, present participle scrupling, simple past and past participle scrupled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hesitate or be reluctant to act due to considerations of conscience or expedience.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To excite scruples in; to cause to scruple.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To regard with suspicion; to question.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To question the truth of (a fact, etc.); to doubt; to hesitate to believe, to question.",
                  "examples": [
                    "I do not scruple to admit that all the Earth seeth but only half of the Moon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}