{
  "word": "dollar",
  "etymologies": [
    {
      "description": [
        "Attested since about 1500, from early Dutch daler, daalder, from German Taler, Thaler (“dollar”), from Sankt Joachimsthaler, literally \"of Joachimstal,\" the name for coins minted in German Sankt Joachimsthal (“St. Joachim's Valley”) (now Jáchymov, Czech Republic). Ultimately from Joachim + Tal (“valley”). Cognate to Danish daler. Doublet of taler."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dollar (plural dollars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Official designation for currency in some parts of the world, including Canada, the United States, Australia, New Zealand, Hong Kong, and elsewhere. Its symbol is $.",
                  "examples": [
                    "Synonyms: buck, smackeroo"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Money generally.",
                  "examples": [
                    "Television, a favored source of news and information, pulls the largest share of advertising monies. In 1935, newspapers received 45 percent of the advertising dollar, magazines 8 percent, and radio 7 percent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, colloquial, historical) A quarter of a pound or one crown, historically minted as a coin of approximately the same size and composition as a then-contemporary dollar coin of the United States, and worth slightly more.",
                  "examples": [
                    "We like to go down to restaurant row / Spend those euro-dollars / All the way from Washington to Tokyo"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive, historical) Imported from the United States, and paid for in U.S. dollars. (Note: distinguish \"dollar wheat\", North American farmers' slogan, meaning a market price of one dollar per bushel.)",
                  "examples": [
                    "The restricted purchase of dollar tobacco will, we hope, have the effect of increasing the imports of Turkish and Grecian tobacco"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nuclear physics) A unit of reactivity equal to the interval between delayed criticality and prompt criticality.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}