{
  "word": "refugee",
  "etymologies": [
    {
      "description": [
        "From French réfugié, past participle of réfugier (“to take refuge”), describing early French Protestants seeking refuge after the Edict of Fontainebleau in 1685. Analyzable as refuge +‎ -ee. Displaced native Old English flīema."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "refugee (plural refugees)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person seeking refuge in a foreign country out of fear of political persecution or the prospect of such persecution in their home country, i.e., a person seeking political asylum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person seeking refuge due to a natural disaster, war, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person formally granted political or economic asylum by a country other than their home country.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A person who flees one place or institution for another.",
                  "examples": [
                    "Why did the SDP dream eventually fade? Partly because it succeeded far better inside parliament than out. It might attract some inner-city Catholic traditionalist Labour refugees from Labour's left, but many of those were already gentrifying."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "refugee (third-person singular simple present refugees, present participle refugeeing, simple past and past participle refugeed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, historical) To convey (slaves) away from the advance of the federal forces.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}