{
  "word": "bruit",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English bruit (“commotion, tumult; fame, renown; collective noun for a group of barons”) [and other forms], from Anglo-Norman brut (“commotion, tumult; noise, sounds; fame, renown; hearsay, rumour; collective noun for a group of barons”) and Old French bruit (“commotion, tumult; noise, sounds; fame, renown; hearsay, rumour”) (modern French bruit (“noise; report, rumour”)), a noun use of the past participle of bruire (“to make a noise; to rattle; to roar; to rustle”), from Late Latin brugere, an alteration of Latin rugīre (“to roar”) (the present active infinitive of rugiō (“to bray; to bellow, roar; to rumble”), possibly from Proto-Indo-European *h₁rewg- (“to belch; to roar”)), possibly influenced by Late Latin bragere (“to bray”). The English word is cognate with Catalan brogir (“to roar”); Old Occitan bruir, brugir (“to roar”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bruit (countable and uncountable, plural bruits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, archaic) Hearsay, rumour; talk; (countable) an instance of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) A clamour, an outcry; a noise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bruit (third-person singular simple present bruits, present participle bruiting, simple past and past participle bruited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic in Britain, current in the US) To disseminate, promulgate, or spread news, a rumour, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French bruit (“noise; report, rumour”), from Old French bruit (“noise; sounds”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bruit (plural bruits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An abnormal sound in the body heard on auscultation (for example, through using a stethoscope); a murmur. [from 19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}