{
  "word": "starfish",
  "etymologies": [
    {
      "description": [
        "star +‎ fish"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "starfish (plural starfishes or starfish)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various asteroids or other echinoderms (not in fact fish) with usually five arms, many of which eat bivalves or corals by everting their stomach.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any many-armed or tentacled sea invertebrate, whether cnidarian, echinoderm, or cephalopod.",
                  "examples": [
                    "But the largest of the star-fish kind is that sea monster called kruken, kraken or krabben. [...] As this enormous sea-animal in all probability may be reckoned of the polype, or of the star-fish, kind, it seems that the parts which are seen rising at its pleasure, and are called arms, are properly the tentacula, or feeding instruments, called horns as well as arms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A woman (or, less commonly, a gay man) who reluctantly takes part in sexual intercourse, and lies on the back while spreading the limbs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang, usually in translations of Japanese pornography) The anus.",
                  "examples": [
                    "Synonym: chocolate starfish"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "starfish (third-person singular simple present starfishes, present participle starfishing, simple past and past participle starfished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To assume a splayed-out shape, like that of a starfish.",
                  "examples": [
                    "\"Oh you damn bastard, why won't you let anybody love you,\" and then, before I could stop her, she threw herself between us and the glowing suitcase, starfishing in the blaze of light as he blew up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form into a splayed-out shape, like that of a starfish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}