{
  "word": "wheelhouse",
  "etymologies": [
    {
      "description": [
        "From wheel +‎ house. Sense 3 (“(baseball) a pitch location which is favourable to the hitter”) references the fact that a vessel is controlled from its wheelhouse (sense 1.2), and sense 4 (“a person’s area of authority or expertise”) is a figurative use of sense 3."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wheelhouse (plural wheelhouses)",
          "definitionGroups": [
            {
              "group": "A building or other structure containing a (large) wheel, such as the water wheel of a mill.",
              "entries": [
                {
                  "meaning": "The partially enclosed structure above and around a wheel of an automobile, typically partly formed by a portion of a fender panel that has been extended outward beyond the plane of the rest of the panel.",
                  "examples": [
                    "Synonyms: wheel arch, wheel well"
                  ]
                },
                {
                  "meaning": "An enclosed compartment on the deck of a vessel such as a fishing boat, originally housing its helm or steering wheel, from which it may be navigated; on a larger vessel it is the bridge.",
                  "examples": [
                    "Synonym: pilothouse"
                  ]
                },
                {
                  "meaning": "The enclosed structure around the paddlewheel of a steamboat.",
                  "examples": [
                    "Synonym: paddle box"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) A prehistoric structure from the Iron Age found in Scotland, characteristically including an outer wall within which a circle of stone piers (resembling the spokes of a wheel) form the basis for lintel arches supporting corbelled roofing with a hearth at the hub.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, baseball, by extension from sense 1.2) A pitch location which is favourable to the hitter.",
                  "examples": [
                    "The pitch was right in his wheelhouse, and he hit a grand slam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, figuratively) A person's area of authority or expertise.",
                  "examples": [
                    "Synonym: domain",
                    "Horse viruses are in Pat’s wheelhouse."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}