{
  "word": "lose",
  "etymologies": [
    {
      "description": [
        "From Middle English losen, from Old English losian, from Proto-Germanic *lusōną, *luzōną, from Proto-Germanic *lusą."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "lose (third-person singular simple present loses, present participle losing, simple past and past participle lost)",
          "definitionGroups": [
            {
              "group": "(transitive) To cause (something) to cease to be in one's possession or capability due to unfortunate or unknown circumstances, events or reasons.",
              "entries": [
                {
                  "meaning": "(transitive) To have (an organ) removed from one's body, especially by accident.",
                  "examples": [
                    "Johnny lost a tooth, but kept it for the tooth fairy.",
                    "He lost his spleen in a car wreck."
                  ]
                },
                {
                  "meaning": "(transitive) To shed (weight).",
                  "examples": [
                    "I’ve lost five pounds this week."
                  ]
                },
                {
                  "meaning": "(transitive) To experience the death of (someone to whom one has an attachment, such as a relative or friend).",
                  "examples": [
                    "She lost all her sons in the war."
                  ]
                },
                {
                  "meaning": "(transitive) To give or owe (money) after losing a bet.",
                  "examples": []
                },
                {
                  "meaning": "To be deprived of access to something.",
                  "examples": [
                    "Users who engage in disruptive behavior may lose their accounts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wander from; to miss, so as not to be able to find; to go astray from.",
                  "examples": [
                    "I lost my way in the forest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fail to win (a game, competition, trial, etc).",
                  "examples": [
                    "We lost the football match.",
                    "You just lost The Game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be unable to follow or trace (somebody or something) any longer.",
                  "examples": [
                    "The policeman lost the robber he was chasing.",
                    "Mission control lost the satellite as its signal died down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (somebody) to be unable to follow or trace one any longer.",
                  "examples": [
                    "We managed to lose our pursuers in the forest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cease exhibiting; to overcome (a behavior or emotion).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To shed, remove, discard, or eliminate.",
                  "examples": [
                    "When we get into the building, please lose the hat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a clock, to run slower than expected.",
                  "examples": [
                    "My watch loses five minutes a week.",
                    "It's already 5:30? My watch must have lost a few minutes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ditransitive) To cause (someone) the loss of something; to deprive of.",
                  "examples": [
                    "O false heart! thou hadst almost betrayed me to eternal flames, and lost me this glory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fail to catch with the mind or senses; to miss.",
                  "examples": [
                    "I lost a part of what he said."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old French los, loos, from Latin laudēs, plural of laus (“praise”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lose",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Fame, renown; praise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}