{
  "word": "was",
  "etymologies": [
    {
      "description": [
        "From Middle English was, from Old English wæs, from Proto-Germanic *was, (compare Scots was, West Frisian was (dated, wie is generally preferred today), Dutch was, Low German was, German war, Swedish var), from Proto-Indo-European *h₂we-h₂wós-e, from *h₂wes- (“to reside”), whence also vestal. The paradigm of “to be” has been since the time of Proto-Germanic a synthesis of three originally distinct verb stems. The infinitive form be is from Proto-Indo-European *bʰuH- (“to become”). The forms is and are are both derived from Proto-Indo-European *h₁es- (“to be”). Lastly, the past forms starting with w- such as was and were are from Proto-Indo-European *h₂wes- (“to reside”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "was",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "first-person singular simple past indicative of be.",
                  "examples": [
                    "I was castigated and scorned."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "third-person singular simple past indicative of be.",
                  "examples": [
                    "It was a really humongous slice of cake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now colloquial) Used in phrases with existential there when the semantic subject is (usually third-person) plural.",
                  "examples": [
                    "There was three of them there."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now colloquial or nonstandard) second-person singular simple past indicative of be.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, nonstandard) first-person plural simple past indicative of be",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, nonstandard) third-person plural simple past indicative of be",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}