{
  "word": "pleonastic",
  "etymologies": [
    {
      "description": [
        "From pleonasm +‎ -astic."
      ],
      "adjectives": [
        {
          "description": "pleonastic (comparative more pleonastic, superlative most pleonastic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Of, or relating to pleonasm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Redundant.",
                  "examples": [
                    "A second class of Subject Expressions in English are so-called pleonastic pronouns such as it and there in sentences like: (104) (a) It is raining/It is a long way to Dallas/Itʼs time to leave/It is obvious that youʼre right (104) (b) There must have been some mistake/There walked into the room the most beautiful woman I had ever encountered These Pronouns are called ‘pleonasticʼ (which means ‘redundantʼ) in traditional grammar because (in their ‘pleonasticʼ use, but not in other uses) they are felt to be (in some vague intuitive sense) ‘semantically emptyʼ, and thus cannot have their reference questioned (cf. ✽What is raining? ✽Where must have been some mistake?)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Characterised by the use of redundant words or an excessive number of words.",
                  "examples": [
                    "Before undertaking to show the connection which this papyrus seems to establish between an apparently historical king of the IId dynasty and the hero of a romance of the XIXth (an interval of two or three thousand years), I will give an English version of Dr. Brugsch's German translation, condensing somewhat its more pleonastic passages, but preserving its genuine Egyptian features."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}