{
  "word": "year",
  "etymologies": [
    {
      "description": [
        "From Middle English yeer, yere, from Old English ġēar (“year”), from Proto-West Germanic *jār, from Proto-Germanic *jērą (“year”), from Proto-Indo-European *yóh₁r̥ (“year, spring”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "year (plural years)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A solar year, the time it takes the Earth to complete one revolution of the Sun (between 365.24 and 365.26 days depending on the point of reference).",
                  "examples": [
                    "we moved to this town a year ago;  I quit smoking exactly one year ago"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The time it takes for any astronomical object (such as a planet, dwarf planet, small Solar System body, or comet) in direct orbit around a star (such as the Sun) to make one revolution around the star.",
                  "examples": [
                    "Mars goes around the sun once in a Martian year, or 1.88 Earth years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period between set dates that mark a year, from January 1 to December 31 by the Gregorian calendar, from Tishiri 1 to Elul 29 by the Jewish calendar, and from Muharram 1 to Dhu al-Hijjah 29 or 30 by the Islamic calendar.",
                  "examples": [
                    "A normal year has 365 full days, but there are 366 days in a leap year.",
                    "I was born in the year 1950.",
                    "This Chinese year is the year of the Ox."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A scheduled part of a calendar year spent in a specific activity.",
                  "examples": [
                    "During this school year I have to get up at 6:30 to catch the bus."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) A Julian year, exactly 365.25 days, represented by \"a\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A level or grade in school or college.",
                  "examples": [
                    "Every second-year student must select an area of specialization.",
                    "The exams in year 12 at high school are the most difficult."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The proportion of a creature's lifespan equivalent to one year of an average human lifespan (see also dog year).",
                  "examples": [
                    "Geneticists have created baker's yeast that can live to 800 in yeast years."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "year",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pronunciation spelling of here.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pronunciation spelling of hear.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}