{
  "word": "exit",
  "etymologies": [
    {
      "description": [
        "From Middle English exit, from Latin exitus (“departure, going out; way by which one may go out, egress; (figuratively) conclusion, termination; (figuratively) death; income, revenue”), from exeō (“to depart, exit; to avoid, evade; (figuratively) to escape; of time: to expire, run out”) + -tus (suffix forming action nouns from verbs). Exeō is derived from ex- (prefix meaning ‘out, away’) + eō (“to go”) (ultimately from ). The English word is cognate with Italian esito, Portuguese êxito, Spanish éxito. Doublet of ejido.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "exit (plural exits)",
          "definitionGroups": [
            {
              "group": "An act of going out or going away, or leaving; a departure.",
              "entries": [
                {
                  "meaning": "(specifically, drama) The action of an actor leaving a scene or the stage.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A way out.",
              "entries": [
                {
                  "meaning": "An opening or passage through which one can go from inside a place (such as a building, a room, or a vehicle) to the outside; an egress.",
                  "examples": [
                    "Synonyms: outgang, outway",
                    "Antonyms: entrance, entranceway, entry, (archaic, rare) entryway, ingang, ingress, portal",
                    "emergency exit    fire exit",
                    "He was looking for the exit and got lost.",
                    "She stood at the exit of the house looking back and waving at those inside."
                  ]
                },
                {
                  "meaning": "(road transport) A minor road (such as a ramp or slip road) which is used to leave a major road (such as an expressway, highway, or motorway).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, often euphemistic) The act of departing from life; death.",
                  "examples": [
                    "Synonyms: see Thesaurus:death",
                    "the untimely exit of a respected politician"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "exit (third-person singular simple present exits, present participle exiting, simple past and past participle exited)",
          "definitionGroups": [
            {
              "group": "(intransitive) To go out or go away from a place or situation; to depart, to leave.",
              "entries": [
                {
                  "meaning": "(theater) To leave a scene or depart from a stage.",
                  "examples": [
                    "Desdemona exits stage left."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, often euphemistic) To depart from life; to die.",
                  "examples": [
                    "Synonyms: see Thesaurus:die"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, computing) To end or terminate (a program, subroutine, etc.)",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive, originally US, also figuratively) To depart from or leave (a place or situation).",
              "entries": [
                {
                  "meaning": "(transitive, specifically) To alight or disembark from a vehicle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge, intransitive) To give up the lead.",
                  "examples": [
                    "West now plays a low club to the J and Q. North exits in a trump."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Latin exit, the third-person singular present active indicative of exeō (“to depart, exit; to avoid, evade; (figuratively) to escape; of time: to expire, run out”); see further at etymology 1 above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "exit",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, drama, also figuratively) Used as a stage direction for an actor: to leave the scene or stage.",
                  "examples": [
                    "Synonym: exeat"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}