{
  "word": "cloak",
  "etymologies": [
    {
      "description": [
        "From Middle English cloke, from Old Northern French cloque (“travelling cloak”), from Medieval Latin clocca (“travelers' cape, literally “a bell”, so called from the garment’s bell-like shape”), of Celtic origin, from Proto-Celtic *klokkos, ultimately imitative.",
        "Doublet of clock."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cloak (plural cloaks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long outer garment worn over the shoulders covering the back; a cape, often with a hood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blanket-like covering, often metaphorical.",
                  "examples": [
                    "Night hid her movements with its cloak of darkness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative)  That which conceals; a disguise or pretext.",
                  "examples": [
                    "1611,  The Holy Bible, […] (King James Version), London:  […]  Robert Barker, […], →OCLC, 1 Thessalonians 2:5:For neither at any time vsed wee flattering wordes, as yee knowe, nor a cloke of couetousnesse, God is witnesse:",
                    "1692–1717,  Robert South,  Twelve Sermons Preached upon Several Occasions, volume , 6th edition, London:  […]  J[ames] Bettenham, for Jonah Bowyer, […], published 1727, →OCLC:\nNo man is esteemed any ways considerable for policy who wears religion otherwise than as a cloak."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A text replacement for an IRC user's hostname or IP address, making the user less identifiable.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cloak (third-person singular simple present cloaks, present participle cloaking, simple past and past participle cloaked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover as with a cloak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To cover up, hide or conceal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(science fiction, transitive, intransitive) To render or become invisible via futuristic technology.",
                  "examples": [
                    "The ship cloaked before entering the enemy sector of space."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}