{
  "word": "worldly",
  "etymologies": [
    {
      "description": [
        "From Middle English worldly, worldlich, wordly (adjective), from Old English woruldlīċ, worldlīċ, weoroldlīċ (“worldly; earthly; temporal; mundane; secular”), from Proto-Germanic *weraldilīkaz, equivalent to world +‎ -ly. Cognate with Dutch wereldlijk (“worldly; secular”), German Low German weltlik (“worldly”), German weltlich (“worldly”), Danish verdslig (“worldly”), Swedish världslig (“worldly”), Icelandic veraldlegur (“worldly; secular”)."
      ],
      "adjectives": [
        {
          "description": "worldly (comparative worldlier or more worldly, superlative worldliest or most worldly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Concerned with human or earthly matters, physical as opposed to spiritual.",
                  "examples": [
                    "These attributes, in spite of poverty and the strict integrity which shut him out from the more worldly successes, attracted to him many admirable persons, as naturally as sweet herbs draw bees, and as naturally he gave them the honey into which fifty years of hard experience had distilled no bitter drop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Concerned with secular rather than sacred matters.",
                  "examples": [
                    "Synonyms: lay, profane",
                    "Antonyms: clerical, religious, sacred"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sophisticated, especially because of surfeit; versed in the ways of the world.",
                  "examples": [
                    "Synonyms: sophisticated, street-smart",
                    "Antonym: naive"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English worldly, worldliche, wordly (adverb), from Old English woroldlīċe, weoroldlīċe; equivalent to world +‎ -ly (adverbial suffix)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "worldly (comparative more worldly, superlative most worldly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a worldly manner.",
                  "examples": [
                    "Synonyms: secularly, unspiritually, worldlily"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}