{
  "word": "swarf",
  "etymologies": [
    {
      "description": [
        "From Middle English *swarf, *swerf, from Old English ġeswearf, ġesweorf (“iron filings; rust”) and/or Old Norse svarf (“metallic dust”), both from Proto-Germanic *swarbą (“that which is rubbed off; shavings”), from Proto-Germanic *swerbaną (“to mop, wipe; to rub off”); see further at swerve. The word is cognate to Old English sweorfan (“to rub, scour; to file”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swarf (countable and uncountable, plural swarfs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The waste chips or shavings from an abrasive activity, such as metalworking, a saw cutting wood, or the use of a grindstone or whetstone. [from mid 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A particular waste chip or shaving.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swarf (third-person singular simple present swarfs, present participle swarfing, simple past and past participle swarfed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grind down.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English swarven, swerven (“to go; to deviate, turn aside; to stagger, be unsteady; to swerve”), from Old English sweorfan (“to wipe; to polish; to rub, scour; to file”), from Proto-Germanic *swerbaną (“to mop, wipe; to rub off”). The word is cognate to Middle Dutch swerven (“to rove; to stray”) (whence Dutch zwerven (“to roam”)), Low German swarven (“to rove; to stray; to riot”), Old Norse svarfa (“to sweep; to be agitated, upset”), Norwegian svarva (“to agitate”), sverva (“to whirl”). See swerve."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swarf (plural swarfs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A faint or swoon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swarf (third-person singular simple present swarfs, present participle swarfing, simple past and past participle swarfed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Scotland, obsolete) To grow languid; to faint.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}