{
  "word": "liberal",
  "etymologies": [
    {
      "description": [
        "The adjective is from Old French liberal, from Latin līberālis (“befitting a freeman”), from līber (“free”); it is attested since the 14th century. The noun is first attested in the 1800s."
      ],
      "adjectives": [
        {
          "description": "liberal (comparative more liberal, superlative most liberal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare outside set phrases) Pertaining to those arts and sciences the study of which is considered to provide general knowledge, as opposed to vocational/occupational, technical or mechanical training.",
                  "examples": [
                    "He had a full education studying the liberal arts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Generous; permitting liberty; willing to give unsparingly.",
                  "examples": [
                    "He was liberal with his compliments."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ample, abundant; generous in quantity.",
                  "examples": [
                    "For this reason a liberal amount of piping should be used. If a liberal supply of piping is provided at first, the first cost will of course be greater, but the extra expenditure is called for but once."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Unrestrained, licentious.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Widely open to new ideas, willing to depart from established opinions or conventions; permissive.",
                  "examples": [
                    "Her parents had liberal ideas about child-rearing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Open to political or social changes and reforms associated with either classical or modern liberalism.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "liberal (plural liberals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One with liberal views, supporting individual liberty (see Wikipedia's article on Liberalism).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Someone with progressive or left-wing views; one with a left-wing ideology.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A supporter of any of several liberal parties.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) One who favors individual voting rights, human and civil rights, and laissez-faire markets (also called \"classical liberal\"; compare libertarian).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}