{
  "word": "swamper",
  "etymologies": [
    {
      "description": [
        "From swamp +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swamper (plural swampers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A person who lives in a swampy area. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A person who clears a road for lumberers in a forest or swamp. [from 19th c.]",
                  "examples": [
                    "In the latter part of winter, I hired with a lumberer – camped out, and wrought in the forest as a swamper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone or something that swamps or overwhelms. [from 19th c.]",
                  "examples": [
                    "The Population Factor is a dissipator or swamper of the gain in per capita income and hence of the redressal of poverty to that degree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, slang) A truck driver's assistant; an assistant to a driver of horses, mules or bullocks. [from 19th c.]",
                  "examples": [
                    "To use such a brake on the front wagon, the driver stood up on the seat, letting the team follow the leaders, and threw his whole weight on the upper end of the bar, while the swamper braked the rear wagon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, slang) a person who travels by foot but has his belongings on a wagon. [from 19th c.]",
                  "examples": [
                    "On the road to the Diorite King, which is about 40 miles from Leonora, there was nothing much to see except a good many swampers. A “swamper” is a man tramping without his swag, which he entrusts to a teamster to bring on his waggon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A handyman or general employee in a liquor saloon; a cook's assistant. [from 20th c.]",
                  "examples": [
                    "The old swamper shifted his broom and held it between his elbow and his side while he held out his hand for the can."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}