{
  "word": "refrain",
  "etymologies": [
    {
      "description": [
        "From Middle English refreynen, from Anglo-Norman refraindre, Middle French refreindre (from Latin refringere), and Anglo-Norman refrener, Middle French refrener (from Latin refrenare)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "refrain (third-person singular simple present refrains, present participle refraining, simple past and past participle refrained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To hold back, to restrain (someone or something). [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, archaic) To show restraint; to hold oneself back. [from 14th c.]",
                  "examples": [
                    "As I went down the river, all dissatisfaction at my lot passed away, and by the time Dartmouth came in view I could no longer refrain myself, but threw my cap into the air, and barely caught it from falling overboard as I shouted, \"Hurrah for merry England! […] \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To repress (a desire, emotion etc.); to check or curb. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with preposition \"from\") To stop oneself from some action or interference; to abstain. [from 15th c.]",
                  "examples": [
                    "If you knew how I struggle for a little health, what uneasiness I am at in riding and walking, and refraining from every thing agreeable to my taste"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare, regional) To abstain from (food or drink). [from 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French refrain, from the Old French verb refraindre (“to break off, repeat”), from Latin re- (“back, again”) + frangō (“break”); compare Occitan refranhs (“a refrain”), refranher (“to repeat”). See refract and the verb refrain."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "refrain (plural refrains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The chorus or burden of a song repeated at the end of each verse or stanza.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A much repeated comment, complaint, or saying.",
                  "examples": [
                    "Synonym: old saw"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}