{
  "word": "flower",
  "etymologies": [
    {
      "description": [
        "From Middle English flour, from Anglo-Norman flur, from Latin flōrem, accusative of flōs, from Proto-Italic *flōs, from Proto-Indo-European *bʰleh₃- (“to thrive, bloom”). Doublet of flour.",
        "Partly displaced native Old English blostma, whence Modern English blossom."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flower (plural flowers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A colorful, conspicuous structure associated with angiosperms, frequently scented and attracting various insects, and which may or may not be used for sexual reproduction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A reproductive structure in angiosperms (flowering plants), often conspicuously colourful and typically including sepals, petals, and either or both stamens and/or a pistil.",
                  "examples": [
                    "You know, Darwin studied their fertilisation, and showed that the whole structure of an ordinary orchid flower was contrived in order that moths might carry the pollen from plant to plant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plant that bears flowers, especially a plant that is small and lacks wood.",
                  "examples": [
                    "We transplanted the flowers to a larger pot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cut flower; the stem of a flowering plant with the blossom or blossoms attached, used for decoration, as a gift, etc.",
                  "examples": [
                    "He always keeps a vase full of flowers in his office."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with in) Of plants, a state of bearing blooms.",
                  "examples": [
                    "The dogwoods are in flower this week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, hypocoristic) The vulva, especially the labia majora.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The best examples or representatives of a group.",
                  "examples": [
                    "the flower of the chivalry of all Spain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The best state of things; the prime.",
                  "examples": [
                    "She was in the flower of her life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Flour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, chemistry, obsolete) A substance in the form of a powder, especially when condensed from sublimation.",
                  "examples": [
                    "the flowers of sulphur"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A figure of speech; an ornament of style.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) Ornamental type used chiefly for borders around pages, cards, etc.",
                  "examples": [
                    "I pointed out to the late Mr. Catherwood, of the firm of Caslon and Catherwood, the inconvenience of both these modes of cutting flowers,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, obsolete) Menstrual discharges.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A delicate, fragile, or oversensitive person.",
                  "examples": [
                    "[…]  she whispered leaning over and kissing her forehead; and then added, 'Mummy loves you, precious flower.'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flower (third-person singular simple present flowers, present participle flowering, simple past and past participle flowered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To put forth blooms.",
                  "examples": [
                    "This plant flowers in June."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To decorate with pictures of flowers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To reach a state of full development or achievement.",
                  "examples": [
                    "It only needed watering to take root, to flower and to fructify, and the watering came in due course."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, intransitive) To froth; to ferment gently, as new beer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come off as flowers by sublimation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "flow +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flower (plural flowers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Something that flows, such as a river.",
                  "examples": [
                    "Leaving the weavers’ village behind you, and crossing the sandy bed of the Vengavati or ‘Swift-flower,’ which, however, contained not a drop of water, you reach the ancient Jain temple."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}