{
  "word": "hacker",
  "etymologies": [
    {
      "description": [
        "From Middle English hakker, hackere, hakkere, equivalent to hack +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hacker (plural hackers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) One who is expert at programming and solving problems with a computer.",
                  "examples": [
                    "A hacker starts with nothing but a dream and a floppy disk and presently finds himself in a business that's doubled and trebled. Three \"diskzines\" — magazines on floppy disks — started cheaply by entrepreneurs who placed ads in obscure computer journals  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer security, telecommunications) One who uses a computer to gain unauthorized access to data, or to carry out malicious attacks.",
                  "examples": [
                    "Synonyms: (outside US) cracker, black hat",
                    "a phone hacker"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer security) A computer security professional, a white-hat hacker.",
                  "examples": [
                    "Synonym: white hat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that hacks; a tool or device for hacking.",
                  "examples": [
                    "Thomas Limbrick, who was only nine years of age, said he lived with his mother when Deborah was beat: that his mother throwed her down all along with her hands; and then against a wall, and kicked her in the belly: that afterwards she picked her up, and beat her with the hacker on the side of the head; wiped the blood off with a dish-clout, and took her up to bed after she was dead."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, regional) A fork-shaped tool used to harvest root vegetables.",
                  "examples": [
                    "The upper half of each turnip had been eaten off by the live-stock, and it was the business of the two women to grub up the lower or earthy half of the root with a hooked fork called a hacker, that it might be eaten also."
                  ]
                }
              ]
            },
            {
              "group": "Someone who hacks.",
              "entries": [
                {
                  "meaning": "One who cuts with rough or heavy blows.",
                  "examples": [
                    "In January or February the \"hacker,\" with his keen-bladed ax, begins the round which ends the season. [...] About a quart of sap is taken from each box by means of the trowel-shaped scoop used by the dipper, and then the hacker comes along and starts the flow afresh by wounding the tree again."
                  ]
                },
                {
                  "meaning": "One who kicks wildly or roughly.",
                  "examples": []
                },
                {
                  "meaning": "One who is consistent and focuses on accomplishing a task or several tasks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) One who is inexperienced or unskilled at a particular activity, especially a sport such as golf or tennis.",
                  "examples": [
                    "a tennis hacker"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) One who operates a taxicab.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}