{
  "word": "throne",
  "etymologies": [
    {
      "description": [
        "From Middle English trone, from Old French trone, from Latin thronus, from Ancient Greek θρόνος (thrónos, “chair, throne”).",
        "Partially replaced seld (\"seat, throne\"), from Middle English selde (“seat, store, throne”), from Old English seld, a form of Old English setl (“sitting, seat, setting”), from Proto-Germanic *setlą."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "throne (plural thrones)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An impressive seat used by a monarch, often on a raised dais in a throne room and reserved for formal occasions.",
                  "examples": [
                    "He approached the throne reverently.",
                    "Queen Victoria sat upon the throne of England for 63 years.",
                    "The prince's newborn baby is fifth in line to the throne."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Leadership, particularly the position of a monarch.",
                  "examples": [
                    "Thou shalt be ouer my house, and according vnto thy word shall all my people be ruled: only in the throne will I be greater then thou."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The seat of a bishop in the cathedral-church of his diocese; also, the seat of a pope.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(humorous) Other seats, particularly:",
              "entries": [
                {
                  "meaning": "(euphemistic) A seat used for urination or defecation, such as a chamber pot, toilet, or the seat of an outhouse.",
                  "examples": [
                    "\"If she has intestinal flu, you probably called while she was on the throne and she didn't want to admit it,\" Alan said dryly."
                  ]
                },
                {
                  "meaning": "(music) A kind of stool used by drummers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A member of an order of angels ranked above dominions and below cherubim.",
                  "examples": [
                    "For by him were all things created that are in heauen, and that are in earth, visible and inuisible, whether they be thrones, or dominions, or principalities, or powers: all things were created by him, and for him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "throne (third-person singular simple present thrones, present participle throning, simple past and past participle throned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To place on a royal seat; to enthrone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To place in an elevated position; to give sovereignty or dominion to; to exalt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To be in, or sit upon, a throne; to be placed as if upon a throne.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}