{
  "word": "cushion",
  "etymologies": [
    {
      "description": [
        "From Middle English quysshyn, from later Old French coissin (modern coussin), from Vulgar Latin *coxīnus (“seat pad”), derived from Latin coxa (“hip, thigh”) with the suffix possibly after Latin pulvīnus (“pillow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cushion (countable and uncountable, plural cushions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A soft mass of material stuffed into a cloth bag, used for comfort or support; for sitting on, kneeling on, resting one's head on etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something acting as a cushion, especially to absorb a shock or impact.",
              "entries": [
                {
                  "meaning": "A pad on which gilders cut gold leaf.",
                  "examples": []
                },
                {
                  "meaning": "A mass of steam in the end of the cylinder of a steam engine to receive the impact of the piston.",
                  "examples": []
                },
                {
                  "meaning": "(sports, billiards, snooker, pool) The lip around a table in cue sports which absorbs some of the impact of the billiard balls and bounces them back.",
                  "examples": []
                },
                {
                  "meaning": "The pillow used in making bone lace.",
                  "examples": []
                },
                {
                  "meaning": "An engraver's pad.",
                  "examples": []
                },
                {
                  "meaning": "(historical) The rubber of an electrical machine.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A pad supporting a woman's hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively) a sufficient quantity of an intangible object (like points or minutes) to allow for some of those points, for example, to be lost without hurting one's chances for successfully completing an objective.",
              "entries": [
                {
                  "meaning": "(finance, countable, uncountable) Money kept in reserve.",
                  "examples": [
                    "Interest coverage is important because it is an indicator of how much cushion a company has in making its interest payments."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The dancer in the cushion dance who currently holds the cushion, or the dance itself.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cushion (third-person singular simple present cushions, present participle cushioning, simple past and past participle cushioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish with cushions.",
                  "examples": [
                    "to cushion a sofa"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To seat or place on, or as on a cushion.",
                  "examples": [
                    "How many doughty monarchs, in later and more polite ages, would have slept in cottages, and have worked in falls, instead of inhabiting palaces, and being cushioned up in thrones, if this rule of government had continued in force ?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To absorb or deaden the impact of.",
                  "examples": [
                    "to cushion a blow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To conceal or cover up, as under a cushion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}