{
  "word": "subtlety",
  "etymologies": [
    {
      "description": [
        "From Middle English sotilte, from Old French sutilté, inherited from Latin subtīlitās, from subtīlis (“subtle”). Equivalent to subtle +‎ -ty. Doublet of subtility."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "subtlety (countable and uncountable, plural subtleties)",
          "definitionGroups": [
            {
              "group": "(uncountable) The quality of being subtle.",
              "entries": [
                {
                  "meaning": "(of things) The quality of being scarcely noticeable or difficult to discern.",
                  "examples": [
                    "the subtlety of the Mona Lisa’s smile"
                  ]
                },
                {
                  "meaning": "(of things) The quality of being done in a clever way that is not obvious or not direct; the quality of being carefully thought out.",
                  "examples": [
                    "the subtlety of a writer’s analysis / of a singer’s phrasing",
                    "Synonym: refinement"
                  ]
                },
                {
                  "meaning": "(of people) The quality of being able to achieve one's aims through clever, delicate or indirect methods.",
                  "examples": [
                    "With all his usual subtlety, he quietly fixed the problem before anyone else noticed it.",
                    "Synonyms: discretion, finesse, savoir-faire"
                  ]
                },
                {
                  "meaning": "(of people) The quality of being able to notice or understand things that are not obvious.",
                  "examples": [
                    "Synonyms: acumen, perceptiveness, perspicacity"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An instance of being subtle, a subtle thing, especially a subtle argument or distinction.",
                  "examples": [
                    "The subtleties of this overture are often overlooked.",
                    "Synonyms: nicety, nuance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, historical) An ornate medieval illusion dish or table decoration, especially when made from one thing but crafted to look like another.",
                  "examples": [
                    "At the king's coronation feast, several subtleties were served between main courses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, countable, archaic) The quality of being clever in surreptitious or deceitful behaviour; an act or argument that shows this quality.",
                  "examples": [
                    "Synonyms: artifice, craftiness, cunning, deceitfulness, slyness, trickery"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) A trick that creates a false appearance.",
                  "examples": [
                    "Synonyms: deception, illusion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) The property of having a low density or thin consistency.",
                  "examples": [
                    "Therefore at Paris where naturally, and also through the aboundance of filth that is about the Citie, the Aire is darke and grosse, the pestilent Infection is lesse fierce and contagious then it is in Prouince, for the subtletie of the Aire stimulates or helps forward the Plague."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) The property of being able to penetrate materials easily.",
                  "examples": [
                    "Synonyms: penetrancy, piercingness"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}