{
  "word": "mysticism",
  "etymologies": [
    {
      "description": [
        "From mystic +‎ -ism, from Old French mistique (“mysterious, full of mystery”), from Latin mysticus (“mystical, mystic, of secret rites”), from Ancient Greek μυστικός (mustikós, “secret, mystic”), from μύστης (mústēs, “one who has been initiated, initiate”) from μῡ́ω (mū́ō, “to close one's lips or eyes; initiate into the mysteries”). Compare Asturian misticismu, Catalan misticisme, French mysticisme, German Mystizismus, Italian misticismo, Portuguese misticismo, Sicilian misticisimu, Spanish misticismo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mysticism (countable and uncountable, plural mysticisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The beliefs, ideas, or thoughts of mystics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A doctrine of direct communication or spiritual intuition of divine truth.",
                  "examples": [
                    "In the history of Christian mysticism the problem how to discriminate between such messages and experiences as were really divine miracles, and such others as the demon in his malice was able to counterfeit, thus making the religious person twofold more the child of hell he was before, has always been a difficult one to solve, needing all the sagacity and experience of the best directors of conscience."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A transcendental union of soul or mind with the divine reality or divinity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obscure thoughts and speculations.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}