{
  "word": "drip",
  "etymologies": [
    {
      "description": [
        "From Middle English drippen, druppen, from Old English dryppan, from Proto-Germanic *drupjaną (“to fall in drops, drip”), from Proto-Germanic *drupô (“drop”). Akin to West Frisian drippe (“to drip”),\nDutch druipen, druppelen (“to drip”), German Low German drüppen (“to drip”), German tropfen, tröpfeln (“to drip”), Norwegian Bokmål dryppe, Norwegian Nynorsk drypa (“to drip”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "drip (third-person singular simple present drips, present participle dripping, simple past and past participle dripped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fall one drop at a time.",
                  "examples": [
                    "Listening to the tap next door drip all night drove me mad!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To leak slowly.",
                  "examples": [
                    "Does the sink drip, or have I just spilt water over the floor?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To let fall in drops.",
                  "examples": [
                    "After putting oil on the side of the salad, the chef should drip a little vinegar in the oil.",
                    "My broken pen dripped ink onto the table."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, usually with with) To have a superabundance of valuable things.",
                  "examples": [
                    "The Old Hall simply drips with masterpieces of the Flemish painters.",
                    "The duchess was dripping with jewels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of the weather) To rain lightly.",
                  "examples": [
                    "The weather isn't so bad. I mean, it's dripping, but you're not going to get so wet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be wet, to be soaked.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, naval slang, intransitive) To whine or complain consistently; to grumble.",
                  "examples": [
                    "The Women's Royal Naval Service was integrated with the Royal Navy in November 1993.  […]  Men interviewed by Public Eye (April, 1994) said they should 'stop dripping about it' and that women should learn to 'take it like a man  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English drippe, from the verb (see above). Compare West Frisian drip (“drip”), Dutch drup (“drip”), Danish dryp (“drip”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drip (countable and uncountable, plural drips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drop of a liquid.",
                  "examples": [
                    "I put a drip of vanilla extract in my hot cocoa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A falling or letting fall in drops; act of dripping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An apparatus that slowly releases a liquid, especially one that intravenously releases drugs into a patient's bloodstream.",
                  "examples": [
                    "He's not doing so well. The doctors have put him on a drip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A limp, ineffectual, or uninteresting person.",
                  "examples": [
                    "He couldn't even summon up the courage to ask her name... what a drip!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) That part of a cornice, sill course, or other horizontal member, which projects beyond the rest, and has a section designed to throw off rainwater.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Style; swagger; fashionable and/or expensive clothing.",
                  "examples": [
                    "His drip is looking fine, especially the Supreme t-shirt."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Acronym."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drip",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A dividend reinvestment program; a type of financial investing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}