{
  "word": "cut",
  "etymologies": [
    {
      "description": [
        "From Middle English cutten, kitten, kytten, ketten (“to cut”) (compare Scots kut, kit (“to cut”)), of North Germanic origin, from Old Norse kytja, kutta, from Proto-Germanic *kutjaną, *kuttaną (“to cut”), of uncertain origin, perhaps related to Proto-Germanic *kwetwą (“meat, flesh”) (compare Old Norse kvett (“meat”)). Akin to Middle Swedish kotta (“to cut or carve with a knife”) (compare dialectal Swedish kåta, kuta (“to cut or chip with a knife”), Swedish kuta, kytti (“a knife”)), Norwegian Bokmål kutte (“to cut”), Norwegian Nynorsk kutte (“to cut”), Icelandic kuta (“to cut with a knife”), Old Norse kuti (“small knife”), Norwegian kyttel, kytel, kjutul (“pointed slip of wood used to strip bark”).",
        "Displaced native Middle English snithen (from Old English snīþan; compare German schneiden), which still survives in some dialects as snithe or snead. See snide.",
        "Adjective sense of \"drunk\" (now rare and now usually used in the originally jocular derivative form of half-cut) dates from the 17th century, from cut in the leg, to have cut your leg, euphemism for being very drunk."
      ],
      "adjectives": [
        {
          "description": "From Middle English cutten, kitten, kytten, ketten (“to cut”) (compare Scots kut, kit (“to cut”)), of North Germanic origin, from Old Norse kytja, kutta, from Proto-Germanic *kutjaną, *kuttaną (“to cut”), of uncertain origin, perhaps related to Proto-Germanic *kwetwą (“meat, flesh”) (compare Old Norse kvett (“meat”)). Akin to Middle Swedish kotta (“to cut or carve with a knife”) (compare dialectal Swedish kåta, kuta (“to cut or chip with a knife”), Swedish kuta, kytti (“a knife”)), Norwegian Bokmål kutte (“to cut”), Norwegian Nynorsk kutte (“to cut”), Icelandic kuta (“to cut with a knife”), Old Norse kuti (“small knife”), Norwegian kyttel, kytel, kjutul (“pointed slip of wood used to strip bark”). Displaced native Middle English snithen (from Old English snīþan; compare German schneiden), which still survives in some dialects as snithe or snead. See snide. Adjective sense of \"drunk\" (now rare and now usually used in the originally jocular derivative form of half-cut) dates from the 17th century, from cut in the leg, to have cut your leg, euphemism for being very drunk.",
          "definitionGroups": []
        },
        {
          "description": "cut (comparative more cut, superlative most cut)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(participial adjective) Having been cut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Reduced.",
                  "examples": [
                    "The pitcher threw a cut fastball that was slower than his usual pitch.",
                    "Cut brandy is a liquor made of brandy and hard grain liquor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a gem) Carved into a shape; not raw.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, of a shot) Played with a horizontal bat to hit the ball backward of point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bodybuilding) Having muscular definition in which individual groups of muscle fibers stand out among larger muscles.",
                  "examples": [
                    "Or how 'bout Shane DiMora? Could he possibly get rip-roaring cut this time around?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Circumcised or having been the subject of female genital mutilation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, slang) Emotionally hurt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, New Zealand, formerly UK) Intoxicated as a result of drugs or alcohol.",
                  "examples": [
                    "Synonyms: see Thesaurus:drunk"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cut (countable and uncountable, plural cuts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of cutting.",
                  "examples": [
                    "He made a fine cut with his sword."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The result of cutting.",
                  "examples": [
                    "a smooth or clear cut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An opening resulting from cutting; an incision or wound.",
                  "examples": [
                    "Look at this cut on my finger!"
                  ]
                }
              ]
            },
            {
              "group": "A notch, passage, or channel made by cutting or digging; a furrow; a groove.",
              "entries": [
                {
                  "meaning": "An artificial navigation channel as distinguished from a navigable river.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A share or portion of profits.",
                  "examples": [
                    "The bank robbers disbanded after everyone got their cut of the money."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A decrease.",
                  "examples": [
                    "Antonym: hike (used in same contexts); increase",
                    "The boss took a 5% pay cut."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A batsman's shot played with a swinging motion of the bat, to hit the ball backward of point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) Sideways movement of the ball through the air caused by a fast bowler imparting spin to the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) In lawn tennis, etc., a slanting stroke causing the ball to spin and bound irregularly; also, the spin thus given to the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) In a strokeplay competition, the early elimination of those players who have not then attained a preannounced score, so that the rest of the competition is less pressed for time and more entertaining for spectators.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially theater, film) A passage omitted or to be omitted from a play, movie script, speech, etc.",
                  "examples": [
                    "The director asked the cast to note down the following cuts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) A particular version or edit of a film.",
                  "examples": [
                    "the director's cut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) The act or right of dividing a deck of playing cards.",
                  "examples": [
                    "The player next to the dealer makes a cut by placing the bottom half on top."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) The card obtained by dividing the pack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The manner or style in which a garment or an article of clothing is fashioned.",
                  "examples": [
                    "I like the cut of that suit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slab, especially of meat.",
                  "examples": [
                    "That’s our finest cut of meat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) An attack made with a chopping motion of the blade, landing with its edge or point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deliberate snub, typically a refusal to return a bow or other acknowledgement of acquaintance.",
                  "examples": [
                    "Rip called him by name, but the cur snarled, showed his teeth, and passed on. This was an unkind cut indeed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unkind act; a cruelty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A definable part, such as an individual song, of a recording, particularly of commercial records, audio tapes, CDs, etc.",
                  "examples": [
                    "The drummer on the last cut of their CD is not identified."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) A truncation, a context that represents a moment in time when other archaeological deposits were removed for the creation of some feature such as a ditch or pit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A haircut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) The partition of a graph’s vertices into two subgroups.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A string of railway cars coupled together, shorter than a train.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An engraved block or plate; the impression from such an engraving.",
                  "examples": [
                    "a book illustrated with fine cuts"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A common workhorse; a gelding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) The failure of a college officer or student to be present at any appointed exercise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A skein of yarn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) That which is used to dilute or adulterate a recreational drug.",
                  "examples": [
                    "Synonym: mix",
                    "Don't buy his coke: it's full of cut."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion) A notch shaved into an eyebrow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bodybuilding) A time period when one attempts to lose fat while retaining muscle mass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A hidden, secluded, or secure place.",
                  "examples": [
                    "Bitch I'm out, catch me chillin' in the cut. Me and my homies swag it out in the cut. It's a party going down in the cut."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemical engineering, petrochemistry) The range of temperatures used to distill a particular mixture of hydrocarbons from crude oil.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cut (third-person singular simple present cuts, present participle cutting, simple past and past participle cut)",
          "definitionGroups": [
            {
              "group": "(transitive) To incise, to cut into the surface of something.",
              "entries": [
                {
                  "meaning": "To perform an incision on, for example with a knife.",
                  "examples": []
                },
                {
                  "meaning": "To divide with a knife, scissors, or another sharp instrument.",
                  "examples": [
                    "Would you please cut the cake?"
                  ]
                },
                {
                  "meaning": "To form or shape by cutting.",
                  "examples": [
                    "I have three diamonds to cut today."
                  ]
                },
                {
                  "meaning": "(slang) To wound with a knife.",
                  "examples": [
                    "We don't want your money no more. We just going to cut you."
                  ]
                },
                {
                  "meaning": "(intransitive) To engage in self-harm by making cuts in one's own skin.",
                  "examples": [
                    "The patient said she had been cutting since the age of thirteen."
                  ]
                },
                {
                  "meaning": "To deliver a stroke with a whip or like instrument to.",
                  "examples": [
                    "“My Continental prominence is improving,” I commented dryly. ¶ Von Lindowe cut at a furze bush with his silver-mounted rattan. ¶ “Quite so,” he said as dryly, his hand at his mustache. “I may say if your intentions were known your life would not be worth a curse.”"
                  ]
                },
                {
                  "meaning": "To wound or hurt deeply the sensibilities of; to pierce.",
                  "examples": [
                    "Sarcasm cuts to the quick."
                  ]
                },
                {
                  "meaning": "To castrate or geld.",
                  "examples": [
                    "to cut a horse"
                  ]
                },
                {
                  "meaning": "To interfere, as a horse; to strike one foot against the opposite foot or ankle in using the legs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To admit of incision or severance; to yield to a cutting instrument.",
                  "examples": [
                    "The panels of white-wood that cuts like cheese, / But lasts like iron for things like these;"
                  ]
                }
              ]
            },
            {
              "group": "(transitive, social) To separate, remove, reject or reduce.",
              "entries": [
                {
                  "meaning": "To separate or omit, in a situation where one was previously associated.",
                  "examples": [
                    "Travis was cut from the team."
                  ]
                },
                {
                  "meaning": "To abridge or shorten a work; to remove a portion of a recording during editing.",
                  "examples": []
                },
                {
                  "meaning": "To reduce, especially intentionally.",
                  "examples": [
                    "They're going to cut salaries by fifteen percent."
                  ]
                },
                {
                  "meaning": "To absent oneself from (a class, an appointment, etc.).",
                  "examples": [
                    "I cut fifth period to hang out with Angela."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, social) To ignore as a social rebuff or snub.",
                  "examples": [
                    "Synonym: spear",
                    "After the incident at the dinner party, people started to cut him on the street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, film) To make an abrupt transition from one scene or image to another.",
                  "examples": [
                    "The camera then cut to the woman on the front row who was clearly overcome and crying tears of joy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, film) To edit a film by selecting takes from original footage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To remove (text, a picture, etc.) and place in memory in order to paste at a later time.",
                  "examples": [
                    "Select the text, cut it, and then paste it in the other application."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To enter a queue in the wrong place.",
                  "examples": [
                    "One student kept trying to cut in front of the line."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To intersect or cross in such a way as to divide in half or nearly so.",
                  "examples": [
                    "This road cuts right through downtown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cricket) To make the ball spin sideways by running one's fingers down the side of the ball while bowling it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cricket) To deflect (a bowled ball) to the off, with a chopping movement of the bat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change direction suddenly.",
                  "examples": [
                    "The football player cut to his left to evade a tackle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To divide a pack of playing cards into two.",
                  "examples": [
                    "If you cut then I'll deal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To make or negotiate.",
                  "examples": [
                    "I'll cut a check for you.",
                    "I didn't deserve it, but he cut me a deal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To dilute or adulterate something, especially a recreational drug.",
                  "examples": [
                    "The best malt whiskies are improved if they are cut with a dash of water.",
                    "The bartender cuts his beer to save money and now it's all watery.",
                    "Drug dealers sometimes cut cocaine with lidocaine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exhibit (a quality).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stop, disengage, or cease.",
                  "examples": [
                    "Synonym: cut out",
                    "The schoolchildren were told to cut the noise.",
                    "Cut the engines when the plane comes to a halt!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) To drive (a ball) to one side, as by (in billiards or croquet) hitting it fine with another ball, or (in tennis) striking it with the racket inclined.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bodybuilding) To lose body mass, aiming to keep muscle but lose body fat.",
                  "examples": [
                    "Coordinate term: bulk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perform (a dancing movement etc.).",
                  "examples": [
                    "to cut a caper"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}