{
  "word": "crunch",
  "etymologies": [
    {
      "description": [
        "From earlier craunch, cranch, of imitative origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crunch (plural crunches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A noisy crackling sound; the sound usually associated with crunching.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A critical moment or event.",
                  "examples": [
                    "The friends, on the contrary, argue that Job does not \"know\", that only God knows; yet, when it comes to the crunch, they themselves seem to know as much as God knows: for example, that Job is a guilty sinner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A problem that leads to a crisis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(exercise) A form of abdominal exercise, based on a sit-up but in which the lower back remains in contact with the floor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(software engineering, slang) The overtime work required to catch up and finish a project, usually in the final weeks of development before release.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dessert consisting of a crunchy topping with fruit underneath.",
                  "examples": [
                    "Synonyms: crisp, crumble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) The symbol #.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking, generally in the plural) A small piece created by crushing; a piece of material with a friable or crunchy texture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A shortage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crunch (third-person singular simple present crunches, present participle crunching, simple past and past participle crunched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To crush something, especially food, with a noisy crackling sound.",
                  "examples": [
                    "When I came home, Susan was watching TV with her feet up on the couch, crunching a piece of celery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be crushed with a noisy crackling sound.",
                  "examples": [
                    "Beetles crunched beneath the men's heavy boots as they worked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To calculate or otherwise process (e.g. to crunch numbers: to perform mathematical calculations). Presumably from the sound made by mechanical calculators.",
                  "examples": [
                    "That metadata makes it much easier for the search engine to crunch the data for queries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To grind or press with violence and noise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To emit a grinding or crunching noise.",
                  "examples": [
                    "There were sounds in the air above his head – sounds of the crunching and rattling of the loose, smooth stones as his neighbors moved about […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive, transitive) To cause the gears to emit a crunching sound by releasing the clutch before the gears are properly synchronised.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, transitive) To compress (data) using a particular algorithm, so that it can be restored by decrunching.",
                  "examples": [
                    "PackIt will not crunch executables, unless told to do so."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(software engineering, slang, transitive) To make employees work overtime in order to meet a deadline in the development of a project.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}