{
  "word": "administration",
  "etymologies": [
    {
      "description": [
        "From Middle English administracioun, from Old French administration, from Latin administratio, from administrare; see administer; compare French administration."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "administration (usually uncountable, plural administrations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act of administering; government of public affairs; the service rendered, or duties assumed, in conducting affairs; the conducting of any office or employment; direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, government, politics) The executive part of government; the persons collectively who are entrusted with the execution of laws and the superintendence of public affairs; the chief magistrate and his cabinet or council; or the council, or ministry, alone, as in Great Britain.",
                  "examples": [
                    "Successive US administrations have had similar Middle East policies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(government, politics) The country's government under the rule of a particular leader.",
                  "examples": [
                    "The Obama administration",
                    "The Duterte administration"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A body that administers; a body of administrators.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act of administering, or tendering something to another; dispensation.",
                  "examples": [
                    "the administration of a medicine, of an oath, of justice, or of the sacrament.",
                    "oral administration of insulin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, business) Management.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, law, UK) An arrangement whereby an insolvent company can continue trading under supervision.",
                  "examples": [
                    "The company went into voluntary administration last week."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}