{
  "word": "feather",
  "etymologies": [
    {
      "description": [
        "From Middle English feþer, from Old English feþer, from Proto-West Germanic *feþru, from Proto-Germanic *feþrō, from Proto-Indo-European *péth₂r̥ (“feather, wing”), from *peth₂- (“to fly”).",
        "See also West Frisian fear, German Low German Fedder, Dutch veder, veer, German Feder, Yiddish פֿעדער‎ (feder), Danish fjer, Swedish fjäder, Norwegian Bokmål fjær, fjør, Norwegian Nynorsk fjør; also Ancient Greek πέτομαι (pétomai), Albanian shpend (“bird”), Latin penna, Old Armenian թիռ (tʿiṙ)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "feather (plural feathers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A branching, hair-like structure that grows on the bodies of birds, used for flight, swimming, protection and display.",
                  "examples": [
                    "Notice, too, that the shaft is not straight, but bent so that the upper surface of the feather is convex, and the lower concave."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Long hair on the lower legs of a dog or horse, especially a draft horse, notably the Clydesdale breed. Narrowly only the rear hair.",
                  "examples": [
                    "Synonyms: feathers, feathering, horsefeathers",
                    "Antonym: spats"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the fins or wings on the shaft of an arrow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A longitudinal strip projecting from an object to strengthen it, or to enter a channel in another object and thereby prevent displacement sideways but permit motion lengthwise; a spline.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Kind; nature; species (from the proverbial phrase \"birds of a feather\").",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the two shims of the three-piece stone-splitting tool known as plug and feather or plug and feathers; the feathers are placed in a borehole and then a wedge is driven between them, causing the stone to split.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The angular adjustment of an oar or paddle-wheel float, with reference to a horizontal axis, as it leaves or enters the water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything petty or trifling; a whit or jot.",
                  "examples": [
                    "To some pew purchasers he gave deeds, to others he gave, none, but both were promised security, and both it seems were equally secure, for the pew deed as Mr. Melledge declared to Mr. G. was not worth a feather."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting, in the plural) Partridges and pheasants, as opposed to rabbits and hares (called fur).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A junction indicator attached to a colour-light signal at an angle, which lights up, typically with four white lights in a row, when a diverging route is set up.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "feather (third-person singular simple present feathers, present participle feathering, simple past and past participle feathered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover or furnish with feathers; (when of an arrow) to fletch.",
                  "examples": [
                    "Olondaw had taught Hazeleye how to use her bow and arrows, and that each might know the result of his or her own shooting, he had feathered her arrow with white and his own with red. How strange are the events of this life,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To adorn, as if with feathers; to fringe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To arrange in the manner or appearance of feathers.",
                  "examples": [
                    "The stylist feathered my hair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, rowing) To rotate the oars while they are out of the water to reduce wind resistance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aeronautics) To streamline the blades of an aircraft's propeller by rotating them perpendicular to the axis of the propeller when the engine is shut down so that the propeller does not windmill during flight.",
                  "examples": [
                    "After striking the bird, the pilot feathered the damaged left engine’s propeller."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(carpentry, engineering) To finely shave or bevel an edge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer graphics) To intergrade or blend the pixels of an image with those of a background or neighboring image.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of written or printed ink: to take on a blurry appearance as a result of spreading through the receiving medium.",
                  "examples": [
                    "Whether or not the ink feathers depends upon the paper or card, and also upon the nature of the dye in the ink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To render light as a feather; to give wings to.",
                  "examples": [
                    "The Polonian story, which perhaps may feather some tedious hours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enrich; to exalt; to benefit.",
                  "examples": [
                    "They stuck not to say that the king cared not to plume his nobility and people to feather himself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tread, as a cockerel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, billiards) To move the cue back and forth along the bridge in preparation for striking the cue ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, billiards) To accidentally touch the cue ball with the tip of the cue when taking aim.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To touch lightly, like (or as if with) a feather.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move softly, like a feather.",
                  "examples": [
                    "She feathered her fingers through Mitchell's hair. “Besides, I like you a whole lot better than Frye.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}