{
  "word": "peplum",
  "etymologies": [
    {
      "description": [
        "From Latin peplum, from Ancient Greek πέπλων (péplōn), neuter of πέπλος (péplos)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "peplum (plural peplums or pepla)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A peplos, an Ancient Greek garment formed of a tubular piece of cloth folded back upon itself halfway down so that the top of the tube is worn around the waist, and the bottom covers the legs down to the ankles; the open top is then worn over the shoulders, and draped, in folds, down to the waist. Compare the Roman palla.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A kind of women's outer garment in ancient Greece; a veil.",
                  "examples": [
                    "And this was Neith, or Athena, that God thus described, \"I am all that was, is, and shall be, and my peplum or veil, no mortal could ever uncover.\"  […]  Peplum is properly a womanish pall or veil, embroidered all over and consecrated to Minerva."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion) A short overskirt cut in such a way that the sides form points. [from 20th century]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion) A short overskirt attached to the waist of a garment; a basque.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From French péplum, from Latin peplum, from Ancient Greek πέπλων (péplōn), neuter of πέπλος (péplos)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "peplum (plural peplums or pepla)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A genre of Italian films based on historical or biblical epics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An individual film in this genre.",
                  "examples": [
                    "[…]  there were hastily produced B movies, such as the peplums, the spaghetti westerns, the detective stories, the horrors."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}