{
  "word": "edge",
  "etymologies": [
    {
      "description": [
        "From Middle English egge, from Old English eċġ, from Proto-West Germanic *aggju, from Proto-Germanic *agjō, from Proto-Indo-European *h₂eḱ- (“sharp”).",
        "See also Dutch egge, German Ecke, Swedish egg, Norwegian egg; also Welsh hogi (“to sharpen, hone”), Latin aciēs (“sharp”), acus (“needle”), Latvian ašs, ass (“sharp”), Ancient Greek ἀκίς (akís, “needle”), ἀκμή (akmḗ, “point”), and Persian آس‎ (âs, “grinding stone”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "edge (plural edges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The boundary line of a surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A one-dimensional face of a polytope. In particular, the joining line between two vertices of a polygon; the place where two faces of a polyhedron meet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An advantage.",
                  "examples": [
                    "I have the edge on him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) The thin cutting side of the blade of an instrument, such as an ax, knife, sword, or scythe; that which cuts as an edge does, or wounds deeply, etc.",
                  "examples": [
                    "And to the angel of the church in Pergamos write; These things saith he which hath the sharp sword with two edges:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp terminating border; a margin; a brink; an extreme verge.",
                  "examples": [
                    "The cup is right on the edge of the table.",
                    "He is standing on the edge of a precipice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sharpness; readiness or fitness to cut; keenness; intenseness of desire.",
                  "examples": [
                    "Death and persecution lose all the ill that they can have, if we do not set an edge upon them by our fears and by our vices."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The border or part adjacent to the line of division; the beginning or early part (of a period of time)",
                  "examples": [
                    "in the edge of evening"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A shot where the ball comes off the edge of the bat, often unintentionally.",
                  "examples": [
                    "Finally another edge for 4, this time dropped by the keeper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A connected pair of vertices in a graph.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A level of sexual arousal that is maintained just short of reaching the point of inevitability, or climax.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, often attributive) The point of data production in an organization (the focus of edge computing), as opposed to the cloud.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "edge (third-person singular simple present edges, present participle edging, simple past and past participle edged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move an object slowly and carefully in a particular direction.",
                  "examples": [
                    "He edged the book across the table.",
                    "The muggers edged her into an alley and demanded money."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move slowly and carefully in a particular direction.",
                  "examples": [
                    "He edged away from her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the form 'just edge') To win by a small margin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, transitive) To hit the ball with an edge of the bat, causing a fine deflection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To trim the margin of a lawn where the grass meets the sidewalk, usually with an electric or gas-powered lawn edger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with an edge; to construct an edging.",
                  "examples": [
                    "If you're edging with stone, brick, or another material in a lawn area, set the upper surfaces of the edging just at or not more than ½ inch above ground level so it won't be an obstacle to lawn mowers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish with an edge, as a tool or weapon; to sharpen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To make sharp or keen; to incite; to exasperate; to goad; to urge or egg on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To delay one's orgasm so as to remain almost at the point of orgasm.",
                  "examples": [
                    "His mouth was open and he was still jerking his dick. Justin knew he must have been edging by then."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}