{
  "word": "mile",
  "etymologies": [
    {
      "description": [
        "From Middle English myle, mile, from Old English mīl, from Proto-West Germanic *mīliju, a borrowing of Latin mīlia, mīllia, plural of mīle, mīlle (“mile”) (literally ‘thousand’ but used as a short form of mīlle passūs (“a thousand paces”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mile (plural miles or (UK colloquial) mile)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The international mile: a unit of length precisely equal to 1.609344 kilometers established by treaty among Anglophone nations in 1959, divided into 5,280 feet or 1,760 yards.",
                  "examples": [
                    "Turn left in 1.2 miles.",
                    "You need to go about three mile down the road. (UK colloquial plural)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several customary units of length derived from the 1593 English statute mile of 8 furlongs, equivalent to 5,280 feet or 1,760 yards of various precise values.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of many customary units of length derived from the Roman mile (mille passus) of 8 stades or 5,000 Roman feet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The Scandinavian mile: a unit of length precisely equal to 10 kilometers defined in 1889.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of many customary units of length from other measurement systems of roughly similar values, as the Chinese (里) or Arabic mile (al-mīl).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(travel) An airline mile in a frequent flyer program.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Any similarly large distance.",
                  "examples": [
                    "The shot missed by a mile."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A race of 1 mile's length; a race of around 1 mile's length (usually 1500 or 1600 meters)",
                  "examples": [
                    "The runners competed in the mile."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) One mile per hour, as a measure of speed.",
                  "examples": [
                    "five miles over the speed limit"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}