{
  "word": "vary",
  "etymologies": [
    {
      "description": [
        "From Middle English varien, from Old French varier, from Latin variō (“to change, alter, make different”), from varius (“different, various”); see various."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vary (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) alteration; change.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vary (third-person singular simple present varies, present participle varying, simple past and past participle varied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To change with time or a similar parameter.",
                  "examples": [
                    "He varies his magic tricks so as to minimize the possibility that any given audience member will see the same trick twice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To institute a change in, from a current state; to modify.",
                  "examples": [
                    "You should vary your diet. Eating just bread will do you harm in the end."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Not to remain constant: to change with time or a similar parameter.",
                  "examples": [
                    "His mood varies by the hour.",
                    "The sine function varies between −1 and 1."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of the members of a group, intransitive) To display differences.",
                  "examples": [
                    "The sprouting tendency of potatoes varies between cultivars, years and places of growing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be or act different from the usual.",
                  "examples": [
                    "I'm not comfortable with 3.Nc3 in the Caro-Kann, so I decided to vary and play exd5."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make of different kinds; to make different from one another; to diversity; to variegate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To embellish; to change fancifully; to present under new aspects, as of form, key, measure, etc. See variation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To disagree; to be at variance or in dissension.",
                  "examples": [
                    "the rich jewel which we vary for"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}