{
  "word": "attitude",
  "etymologies": [
    {
      "description": [
        "From French attitude, from Italian attitudine (“attitude, aptness”), from Medieval Latin aptitūdō (“aptitude”) and actitūdō (“acting, posture”), from Latin aptō and actitō. Doublet of aptitude."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "attitude (countable and uncountable, plural attitudes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The position of the body or way of carrying oneself.",
                  "examples": [
                    "Synonyms: posture, stance",
                    "The ballet dancer walked with a graceful attitude."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Disposition or state of mind.",
                  "examples": [
                    "Don't give me your negative attitude.",
                    "You've got a nice attitude today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, UK, informal) Unpleasant behavior.",
                  "examples": [
                    "He doesn't take attitude from anybody.",
                    "I asked the waiter for a clean fork and all I got was attitude."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aeronautics, nautical, engineering) The orientation of a vehicle or other object relative to the horizon, direction of motion, other objects, etc.",
                  "examples": [
                    "Synonyms: trim, orientation",
                    "The airliner had to land with a nose-up attitude after the incident."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ballet) A position similar to arabesque, but with the raised leg bent at the knee.",
                  "examples": [
                    "Blasis was a man of many accomplishments. He invented the ballet position of attitude and codified the ballet technique of that time, distinguishing three types of dancers: the serious, the demi-caractère, and the comic dancer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "attitude (third-person singular simple present attitudes, present participle attituding, simple past and past participle attituded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To assume or to place in a particular position or orientation; to pose.",
                  "examples": [
                    "[…]  nymphs of quality, formed for the offices of love and of conversation, are attituded about her, each star set as it were in surrounding satellites of admirers; […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To express an attitude through one's posture, bearing, tone of voice, etc.",
                  "examples": [
                    "He attituded his way over to me, got up close, and just stood there looking at me, trying to appear threatening."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}