{
  "word": "goodwill",
  "etymologies": [
    {
      "description": [
        "From Middle English *goodwille, good wille (“goodwill”), perhaps from Old English *gōdwille (“goodwill”); compare Old English gōdwillende (“well-pleased”); also Scots guidwilly, guidwillie (“displaying goodwill”), equivalent to good +‎ will. Cognate with Scots guidwill (“goodwill”), Middle Low German gūtwille (“goodwill”), Old High German guotwilligi (“goodwill”), Old Danish godvilje (“goodwill”), Icelandic góðvilji, góðvili (“goodwill”), Icelandic góðvild (“goodness”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "goodwill (usually uncountable, plural goodwills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A favorably disposed attitude toward someone or something.",
                  "examples": [
                    "We will seek friendship and goodwill with the nations of the world — but we do so with the understanding that it is the right of all nations to put their own interests first."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(accounting) The value of a business entity not directly attributable to its tangible assets and liabilities. This value derives from factors such as consumer loyalty to the brand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) A concept used to refer to the ability of an individual or business to exert influence within a community, club, market or another type of group, without having to resort to the use of an asset (such as money or property), either directly or by the creation of a lien.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}