{
  "word": "trumpet",
  "etymologies": [
    {
      "description": [
        "From Middle English trumpet, trumpette, trompette (“trumpet”), from Old French trompette (“trumpet”), diminutive of trompe (“horn, trump, trumpet”), from Frankish *trumpa, *trumba (“trumpet”), ultimately imitative.",
        "Cognate with Old High German trumpa, trumba (“horn, trumpet”), Middle Dutch tromme (“drum”), Middle Low German trumme (“drum”), Old Norse trumba (“pipe; trumpet”). More at drum.",
        "Displaced native English beme, from Middle English beme, from Old English bīeme."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trumpet (plural trumpets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A musical instrument of the brass family, generally tuned to the key of B-flat; by extension, any type of lip-vibrated aerophone, most often valveless and not chromatic.",
                  "examples": [
                    "The royal herald sounded a trumpet to announce their arrival."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who plays the trumpet; a trumpeter.",
                  "examples": [
                    "The trumpets were assigned to stand at the rear of the orchestra pit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cry of an elephant, or any similar loud cry.",
                  "examples": [
                    "The large bull gave a basso trumpet as he charged the hunters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) One who praises, or propagates praise, or is the instrument of propagating it.",
                  "examples": [
                    "That great politician was pleased to have the greatest wit of those times  […]  to be the trumpet of his praises."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A funnel, or short flaring pipe, used as a guide or conductor, as for yarn in a knitting machine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of traffic interchange involving at least one loop ramp connecting traffic either entering or leaving the terminating expressway with the far lanes of the continuous highway.",
                  "examples": [
                    "The result of adopting the latter principle would be that even unimportant T-junctions would be in the form of trumpets or half-cloverleaf junctions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A powerful reed stop in organs, having a trumpet-like sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various flowering plants with trumpet-shaped flowers, for example, of the genus Collomia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, often capitalized) A supporter of Donald Trump, especially a fervent one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trumpet (third-person singular simple present trumpets, present participle trumpeting, simple past and past participle trumpeted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To sound loudly, be amplified",
                  "examples": [
                    "The music trumpeted from the speakers, hurting my ears."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To play the trumpet.",
                  "examples": [
                    "Cedric made a living trumpeting for the change of passersby in the subway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) Of an elephant, to make its cry.",
                  "examples": [
                    "The circus trainer cracked the whip, signaling the elephant to trumpet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To give a loud cry like that of an elephant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To proclaim loudly; to promote enthusiastically",
                  "examples": [
                    "Andy trumpeted Jane's secret across the school, much to her embarrassment."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}