{
  "word": "cloud",
  "etymologies": [
    {
      "description": [
        "From Middle English cloud, from Old English clūd (“mass of stone, rock, boulder, hill”), from Proto-Germanic *klūtaz, *klutaz (“lump, mass, conglomeration”), from Proto-Indo-European *gel- (“to ball up, clench”).",
        "Cognate with Scots clood, clud (“cloud”), Dutch kluit (“lump, mass, clod”), German Low German Kluut, Kluute (“lump, mass, ball”), German Kloß (“lump, ball, dumpling”), Danish klode (“sphere, orb, planet”), Swedish klot (“sphere, orb, ball, globe”), Icelandic klót (“knob on a sword's hilt”). Related to English clod, clot, clump, club. Largely replaced Middle English wolken, from Old English wolcn (whence Modern English welkin), the commonest Germanic word (compare Dutch wolk, German Wolke)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cloud (plural clouds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A rock; boulder; a hill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A visible mass of water droplets suspended in the air.",
                  "examples": [
                    "So this was my future home, I thought! […] Backed by towering hills, the but faintly discernible purple line of the French boundary off to the southwest, a sky of palest Gobelin flecked with fat, fleecy little clouds, it in truth looked a dear little city; the city of one's dreams."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any mass of dust, steam or smoke resembling such a mass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything which makes things foggy or gloomy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Anything unsubstantial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dark spot on a lighter material or background.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group or swarm, especially suspended above the ground or flying.",
                  "examples": [
                    "He opened the door and was greeted by a cloud of bats."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An elliptical shape or symbol whose outline is a series of semicircles, supposed to resemble a cloud.",
                  "examples": [
                    "The comic-book character's thoughts appeared in a cloud above his head."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A telecom network (from their representation in engineering drawings)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, with \"the\") The Internet, regarded as an abstract amorphous omnipresent space for processing and storage, the focus of cloud computing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A negative or foreboding aspect of something positive: see every cloud has a silver lining or every silver lining has a cloud.",
                  "examples": [
                    "But when he found that some of his interrogatories were evaded, and others answered undecisively, the look of gentleness which he had assumed, vanished, and his brow wore the cloud of disappointment and of anger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Crystal methamphetamine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large, loosely-knitted headscarf worn by women.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cloud (third-person singular simple present clouds, present participle clouding, simple past and past participle clouded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become foggy or gloomy, or obscured from sight.",
                  "examples": [
                    "The glass clouds when you breathe on it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To overspread or hide with a cloud or clouds.",
                  "examples": [
                    "The sky is clouded."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of the breath, to become cloud; to turn into mist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make obscure.",
                  "examples": [
                    "All this talk about human rights is clouding the real issue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make less acute or perceptive.",
                  "examples": [
                    "Your emotions are clouding your judgement.",
                    "The tears began to well up and cloud my vision."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make gloomy or sullen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To blacken; to sully; to stain; to tarnish (reputation or character).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark with, or darken in, veins or sports; to variegate with colors.",
                  "examples": [
                    "to cloud yarn"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become marked, darkened or variegated in this way.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}