{
  "word": "colonel",
  "etymologies": [
    {
      "description": [
        "First attested 1548, from Middle French coronnel, from Old Italian colonnello (“the officer of a small company of soldiers (column) that marched at the head of a regiment”), from compagnia colonnella (“little column company”), from Latin columna (“pillar”), originally a collateral form of columen, contraction culmen (“a pillar, top, crown, summit”), o-grade form from a Proto-Indo-European *kelH- (“to rise, be elevated, be prominent”). See hill, holm."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "colonel (plural colonels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A commissioned officer in an armed military organization, typically the highest rank before flag officer ranks (generals). It is generally found in armies, air forces or naval infantry (marines).",
                  "examples": [
                    "The colonel and his sponsor made a queer contrast: Greystone long and stringy, with a face that seemed as if a cold wind was eternally playing on it. […] But there was not a more lascivious reprobate and gourmand in all London than this same Greystone."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "colonel (third-person singular simple present colonels, present participle coloneling or colonelling, simple past and past participle coloneled or colonelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act as or like a colonel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}