{
  "word": "bubble",
  "etymologies": [
    {
      "description": [
        "Partly imitative, also influenced by burble. Compare Middle Dutch bobbe (“bubble”) > Dutch bubbel (“bubble”), Low German bubbel (“bubble”), Danish boble (“bubble”), Swedish bubbla (“bubble”). The word was first used in its economic sense in association with the collapse of the South Sea Company in 1720, based on the metaphor of an inflated soap bubble bursting."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bubble (plural bubbles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spherically contained volume of air or other gas, especially one made from soapy liquid.",
                  "examples": [
                    "Synonym: (obsolete) bull",
                    "Antonym: antibubble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small spherical cavity in a solid material.",
                  "examples": [
                    "bubbles in window glass, or in a lens"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Anything resembling a hollow sphere.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Anything lacking firmness or solidity; a cheat or fraud; an empty project.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics) A period of intense speculation in a market, causing prices to rise quickly to irrational levels as the metaphorical bubble expands, and then fall even more quickly as the bubble bursts.",
                  "examples": [
                    "real estate bubble",
                    "dot-com bubble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) The emotional and/or physical atmosphere in which the subject is immersed.",
                  "examples": [
                    "Synonyms: circumstances, ambience",
                    "Hyponym: filter bubble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An officer's station in a prison dormitory, affording views on all sides.",
                  "examples": [
                    "Later that day, the unit was staffed with only one officer, who was required to stay in the bubble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Someone who has been ‘bubbled’ or fooled; a dupe.",
                  "examples": [
                    "Gany's a cheat, and I'm a bubble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, hollow, floating bead or globe, formerly used for testing the strength of spirits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The globule of air in the chamber of a spirit level.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cockney rhyming slang) A laugh.",
                  "examples": [
                    "Synonyms: giraffe, bubble bath",
                    "Are you having a bubble?!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cockney rhyming slang) A Greek.",
                  "examples": [
                    "Synonym: bubble and squeak"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, historical) Any of the small magnetized areas that make up bubble memory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) The point in a poker tournament when the last player without a prize loses all their chips and leaves the game, leaving only players that are going to win prizes. (e.g., if the last remaining 9 players win prizes, then the point when the 10th player leaves the tournament)",
                  "examples": [
                    "Many players tend to play timidly (not play many hands) around the bubble, to keep their chips and last longer in the game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people who are in quarantine together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for travel bubble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, slang) A bulb or lamp; the part of a lighting assembly that actually produces the light.",
                  "examples": [
                    "A bare lamp (bulb, globe, 'bubble') radiates light in all directions."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bubble (third-person singular simple present bubbles, present participle bubbling, simple past and past participle bubbled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce bubbles, to rise up in bubbles (such as in foods cooking or liquids boiling).",
                  "examples": [
                    "The laminate is bubbling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To churn or foment, as if wishing to rise to the surface.",
                  "examples": [
                    "Rage bubbled inside him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To rise through a medium or system, similar to the way that bubbles rise in liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To cheat, delude.",
                  "examples": [
                    "No, no, friend, I shall never be bubbled out of my religion in hopes only of keeping my place under another government  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Scotland and Northern England) To cry, weep.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pat a baby on the back so as to cause it to belch.",
                  "examples": [
                    "Groggily her mind went back through the long hours to 10 P.M. She had fed Junior, bubbled him, diped him—according to plan."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to feel as if bubbling or churning.",
                  "examples": [
                    "It seemed to Adam that he felt the blood in his toes creeping up his legs and body until it reached his brain where, finding it could go no farther, it bubbled him into dumbness: it added to his confusion to know that he looked as if some such accident had befallen his circulation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To express in a bubbly or lively manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form into a protruding round shape.",
                  "examples": [
                    "She bubbled her lips at Junior and wrinkled her eyes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with bubbles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bubble in; to mark a response on a form by filling in a circular area (‘bubble’).",
                  "examples": [
                    "You don’t want to go back and forth between the test booklet and your answer sheet to bubble your answers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) To apply a filter bubble, as to search results.",
                  "examples": [
                    "Please don't bubble me; just give me the stories I need to hear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To join together in a support bubble",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}