{
  "word": "body",
  "etymologies": [
    {
      "description": [
        "From Middle English bodi, bodiȝ, from Old English bodiġ (“body, trunk, chest, torso, height, stature”), from Proto-West Germanic *bodag (“body, trunk”), from Proto-Indo-European *bʰewdʰ- (“to be awake, observe”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "body (countable and uncountable, plural bodies)",
          "definitionGroups": [
            {
              "group": "Physical frame.",
              "entries": [
                {
                  "meaning": "The physical structure of a human or animal seen as one single organism. [from 9th c.]",
                  "examples": [
                    "I saw them walking from a distance, their bodies strangely angular in the dawn light."
                  ]
                },
                {
                  "meaning": "The fleshly or corporeal nature of a human, as opposed to the spirit or soul. [from 13th c.]",
                  "examples": [
                    "The body is driven by desires, but the soul is at peace."
                  ]
                },
                {
                  "meaning": "A corpse. [from 13th c.]",
                  "examples": [
                    "Her body was found at four o'clock, just two hours after the murder."
                  ]
                },
                {
                  "meaning": "(archaic or informal except in compounds) A person. [from 13th c.]",
                  "examples": [
                    "Indeed, if it belonged to a poor body, it would be another thing; but so great a lady, to be sure, can never want it  […]"
                  ]
                },
                {
                  "meaning": "(sociology) A human being, regarded as marginalized or oppressed.",
                  "examples": [
                    "This, of course, was not about the State, but it was certainly an invasion: black bodies acting out in a public domain circumscribed by a racist culture. The Garvey movement presents an example of black bodies transgressing racialized spatial boundaries."
                  ]
                }
              ]
            },
            {
              "group": "Main section.",
              "entries": [
                {
                  "meaning": "The torso, the main structure of a human or animal frame excluding the extremities (limbs, head, tail). [from 9th c.]",
                  "examples": [
                    "The boxer took a blow to the body."
                  ]
                },
                {
                  "meaning": "The largest or most important part of anything, as distinct from its appendages or accessories. [from 11th c.]",
                  "examples": [
                    "The bumpers and front tyres were ruined, but the body of the car was in remarkable shape."
                  ]
                },
                {
                  "meaning": "(archaic) The section of a dress extending from the neck to the waist, excluding the arms. [from 16th c.]",
                  "examples": [
                    "Penny was in the scullery, pressing the body of her new dress."
                  ]
                },
                {
                  "meaning": "The content of a letter, message, or other printed or electronic document, as distinct from signatures, salutations, headers, and so on. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "A bodysuit. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(programming) The code of a subroutine, contrasted to its signature and parameters. [from 20th c.]",
                  "examples": [
                    "In many programming languages, the method body is enclosed in braces."
                  ]
                }
              ]
            },
            {
              "group": "Coherent group.",
              "entries": [
                {
                  "meaning": "A group of people having a common purpose or opinion; a mass. [from 16th c.]",
                  "examples": [
                    "I was escorted from the building by a body of armed security guards."
                  ]
                },
                {
                  "meaning": "An organisation, company or other authoritative group. [from 17th c.]",
                  "examples": [
                    "The local train operating company is the managing body for this section of track."
                  ]
                },
                {
                  "meaning": "A unified collection of details, knowledge or information. [from 17th c.]",
                  "examples": [
                    "We have now amassed a body of evidence which points to one conclusion."
                  ]
                }
              ]
            },
            {
              "group": "Material entity.",
              "entries": [
                {
                  "meaning": "Any physical object or material thing. [from 14th c.]",
                  "examples": [
                    "All bodies are held together by internal forces."
                  ]
                },
                {
                  "meaning": "(uncountable) Substance; physical presence. [from 17th c.]",
                  "examples": [
                    "We have given body to what was just a vague idea."
                  ]
                },
                {
                  "meaning": "(uncountable) Comparative viscosity, solidity or substance (in wine, colours etc.). [from 17th c.]",
                  "examples": [
                    "The red wine, sadly, lacked body."
                  ]
                },
                {
                  "meaning": "An agglomeration of some substance, especially one that would be otherwise uncountable.",
                  "examples": [
                    "In a gentle breeze, the whole body of air, as far as the breeze extends, moves at the rate of seven or eight miles an hour; in a high wind, at the rate of seventy, eighty, or an hundred miles an hour  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) The shank of a type, or the depth of the shank (by which the size is indicated).",
                  "examples": [
                    "a nonpareil face on an agate body"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A three-dimensional object, such as a cube or cone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "body (third-person singular simple present bodies, present participle bodying, simple past and past participle bodied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give body or shape to something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To construct the bodywork of a car.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To embody.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, African-American Vernacular) To murder someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, African-American Vernacular, by extension) To utterly defeat someone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, video games) to hard counter a particular character build or play style.  Frequently used in the passive voice form, get bodied by.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}