{
  "word": "jowl",
  "etymologies": [
    {
      "description": [
        "From Middle English chawl, chavel (“cheek, jaw”), from Old English ċeafl, from Proto-West Germanic *kafl."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jowl (plural jowls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "the jaw, jawbone; especially one of the lateral parts of the mandible.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jowl (third-person singular simple present jowls, present participle jowling, simple past and past participle jowled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To throw, dash, or knock.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English cholle (“wattle, jowl”), from Old English ċeole, ċeolu (“throat”), from Proto-Germanic *kelǭ (“gullet”) (compare West Frisian kiel, Dutch keel, German Kehle), from Proto-Indo-European *gʷelu- (“to swallow”) (compare Old Irish in·gilid (“to graze”), Irish goile (“stomach”), Latin gula (“throat”), gluttiō (“to swallow”), Russian глота́ть (glotátʹ, “to swallow, gulp”), Ancient Greek δέλεαρ (délear, “lure”), Armenian կլանել (klanel, “I swallow”), Persian گلو‎ (galu), Hindi गला (galā, “neck, throat”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jowl (plural jowls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a fold of fatty flesh under the chin, around the cheeks, or lower jaw (as a dewlap, wattle, crop, or double chin).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "the cheek; especially the cheek meat of a hog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "cut of fish including the head and adjacent parts",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}