{
  "word": "lever",
  "etymologies": [
    {
      "description": [
        "From Middle English lever, levore, levour, from Old French leveor, leveur (“a lifter, lever (also Old French and French levier)”), from Latin levātor (“a lifter”), from levō (“to raise”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lever (plural levers)",
          "definitionGroups": [
            {
              "group": "(mechanics) A rigid piece which is capable of turning about one point, or axis (the fulcrum), and in which are two or more other points where forces are applied; — used for transmitting and modifying force and motion.",
              "entries": [
                {
                  "meaning": "Specifically, a bar of metal, wood or other rigid substance, used to exert a pressure, or sustain a weight, at one point of its length, by receiving a force or power at a second, and turning at a third on a fixed point called a fulcrum. It is usually named as the first of the six mechanical powers, and is of three kinds, according as either the fulcrum F, the weight W, or the power P, respectively, is situated between the other two, as in the figures.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small such piece to trigger or control a mechanical device (like a button).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanics) A bar, as a capstan bar, applied to a rotatory piece to turn it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanics) An arm on a rock shaft, to give motion to the shaft or to obtain motion from it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, except in generalized senses below) A crowbar.",
                  "examples": [
                    "My lord, I brained him with a lever my neighbour lent me, and he stood by and cried, ‘Strike home, old boy!’"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lever (third-person singular simple present levers, present participle levering, simple past and past participle levered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move with a lever.",
                  "examples": [
                    "With great effort and a big crowbar I managed to lever the beam off the floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, transitive) To use, operate or move (something) like a lever (physically).",
                  "examples": [
                    "Suddenly he had levered himself up from the sofa, rocking the lame man violently, and was walking towards the receptionist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, transitive) To use (something) like a lever (in an abstract sense).",
                  "examples": [
                    "He was a man who levered his way from small-time communist hack to political power by tapping into the most potent vein of historical juice in the Balkans: nationalism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, finance) To increase the share of debt in the capitalization of a business.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lever, comparative of leve, leef (“dear, beloved, lief”), equivalent to lief +‎ -er. Related to German lieber (“rather”)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "lever (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Rather.",
                  "examples": [
                    "for I had lever be without ye / Then have suche besines about ye"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French lever."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lever (plural levers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A levee.",
                  "examples": [
                    "We do not appear at Phœbus's Levér."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}