{
  "word": "lounge",
  "etymologies": [
    {
      "description": [
        "Origin uncertain. Perhaps from French s'allonger (“to lie down”). Compare French longer (“to walk along”). Compare also German lungern (“to hang or lounge around, linger”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lounge (plural lounges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A place where one can lounge; an area, establishment, house etc. where loungers gather and where one can relax and be at ease.",
                  "examples": [
                    "He  […]  prevailed on Captain Musgrave to introduce him to a family, where he supposed he might find a monstrous good lounge for the rest of the time he was to be quartered in the neighbourhood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of someone who lounges; idle reclining.",
                  "examples": [
                    "That is, he devoted his waking hours to lounges among the habitués of Chestnut-street, and lollings in an arm-chair of 'Squire Coke in Walnut-street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) The living room or sitting room of a house.",
                  "examples": [
                    "The lounge was furnished in old English oak and big Knole settees. There were rugs from Tabriz and Kerman on the highly polished floor.  […]  A table lamp was fashioned from a silver Egyptian hookah."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large comfortable seat for two or three people or more, a sofa or couch; also called lounge chair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A waiting room in an office, airport etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An establishment, similar to a bar, that serves alcohol and often plays background music or shows television.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lounge (third-person singular simple present lounges, present participle lounging, simple past and past participle lounged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To relax; to spend time lazily; to stand, sit, or recline, in an indolent manner.",
                  "examples": [
                    "We like to spend our Sundays lounging about at home in our pyjamas."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}