{
  "word": "bowser",
  "etymologies": [
    {
      "description": [
        "From Bowser (“a surname”), after Sylvanus Bowser, US inventor of the first fuel pump; also a trade name of SF Bowser inc., the inventor's company."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bowser (plural bowsers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly Australia and New Zealand) A fuel metering/delivery pump at a filling station.",
                  "examples": [
                    "The Moree Municipal Council decided to devote the revenue derived from the rent of the bowser petrol pumps within the municipality for this year, which amounted to forty guineas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A road vehicle (often a trailer) for the transport of liquid fuel, particularly aviation fuel at an airfield.",
                  "examples": [
                    "The bowsers then go out to the aircraft and supply them with petrol."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A mobile water tank deployed to distribute fresh water in emergency situations where the normal system of piped distribution has broken down or is insufficient.",
                  "examples": [
                    "Mr. Deputy Speaker, Sir, as hon. Shidie has said, there is no water bowser in Garissa and he categorically said that there is a water bowser to supply water to the people of Kulan. Could he give the registration number of this water bowser which is supplying water to the people of Kulan?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, slang, used in the vocative) A buffoon or imbecile.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}