{
  "word": "haunt",
  "etymologies": [
    {
      "description": [
        "From Middle English haunten (“to reside, inhabit, use, employ”), from Old French hanter (“to inhabit, frequent, resort to”), from Old Northern French hanter (“to go back home, frequent”), from Old Norse heimta (“to bring home, fetch”) or/and from Old English hāmettan (“to bring home; house; cohabit with”); both from Proto-Germanic *haimatjaną (“to house, bring home”), from Proto-Germanic *haimaz (“village, home”), from Proto-Indo-European *ḱóymos (“village”).",
        "Cognate with Old English hāmettan (“to provide housing to, bring home”); related to Old English hām (“home, village”), Old French hantin (“a stay, a place frequented by”) from the same Germanic source. Another descendant from the French is Dutch hanteren, whence German hantieren, Swedish hantera, Danish håndtere. More at home."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "haunt (plural haunts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place at which one is regularly found; a habitation or hangout.",
                  "examples": [
                    "The shopping mall is a popular haunt of the local teenagers in this town.",
                    "I went back the town I used to live and visited all my old haunts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) A ghost.",
                  "examples": [
                    "Synonym: haint"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lair or feeding place of animals.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "haunt (third-person singular simple present haunts, present participle haunting, simple past and past participle haunted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To inhabit or to visit frequently (most often used in reference to ghosts).",
                  "examples": [
                    "A couple of ghosts haunt the old, burnt-down house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make uneasy, restless.",
                  "examples": [
                    "The memory of his past failures haunted him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stalk; to follow.",
                  "examples": [
                    "The policeman haunted him, following him everywhere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now rare) To live habitually; to stay, to remain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To accustom; habituate; make accustomed to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To practise; to devote oneself to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To persist in staying or visiting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}