{
  "word": "sprightly",
  "etymologies": [
    {
      "description": [
        "From spright +‎ -ly (suffix forming adjectives with the sense ‘behaving like, having the nature of’). Spright is an obsolete variant of sprite (“a shade, spirit; elf, fairy, goblin; apparition, ghost”), from Middle English sprit (“principle of life; soul, especially at the point of death; immaterial being (angel, demon, apparition, ghost, etc.); divine inspiration; Holy Spirit; the mind, intellect, reason; mental faculties, senses; power of prophecy; character, disposition; courage, resolution; mood, state of mind; human will; breath; (alchemy) volatile substance”) [and other forms], from Anglo-Norman esprite, esprit and Middle French esprit, variants of Anglo-Norman, Middle French, Old French espirit, esperit (“spirit”), from Latin spīritus (“air; breath; breathing; ghost, spirit”), from spīrō (“to breathe; to breathe out, exhale”) (from Proto-Indo-European *(s)peys- (“to blow; to breathe”)) + -tus (“suffix forming verbal nouns from verbs”)."
      ],
      "adjectives": [
        {
          "description": "sprightly (comparative sprightlier, superlative sprightliest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Animated, gay, or vivacious; lively, spirited.",
                  "examples": [
                    "Synonyms: energetic, high-spirited, (chiefly Australia, US) spright",
                    "Antonym: melancholy"
                  ]
                }
              ]
            },
            {
              "group": "Of a person: full of life and vigour, especially with a light and springy step.",
              "entries": [
                {
                  "meaning": "Especially of an older person: energetic and in good health; spry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) Of or relating to a sprite; ghostly, spectral.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From spright +‎ -ly (suffix forming adverbs from adjectives).; see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "sprightly (comparative sprightlier, superlative sprightliest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a lively and vigorous way; sprightlily.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}