{
  "word": "strip",
  "etymologies": [
    {
      "description": [
        "From alteration of stripe or from Middle Low German strippe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "strip (chiefly countable, plural strips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A long, thin piece of land; any long, thin area.",
                  "examples": [
                    "The countries were in dispute over the ownership of a strip of desert about 100 metres wide."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually countable, sometimes uncountable) A long, thin piece of any material; any such material collectively.",
                  "examples": [
                    "Papier mache is made from strips of paper.",
                    "Squeeze a strip of glue along the edge and then press down firmly.",
                    "I have some strip left over after fitting out the kitchen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A comic strip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A landing strip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strip steak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A street with multiple shopping or entertainment possibilities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) The playing area, roughly 14 meters by 2 meters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, soccer) The uniform of a football team, or the same worn by supporters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A trough for washing ore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The issuing of a projectile from a rifled gun without acquiring the spiral motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A television series aired at the same time daily (or at least on Mondays to Fridays), so that it appears as a strip straight across the weekly schedule.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) An investment strategy involving simultaneous trade with one call and two put options on the same security at the same strike price, similar to but more bearish than a straddle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English strepen, strippen, from Old English strīepan (“plunder”), from Proto-Germanic *strēpōną, from Proto-Indo-European *(s)ter(h₁)- (“to be stiff; be rigid; exert”). Probably related to German Strafe (“deprivation, fine, punishment”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "strip (plural strips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of removing one's clothes; a striptease.",
                  "examples": [
                    "She stood up on the table and did a strip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributively, of games) Denotes a version of a game in which losing players must progressively remove their clothes.",
                  "examples": [
                    "strip poker; strip Scrabble"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "strip (third-person singular simple present strips, present participle stripping, simple past and past participle stripped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove or take away, often in strips or stripes.",
                  "examples": [
                    "Norm will strip the old varnish before painting the chair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually intransitive) To take off clothing.",
                  "examples": [
                    "Seeing that no one else was about, he stripped and dived into the river."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To perform a striptease.",
                  "examples": [
                    "In the seedy club, a group of drunken men were watching a woman stripping."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take away something from (someone or something); to plunder; to divest.",
                  "examples": [
                    "The athlete was stripped of his medal after failing a drugs test.",
                    "They had stripped the forest bare, with not a tree left standing.",
                    "Don't park your car here overnight, otherwise it will be stripped by morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove cargo from (a container).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove (the thread or teeth) from a screw, nut, or gear, especially inadvertently by overtightening.",
                  "examples": [
                    "Don't tighten that bolt any more or you'll strip the thread.",
                    "The screw is stripped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fail in the thread; to lose the thread, as a bolt, screw, or nut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fire (a bullet or ball) from a rifle such that it fails to pick up a spin from the rifling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fail to pick up a spin from the grooves in a rifle barrel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove color from hair, cloth, etc. to prepare it to receive new color.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, bridge) To remove all cards of a particular suit from another player. (See also strip-squeeze.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To empty (tubing) by applying pressure to the outside of (the tubing) and moving that pressure along (the tubing).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To milk a cow, especially by stroking and compressing the teats to draw out the last of the milk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To press out the ripe roe or milt from fishes, for artificial fecundation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, transitive) To run a television series at the same time daily (or at least on Mondays to Fridays), so that it appears as a strip straight across the weekly schedule.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, agriculture) To pare off the surface of (land) in strips.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove the overlying earth from (a deposit).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To pass; to get clear of; to outstrip.",
                  "examples": [
                    "when first they stripp'd the Malean promontory"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the insulation from a wire/cable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the metal coating from (a plated article), as by acids or electrolytic action.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove fibre, flock, or lint from; said of the teeth of a card when it becomes partly clogged.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pick the cured leaves from the stalks of (tobacco) and tie them into \"hands\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the midrib from (tobacco leaves).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}