{
  "word": "priest",
  "etymologies": [
    {
      "description": [
        "From Middle English prest, preest, from Old English prēost (“priest”), from Late Latin presbyter, from Ancient Greek πρεσβύτερος (presbúteros), from πρέσβυς (présbus, “elder, older”). Reinforced in Middle English by Old French prestre, also from Latin presbyter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "priest (plural priests, feminine priestess)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a religious clergyman (clergywoman, clergyperson) who is trained to perform services or sacrifices at a church or temple",
                  "examples": [
                    "The priest at the Catholic church heard his confession.",
                    "The Shinto priest burnt incense for his ancestors.",
                    "The Israelite priests were descended from Moses' brother Aaron."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a blunt tool, used for quickly stunning and killing fish",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Mormonism) the highest office in the Aaronic priesthood",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "priest (third-person singular simple present priests, present participle priesting, simple past and past participle priested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ordain as a priest.",
                  "examples": [
                    "If there bee any lasie fellow, any that cannot away with worke, any that would wallow in pleasures, hee is hastie to be priested. And when hee is made one, and has gotten a benefice, he consorts with his neighbour priests, who are altogether given to pleasures; and then both hee, and they, live, not like Christians, but like epicures; drinking, eating, feasting, and revelling, till the cow come home, as the saying is."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}