{
  "word": "bustle",
  "etymologies": [
    {
      "description": [
        "From Middle English bustlen, bustelen, bostlen, perhaps an alteration of *busklen (> Modern English buskle), a frequentative of Middle English busken (“to prepare; make ready”), from Old Norse búask (“to prepare oneself”); or alternatively from a frequentative form of Middle English busten, bisten (“to buffet; pummel; dash; beat”)  +‎ -le. Compare also Icelandic bustla (“to splash; bustle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bustle (countable and uncountable, plural bustles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) An excited activity; a stir.",
                  "examples": [
                    "we are, perhaps, all the while flattering our natural indolence, which, hating the bustle of the world, and drudgery of business seeks a pretence of reason to give itself a full and uncontrolled indulgence"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, countable) A cover to protect and hide the back panel of a computer or other office machine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, countable) A frame worn underneath a woman's skirt, typically only protruding from the rear as opposed to the earlier more circular hoops.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bustle (third-person singular simple present bustles, present participle bustling, simple past and past participle bustled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move busily and energetically with fussiness (often followed by about).",
                  "examples": [
                    "The commuters bustled about inside the train station."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To teem or abound (usually followed by with); to exhibit an energetic and active abundance (of a thing).",
                  "examples": [
                    "The train station was bustling with commuters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To push around, to importune.",
                  "examples": [
                    "Don’t bustle her or fuss or snatch: / A suitor looking at his watch / Is not a posture that persuades / Willing, much less reluctant maids."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}