{
  "word": "permit",
  "etymologies": [
    {
      "description": [
        "From Middle English permitten, borrowed from Middle French permettre, from Latin permittō (“give up, allow”), from per (“through”) + mittō (“send”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "permit (plural permits)",
          "definitionGroups": [
            {
              "group": "An artifact or document rendering something allowed or legal. [from 17th c.]",
              "entries": [
                {
                  "meaning": "A learner's permit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Formal permission. [16th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "permit (third-person singular simple present permits, present participle permitting, simple past and past participle permitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow (something) to happen, to give permission for. [from 15th c.]",
                  "examples": [
                    "Last week the decision on two points was conclusive: the Presbyterian Church in the U. S. A. will not permit ordination of women as ministers, but will permit their election as ruling elders, permission which makes possible a woman as moderator."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow (someone) to do something; to give permission to. [from 15th c.]",
                  "examples": [
                    "He was ultimately cleared, but during that period, Mr. Ackman said, his lawyers would not permit him to defend himself publicly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To allow for, to make something possible. [from 16th c.]",
                  "examples": [
                    "What was left to say? Quite a lot, if only parliamentary time permitted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To allow, to admit (of). [from 18th c.]",
                  "examples": [
                    "\"As an instrument of economic policy, incantation does not permit of minor doubts or scruples.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, pronounced like noun) To grant formal authorization for (something).",
                  "examples": [
                    "The Building Department permitted that project last week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, pronounced like noun) To attempt to obtain or succeed in obtaining formal authorization for (something).",
                  "examples": [
                    "We've been busy permitting the State Street development."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic, rare) To hand over, resign (something to someone). [from 15th c.]",
                  "examples": [
                    "Let us not aggravate our sorrows, / But to the gods permit the event of things."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "An irregular borrowing from Spanish palometa, probably from a Doric variant of Ancient Greek πηλαμύς (pēlamús, “young tuna”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "permit (plural permit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pompano of the species Trachinotus falcatus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}