{
  "word": "epicentre",
  "etymologies": [
    {
      "description": [
        "epi- (“over, on top”) +‎ centre, from Ancient Greek ἐπί (epí, “on”) + κέντρον (kéntron, “centre”).",
        "Sense of “center of an activity (particularly a disaster)” (1908) by generalization from earthquakes, possibly influenced by epidemic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "epicentre (plural epicentres)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(seismology) The point on the land or water surface directly above the focus, or hypocentre, of an earthquake.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The point on the surface of the earth directly above an underground explosion.",
                  "examples": [
                    "Synonym: ground zero"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, proscribed) The focal point of any activity, especially if dangerous or destructive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, proscribed) The geographical area in which an ongoing disaster, illness, crisis, or other destructive event is currently most severe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "epicentre (third-person singular simple present epicentres, present participle epicentring, simple past and past participle epicentred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of an earthquake: to have its epicentre (at a specified location).",
                  "examples": [
                    "The records of disturbances epicentering closer to the station, notably those of 1914 in Los Santos Province of the Republic of Panama, about 120 miles from Balboa Heights, have usually been less satisfactory than this record  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}