{
  "word": "sluice",
  "etymologies": [
    {
      "description": [
        "From Middle English sluse, alteration of scluse, from Anglo-Norman escluse (“sluice, floodgate”), from Late Latin exclusa (“extrusion, gate”), from Latin exclūsus, form of exclūdō (“I shut out, I exclude”) (English exclude). Cognate to Dutch sluis."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sluice (plural sluices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artificial passage for water, fitted with a valve or gate, for example in a canal lock or a mill stream, for stopping or regulating the flow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A water gate or floodgate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hence, an opening or channel through which anything flows; a source of supply.",
                  "examples": [
                    "Each sluice of affluent fortune open'd soon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The stream flowing through a floodgate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A long box or trough through which water flows, used for washing auriferous earth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) An instance of wh-stranding ellipsis, or sluicing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sluice (third-person singular simple present sluices, present participle sluicing, simple past and past participle sluiced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To emit by, or as by, flood gates.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wet copiously, as by opening a sluice",
                  "examples": [
                    "Nine - mile Creek has been dug out again and again , and has been sluiced three times"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wash with, or in, a stream of water running through a sluice.",
                  "examples": [
                    "to sluice earth or gold dust in a sluice box in placer mining"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, more generally) To wash (down or out).",
                  "examples": [
                    "And now men with a hose have come and are sluicing out the streets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To flow, pour.",
                  "examples": [
                    "In the trough behind the white wave / Helen shook her dark head, the water sluiced from her shoulders / And rose-tipped breasts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) To elide the complement in a coordinated wh-question. See sluicing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}