{
  "word": "evolution",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin ēvolūtiō, ēvolūtiōnis (“the act of unrolling, unfolding or opening (of a book)”), from ēvolūtus, perfect passive participle of ēvolvō (“unroll, unfold”), from ex + volvō (“roll”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "evolution (countable and uncountable, plural evolutions)",
          "definitionGroups": [
            {
              "group": "A change of position.",
              "entries": [
                {
                  "meaning": "(military) A manoeuvre of troops or ships. [from 17th c.]",
                  "examples": [
                    "Major Holroyd, who acted as the General, was extremely polite, and attentive, and came to us between every evolution, to explain and talk over the manoeuvres."
                  ]
                },
                {
                  "meaning": "(chiefly dance, sports) A turning movement, especially of the body. [from 17th c.]",
                  "examples": [
                    "It was a critical instant: the pirouette -- it would fail, she feared. … the rapid whirl achieved in exact time, the whole evolution executed to perfection."
                  ]
                },
                {
                  "meaning": "(obsolete) A turned or twisted shape; an involution, a complex or intricate shape. [18th c.]",
                  "examples": [
                    "‘It is not in the showy evolutions of buildings, but in the multiplicity of human habitations which are crouded together, that the wonderful immensity of London consists.’"
                  ]
                }
              ]
            },
            {
              "group": "An unfolding.",
              "entries": [
                {
                  "meaning": "(now rare) The act or process of unfolding or opening out; the progression of events in regular succession. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(geometry) The opening out of a curve; now more generally, the gradual transformation of a curve by a change of the conditions generating it. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(mathematics, now chiefly historical) The extraction of a root from a given power. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(chemistry) The act or an instance of giving off gas; emission. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "Process of development.",
              "entries": [
                {
                  "meaning": "Development; the act or result of developing what was implicit in an idea, argument etc. [from 17th c.]",
                  "examples": [
                    "The ongoing evolution of Lolita subculture fashion includes, among other things, the ballet style."
                  ]
                },
                {
                  "meaning": "A process of gradual change in a given system, subject, product etc., especially from simpler to more complex forms. [from 18th c.]",
                  "examples": [
                    "Among other forms of change, the evolution of transportation has involved modification, diversification, convergence, divergence, hybridization, differentiation, and naturally, selection."
                  ]
                },
                {
                  "meaning": "(biology) The transformation of animals, plants and other living things into different forms (now understood as a change in genetic composition) by the accumulation of changes over successive generations. [from 19th c.]",
                  "examples": [
                    "[Some books have] made the erroneous assumption that the important thing in evolution is the good of the species (or the group) rather than the good of the individual (or the gene)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}