{
  "word": "wear",
  "etymologies": [
    {
      "description": [
        "From Middle English weren, werien, from Old English werian (“to clothe, cover over; put on, wear, use; stock (land)”), from Proto-West Germanic *waʀjan, from Proto-Germanic *wazjaną (“to clothe”), from Proto-Indo-European *wes- (“to dress, put on (clothes)”).",
        "Cognate to Sanskrit वस्ते (váste), Ancient Greek ἕννυμι (hénnumi, “put on”), Latin vestis (“garment”) (English vest), Albanian vesh (“dress up, wear”), Tocharian B wäs-, Old Armenian զգենում (zgenum), Welsh gwisgo, Hittite 𒉿𒀸- (waš-)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wear (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) (in combination) clothing",
                  "examples": [
                    "footwear; outdoor wear; maternity wear"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) damage to the appearance and/or strength of an item caused by use over time",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) fashion",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wear (third-person singular simple present wears, present participle wearing, simple past wore, past participle worn or (now colloquial and nonstandard) wore or (obsolete) worne)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To carry or have equipped on or about one's body, as an item of clothing, equipment, decoration, etc.",
                  "examples": [
                    "He's wearing some nice pants today.  She wore her medals with pride.  Please wear your seatbelt.  Can you wear makeup and sunscreen at the same time?  He was wearing his lunch after tripping and falling into the buffet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have or carry on one's person habitually, consistently; or, to maintain in a particular fashion or manner.",
                  "examples": [
                    "He wears eyeglasses.  She wears her hair in braids."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bear or display in one's aspect or appearance.",
                  "examples": [
                    "She wore a smile all day.  He walked out of the courtroom wearing an air of satisfaction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, with \"it\") To overcome one's reluctance and endure a (previously specified) situation.",
                  "examples": [
                    "I know you don't like working with him, but you'll just have to wear it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To eat away at, erode, diminish, or consume gradually; to cause a gradual deterioration in; to produce (some change) through attrition, exposure, or constant use.",
                  "examples": [
                    "You're going to wear a hole in the bottom of those shoes.  The water has slowly worn a channel into these rocks.  Long illness had worn the bloom from her cheeks.  Exile had worn the man to a shadow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative) To undergo gradual deterioration; become impaired; be reduced or consumed gradually due to any continued process, activity, or use.",
                  "examples": [
                    "The tiles were wearing thin due to years of children's feet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To exhaust, fatigue, expend, or weary.",
                  "examples": [
                    "His neverending criticism has finally worn my patience.  Toil and care soon wear the spirit.  Our physical advantage allowed us to wear the other team out and win."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To last or remain durable under hard use or over time; to retain usefulness, value, or desirable qualities under any continued strain or long period of time; sometimes said of a person, regarding the quality of being easy or difficult to tolerate.",
                  "examples": [
                    "Don't worry, this fabric will wear. These pants will last you for years.  This color wears so well. I must have washed this sweater a thousand times.  I have to say, our friendship has worn pretty well.  It's hard to get to know him, but he wears well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial) (in the phrase \"wearing on (someone)\") To cause annoyance, irritation, fatigue, or weariness near the point of an exhaustion of patience.",
                  "examples": [
                    "Her high pitched voice is really wearing on me lately."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of time) To pass slowly, gradually or tediously.",
                  "examples": [
                    "wear on, wear away.  As the years wore on, we seemed to have less and less in common."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To bring (a sailing vessel) onto the other tack by bringing the wind around the stern (as opposed to tacking when the wind is brought around the bow); to come round on another tack by turning away from the wind. Also written \"ware\". Past: weared, or wore/worn.",
                  "examples": [
                    "Synonym: gybe"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English weren, werien, from Old English werian (“to guard, keep, defend; ward off, hinder, prevent, forbid; restrain; occupy, inhabit; dam up; discharge obligations on (land)”), from Proto-West Germanic *warjan, from Proto-Germanic *warjaną (“to defend, protect, ward off”), from Proto-Indo-European *wer- (“to close, cover, protect, save, defend”).",
        "Cognate with Scots wer, weir (“to defend, protect”), Dutch weren (“to aver, ward off”), German wehren (“to fight”), Swedish värja (“to defend, ward off”), Icelandic verja (“to defend”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wear (third-person singular simple present wears, present participle wearing, simple past weared or wore, past participle weared or worn or (obsolete) worne)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly UK dialectal, transitive) To guard; watch; keep watch, especially from entry or invasion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly UK dialectal, transitive) To defend; protect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly UK dialectal, transitive) To ward off; prevent from approaching or entering; drive off; repel.",
                  "examples": [
                    "to wear the wolf from the sheep"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly UK dialectal, transitive) To conduct or guide with care or caution, as into a fold or place of safety.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wear (plural wears)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dated form of weir.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}