{
  "word": "siren",
  "etymologies": [
    {
      "description": [
        "From Middle English siren, from Old French sereine and Latin Sīrēn, Sīrēna, from Ancient Greek Σειρήν (Seirḗn). The mammalian sense was first attested in French in Dominique Bouhours, Les entretiens d'Ariste et d'Eugène, in 1671. The aquatic salamander sense was originally introduced by Linnaeus in 1766, for a genus of his reptiles."
      ],
      "adjectives": [
        {
          "description": "siren",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to or like a siren.",
                  "examples": [
                    "Synonyms: bewitching, enchanting, enticing, sirenic"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "siren (plural sirens or sirenes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Greek mythology) One of a group of nymphs who lured mariners to their death on the rocks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who sings sweetly and charms.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dangerously seductive woman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A member of an order of mammals of Sirenia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A member of a genus of aquatic salamanders of the family Sirenidae, commonly used for all species subsumed under the family of Sirenidae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Any of various nymphalid butterflies of the genus Hestina.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device, either mechanical or electronic, that makes a piercingly loud sound as an alarm or signal, or the sound from such a device (first recorded 1879).",
                  "examples": [
                    "There goes the siren that warns of the air raid / Then comes the sound of the guns sending flak / Out for the scramble we've got to get airborne / Got to get up for the coming attack."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical instrument, one of the few aerophones in the percussion section of the symphony orchestra (patented as Acme Siren in 1895).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instrument for demonstrating the laws of beats and combination tones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy, astrophysics) An astrophysical event that can be used for calculating cosmic distances.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "siren (third-person singular simple present sirens, present participle sirening, simple past and past participle sirened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a noise with, or as if with, a siren.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}