{
  "word": "commiserate",
  "etymologies": [
    {
      "description": [
        "From commiserātus, the perfect passive participle of commiseror."
      ],
      "adjectives": [
        {
          "description": "commiserate (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) commiserating, pitying, lamentful",
                  "examples": [
                    "In the time of Gregory Nazianzene, if we may credit ecclesiastical records, there sprung up the direfulest mortality in Rome that mankind hath been acquainted with; scarce able were the living to bury the dead, and not so much but their streets were digged up for graves, which this holy Father (with no little commiserate heart-bleeding) beholding, commanded all the clergy (for he was at that time their chief bishop) to assemble in prayer and supplications, and deal forcingly beseeching with God, to intermit his fury and forgive them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Modelled upon commiserāt-, the perfect passive participial stem of the Latin commiseror."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "commiserate (third-person singular simple present commiserates, present participle commiserating, simple past and past participle commiserated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To feel or express compassion or sympathy for (someone or something).",
                  "examples": [
                    "A few individuals who commiserated the unhappy condition of British negro slaves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, as the phrasal verb commiserate with) To sympathize; condole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To offer condolences jointly with; express sympathy with.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}