{
  "word": "gam",
  "etymologies": [
    {
      "description": [
        "From Italian gamba (“leg”). Doublet of gamba, jamb, and gamb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gam (plural gams)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A person's leg, especially an attractive woman's leg.",
                  "examples": [
                    "The women's-liberation movement of the late sixties and the seventies – the so-called second wave of feminism – introduced Americans to the notion that their mothers and sisters and daughters ought not to be \"objectified\": that there was something wrong with reducing female people to boobs, gams, and beaver."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain but surely formed within English; etymons may include game or gammon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gam (plural gams)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Collective noun used to refer to a group of whales, or rarely also of porpoises; a pod.",
                  "examples": [
                    "Upon getting into a \"gam\" of whales, this boat, together with that of one of the mates, pulled for a single whale that was seen at a distance from the others, and succeeded in getting square up to their victim unperceived."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A social gathering of whalers (whaling ships).",
                  "examples": [
                    "There is still that yearning for news from Nantucket that there was when the whale-ships stopped for a gam out in the far-distant Pacific Ocean  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gam (third-person singular simple present gams, present participle gamming, simple past and past participle gammed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive, intransitive) To pay a social visit on another ship at sea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialect) To engage in social intercourse anywhere.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}