{
  "word": "enterprise",
  "etymologies": [
    {
      "description": [
        "From Old French via Middle English and Middle French entreprise, feminine past participle of entreprendre (“to undertake”), from entre (“in between”) + prendre (“to take”), from Latin inter + prehendō, see prehensile."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "enterprise (countable and uncountable, plural enterprises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A company, business, organization, or other purposeful endeavor.",
                  "examples": [
                    "Synonyms: see Thesaurus:enterprise",
                    "The government sponsored enterprises (GSEs) are a group of financial services corporations which have been created by the United States Congress.",
                    "A micro-enterprise is defined as a company or business having 5 or fewer employees and a low seed capital."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An undertaking, venture, or project, especially a daring and courageous one.",
                  "examples": [
                    "Biosphere 2 was a scientific enterprise aimed at the exploration of the complex web of interactions within life systems."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A willingness to undertake new or risky projects; energy and initiative.",
                  "examples": [
                    "He has shown great enterprise throughout his early career."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Active participation in projects.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "enterprise (third-person singular simple present enterprises, present participle enterprising, simple past and past participle enterprised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To undertake an enterprise, or something hazardous or difficult.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To undertake; to begin and attempt to perform; to venture upon.",
                  "examples": [
                    "The business must be enterprised this night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat with hospitality; to entertain.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}