{
  "word": "stipend",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Late Middle English stipend, stipende (“salary, wage”) [and other forms], from Old French stipende, stipendie, from Latin stīpendium (“contribution; dues; impost, tax; tribute; military pay or stipend; military service”), from *stipipendium, *stippendium, from stips (“alms; contribution, donation, gift”) (ultimately from Proto-Indo-European *steyp- (“erect; stiff”)) + pendere (the present active infinitive of pendō (“to cause to hang down or suspend; to weigh, weigh out; (hence) to pay”), ultimately from Proto-Indo-European *(s)pend- (“to pull; to spin; to stretch”)) + -ium (suffix forming abstract nouns).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stipend (plural stipends)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A regular fixed payment made to someone (especially a clergyman, judge, soldier, or teacher) for services provided by them; a salary. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "Some other form of fixed (and generally small) payment occurring at regular intervals, such as an allowance, a pension, or (obsolete) a tax. [from 16th c.]",
                  "examples": [
                    "Coordinate term: pocket money",
                    "My stipend for doing public service is barely enough to cover living expenses."
                  ]
                },
                {
                  "meaning": "(education) A scholarship granted to a student. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "Money which is earned; an income. [17th c.]",
                  "examples": []
                },
                {
                  "meaning": "A one-off payment for a service provided. [16th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stipend (third-person singular simple present stipends, present participle stipending, simple past and past participle stipended)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete or historical) To provide (someone) with a stipend (an allowance, a pension, a salary, etc.). [from 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}