{
  "word": "pie",
  "etymologies": [
    {
      "description": [
        "From Middle English pye, pie, pey, perhaps from Old English *pīe (“pastry”) (compare Old English pīe, pēo (“insect, bug”)), attested in early Middle English piehus (“bakery”, literally “pie-house”) c. 1199. Relation to Medieval Latin pica, pia (“pie, pastry”) is unclear, as there are no similar terms found in any Romance languages; therefore, like Irish pióg (“pie”), the Latin term may have been simply borrowed from the English.",
        "Some sources state the word comes from Latin pīca (“magpie, jay”) (from the idea of the many ingredients put into pies likened to the tendency of magpies to bring a variety of objects back to their nests), ultimately from Proto-Indo-European *(s)peyk- (“woodpecker; magpie”), though this has its controversies. However, if so, then it is a doublet of pica."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pie (countable and uncountable, plural pies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of pastry that consists of an outer crust and a filling.",
                  "examples": [
                    "The family had steak and kidney pie for dinner and cherry pie for dessert."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various other, non-pastry dishes that maintain the general concept of a shell with a filling.",
                  "examples": [
                    "Shepherd's pie is made of mince covered with mashed potato."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northeastern US) A pizza.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A paper plate covered in cream, shaving foam or custard that is thrown or rubbed in someone’s face for comical purposes, to raise money for charity, or as a form of political protest; a custard pie; a cream pie.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The whole of a wealth or resource, to be divided in parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(letterpress typography) A disorderly mess of spilt type.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) An especially badly bowled ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pie chart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The vulva.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pie (third-person singular simple present pies, present participle pieing, simple past and past participle pied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit in the face with a pie, either for comic effect or as a means of protest (see also pieing).",
                  "examples": [
                    "I'd like to see someone pie the chairman of the board."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To go around (a corner) in a guarded manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) (of printing types) To reduce to confusion; to jumble.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English pye, from Old French pie, from Latin pīca, feminine of pīcus (“woodpecker”), from Proto-Indo-European *(s)peyk- (“woodpecker; magpie”). Cognate with speight."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pie (plural pies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Magpie.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Hindi पाई (pāī, “quarter”), from Sanskrit पादिका (pādikā)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pie (plural pie or pies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The smallest unit of currency in South Asia, equivalent to 1⁄192 of a rupee or 1⁄12 of an anna.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Hindi पाहि (pāhi, “migrant farmer, passer-through”), from Sanskrit पार्श्व (pārśva, “side, vicinity”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pie (plural pies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Ellipsis of pie-dog: an Indian breed, a stray dog in Indian contexts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Spanish pie (“foot, Spanish foot”), from Latin pēs (“foot, Roman foot”), from Proto-Indo-European *pṓds."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pie (plural pies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A traditional Spanish unit of length, equivalent to about 27.9 cm.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}