{
  "word": "anvil",
  "etymologies": [
    {
      "description": [
        "From Middle English anfilt, anvelt, anfelt, from late Old English anfilt, anfilte, anfealt, from earlier onfilti (“anvil”), from Proto-West Germanic *anafalt (compare Middle Dutch anvilte, Low German Anfilts, Anefilt, Old High German anafalz), compound of *ana (“on”) + *falt (“beaten”) (compare German falzen (“to groove, fold, welt”), Swedish dialectal filta (“to beat”)), from Proto-Indo-European *pelh₂-t- (“shaken, beaten”) (compare Middle Irish lethar (“leather”), Latin pellō (“to beat, strike”), Ancient Greek πάλλω (pállō, “to toss, brandish”)), enlargement of Proto-Indo-European *pelh₂- (“to stir, move”). More at felon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "anvil (plural anvils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heavy iron block used in the blacksmithing trade as a surface upon which metal can be struck and shaped.",
                  "examples": [
                    "What the anvil? what dread grasp / Dare its deadly terrors clasp?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The incus bone in the middle ear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stone or other hard surface used by a bird for breaking the shells of snails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The non-moving surface of a micrometer against which the item to be measured is placed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) A horizontal-topped mass of cloud, shaped like a blacksmith's anvil, that forms before a thunderstorm.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "anvil (third-person singular simple present anvils, present participle anvilling or anviling, simple past and past participle anvilled or anviled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, often figurative) To fashion on, or as if on, an anvil.",
                  "examples": [
                    "I Have anvil’d out this Iron Age,",
                    "Which I commit, not to your patronage,",
                    "But skill and Art  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}