{
  "word": "barnacle",
  "etymologies": [
    {
      "description": [
        "From Middle English barnakille, from earlier bernake, bernekke, from Old Northern French bernaque (“barnacle”) (compare French barnache), from Medieval Latin barneca (“limpet”), from Gaulish (compare Welsh brennig, Irish báirneac), from Proto-Celtic *barinākos, from *barinā (“rock, rocky ground”) (compare Old Irish barenn (“boulder”)), from Proto-Indo-European *gʷr̥H- (“hill, mountain”) + Proto-Celtic *-ākos, from Proto-Indo-European *-kos, *-ḱos; for sense development, compare Ancient Greek λέπας (lépas, “rock”) which gave λεπάς (lepás, “limpet”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "barnacle (plural barnacles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A marine crustacean of the subclass Cirripedia that attaches itself to submerged surfaces such as tidal rocks or the bottoms of ships.",
                  "examples": [
                    "Hypernyms: arthropod, crustacean"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The barnacle goose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering, slang) In electrical engineering, a change made to a product on the manufacturing floor that was not part of the original product design.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics, slang) On printed circuit boards, a change such as soldering a wire in order to connect two points, or addition such as an added resistor or capacitor, subassembly or daughterboard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(software engineering, slang) A deprecated or obsolete file, image or other artifact that remains with a project even though it is no longer needed.",
                  "examples": [
                    "Synonym: (collectively) cruft",
                    ""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, in the plural) An instrument like a pair of pincers, to fix on the nose of a vicious horse while shoeing so as to make it more tractable.",
                  "examples": [
                    "Synonym: twitch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, Britain, slang, in the plural) A pair of spectacles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, obsolete) A good job, or snack easily obtained.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A worldly sailor.",
                  "examples": [
                    "Synonym: shellback"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "barnacle (third-person singular simple present barnacles, present participle barnacling, simple past and past participle barnacled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To connect with or attach.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To press close against something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}