{
  "word": "center",
  "etymologies": [
    {
      "description": [],
      "adjectives": [
        {
          "description": "center (not comparable) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, at, or related to a center.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "center (plural centers) (American spelling) (Canadian spelling, alternative)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The point in the interior of a circle that is equidistant from all points on the circumference. [from 14th c.]",
                  "examples": [
                    "If a point be taken within a circle, and more than two equal straight lines fall from the point on the circle, the point taken is the centre of the circle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The point in the interior of a sphere that is equidistant from all points on the circumference. [from 14th c.]",
                  "examples": [
                    "Japanese scientists are to explore the centre of the Earth. Using a giant drill ship launched next month, the researchers aim to be the first to punch a hole through the rocky crust that covers our planet and to reach the mantle below."
                  ]
                }
              ]
            },
            {
              "group": "The middle portion of something; the part well away from the edges.",
              "entries": [
                {
                  "meaning": "(obsolete) The innermost point of the Earth, or the Earth itself, as the center or foundation of the Universe; the center or foundation of the Universe abstractly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) The point on a line that is midway between the ends.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) The point in the interior of any figure of any number of dimensions that has as its coordinates the arithmetic mean of the coordinates of all points on the perimeter of the figure (or of all points in the interior for a center of volume).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(group theory, ring theory) The subgroup (respectively, subring), denoted Z(G), of those elements of a given group (respectively, ring) G that commute with every element of G.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place, especially a building or complex, set aside for some specified function or activity.",
                  "examples": [
                    "shopping center, convention center, civic center, garment center, Lincoln Center for the Performing Arts, Rockefeller Center"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) The ensemble of moderate or centrist political parties.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The venue in which the head of government in a centralized state is situated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A topic that is particularly important in a given context, the element in a subject of cognition, volition or discussion that is perceived as decisive.",
                  "examples": [
                    "the center of the controversy",
                    "the center of attention"
                  ]
                }
              ]
            },
            {
              "group": "(sports) A player in the middle of a playing area.",
              "entries": [
                {
                  "meaning": "(basketball) The player, generally the tallest, who plays closest to the basket.",
                  "examples": []
                },
                {
                  "meaning": "(ice hockey) The forward that generally plays between the left wing and right wing and usually takes the faceoffs.",
                  "examples": []
                },
                {
                  "meaning": "(American football, Canadian football) The person who holds the ball at the beginning of each play.",
                  "examples": []
                },
                {
                  "meaning": "(netball) A player who can go all over the court, except the shooting circles.",
                  "examples": []
                },
                {
                  "meaning": "(soccer) A pass played into the centre of the pitch.",
                  "examples": []
                },
                {
                  "meaning": "(rugby) One of the backs operating in a central area of the pitch, either the inside centre or outside centre.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A certain mechanical implement functioning in the middle of a whole apparatus",
              "entries": [
                {
                  "meaning": "(architecture) A temporary structure upon which the materials of a vault or arch are supported in position until the work becomes self-supporting.",
                  "examples": []
                },
                {
                  "meaning": "(engineering) One of the two conical steel pins in a lathe, etc., upon which the work is held, and about which it revolves.",
                  "examples": []
                },
                {
                  "meaning": "(engineering) A conical recess or indentation in the end of a shaft or other work, to receive the point of a center, on which the work can turn, as in a lathe.",
                  "examples": []
                },
                {
                  "meaning": "(Australia, New Zealand) The ring in the gambling game two-up in which the spinner operates.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "center (third-person singular simple present centers, present participle centering, simple past and past participle centered) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (an object) to occupy the center of an area.",
                  "examples": [
                    "Thy joys are centred all in me alone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (some attribute, such as a mood or voltage) to be adjusted to a value which is midway between the extremes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give (something) a central basis.",
                  "examples": [
                    "However, Lucas also centered the plot around the protection of the secret Death Star plans, which now filled the role of the clan treasure the enemy is seeking in Hidden Fortress;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To concentrate on (something), to pay close attention to (something).",
                  "examples": [
                    "The plot centers on the life of a working-class family.",
                    "The discussion centered around the recent issues."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) To form a recess or indentation for the reception of a center.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}