{
  "word": "overspin",
  "etymologies": [
    {
      "description": [
        "over- +‎ spin"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "overspin (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An excessive amount of spin applied to a projectile such that its nose does not turn down at the summit of the trajectory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rotational motion, especially that given to a ball, in which the upper surface spins in the direction of motion; topspin;top.",
                  "examples": [
                    "1886,  E.T.Sachs,  The Boys Own Annual: Lawn-Tennis of the Present‎[2], volume 9, page 778:What is wanted is just the reverse - i.e top or overspin, which causes the ball to revolve in the direction in which it is going.",
                    "1905,  Eustace Miles,  “Tennis and its Popularisation”, in F. G. Aflalo, editor, The Sports of the World, London: Cassell and Company, page 227:Then may come that particular feature of Tennis—the Cut. In this one does not strike the ball fair and square as at Cricket and Racquets; still less does one give the ball what may be called the overspin, to make it fly quicker and to give it pace over the ground, as one does at Lawn Tennis."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "overspin (third-person singular simple present overspins, present participle overspinning, simple past and past participle overspun)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To spin too much or too far.",
                  "examples": [
                    "In my enthusiasm I overspun the handle of the microfilm reading machine and went a few pages further than I intended."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}