{
  "word": "crotch",
  "etymologies": [
    {
      "description": [
        "Of disputed origin; two possibilities seem likely:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crotch (plural crotches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The area where something forks or branches, a ramification takes place.",
                  "examples": [
                    "There is a child sitting in a crotch of that tree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ventral area (very bottom) of the human body between where the legs fork from the torso, in the area of the genitals and anus.",
                  "examples": [
                    "Every mile they rode their crotches felt worse saddlepain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, euphemistic) Either the male or female genitalia.",
                  "examples": [
                    "He cringed at being kicked in the crotch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards) In the three-ball carom game, a small space at each corner of the table.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) The open counter (negative space) formed by two downward strokes that meet at an internal acute angle, potentially above a vertex, as in the letters \"V\" and \"Y\".",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crotch (third-person singular simple present crotches, present participle crotching, simple past and past participle crotched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with a crotch; to give the form of a crotch to.",
                  "examples": [
                    "to crotch the ends of ropes in splicing or tying knots"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, logging, historical, Western US) To notch (a log) on opposite sides to provide a grip for the dogs that will haul it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shoplift or smuggle by hiding between one's thighs or in one's underwear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit in the crotch (genital region).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sailing) To secure (the boom) to the boom crotch (a forked pole).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, tree work) To hang (a rope) over a crotch in a tree so that the ends hang down from opposite sides.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove overgrown wool from around the eyes of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}