{
  "word": "turnover",
  "etymologies": [
    {
      "description": [
        "turn +‎ over"
      ],
      "adjectives": [
        {
          "description": "turnover (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Capable of being turned over; designed to be turned over.",
                  "examples": [
                    "a turnover collar"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "turnover (countable and uncountable, plural turnovers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount of money taken as sales transacted in a given period.",
                  "examples": [
                    "The company had an annual turnover of $500,000."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The frequency with which stock is replaced after being used or sold, workers leave and are replaced, a property changes hands, etc.",
                  "examples": [
                    "High staff-turnover can lead to low morale amongst employees",
                    "Those apartments have a high turnover because they are so close to the railroad tracks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A semicircular pastry made by turning one half of a circular crust over the other, enclosing the filling (usually fruit).",
                  "examples": [
                    "They only served me one apple turnover for breakfast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A loss of possession of the ball without scoring.",
                  "examples": [
                    "The Nimrods committed another dismaying turnover en route to another humiliating loss."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A measure of leg speed: the frequency with which one takes strides when running, typically given in strides per minute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or result of overturning something; an upset.",
                  "examples": [
                    "a bad turnover in a carriage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) An apprentice, in any trade, who is handed over from one master to another to complete his time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}