{
  "word": "felicity",
  "etymologies": [
    {
      "description": [
        "From Middle English felicite (“bliss, happiness, joy; delight, pleasure; a source of happiness; good fortune; prosperity; well-being; of a planet: in an influential position”) [and other forms], borrowed from Old French felicité (modern French félicité (“bliss, happiness; felicity”)), from Latin fēlīcitātem, the accusative singular of fēlīcitās (“fertility, fruitfulness; happiness, felicity; good fortune; success”), from fēlix (“happy; blessed, fortunate, lucky; fertile, fruitful; prosperous; auspicious, favourable”) (ultimately from Proto-Indo-European *dʰeh₁(y)- (“to nurse, suckle”)) + -itās (a variant of -tās (suffix forming nouns indicating a state of being))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "felicity (countable and uncountable, plural felicities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Happiness; (countable) an instance of this.",
                  "examples": [
                    "Antonym: infelicity"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) An apt and pleasing style in speech, writing, etc.; (countable) an apt and pleasing choice of words.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, rare) Good luck; success; (countable) An instance of unexpected good luck; a stroke of luck; also, a lucky characteristic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, semiotics) Reproduction of a sign with fidelity.",
                  "examples": [
                    "The quotation was rendered with felicity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something that is either a source of happiness or particularly apt.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}