{
  "word": "discuss",
  "etymologies": [
    {
      "description": [
        "From Middle English discussen, from Middle French and Anglo-Norman discusser (French discuter), from Latin discussus, past participle of discutiō (“to strike or shake apart, break up, scatter; examine, discuss”), from dis- (“apart”) + quatiō (“to shake”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "discuss (third-person singular simple present discusses, present participle discussing, simple past and past participle discussed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To converse or debate concerning a particular topic.",
                  "examples": [
                    "Let's sit down and discuss this rationally.",
                    "I don't wish to discuss this further. Let's talk about something else."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To communicate, tell, or disclose (information, a message, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To break to pieces; to shatter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, colloquial) To deal with, in eating or drinking; consume.",
                  "examples": [
                    "We sat quietly down and discussed a cold fowl that we had brought with us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To examine or search thoroughly; to exhaust a remedy against, as against a principal debtor before proceeding against the surety.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To drive away, disperse, shake off; said especially of tumors.",
                  "examples": [
                    "The softness of my hands was secured by medicated gloves, and my bosom rubbed with a pomade prepared by my mother, of virtue to discuss pimples, and clear discolourations."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}