{
  "word": "combine",
  "etymologies": [
    {
      "description": [
        "From Middle French combiner, from Late Latin combīnāre, present active infinitive of combīnō (“unite, yoke together”), from Latin con- (“together”) + bīnī (“two by two”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "combine (plural combines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A combine harvester",
                  "examples": [
                    "We can't finish harvesting because our combine is stuck in the mud."
                  ]
                }
              ]
            },
            {
              "group": "A combination",
              "entries": [
                {
                  "meaning": "Especially, a joint enterprise of whatever legal form for a purpose of business or in any way promoting the interests of the participants, sometimes with monopolistic or fraudulent intentions.",
                  "examples": [
                    "The telecom companies were accused of having formed an illegal combine in order to hike up the network charges."
                  ]
                },
                {
                  "meaning": "An industrial conglomeration in a socialist country, particularly in the former Soviet bloc.",
                  "examples": [
                    "Synonym: kombinat"
                  ]
                },
                {
                  "meaning": "(art) An artwork falling between painting and sculpture, having objects embedded into a painted surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A Test match in which applicants play in the hope of earning a position on a professional football team.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "combine (third-person singular simple present combines, present participle combining, simple past and past participle combined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring (two or more things or activities) together; to unite.",
                  "examples": [
                    "Combine the milk and the hot water in a large bowl.   I'm combining business and pleasure on this trip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have two or more things or properties that function together.",
                  "examples": [
                    "Joe combines the intelligence of a rock with the honesty of a politician."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come together; to unite.",
                  "examples": [
                    "two substances that easily combine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) In the game of casino, to play a card which will take two or more cards whose aggregate number of pips equals those of the card played.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To bind; to hold by a moral tie.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}