{
  "word": "presumption",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French presumption, from Old French presumption, from Latin praesumptiō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "presumption (countable and uncountable, plural presumptions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "the act of presuming, or something presumed",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "the belief of something based upon reasonable evidence, or upon something known to be true",
                  "examples": [
                    "The presumption is that an event has taken place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "the condition upon which something is presumed",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) arrogant behaviour; the act of venturing beyond due bounds of reverence or respect",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An inference that a trier of fact is either permitted or required to draw under certain factual circumstances (as prescribed by statute or case law) unless the party against whom the inference is drawn is able to rebut it with admissible, competent evidence.",
                  "examples": [
                    "The state, in the exercise of its general power to prescribe rules of evidence, may provide that proof of a particular fact, or of several facts taken collectively, shall be prima facie evidence of another fact when there is some rational connection between the fact proved and the ultimate fact presumed. The legislative presumption is invalid when it is entirely arbitrary, or creates an invidious discrimination, or operates to deprive a party of a reasonable opportunity to present the pertinent facts in his defense."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}