{
  "word": "disport",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English disporten, desporten (“to take part in entertainment, sport, etc., to pass time, amuse oneself, be merry; to amuse, entertain; to cheer, console; to behave (in a particular way), deport; to be active, to busy; to relieve (someone of a task); to prevent (someone from attending)”), from Anglo-Norman desporter, Old French desporter, deporter, depporter (“to amuse, entertain; to pass time, amuse oneself; to forbear; to stop”), from Latin deportāre, present active infinitive of dēportō (“to bring, convey; to bring or take home; to carry along or down; to banish, transport”), from dē- (prefix meaning ‘from, off’) + portō (“to bear, carry; to bring, convey”) (from Proto-Indo-European *per- (“to carry forth; fare”)). The English word is a doublet of deport. Also a doublet of sport",
        "The noun is derived from Middle English disport, desport (“activity providing amusement, pleasure or relaxation; entertainment, recreation; game, pastime, sport; pleasure derived from an activity; source of comfort; consolation, solace; conduct, deportment; customary behaviour, manner; act, activity; departure”), from Anglo-Norman disport, Old French desport, deport (“game, pastime, sport; pleasure, recreation; disport”), from desporter: see further above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "disport (plural disports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, archaic) Anything which diverts one from serious matters; a game, a pastime, a sport.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, archaic) Amusement, entertainment, recreation, relaxation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) The way one carries oneself; bearing, carriage, deportment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) Bearing, elevation, orientation.",
                  "examples": [
                    "... shooting a bullet ... out of a Culverin towards the East, and afterwards another, with the same charge, and at the same elevation or disport towards the West."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Fun, gaiety, joy, merriment, mirth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "disport (third-person singular simple present disports, present participle disporting, simple past and past participle disported)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, reflexive, dated) To amuse oneself divertingly or playfully; in particular, to cavort or gambol.",
                  "examples": [
                    "Synonyms: cheer, divert, enjoy, frolic"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}