{
  "word": "chud",
  "etymologies": [
    {
      "description": [
        "Compare chew, cud."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "chud (third-person singular simple present chuds, present participle chudding, simple past and past participle chudded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To champ; to bite.",
                  "examples": [
                    "the horse chuds his bit ſo chearfully"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the science fiction horror movie C.H.U.D. (1984). The abbreviation in the title of aforementioned film stands for \"Cannibalistic Humanoid Underground Dwellers.\"",
        "For Sense 2, apparently coined by famous podcast Chapo Trap House, partly for need of an insult unrelated to any known slur (in American cultural context). Reversed positive sense seems to hearken lexical similarity to other internet slang Chad (“alpha male”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chud (plural chuds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A gross, physically unappealing person.",
                  "examples": [
                    "When Homer recounts his experience in new york city, being chased by mobsters pimps and chuds! ha ha ha."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, Internet slang, sometimes derogatory) A person on the political right, and/or who holds socio-political views seen as regressive or bigoted.",
                  "examples": [
                    "Some chud on Twitter said The Wall Street Journal was liberal propaganda. (pejorative)",
                    "Unlike all those cuckservatives in Congress, this guy's a true chud. (positive)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From ch- +‎ could, from ich + could."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}