{
  "word": "tandem",
  "etymologies": [
    {
      "description": [
        "From Latin tandem (“(of time) at length, at last”). In English, applied humorously (by someone who knew Latin) to two horses harnessed \"at length\" (i.e., in a single line) instead of side-by-side."
      ],
      "adjectives": [
        {
          "description": "tandem (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Together; working as one.",
                  "examples": [
                    "Their skillful tandem work made the project quick and successful."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "tandem (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One behind the other.",
                  "examples": [
                    "to ride tandem on a bicycle-built-for-two",
                    "The horses were harnessed tandem."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "tandem (plural tandems)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A carriage pulled by two or more draught animals (generally draught horses) harnessed one behind the other, both providing the pulling power but only the animal in front able to steer. [from mid 18th c.]",
                  "examples": [
                    "Mr. Foker was no more like a gentleman now than in his school days: and yet Pen felt a secret pride in strutting down High Street with a young fellow who owned tandems, talked to officers, and ordered turtle and champagne for dinner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transferred sense) A bicycle or tricycle in which two people sit one behind the other, both able to pedal but only the person in front able to steer. [from late 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A group of two or more people, machines etc. working together; close collaboration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) A method of language learning based on mutual exchange, where ideally each learner is a native speaker in the language the other person wants to learn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) a hollow metal tube containing radioactive material, inserted through the vagina into the uterus for treatment of gynecological cancer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}