{
  "word": "hedgehog",
  "etymologies": [
    {
      "description": [
        "From hedge +‎ hog."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hedgehog (plural hedgehogs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small mammal, of the family Erinaceidae or subfamily Erinaceinae (spiny hedgehogs, the latter characterized by their spiny back and often by the habit of rolling up into a ball when attacked.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Any of several spiny mammals, such as the porcupine, that are similar to the hedgehog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) Ellipsis of Czech hedgehog: an antitank obstacle constructed from three steel rails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, military, historical) A spigot mortar-type of depth charge weapon from World War II that simultaneously fires a number of explosives into the water to create a pattern of underwater explosions intended to attack submerged submarines.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) A type of chocolate cake (or slice), somewhat similar to an American brownie.",
                  "examples": [
                    "There are hedgehogs with sultanas as well as breadcrumbs, carrot cakes and fruitcakes and banana walnut loaves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A form of dredging machine.",
                  "examples": [
                    "The first machines merely loosened, but did not raise the stuff, a scouring being afterwards effected by means of sluices. These machines consisted of large bars or prongs placed vertically in a frame, and being fastened to a barge placed in the line of the sluices, the whole was inpelled forward by the current, thereby scouring the bed. Such a machine, called a hedgehog, is still used in Lincolnshire."
                  ]
                }
              ]
            },
            {
              "group": "Certain flowering plants with parts resembling a member of family Erinaceidae",
              "entries": [
                {
                  "meaning": "Medicago intertexta, the pods of which are armed with short spines.",
                  "examples": []
                },
                {
                  "meaning": "Retzia capensis of South Africa.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The edible fungus Hydnum repandum.",
                  "examples": [
                    "Synonyms: sweet tooth, wood hedgehog"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of electrical transformer with open magnetic circuit, the ends of the iron wire core being turned outward and presenting a bristling appearance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A way of serving food at a party, consisting of a half melon or potato etc. with individual cocktail sticks of cheese and pineapple stuck into it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(differential geometry) A type of plane curve; see Hedgehog (geometry).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hedgehog (third-person singular simple present hedgehogs, present participle hedgehogging, simple past and past participle hedgehogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) To make use of a hedgehog barricade as a defensive maneuver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To array with spiky projections like the quills of a hedgehog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To curl up into a defensive ball.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}