{
  "word": "mislike",
  "etymologies": [
    {
      "description": [
        "From Middle English misliken (“to displease, offend; to disturb mentally, peturb; to dislike, find distasteful; to be unpleasant; to be displeased, dissatisfied, or unhappy; to feel sorry for (someone’s misfortune); of fruit or a tree: to fail to flourish”) [and other forms], from Old English mislīcian (“to displease; to disquiet”), from mis- (prefix meaning ‘bad; badly; wrong; wrongly’, or indicating a failure or lack) + līcian (“to like; to appeal to, please”) (ultimately from Proto-Indo-European *leyg- (“like, similar; even, level”)). The English word is analysable as mis- +‎ like."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "mislike (third-person singular simple present mislikes, present participle misliking, simple past and past participle misliked)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To disapprove of or dislike (someone or something); to have an aversion to. [from 13th c.]",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To displease or offend (someone). [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "(archaic) To displease or offend.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To disapprove; also, to be displeased or unhappy.",
                  "examples": []
                },
                {
                  "meaning": "To become sickly or weak due to poor health; to waste away.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English mislike (“displeasure; hardship; sorrow; unpleasantness”), from mis- (prefix meaning ‘bad; badly; wrong; wrongly’, etc.) + like (“pleasure, will”) (from liken (“to give pleasure to, make happy, please; to be pleasant; to suit; (reflexive) to please oneself, take delight; (reflexive) to be pleased to do (something); to like; to approve of, be in favour of; to be delighted or pleased; to choose, want, wish”), from Old English līcian (verb): see further at etymology 1)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mislike (countable and uncountable, plural mislikes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, archaic) Aversion or distaste for something; dislike; (countable, archaic) an instance of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "(uncountable) Lack of comfort; discomfort; also, difficulty; trouble; or sadness; unhappiness.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) The characteristic or state of incapacity, physical distress, or weakness due to poor health; sickliness; (countable) an instance of this.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) Discontent, unrest; (countable) an instance of this.",
                  "examples": [
                    "Synonyms: disaffection, dissension"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From mis- (prefix meaning ‘bad; badly; wrong; wrongly’) +‎ like (“similar”, adjective)."
      ],
      "adjectives": [
        {
          "description": "mislike (comparative more mislike, superlative most mislike)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) Not like or similar; different, unlike.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}