{
  "word": "bondage",
  "etymologies": [
    {
      "description": [
        "From Middle English bondage (“serfdom”), from British Medieval Latin bondagium (“an inferior tenure held by a bond or husbandman”), from Middle English bond (“a tenant farmer, serf”), from Old English bonda (“a householder, husband, head of a family”), of Old Norse origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bondage (countable and uncountable, plural bondages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being enslaved or the practice of slavery.",
                  "examples": [
                    "In Judeo-Christian tradition, the Israelites fled bondage at the hands of the Egyptians, only to wander in the wilderness for the next four decades.",
                    "Antonym: freedom"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The state of lacking freedom; constraint.",
                  "examples": [
                    "He lived in financial bondage to his cocaine habit; no matter how much he earned, it all seemed to disappear up his nose.",
                    "Antonym: freedom"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The practice of physically restraining people for sexual pleasure, such as by tying up or shackling.",
                  "examples": [
                    "Their marriage broke up when she discovered he had been engaging in bondage games with a local dominatrix while he was supposedly working out at the gym."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive) Applied to clothing with many buckles, zips, etc., associated with punk and goth subcultures.",
                  "examples": [
                    "bondage trousers; bondage jeans; bondage pants"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}