{
  "word": "marshmallow",
  "etymologies": [
    {
      "description": [
        "From Old English mersċmealwe, corresponding to marsh +‎ mallow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "marshmallow (plural marshmallows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Marsh mallow, a species of mallow, Althaea officinalis, that grows in marshy terrain. [from 9th c.]",
                  "examples": [
                    "Our common Marsh Mallows have diverse soft, hoary white stalks rising to be three or four foot high, spreading forth many branches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of confectionery, originally (since Ancient Egyptian times) made from this plant, but now generally made of sugar or corn syrup, gelatin that has been pre-softened in water, gum arabic, flavorings, and sometimes beaten egg whites, all whipped to a spongy consistency. [from 19th c.]",
                  "examples": [
                    "The Disagreeable Girl is a female of the genus homo persuasion, built around a digestive apparatus that possesses marked marshmallow proclivities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Someone who is soft and benign.",
                  "examples": [
                    "He acts like a total badass, but he's really just a marshmallow once you get to know him."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "marshmallow (third-person singular simple present marshmallows, present participle marshmallowing, simple past and past participle marshmallowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To soften (literally or figuratively)",
                  "examples": [
                    "For i could still feel her small face in my hands, her lips marshmallowing under the brushing knuckle of my index, the hard press of her capable contoured body."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}