{
  "word": "croup",
  "etymologies": [
    {
      "description": [
        "From Middle English croupe, from Old French croupe (“rump, body”), from Old Norse kroppr (“body, trunk, mass”), from Proto-Germanic *kruppaz (“body, mass, heap, collection, crop”), from Proto-Indo-European *grewb- (“to curve, bend, crawl”). More at crupper, doublet of croupe, group, and crop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "croup (plural croups)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The top of the rump of a horse or other quadruped.",
                  "examples": [
                    "Coordinate terms: crupper, rump, buttocks"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Scots croup, croop (“the croup”), from Scots croup, crowp, croop (“to croak, speak hoarsely, murmur, complain”), from Old Scots crowp, crope, croap (“to call loudly, croak”), alteration of rowp, roup, roip, rope (“to cry, cry hoarsely, roop”), from Middle English roupen, ropen, from Old English hrōpan (“to shout, proclaim; cry out, scream, howl”), from Proto-Germanic *hrōpaną (“to shout”), from Proto-Indo-European *ker-, *kor- (“to caw, crow”). More at roop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "croup (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pathology) An infectious illness of the larynx, especially in young children, causing respiratory difficulty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "croup (third-person singular simple present croups, present participle crouping, simple past and past participle crouped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete outside dialects) To croak, make a hoarse noise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}