{
  "word": "democratic",
  "etymologies": [
    {
      "description": [
        "From Middle French democratique (“pertaining to democracy, democratic”) (modern French démocratique), and its etymon Late Latin democraticus (“pertaining to democracy, democratic; democrat”), from Ancient Greek δημοκρᾰτῐκός (dēmokratikós, “of or for democracy; favouring or suited for democracy”), from δημοκρᾰτῐ́ᾱ (dēmokratíā, “democracy”) + -ῐκός (-ikós, suffix with the sense ‘of or pertaining’ to forming adjectives). Δημοκρᾰτῐ́ᾱ (Dēmokratíā) is derived from δῆμος (dêmos, “the common people; free citizens, sovereign people; popular assembly; popular government, democracy”) (ultimately from Proto-Indo-European *deh₂- (“to divide; to share”)) + -κρᾰτῐ́ᾱ (-kratíā, suffix meaning ‘government; rule’) (from κρᾰ́τος (krátos, “might, strength; dominion, power”) (ultimately from Proto-Indo-European *kret- (“insight, intelligence; strength”)) + -ῐ́ᾱ (-íā, suffix forming feminine abstract nouns))."
      ],
      "adjectives": [
        {
          "description": "democratic (comparative more democratic, superlative most democratic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to democracy; constructed upon or in line with the principle of government chosen by the people.",
                  "examples": [
                    "Synonym: (archaic) democratical",
                    "Antonyms: nondemocratic, undemocratic",
                    "The United States is a democratic country, as the citizens are allowed to choose leaders to represent their interests."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Exhibiting social equality; egalitarian.",
                  "examples": [
                    "Antonyms: nondemocratic, undemocratic"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, politics) Alternative letter-case form of Democratic (“of, pertaining to, or supporting the Democratic Party”)",
                  "examples": [
                    "Mount Vernon is run by a strong democratic party organization."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "democratic (plural democratics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural, dated) Synonym of democrat (“a supporter of democracy; an advocate of democratic politics (originally (historical) as opposed to the aristocrats in Revolutionary France)”)",
                  "examples": [
                    "Synonyms: (obsolete) democratical, democratist"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}