{
  "word": "purse",
  "etymologies": [
    {
      "description": [
        "From Middle English purse, from Old English purs (“purse”), partly from pusa (“wallet, bag, scrip”) and partly from burse (“pouch, bag”).",
        "Old English pusa comes from Proto-Germanic *pusô (“bag, sack, scrip”), from Proto-Indo-European *būs- (“to swell, stuff”), and is cognate with Old High German pfoso (“pouch, purse”), Low German pūse (“purse, bag”), Old Norse posi (“purse, bag”), Danish pose (“purse, bag”). Old English burse comes from Medieval Latin bursa (“leather bag”) (compare English bursar), from Ancient Greek βύρσα (búrsa, “hide, wine-skin”).",
        "Compare also Old French borse (French bourse), Old Saxon bursa (“bag”), Old High German burissa (“wallet”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "purse (plural purses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small bag for carrying money.",
                  "examples": [
                    "And then muſt many a man occupie as farre as his purſe would reache, and ſtretche out his legges accordynge to the length of his couerlet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A handbag (small bag usually used by women for carrying various small personal items)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quantity of money given for a particular purpose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A specific sum of money in certain countries: formerly 500 piastres in Turkey or 50 tomans in Persia.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "purse (third-person singular simple present purses, present participle pursing, simple past and past participle pursed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To press (one's lips) in and together so that they protrude.",
                  "examples": [
                    "The serving Sister pursed up her lips to remind him of the cloistral rule, almost as if she wanted to prevent any conversation between him and the nun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To draw up or contract into folds or wrinkles; to pucker; to knit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put into a purse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete, rare) To steal purses; to rob.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}