{
  "word": "appeal",
  "etymologies": [
    {
      "description": [
        "From Middle English apel, appel (“formal accusation brought in court; a challenge to trial by combat; an appeal to a higher court or authority; plea (for mercy, protection, etc.); pealing (of bells)”) [and other forms], from Old French apel (“a call”) (modern French appel (“a call; an appeal”)), from apeler (“to call; to call out”), from Latin appellāre, adpellāre, respectively the present active infinitives of appellō (“to address as, call by name; to drive, move to; to land or put ashore”) and adpellō (“to drive, move to; to land or put ashore”), from ad- (prefix meaning ‘to; towards’) (ultimately from Proto-Indo-European *h₂éd (“at; to”)) + pellō (“to drive, impel, push; to hurl, propel; to banish, expel; to eject, thrust out”) (ultimately from Proto-Indo-European *pelh₂- (“to approach”), from *pel- (“to beat; to drive; to push”)). Doublet of appel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "appeal (countable and uncountable, plural appeals)",
          "definitionGroups": [
            {
              "group": "(law)",
              "entries": [
                {
                  "meaning": "An application to a superior court or judge for a decision or order by an inferior court or judge to be reviewed and overturned.",
                  "examples": []
                },
                {
                  "meaning": "The legal document or form by which such an application is made; also, the court case in which the application is argued.",
                  "examples": []
                },
                {
                  "meaning": "A person's legal right to apply to court for such a review.",
                  "examples": [
                    "I have an appeal against the lower court decision."
                  ]
                },
                {
                  "meaning": "(historical) An accusation or charge against someone for wrongdoing (especially treason).",
                  "examples": []
                },
                {
                  "meaning": "(historical) A process which formerly might be instituted by one private person against another for some heinous crime demanding punishment for the particular injury suffered, rather than for the offence against the public; an accusation.",
                  "examples": []
                },
                {
                  "meaning": "(historical) At common law, an accusation made against a felon by one of their accomplices (called an approver).",
                  "examples": []
                }
              ]
            },
            {
              "group": "A call to a person or an authority for a decision, help, or proof; an entreaty, an invocation.",
              "entries": [
                {
                  "meaning": "(cricket) The act, by the fielding side, of asking an umpire for a decision on whether a batsman is out or not.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A resort to some physical means; a recourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A power to attract or interest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric) A call to, or the use of, a principle or quality for purposes of persuasion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A summons to defend one's honour in a duel, or one's innocence in a trial by combat; a challenge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English apelen, appelen (“to accuse; to make a formal charge before a court, etc., impeach; to challenge to trial by combat; to apply to a higher court or authority for review of a decision; to call upon for a decision, favour, help, etc.; to call by a name”) [and other forms], from Old French apeler (“to call; to call out”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "appeal (third-person singular simple present appeals, present participle appealing, simple past and past participle appealed)",
          "definitionGroups": [
            {
              "group": "(law)",
              "entries": [
                {
                  "meaning": "(intransitive) Often followed by against (the inferior court's decision) or to (the superior court): to apply to a superior court or judge for a decision or order by an inferior court or judge to be reviewed and overturned.",
                  "examples": [
                    "Dissatisfied with the judge’s ruling, she decided to appeal.",
                    "He was advised by his lawyer to appeal against his conviction."
                  ]
                },
                {
                  "meaning": "(transitive, originally US) To apply to a superior court or judge to review and overturn (a decision or order by an inferior court or judge).",
                  "examples": [
                    "The plaintiff appealed the decision to the appellate court."
                  ]
                },
                {
                  "meaning": "(transitive, historical) To accuse or charge (someone) with wrongdoing (especially treason).",
                  "examples": []
                },
                {
                  "meaning": "(transitive, historical) Of a private person: to instituted legal proceedings (against another private person) for some heinous crime, demanding punishment for the particular injury suffered.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, historical) Of the accomplice of a felon: to make an accusation at common law against (the felon).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive) To call upon a person or an authority to corroborate a statement, to decide a controverted question, or to vindicate one's rights; to entreat, to invoke.",
              "entries": [
                {
                  "meaning": "(intransitive, cricket) Of a fielding side; to ask an umpire for a decision on whether a batsman is out or not, usually by saying \"How's that?\" or \"Howzat?\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To call upon someone for a favour, help, etc.",
                  "examples": [
                    "I appeal to all of you to help the orphans."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To have recourse or resort to some physical means.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To be attractive.",
                  "examples": [
                    "That idea appeals to me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, historical) To summon (someone) to defend their honour in a duel, or their innocence in a trial by combat; to challenge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}