{
  "word": "conquest",
  "etymologies": [
    {
      "description": [
        "From Middle English conquest, from Old French conqueste (French conquête)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "conquest (countable and uncountable, plural conquests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Victory gained through combat; the subjugation of an enemy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, by extension) An act or instance of overcoming an obstacle.",
                  "examples": [
                    "Three years sufficed for the conquest of the country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is conquered; possession gained by force, physical or moral.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, feudal law) The acquiring of property by other means than by inheritance; acquisition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, figurative) A person whose romantic affections one has gained, or with whom one has had sex, or the act of gaining another's romantic affections.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A competitive mode found in first-person shooter games in which competing teams (usually two) attempt to take over predetermined spawn points labeled by flags.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "conquest (third-person singular simple present conquests, present participle conquesting, simple past and past participle conquested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To conquer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marketing) To compete with an established competitor by placing advertisements for one's own products adjacent to editorial content relating to the competitor or by using terms and keywords for one's own products that are currently associated with the competitor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}