{
  "word": "forfeit",
  "etymologies": [
    {
      "description": [
        "Middle English forfait from ca. 1300, from Old French forfait (“crime”), originally the past participle of forfaire (“to transgress”), and Medieval Latin foris factum. During the 15th century, the sense shifted from the crime to the penalty for the crime."
      ],
      "adjectives": [
        {
          "description": "forfeit (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lost or alienated for an offense or crime; liable to penal seizure.",
                  "examples": [
                    "to tread the forfeit paradise"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "forfeit (countable and uncountable, plural forfeits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A penalty for or consequence of a misdemeanor.",
                  "examples": [
                    "That he our deadly forfeit should release"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing forfeited; that which is taken from somebody in requital of a misdeed committed; that which is lost, or the right to which is alienated, by a crime, breach of contract, etc.",
                  "examples": [
                    "He who murders pays the forfeit of his own life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something deposited and redeemable by a sportive fine as part of a game.",
                  "examples": [
                    "Country dances and forfeits shortened the rest of the day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) Injury; wrong; mischief.",
                  "examples": [
                    "to seek arms upon people and country that never did us any forfeit"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "forfeit (third-person singular simple present forfeits, present participle forfeiting, simple past and past participle forfeited or (rare) forfeit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To suffer the loss of something by wrongdoing or non-compliance",
                  "examples": [
                    "He forfeited his last chance of an early release from jail by repeatedly attacking another inmate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lose a contest, game, match, or other form of competition by voluntary withdrawal, by failing to attend or participate, or by violation of the rules",
                  "examples": [
                    "Because only nine players were present, the football team was forced to forfeit the game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be guilty of a misdeed; to be criminal; to transgress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fail to keep an obligation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}