{
  "word": "trash",
  "etymologies": [
    {
      "description": [
        "From Middle English trasch, trassh, probably a dialectal form of *trass (compare Orkney truss, English dialectal trous), from Old Norse tros (“rubbish, fallen leaves and twigs”). Compare Norwegian trask (“lumber, trash, baggage”), Swedish trasa (“rag, cloth, worthless fellow”), Swedish trås (“dry fallen twigs, wood-waste”). Compare also Old English þreax (“rottenness, rubbish”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trash (countable and uncountable, plural trashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US) Useless physical things to be discarded; rubbish; refuse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US, metonymically) A container into which things are discarded.",
                  "examples": [
                    "Synonyms: trashcan, trash can, trashbin, trash bin, garbage can, rubbish bin, bin",
                    "Coordinate terms: recycle bin, recycling bin, recycling"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US, figurative) Something worthless or of poor quality.",
                  "examples": [
                    "When your life is trash, you don't have much to lose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dubious assertion, either for appearing untrue or for being excessively boastful.",
                  "examples": [
                    "Synonyms: garbage, rubbish (chiefly British)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Southern United States, agriculture) The disused stems, leaves, or vines of a crop, as well as any weeds mixed therewith, which will either be plowed in as green manure or be removed by raking, grazing, or burning.",
                  "examples": [
                    "Coordinate terms: straw, stover, shaw"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture, uncountable) Loose-leaf tobacco of a low grade, with much less commercial value than the principal grades.",
                  "examples": [
                    "Synonym: scrap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US) (slang, derogatory) People of low social status or class. (See, for example, white trash or Eurotrash.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Canada, US) (fandom slang, humorous, uncountable) A fan who is excessively obsessed with their fandom and its fanworks.",
                  "examples": [
                    "I am Harry Potter trash.",
                    "Hyponym: stan"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Temporary storage on disk for files that the user has deleted, allowing them to be recovered if necessary.",
                  "examples": [
                    "Synonym: (in Microsoft Windows) recycle bin"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trash (third-person singular simple present trashes, present participle trashing, simple past and past participle trashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) To discard.",
                  "examples": [
                    "Fatcat also fails to warn you that unformatting will trash any files copied to the unintentionally formatted disk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) To make into a mess.",
                  "examples": [
                    "The burglars trashed the house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) To beat soundly in a game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) To disrespect someone or something",
                  "examples": [
                    "It is a British tradition for the media to celebrate an upcoming royal wedding by trashing the incoming in-laws, from Diana’s stepmother, Raine Spencer, to Kate Middleton’s Uncle Gary and his memorably named Ibizan villa, Maison de Bang Bang."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To free from trash, or worthless matter; hence, to lop; to crop.",
                  "examples": [
                    "to trash the rattoons of sugar cane"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To treat as trash, or worthless matter; hence, to spurn, humiliate, or crush.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hold back by a trash or leash, as a dog in pursuing game; hence, to retard, encumber, or restrain; to clog; to hinder vexatiously.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}