{
  "word": "dicker",
  "etymologies": [
    {
      "description": [
        "From Middle English diker (“measure of ten”), from Late Latin dacra (“a dicker”), from Latin decuria (“a ten of something”), from decem (“ten”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dicker (countable and uncountable, plural dickers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A unit of measure, consisting of 10 of some object, particularly hides and skins.",
                  "examples": [
                    "Hobs [the Tanner of Tamsworth].  […]  My taking is more than my spending, for here's store left. I have spent but a groat; a penny for my two jades, a penny to the poor, a penny pot of ale, and a penny cake for my man and me, a dicker of cowhides cost me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A chaffering, barter, or exchange, of small wares.",
                  "examples": [
                    "to make a dicker"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dicker (third-person singular simple present dickers, present participle dickering, simple past and past participle dickered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bargain, haggle or negotiate over a sale.",
                  "examples": [
                    "In the brilliant sparkle of the morning when everything that was not superlatively blue was superlatively green, I dickered with a man who was taking a party up the inlet that he should drop me off at the village I was headed for."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To barter.",
                  "examples": [
                    "Then, the white men who penetrated to those semi-wilds were always ready to \"dicker\" and to \"swap,\" and to \"trade\" rifles, and watches, and whatever else they might happen to possess, almost to their wives and children."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}