{
  "word": "bego",
  "etymologies": [
    {
      "description": [
        "From Middle English begon, from Old English begān (“to go over, traverse, get to, come by, fall into, go to, visit, care for, cultivate, inhabit, occupy, surround, beset, overrun, practice, do, engage in, perform, attend to, be diligent about, honor, serve, worship, profess”), from Proto-Germanic *bi + *gāną, corresponding to be- +‎ go. Cognate with Dutch begaan, German begehen, Danish begå."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bego (third-person singular simple present begoes, present participle begoing, simple past bewent, past participle begone)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To go about; encompass; surround; beset, surround with hostile intent; to overrun.",
                  "examples": [
                    "Thy prysemen ar sore begone and put undir, for they ar oversette with Sarazens mo than fyve hondred."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To clothe, dress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete except in set phrases) To affect, usually as a good or bad influence, or as a circumstance.",
                  "examples": [
                    "He was woe begone."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Back-formation from begone, originally an imperative but now an interjection, construed as a past participle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bego (plural begoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which besets, surrounds, compasses, or affects; situation; circumstance.",
                  "examples": [
                    "“As I was passing by a vineyard on the Earth where some of mankind were taking their lunch, I heard them complaining and grumbling about these things they called 'ants'. Oh the woes and begoes of mankind,” smiled the good lord."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bego (third-person singular simple present begoes, present participle begoing, simple past bewent, past participle begone)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, humoristic or faux-archaic) To go away, to disappear.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}