{
  "word": "speaker",
  "etymologies": [
    {
      "description": [
        "From Middle English speker, spekere, an alteration (with change of suffix) of Old English speca, spreca (“speaker”), from Proto-Germanic *sprekô (“speaker”), equivalent to speak +‎ -er. Compare Saterland Frisian Spreeker (“speaker”), West Frisian sprekker (“speaker”), Dutch spreker (“speaker”), German Low German Spreker (“speaker”), German Sprecher (“speaker”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "speaker (plural speakers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who speaks.",
                  "examples": [
                    "There were three different speakers, but I couldn't make out their accents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Loudspeaker.",
                  "examples": [
                    "She lost her hearing after standing too close to the speaker at the festival."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Speakerphone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) The chair or presiding officer of certain legislative bodies, such as the U.K. House of Commons or the U.S. House of Representatives.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who makes a speech to an audience.",
                  "examples": [
                    "The company hired a motivational speaker to boost morale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A book containing passages of text for use in speeches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(especially in linguistics) The producer of a given utterance, whether speech or text.",
              "entries": [
                {
                  "meaning": "(poetry) The literary character uttering the lyrics of a poem or song, as opposed to the author writing the words of that character.",
                  "examples": [
                    "Popular culture often incorrectly attributes quotes from the speakers of poems or songs to the authors thereof, as when \"I took the one less traveled by\" is attributed to Robert Frost rather than to the speaker in Frost's \"The Road Not Taken\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A key on a woodwind instrument of the clarinet family (cf octave key on other instruments) which induces the instrument to overblow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}