{
  "word": "equinox",
  "etymologies": [
    {
      "description": [
        "From Middle English equinox, equinoxe, equynox (“one of the two periods in the year when the day and night are of equal length, equinox; either the zodiac sign Aries or Libra, in which the sun crosses the celestial equator”), from Old French equinoce, equinoxe (modern French équinoxe), or from its etymon Medieval Latin ēquinoxium, ēquinoctium, from Latin aequinoctium (“equinox”), from aequus (“equal”) + nox (“night”) (ultimately derived from Proto-Indo-European *nókʷts (“night”)) + -ium (suffix forming abstract nouns). The Latin word, ultimately adopted in Middle English and modern English, displaced Old English efnniht (modern English evennight).",
        "The plural form equinoctes treats equinox as if it were a Latin word; the accusative, nominative, or vocative plural of Latin nox (“night”) is noctēs."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "equinox (plural equinoxes or (rare) equinoctes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the two occasions in the year when the length of the day and night are equal, which occurs when the apparent path of the Sun (the ecliptic) intersects with the equatorial plane of the Earth; this happens on a day between March 19 and 21 (spring in the Northern Hemisphere, and autumn in the Southern Hemisphere), and on another day between September 21 and 24 (autumn in the Northern Hemisphere, and spring in the Southern Hemisphere); hence, the exact time when the intersection occurs.",
                  "examples": [
                    "Synonym: (rare) evennight"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) The circumstance of a twenty-four hour time period having the day and night of equal length.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) One of the two points in space where the apparent path of the Sun intersects with the equatorial plane of the Earth.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "(rare) A gale (“very strong wind”) once thought to occur more frequently around the time of an equinox (sense 1), now known to be a misconception; an equinoctial gale.",
                  "examples": []
                },
                {
                  "meaning": "(astronomy) A celestial equator (“great circle on the celestial sphere, coincident with the plane of the Earth's equator (the equatorial plane)”); also, the Earth's equator.",
                  "examples": [
                    "Synonym: (obsolete) equinoctial line"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}