{
  "word": "basin",
  "etymologies": [
    {
      "description": [
        "From Middle English basyn, from Old French bacin, from Vulgar Latin *baccinum (“wide bowl”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "basin (plural basins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wide bowl for washing, sometimes affixed to a wall.",
                  "examples": [
                    "Everybody had washed before going to bed, apparently, and the bowls were ringed with a dark sediment which the hard, alkaline water had not dissolved. Shutting the door on this disorder, he turned back to the kitchen, took Mahailey’s tin basin, doused his face and head in cold water, and began to plaster down his wet hair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A shallow bowl used for a single serving of a drink or liquidy food.",
                  "examples": [
                    "They have a good basin of coffee or cocoa for breakfast  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A depression, natural or artificial, containing water.",
                  "examples": [
                    "The fountains were plashing musically into marble and alabaster basins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) An area of land from which water drains into a common outlet; drainage basin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) A shallow depression in a rock formation, such as an area of down-folded rock that has accumulated a thick layer of sediments, or an area scooped out by water erosion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "basin (third-person singular simple present basins, present participle (US) basining or basinning, simple past and past participle (US) basined or basinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To create a concavity or depression in.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To serve as or become a basin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shelter or enclose in a basin.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}