{
  "word": "addresser",
  "etymologies": [
    {
      "description": [
        "address +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "addresser (plural addressers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who gives an address or speech.",
                  "examples": [
                    "The girls were listening with the polite though precarious attention which Brown Borough girls always bring to bear on the first three hundred words of any address, especially if the addresser be a man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who addresses someone (directs spoken or written communication toward someone).",
                  "examples": [
                    "When letters were in their infancy, and when knowledge and the arts were groping their way through seemingly impervious mists, some splendid name was necessary to give an author celebrity—hence the custom of DEDICATIONS; hence those floods of adulation, which poured from the press, and outraged the feelings of the addresser and the addressed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who addresses (applies an address to an object to be delivered to a particular location).",
                  "examples": [
                    "[…]  if they had not been lifted in the air by the enormous accident of a man of genius, the Dickenses, I fancy, would have appeared in poorer and poorer places, as inventory clerks, as caretakers, as addressers of envelopes, until they melted into the masses of the poor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine that addresses.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}