{
  "word": "bolster",
  "etymologies": [
    {
      "description": [
        "From Middle English bolster, bolstre, from Old English bolster (“pillow”), from Proto-West Germanic *bolstr, from Proto-Germanic *bulstraz (“pillow, cushion”). Cognate with Scots bowster (“bolster”), West Frisian bulster (“mattress”), Dutch bolster (“husk, shell”), German Polster (“bolster, pillow, pad”), Swedish bolster (“soft mattress, bolster”), Icelandic bólstur (“pillow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bolster (plural bolsters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large cushion or pillow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pad, quilt, or anything used to hinder pressure, support part of the body, or make a bandage sit easy upon a wounded part; a compress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vehicles, agriculture) A small spacer located on top of the axle of horse-drawn wagons that gives the front wheels enough clearance to turn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short, horizontal structural timber between a post and a beam for enlarging the bearing area of the post and/or reducing the span of the beam.",
                  "examples": [
                    "Synonyms: cross-head, pillow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A beam in the middle of a railway truck, supporting the body of the car.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The perforated plate in a punching machine on which anything rests when being punched.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a knife blade that abuts upon the end of the handle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The metallic end of a pocketknife handle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The rolls forming the ends or sides of the Ionic capital.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) A block of wood on the carriage of a siege gun, upon which the breech of the gun rests when arranged for transportation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bolster (third-person singular simple present bolsters, present participle bolstering, simple past and past participle bolstered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, often figurative) To brace, reinforce, secure, or support.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}