{
  "word": "plea",
  "etymologies": [
    {
      "description": [
        "From Middle English ple, from Old French plait, plaid, from Medieval Latin placitum (“a decree, sentence, suit, plea, etc., Latin an opinion, determination, prescription, order; literally, that which is pleasing, pleasure”), neuter of placitus, past participle of placere (“to please”). Cognate with Spanish pleito (“lawsuit, suit”). Doublet of placit and placate. See also please, pleasure."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plea (plural pleas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An appeal, petition, urgent prayer or entreaty.",
                  "examples": [
                    "a plea for mercy",
                    "make a plea"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An excuse; an apology.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is alleged or pleaded, in defense or in justification.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) That which is alleged by a party in support of his cause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An allegation of fact in a cause, as distinguished from a demurrer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The defendant’s answer to the plaintiff’s declaration and demand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A cause in court; a lawsuit; as, the Court of Common Pleas.",
                  "examples": [
                    "they or any three of them shall be a Court and have cognizance of pleas real, personal, and mixed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plea (third-person singular simple present pleas, present participle pleaing, simple past and past participle pleaed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly England regional, Scotland) To plead; to argue. [from 15th c.]",
                  "examples": [
                    "With my riches, my unhappiness was increased tenfold; and here, with another great acquisition of property, for which I had pleaed, and which I had gained in a dream, my miseries and difficulties were increasing."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}