{
  "word": "tall",
  "etymologies": [
    {
      "description": [
        "From Middle English tall, talle, tal (“seemly, becoming, handsome, good-looking, excellent, good, valiant, lively in speech, bold, great, large, big”), from Old English *tæl, ġetæl (“swift, ready, having mastery of”), from Proto-Germanic *talaz (“submissive, pliable, obedient”), from Proto-Indo-European *dol-, *del- (“to aim, calculate, adjust, reckon”).",
        "Cognate with Scots tal (“high, lofty, tall”), Old Frisian tel (“swift”), Old Saxon gital (“quick”), Old High German gizal (“active, agile”), Gothic 𐌿𐌽𐍄𐌰𐌻𐍃 (untals, “indocile, disobedient”).",
        "The Oxford English Dictionary notes: \"The sense development [of tall] is remarkable, but is paralleled more or less by that of other adjectives expressing estimation, such as buxom, canny, clean, clever, cunning, deft, elegant, handsome, pretty, proper; German klein, as compared with English clean, presents the antithesis to modern tall as compared to tall in early Middle English. It has been conjectured that in the sense 'high of stature' it is a different word, adopted from the Welsh tal in some sense; but the latter is, according to Professor Rhŷs, merely a 16th-century borrowing of the English word (in Owen Pughe's Dictionary erroneously mixed up with the genuine Welsh word tal (“end, brow, forehead”), with which it has no possible connection.)\""
      ],
      "adjectives": [
        {
          "description": "tall (comparative taller, superlative tallest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Having a vertical extent greater than the average. For example, somebody with a height of over 6 feet would generally be considered to be tall.",
                  "examples": [
                    "Being tall is an advantage in basketball."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a building, etc.) Having its top a long way up; having a great vertical (and often greater than horizontal) extent; high.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a story) Hard to believe, such as a tall story or a tall tale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, of a cup of coffee) Smaller than grande, usually 8 ounces (~ 230 ml).",
                  "examples": [
                    "Coordinate terms: grande, venti"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Obsequious; obedient.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Seemly; suitable; fitting, becoming, comely; attractive, handsome.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Bold; brave; courageous; valiant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Fine; proper; admirable; great; excellent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tall (plural talls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(possibly nonstandard) Someone or something that is tall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A clothing size for taller people.",
                  "examples": [
                    "Do you have this in a tall?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tall serving of a drink, especially one from Starbucks, which contains 12 ounces.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}