{
  "word": "slag",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle Low German slagge, slaggen (“slag, dross”), from Old Saxon *slaggo, from Proto-West Germanic *slaggō, from Proto-Germanic *slaggô, from Proto-Germanic *slagōną (“to strike”) + *-gô (diminutive suffix). Compare Middle Low German slāgen (“to strike”), since originally the splinters struck off from the metal by hammering, from *slagōn, from Proto-West Germanic *slagōn. Compare also Old Saxon slegi, from Proto-West Germanic *slagi.",
        "See also Dutch slak, German Schlacke, Swedish slagg; also compare English slay."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slag (countable and uncountable, plural slags)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Waste material from a mine.",
                  "examples": [
                    "After the big village, the scenery had returned to grass and woodland, but this had now given way to ugly mounds of discarded slag. Beyond the slag was a colliery with its machinery and smoking chimney, making the whole area look grim and austere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Scum that forms on the surface of molten metal.",
                  "examples": [
                    "In Asia Minor and on islands in the Aegean Sea, dumps of slag (scum formed by molten metal surface oxidation) demonstrate that silver was being separated from lead as early as 5000 BC."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Impurities formed and separated out when a metal is smelted from ore; vitrified cinders.",
                  "examples": [
                    "Consequently, mounds of large ‘cakes’ of slag are often found near the smelting sites of the Late Bronze Age, as for example at Ramsau in Austria (Doonan et al. 1996)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hard aggregate remaining as a residue from blast furnaces, sometimes used as a surfacing material.",
                  "examples": [
                    "During blast furnace operations, the plant operator pays careful attention to the slag chemistry (both composition and variability) as slag behavior is a major consideration in ensuring the quality of hot metal (molten iron)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Scoria associated with a volcano.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, derogatory, dated) A coward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, chiefly Cockney, derogatory) A contemptible person, a scumbag.",
                  "examples": [
                    "Kill him. Kill the royal slag."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) A prostitute, or a woman who acts like one; a slut.",
                  "examples": [
                    "We never talked about that, of course; we talked about how we could find a woman in the Dilly, and if the Yanks had taken them all, how we could always resort to the peroxided older slags who hung out around the side doors to Waterloo station and did knee tremblers for the Yanks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slag (third-person singular simple present slags, present participle slagging, simple past and past participle slagged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To produce slag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become slag; to agglomerate when heated below the fusion point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce to slag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive, sometimes with \"off\") To talk badly about; to malign or denigrate (someone).",
                  "examples": [
                    "If you slag off the other person, then—to the extent that your child identifies with that person as their parent—you are slagging off a part of them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Australia, slang) To spit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}