{
  "word": "hospital",
  "etymologies": [
    {
      "description": [
        "From Middle English hospital, hospitall, from Old French hospital (Modern French hôpital), from Late Latin hospitālis, hospitāle (“hospice, shelter, guesthouse”), from noun use of Latin hospitālis (“hospitable”), from hospes (“host, guest”). Doublet of hotel and hostel. Displaced native Middle English lechehous, from Old English lǣċehūs (literally “doctor house”)."
      ],
      "adjectives": [
        {
          "description": "hospital (comparative more hospital, superlative most hospital)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Hospitable.",
                  "examples": [
                    "At last the Ocean, that hospital friend to the wretched, opened her capacious arms to receive him; and he instantly resolved to accept her kind invitation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "hospital (plural hospitals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large medical facility, usually in a building with multiple floors, where seriously ill or injured patients are given extensive medical and/or surgical treatment.",
                  "examples": [
                    "Luckily an ambulance arrived quickly and he was rushed to hospital. (UK)",
                    "Luckily an ambulance arrived quickly and he was rushed to the hospital. (US)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A building founded for the long-term care of its residents, such as an almshouse. The residents may have no physical ailments, but simply need financial support.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A place of lodging.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}