{
  "word": "establishment",
  "etymologies": [
    {
      "description": [
        "From Middle English *establishment, stablishment, stablisshement, from Old French establissement (Modern French établissement), from the verb establir. Equivalent to establish +‎ -ment."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "establishment (countable and uncountable, plural establishments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of establishing; a ratifying or ordaining; settlement; confirmation.",
                  "examples": [
                    "Since their establishment of the company in 1984, they have grown into a global business."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being established, founded, etc.; fixed state.",
                  "examples": [
                    "The firm celebrated twenty years since their establishment by updating their look."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is established; as a form of government, a permanent organization, business or force, or the place where one is permanently fixed for residence.",
                  "examples": [
                    "Pedro's is a fine establishment serving a variety of delicious food.",
                    "Exposing the shabby parts of the establishment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with \"the\") The ruling class or authority group in a society; especially, an entrenched authority dedicated to preserving the status quo. Also Establishment.",
                  "examples": [
                    "It's often necessary to question the establishment to get things done."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The number of staff required to run a department or organisation (often used in the context of healthcare and other public services).",
                  "examples": [
                    "The cancer department has an establishment of 10 doctors and 30 nurses."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}