{
  "word": "alligator",
  "etymologies": [
    {
      "description": [
        "From early Modern English alligater, alligarta, aligarto, alegarto, alagarto, from Spanish el lagarto (“the lizard”), from Latin lacertus (“lizard”), modern spelling possibly influenced by the unrelated Latin alligator (“one who binds”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "alligator (plural alligators)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Either of two species of large amphibious reptile, Alligator mississippiensis or Alligator sinensis, in the genus Alligator within order Crocodilia, which have sharp teeth and very strong jaws and are native to the Americas and China, respectively.",
                  "examples": [
                    "All you could see of the alligator were two eyes above the water, then suddenly it snatched up and caught the poor bird with strong jaws full of sharp teeth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(paleontology) A member of the family Alligatoridae, which includes the caimans.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Nigeria) dwarf crocodile (Osteolaemus tetraspis)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(formerly) Applied to any species of crocodile.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Any of various machines with strong jaws, one of which opens like the movable jaw of an alligator.",
              "entries": [
                {
                  "meaning": "(metalworking) A form of squeezer for the puddle ball.",
                  "examples": []
                },
                {
                  "meaning": "(mining) A rock breaker.",
                  "examples": []
                },
                {
                  "meaning": "(printing) A kind of job press.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various vehicles that have relatively long, low noses in front of a cab or other, usually windowed, structure.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "alligator (third-person singular simple present alligators, present participle alligatoring, simple past and past participle alligatored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of paint or other coatings) To crack in a pattern resembling an alligator's skin.",
                  "examples": [
                    "Alligatoring is a result of the sun making the top surface of the asphalt brittle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Latin alligātor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "alligator (plural alligators)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One who binds or ties.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}