{
  "word": "forehold",
  "etymologies": [
    {
      "description": [
        "From fore- (prefix meaning ‘positioned at or near the front’) +‎ hold (“the cargo area of an aircraft or ship”). Hold is a variant of hole (influenced by hold (verb)), from Middle English hole, hol (“perforation, hole; cave, cavern; hiding place, shelter; cell, compartment”), from Old English hol (“hole (in the ground)”), from Proto-West Germanic *hol (“hollow”), from Proto-Germanic *hulą (“depression, hollow; hole”), from Proto-Germanic *hulaz (“hollow”); further etymology uncertain, possibly either from Proto-Indo-European *ḱel- (“to cover; to conceal, hide”) or *ḱewh₁- (“to be strong; to swell”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "forehold (plural foreholds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The forward or front part of the hold of a ship.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From fore- (prefix meaning ‘occurring beforehand; earlier, prior to’) +‎ hold (“to maintain; to consider, opine”). Hold is derived from Middle English holden (“to grasp; to possess; to hold (a belief or opinion”), from Old English healdan (“to grasp, hold fast; to possess”), from Proto-West Germanic *haldan (“to hold; to keep”), from Proto-Germanic *haldaną (“to hold; to keep”); further etymology uncertain, possibly from Proto-Indo-European *ḱel- (“to cover; to conceal, hide”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "forehold (third-person singular simple present foreholds, present participle foreholding, simple past foreheld, past participle foreheld or (obsolete) foreholden)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To hold or believe (something) beforehand; to assume; to anticipate, to predict.",
                  "examples": [
                    "Synonyms: (obsolete) foredeem, presage, prognosticate; see also Thesaurus:predict"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}