{
  "word": "cork",
  "etymologies": [
    {
      "description": [
        "From Middle English cork (“oak bark, cork”), from Middle Dutch curc (“cork (material or object)”), either from Spanish corcho (“cork (material or object)”) (also corcha or corche) or from Old Spanish alcorque (“cork sole”). Doublet of cortex."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cork (countable and uncountable, plural corks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The bark of the cork oak, which is very light and porous and used for making bottle stoppers, flotation devices, and insulation material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bottle stopper made from this or any other material.",
                  "examples": [
                    "Snobs feel it's hard to call it wine with a straight face when the cork is made of plastic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An angling float, also traditionally made of oak cork.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cork oak, Quercus suber.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The dead protective tissue between the bark and cambium  in woody plants, with suberin deposits making it impervious to gasses and water.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cork (third-person singular simple present corks, present participle corking, simple past and past participle corked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seal or stop up, especially with a cork stopper.",
                  "examples": [
                    "Arms draped on shoulders, kick-stepping in circles, they swing bottles of wine. Purpled thumbs cork the bottles. The wine leaps and jumps behind green glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To blacken (as) with a burnt cork.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To leave the cork in a bottle after attempting to uncork it.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To fill with cork.",
              "entries": [
                {
                  "meaning": "(transitive, baseball) To tamper with (a bat) by drilling out part of the head and filling the cavity with cork or similar light, compressible material.",
                  "examples": [
                    "He corked his bat, which was discovered when it broke, causing a controversy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Australia) To injure through a blow; to induce a haematoma.",
                  "examples": [
                    "The vicious tackle corked his leg."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) To position one's drift net just outside of another person's net, thereby intercepting and catching all the fish that would have gone into that person's net.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the traversal path resembling that of a corkscrew."
      ],
      "adjectives": [
        {
          "description": "cork (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snowboarding, skiing, skateboarding) Having the property of a head over heels rotation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cork (plural corks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snowboarding, skiing, skateboarding) An aerialist maneuver involving a rotation where the rider goes heels over head, with the board overhead.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cork (third-person singular simple present corks, present participle corking, simple past and past participle corked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snowboarding, skiing, skateboarding) To perform such a maneuver.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}