{
  "word": "knotty",
  "etymologies": [
    {
      "description": [
        "From Middle English knotti, knotty (“having a knot in it; full of knots; tied together (?); resembling a knot, knotlike; having knobs or protuberances; bulging, convex; of a tree, branch, etc.: full of knots, gnarled; of a plant cutting to be grafted or planted: full of buds or eyes; having joints (?); having swollen joints; of flesh: glandular; of flesh: granular, lumpy, especially, having many swellings; mangy, scurfy (?); having pimples (?); of cauterization: carried out on glandular tissue; (figuratively) of a question or problem: difficult, intricate”) [and other forms], from knotte (“knot; pattern of intersecting lines; coil of a snake”) (from Old English cnotta (“knot”), from Proto-Germanic *knuttô (“knot”), possibly from Proto-Indo-European *gnod- (“to bind”)) + -i (suffix forming adjectives from nouns). The English word may be analysed as knot +‎ -y (suffix forming adjectives with the sense ‘having the quality of’)."
      ],
      "adjectives": [
        {
          "description": "knotty (comparative knottier or more knotty, superlative knottiest or most knotty)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of string or something stringlike: full of, or tied up, in knots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a part of the body, a tree, etc.: full of knots (knobs or swellings); gnarled, knobbly.",
                  "examples": [
                    "a knotty pine"
                  ]
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Complicated or tricky; complex, difficult.",
                  "examples": [
                    "Synonyms: intricate, thorny; see also Thesaurus:complex",
                    "Antonyms: simple, uncomplicated",
                    "a knotty problem"
                  ]
                },
                {
                  "meaning": "Of an austere or hard nature; rugged.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}