{
  "word": "gravy",
  "etymologies": [
    {
      "description": [
        "From Middle English gravey, greavie, gravy; probably from greaves, graves (“the sediment of melted tallow”), or from Old French grave, a claimed misspelling of grané (“stew, spice”), from grain (“spice”).",
        "Sense of \"pasta sauce\" apparently seems to be from Italian dialect, especially Calabrian, differentiating tomato  puree (salsa (“sauce”)) from cooked tomato sauce (sugo)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gravy (usually uncountable, plural gravies)",
          "definitionGroups": [
            {
              "group": "(countable, uncountable) A thick sauce made from the fat or juices that come out from meat or vegetables as they are being cooked.",
              "entries": [
                {
                  "meaning": "A dark savoury sauce prepared from stock and usually meat juices; brown gravy.",
                  "examples": [
                    "A roast dinner isn't complete without gravy."
                  ]
                },
                {
                  "meaning": "(Southern US) A pale sauce prepared from a roux with meat fat; a type of béchamel sauce.",
                  "examples": [
                    "There are few foods more Southern than biscuits and gravy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, chiefly Italian-American) Sauce used for pasta.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, India, Singapore) Curry sauce.",
                  "examples": [
                    "With this the hostess poured two or three spoonfuls of the gravy of the curry on to the rice opposite to each person."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, informal) Unearned gain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, informal) Extra benefit.",
                  "examples": [
                    "The first thousand tickets and the concessions cover the venue and the band. The rest is gravy."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gravy (third-person singular simple present gravies, present participle gravying, simple past and past participle gravied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make gravy.",
                  "examples": [
                    "I mean simply this — that the process of canning and preserving or of gravying and saucing frequently removes the most vitally essential acids and salts  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}