{
  "word": "save",
  "etymologies": [
    {
      "description": [
        "From Middle English saven, sauven, a borrowing from Old French sauver, from Late Latin salvāre (“to save”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "save (plural saves)",
          "definitionGroups": [
            {
              "group": "An instance of preventing (further) harm or difficulty.",
              "entries": [
                {
                  "meaning": "In various sports, a block that prevents an opponent from scoring.",
                  "examples": [
                    "The goaltender made a great save."
                  ]
                },
                {
                  "meaning": "(baseball) A successful attempt by a relief pitcher to preserve the win of another pitcher on one's team.",
                  "examples": [
                    "Jones retired seven to earn the save."
                  ]
                },
                {
                  "meaning": "(professional wrestling, slang) A point in a professional wrestling match when one or more wrestlers run to the ring to aid a fellow wrestler who is being beaten.",
                  "examples": [
                    "The giant wrestler continued to beat down his smaller opponent, until several wrestlers ran in for the save."
                  ]
                },
                {
                  "meaning": "(informal) An action that brings one back out of an awkward situation.",
                  "examples": [
                    "Nice save."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The act, process, or result of saving data to a storage medium.",
                  "examples": [
                    "If you're hit by a power cut, you'll lose all of your changes since your last save.",
                    "The game console can store up to eight saves on a single cartridge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(role-playing games) A saving throw.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [
        {
          "description": "save",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Except; with the exception of.",
                  "examples": [
                    "Under the terms of the Interdict no church services and offices were to be permitted save the baptism of infants and the confession of the dying."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [
        {
          "description": "save (third-person singular simple present saves, present participle saving, simple past and past participle saved)",
          "definitionGroups": [
            {
              "group": "(transitive) To prevent harm or difficulty.",
              "entries": [
                {
                  "meaning": "To help (somebody) to survive, or rescue (somebody or something) from harm.",
                  "examples": [
                    "She was saved from drowning by a passer-by.",
                    "We were able to save a few of our possessions from the house fire."
                  ]
                },
                {
                  "meaning": "To keep (something) safe; to safeguard.",
                  "examples": []
                },
                {
                  "meaning": "(usually ditransitive) To spare (somebody) from effort, or from something undesirable.",
                  "examples": [
                    "I've found a shortcut that saves me ten minutes on my commute."
                  ]
                },
                {
                  "meaning": "(Christianity) To redeem or protect someone from eternal damnation.",
                  "examples": [
                    "Jesus Christ came to save sinners."
                  ]
                },
                {
                  "meaning": "(sports) To catch or deflect (a shot at goal).",
                  "examples": [
                    "Chelsea's youngsters, who looked lively throughout, then combined for the second goal in the seventh minute. Romeu's shot was saved by Wolves goalkeeper Dorus De Vries but Piazon kept the ball alive and turned it back for an unmarked Bertrand to blast home."
                  ]
                },
                {
                  "meaning": "(baseball) To preserve, as a relief pitcher, (a win of another pitcher's on one's team) by defending the lead held when the other pitcher left the game.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To put aside, to avoid.",
              "entries": [
                {
                  "meaning": "(transitive) To store for future use.",
                  "examples": [
                    "Let's save the packaging in case we need to send the product back."
                  ]
                },
                {
                  "meaning": "(transitive) To conserve or prevent the wasting of.",
                  "examples": [
                    "Save electricity by turning off the lights when you leave the room."
                  ]
                },
                {
                  "meaning": "(transitive) To obviate or make unnecessary.",
                  "examples": [
                    "Will you not speak to save a lady's blush?"
                  ]
                },
                {
                  "meaning": "(transitive, intransitive, computing, video games) To write a file to disk or other storage medium.",
                  "examples": [
                    "Where did I save that document? I can't find it on the desktop."
                  ]
                },
                {
                  "meaning": "(intransitive) To economize or avoid waste.",
                  "examples": [
                    "We're tired of always having to scrimp and save."
                  ]
                },
                {
                  "meaning": "(transitive and intransitive) To accumulate money or valuables.",
                  "examples": []
                },
                {
                  "meaning": "(reflexive, idiomatic, often with \"for\") To refrain from romantic or (especially in later use) sexual relationships until one is married or is with a suitable partner.",
                  "examples": [
                    "She told me she's saving herself for marriage."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}