{
  "word": "moor",
  "etymologies": [
    {
      "description": [
        "From Middle English mor, from Old English mōr, from Proto-Germanic *mōraz, from Proto-Indo-European *móri. Cognates include Welsh môr, Old Irish muir (from Proto-Celtic *mori); Scots muir, Dutch moer, Old Saxon mōr, Old Saxon mūr, German Moor and perhaps also Gothic 𐌼𐌰𐍂𐌴𐌹 (marei). See mere."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "moor (plural moors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An extensive waste covered with patches of heath, and having a poor, light soil, but sometimes marshy, and abounding in peat; a heath",
                  "examples": [
                    "A cold, biting wind blew across the moor, and the travellers hastened their step.",
                    "In her girlish age, she kept sheep on the moor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A game preserve consisting of moorland.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English moren, from unattested Old English *mārian, from Proto-West Germanic *mairōn (“to moor, fasten to”), related to *maida- (“post”), from Proto-Indo-European *mēyt-, *meyt-, from *mēy-, *mey- (“stake, pole”). Cognate with Dutch meren (“to moor”), marren (“to bind”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "moor (third-person singular simple present moors, present participle mooring, simple past and past participle moored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) To cast anchor or become fastened.",
                  "examples": [
                    "The vessel was moored in the stream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To fix or secure (e.g. a vessel) in a particular place by casting anchor, or by fastening with ropes, cables or chains or the like.",
                  "examples": [
                    "They moored the boat to the wharf."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To secure or fix firmly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}