{
  "word": "crawl",
  "etymologies": [
    {
      "description": [
        "From Middle English crawlen, crewlen, creulen, crallen, *cravelen, from Old Norse krafla (compare Danish kravle (“to crawl, creep”), Swedish kravla, kräla)), from Proto-Germanic *krablōną (compare Dutch krabbelen, German Low German krabbeln, German krabbeln), frequentative of *krabbōną (“to scratch, scrape”). Compare also West Frisian kreauwelje (“to crawl”), Dutch krevelen, krieuwelen (“to crawl”), German Low German kribbeln, German kribbeln (“to creep, crawl, tingle”). See also crab, crabble."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crawl (plural crawls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of moving slowly on hands and knees, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of sequentially visiting a series of similar establishments (i.e., a bar crawl).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rapid swimming stroke with alternate overarm strokes and a fluttering kick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A very slow pace.",
                  "examples": [
                    "My computer has slowed down to a crawl since I installed that software package."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, film) A piece of horizontally or vertically scrolling text overlaid on the main image.",
                  "examples": [
                    "The opening crawl (and a stirring propaganda movie) informs us that “The Hunger Games” are an annual event in Panem, a North American nation divided into 12 different districts, each in service to the Capitol, a wealthy metropolis that owes its creature comforts to an oppressive dictatorship."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crawl (third-person singular simple present crawls, present participle crawling, simple past and past participle crawled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To creep; to move slowly on hands and knees, or by dragging the body along the ground.",
                  "examples": [
                    "Clutching my wounded side, I crawled back to the trench."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move forward slowly, with frequent stops.",
                  "examples": [
                    "The rush-hour traffic crawled around the bypass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act in a servile manner.",
                  "examples": [
                    "Don’t come crawling to me with your useless apologies!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Followed by with: see crawl with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To feel a swarming sensation.",
                  "examples": [
                    "The horrible sight made my skin crawl."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To swim using the crawl stroke.",
                  "examples": [
                    "I think I’ll crawl the next hundred metres."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move over (an area) on hands and knees.",
                  "examples": [
                    "The baby crawled the entire second floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move over (an area) slowly, with frequent stops.",
                  "examples": [
                    "They crawled the downtown bars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Internet) To visit files or web sites in order to index them for searching.",
                  "examples": [
                    "Yahoo Search has updated its Slurp Crawler to crawl websites faster and more efficiently."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Compare kraal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crawl (plural crawls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pen or enclosure of stakes and hurdles for holding fish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}