{
  "word": "quicken",
  "etymologies": [
    {
      "description": [
        "From Middle English quikenen (“to become alive again after dying; to raise (someone) from the dead; to regain consciousness or strength; to give vitality, revive; to regain validity; to nourish; to spare (the life of someone or something); to ignite; to illuminate; of events: to happen more quickly; of clouds; to form”) [and other forms], from quiken (“to come to life; to become alive again after dying; to give or regain vitality, revive; of a seed: to germinate, grow; to arouse (anger); to inspire; to reinforce, strengthen; to make (a substance) alchemically active; to nourish, sustain; to sharpen; to ignite; to illuminate; of news: to spread”) + -en (suffix forming the infinitive forms of verbs). Quiken is derived from Old English cwician (“to bring to life, vivify; to come to life, become living; to quicken”), from cwic (“alive, live, living; mentally agile; intelligent, keen”) (ultimately from Proto-Germanic *kwikwaz (“alive; lively; quick”) and Proto-Indo-European *gʷeyh₃- (“to live”)) + -ian (suffix forming verbs from adjectives and nouns). The English word may be analysed as quick (“moving with swiftness; occurring in a short time; (archaic) alive, living; (archaic) pregnant”) +‎ -en (suffix attached to some adjectives forming transitive verbs meaning ‘to make [adjective]’)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "quicken (third-person singular simple present quickens, present participle quickening, simple past and past participle quickened)",
          "definitionGroups": [
            {
              "group": "Senses relating to life or states of activity.",
              "entries": [
                {
                  "meaning": "(transitive)",
                  "examples": [
                    "Synonyms: motivate, stir up"
                  ]
                },
                {
                  "meaning": "To put (someone or something) in a state of activity or vigour comparable to life; to excite, to rouse.",
                  "examples": [
                    "Synonyms: motivate, stir up"
                  ]
                },
                {
                  "meaning": "To inspire or stimulate (an action, a feeling, etc.).",
                  "examples": []
                },
                {
                  "meaning": "To stimulate or assist the fermentation of (an alcoholic beverage, dough, etc.).",
                  "examples": []
                },
                {
                  "meaning": "(literary, also figuratively) To give life to (someone or something never alive or once dead); to animate, to resurrect, to revive. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To make or help (something) to burn.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To make (a drug, liquor, etc.) more effective or stimulating.",
                  "examples": []
                },
                {
                  "meaning": "(passive) Of a pregnant woman: to be in the state of reaching the stage of pregnancy at which the movements of the foetus are first felt.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive)",
                  "examples": []
                },
                {
                  "meaning": "To take on a state of activity or vigour comparable to life; to be excited or roused. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "To grow bright; to brighten.",
                  "examples": []
                },
                {
                  "meaning": "Of an alcoholic beverage, dough, etc.: to ferment.",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) Of a pregnant woman: to first feel the movements of the foetus, or reach the stage of pregnancy at which this takes place; of a foetus: to begin to move. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(literary, also figuratively)",
                  "examples": []
                },
                {
                  "meaning": "To give life; to make alive.",
                  "examples": []
                },
                {
                  "meaning": "To come back to life, to receive life. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(rare) To inspire or stimulate.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Senses relating to speed.",
              "entries": [
                {
                  "meaning": "(transitive)",
                  "examples": [
                    "Synonym: accelerate"
                  ]
                },
                {
                  "meaning": "To make (something) quicker or faster; to hasten, speed up. [from 17th c.]",
                  "examples": [
                    "Synonym: accelerate"
                  ]
                },
                {
                  "meaning": "(construction, nautical (shipbuilding), archaic) To shorten the radius of (a curve); to make (a curve) sharper, or (an incline) steeper.",
                  "examples": [
                    "to quicken the sheer, that is, to make its curve more pronounced"
                  ]
                },
                {
                  "meaning": "(intransitive) To become quicker or faster. [from 17th c.]",
                  "examples": [
                    "My heartbeat quickened when I heard him approach."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From quick(silver) (“mercury”) +‎ -en ((obsolete) suffix forming the infinitive forms of verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "quicken (third-person singular simple present quickens, present participle quickening, simple past and past participle quickened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To apply quicksilver (mercury) to (something); to combine (something) with quicksilver; to quicksilver.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English quiken (“(chiefly in place names) probably the European rowan or mountain ash (Sorbus aucuparia), and possibly also the aspen (Populus tremula), juniper (genus Juniperus, specifically the common juniper (Juniperus communis)), or service tree (Sorbus domestica)”), possibly from Old English cwician (“to bring to life, vivify; to come to life, become living; to quicken”) (see etymology 1)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quicken (plural quickens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Ireland, Northern England) In full quicken tree: the European rowan, rowan, or mountain ash (Sorbus aucuparia). [from 15th c.]",
                  "examples": [
                    "Synonyms: quickbeam, quick tree"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English quiken (“couch grass (Elymus repens); a leguminous plant, vetch”) [and other forms], a variant of quich, quik (“couch grass (Elymus repens); a leguminous plant, vetch”) [and other forms] (whence modern English quick, quitch (“couch grass, quitchgrass”); the -en element remains unexplained), from Old English cwiċe (“couch grass”), ultimately from Proto-Germanic *kwikwaz (“alive; lively; quick”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quicken (countable and uncountable, plural quickens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Midlands (northern), Northern England, Northern Ireland, Scotland) Synonym of couch grass (“a species of grass, Elymus repens”); also (chiefly in the plural), the underground rhizomes of this, and sometimes other grasses.",
                  "examples": [
                    "Synonyms: dog grass, quackgrass, quickens, quick grass, quitch, quitch grass, scutch grass, twitch, witchgrass"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}