{
  "word": "attrition",
  "etymologies": [
    {
      "description": [
        "15th century, learned borrowing from Latin attritio (“a rubbing against”), from the verb attritus, past participle of atterere (“to wear”), from ad- (“to, towards”) +‎ terere (“to rub”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "attrition (countable and uncountable, plural attritions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Grinding down or wearing away by friction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The gradual reduction in a tangible or intangible resource due to causes that are passive and do not involve productive use of the resource.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(human resources) A gradual, natural reduction in membership or personnel, as through retirement, resignation, or death.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) The loss of participants during an experiment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology) Imperfect contrition or remorse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dentistry) The wearing of teeth due to their grinding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) The loss of a first or second language or a portion of that language.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "attrition (third-person singular simple present attritions, present participle attritioning, simple past and past participle attritioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grind or wear down through friction.",
                  "examples": [
                    "Synonym: attrit",
                    "attritioned teeth; attritioned rock"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce the number of (jobs or workers) by not hiring new employees to fill positions that become vacant (often with out).",
                  "examples": [
                    "[…]  but the heart of the health services in New York will have to attrition out some 3,000 to 5,000 jobs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To undergo a reduction in number.",
                  "examples": [
                    "The cohort of one hundred students had attritioned to sixty by the end of secondary school."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}