{
  "word": "scurvy",
  "etymologies": [
    {
      "description": [
        "Noun usage possibly from the adjective scurvy influenced by or a variant of scurfy. Took on meaning of Dutch scheurbuik, French scorbut (“scurvy”), possibly from Old Norse skyrbjúgr, skyr (“sour milk”) + bjúgr (“swelling, tumour”), from the verb bjúga (“to bend”), whence Icelandic skyrbjúgur (“scurvy”) and Swedish skörbjugg (“scurvy”).",
        "Compare German Scharbock, Late Latin scorbutus. More at sour, bow.",
        "Or, equivalent to scurf (“flakes on the surface of the skin”) +‎ -y."
      ],
      "adjectives": [
        {
          "description": "scurvy (comparative scurvier, superlative scurviest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Covered or affected with scurf or scabs; scabby; scurfy; specifically, diseased with the scurvy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Contemptible, despicable, low, disgustingly mean.",
                  "examples": [
                    "a scurvy trick; a scurvy knave"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "Noun usage possibly from the adjective scurvy influenced by or a variant of scurfy. Took on meaning of Dutch scheurbuik, French scorbut (“scurvy”), possibly from Old Norse skyrbjúgr, skyr (“sour milk”) + bjúgr (“swelling, tumour”), from the verb bjúga (“to bend”), whence Icelandic skyrbjúgur (“scurvy”) and Swedish skörbjugg (“scurvy”). Compare German Scharbock, Late Latin scorbutus. More at sour, bow. Or, equivalent to scurf (“flakes on the surface of the skin”) +‎ -y.",
          "definitionGroups": []
        },
        {
          "description": "scurvy (usually uncountable, plural scurvies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pathology) A disease caused by insufficient intake of vitamin C, leading to the formation of livid spots on the skin, spongy gums, loosening of the teeth and bleeding into the skin and from almost all mucous membranes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}