{
  "word": "charger",
  "etymologies": [
    {
      "description": [
        "From Middle English chargere, equivalent to charge +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "charger (plural chargers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device that charges or recharges.",
                  "examples": [
                    "Put the batteries in the charger overnight so we can use them tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who charges.",
                  "examples": [
                    "That attack may damage the homosexual, but even as he is hurt, he also feels superior, because he is not a bull—a blind, stupid animal. Rather, he is an aesthete—a tweaker, not a charger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, military) A large horse trained for battle and used by the cavalry (of a lighter build than a destrier).",
                  "examples": [
                    "The knight rode a white charger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large platter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large decorative plate, sometimes used under dinner plates or other savoury-dish vessels in a multi-course meal; also service plate or underplate.",
                  "examples": [
                    "The fancy restaurant used a white porcelain charger when serving."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) A speed loader that holds several cartridges together in a single unit for easier loading of a firearm's magazine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(prison) A rectal concealment container for prohibited material such as money, drugs and tools.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of hard charger (“person with a good work ethic”)",
                  "examples": [
                    "Miller had a new executive officer, a real charger, as they're known in the trade, who was looking into all aspects of the operation up there."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}