{
  "word": "tittle",
  "etymologies": [
    {
      "description": [
        "From Middle English tytle, titel, titele, from Anglo-Norman titil, titule and Medieval Latin titulus (“small stroke, diacritical mark, accent”), from Latin titulus (“title”). Doublet of tilde, titer/titre, title, titlo, and titulus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tittle (plural tittles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) Any small dot, stroke, or diacritical mark, especially if part of a letter, or if a letter-like abbreviation; in particular, the dots over the Latin letters i and j.",
                  "examples": [
                    "The foure pricks or tittles are these. The first is a full prick or period. The second is a comma or crooked tittle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A small, insignificant amount (of something); a modicum or speck.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English titillen, tytyllen, perhaps variants of Middle English tutelen (“to whisper, chatter”), from tutel (“mouth”), from Old English *tūtel, *tȳtel, related to Old Frisian tūte (“mouth”). Compare Middle English touten (“to jut out, project, protrude”), Middle English toute (“projection, mound, hill”), Middle Dutch tûte (whence modern Dutch tuit (“spout, nozzle, nose, point, peak, summit”)), Old Norse túta (“a teat-like prominence”), Danish tude (“spout”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "tittle (third-person singular simple present tittles, present participle tittling, simple past and past participle tittled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) To chatter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}