{
  "word": "lost",
  "etymologies": [
    {
      "description": [
        "From Middle English loste, losede (preterite) and Middle English lost, ilost, ilosed (past participle), from Old English losode (preterite) and Old English losod, ġelosod, equivalent to lose +‎ -t."
      ],
      "adjectives": [
        {
          "description": "lost (comparative loster or more lost, superlative lostest or most lost)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having wandered from, or unable to find, the way.",
                  "examples": [
                    "The children were soon lost in the forest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In an unknown location; unable to be found.",
                  "examples": [
                    "Deep beneath the ocean, the Titanic was lost to the world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not perceptible to the senses; no longer visible.",
                  "examples": [
                    "an island lost in a fog; a person lost in a crowd"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Parted with; no longer held or possessed.",
                  "examples": [
                    "a lost limb; lost honour"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not employed or enjoyed; thrown away; employed ineffectually; wasted; squandered.",
                  "examples": [
                    "a lost day; a lost opportunity or benefit; no time should be lost"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ruined or destroyed, either physically or morally; past help or hope.",
                  "examples": [
                    "a ship lost at sea; a woman lost to virtue; a lost soul"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hardened beyond sensibility or recovery; alienated; insensible.",
                  "examples": [
                    "lost to shame; lost to all sense of honour"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Occupied with, or under the influence of, something, so as not to notice external things.",
                  "examples": [
                    "to be lost in thought"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "lost",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense and past participle of lose",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}