{
  "word": "busy",
  "etymologies": [
    {
      "description": [
        "From Middle English bisy, busie, from Old English bisiġ (“busy, occupied, diligent”), from Proto-West Germanic *bisīg (“diligent; zealous; busy”). Cognate with Saterland Frisian biesich (“active, diligent, hard-working, industrious”), Dutch bezig (“busy”), Low German besig (“busy”), Old Frisian bisgia (“to use”), Old English bisgian (“to occupy, employ, trouble, afflict”). The spelling with ⟨u⟩ represents the pronunciation of the West Midland and Southern dialects while the Modern English pronunciation with /ɪ/ is from the dialects of the East Midlands."
      ],
      "adjectives": [
        {
          "description": "busy (comparative busier, superlative busiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Crowded with business or activities; having a great deal going on.",
                  "examples": [
                    "Be careful crossing that busy street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Engaged in activity or by someone else.",
                  "examples": [
                    "The director cannot see you now: he's busy.",
                    "Her telephone has been busy all day.",
                    "He is busy with piano practice.",
                    "They are busy getting ready for the annual meeting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a lot going on; complicated or intricate.",
                  "examples": [
                    "Flowers, stripes, and checks in the same fabric make for a busy pattern."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Officious; meddling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "busy (plural busies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, UK, Liverpudlian, derogatory) A police officer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "busy (third-person singular simple present busies, present participle busying, simple past and past participle busied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, usually reflexive) To make somebody busy or active; to occupy.",
                  "examples": [
                    "On my vacation I'll busy myself with gardening."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rush somebody.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}