{
  "word": "glaive",
  "etymologies": [
    {
      "description": [
        "From Middle English gleyve (“lance, glaive”), from Old French glaive (“lance; sword”), from Late Latin glavus. The further etymology is uncertain; one possibility is that glavus reflects Latin gladius (“sword”) crossed with clāva (“club”); another is that it derives from a re-crossing of gladius with Proto-Celtic *kladiwos (“sword”); yet another is that it is a borrowing into Late Latin from Old Irish claideb. All of the aforementioned words derive ultimately from Proto-Indo-European *kelh₂- (“to beat; to break”). The Oxford English Dictionary notes that none of these words had the oldest meaning of Old French glaive (“lance”). The English word is cognate with Middle Dutch glavie, glaye (“lance”); Middle High German glavîe, glævîn (“lance”), Swedish glaven (“lance”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "glaive (plural glaives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, historical) A light lance with a long, sharp-pointed head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A weapon consisting of a pole with a large blade fixed on the end, the edge of which is on the outside curve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(loosely or poetic, archaic) A sword, particularly a broadsword.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}