{
  "word": "quantity",
  "etymologies": [
    {
      "description": [
        "From Middle English quantite, from Old French quantité, from Latin quantitās (“quantity”), from quantus (“how much”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quantity (countable and uncountable, plural quantities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fundamental, generic term used when referring to the measurement (count, amount) of a scalar, vector, number of items or to some other way of denominating the value of a collection or group of items.",
                  "examples": [
                    "You have to choose between quantity and quality."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An indefinite amount of something.",
                  "examples": [
                    "Some soap making oils are best as base oils, used in a larger quantity in the soap, while other oils are best added in a small quantity.",
                    "Olive oil can be used practically in any quantity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specific measured amount.",
                  "examples": [
                    "This bag would normally costs $497.50 for a quantity of 250, at a price of $1.99 per piece.",
                    "Generally it should not be used in a quantity larger than 15 percent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A considerable measure or amount.",
                  "examples": [
                    "The Boeing P-26A was the first all-metal monoplane fighter produced in quantity for the U.S. Army Air Corps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metrology) Property of a phenomenon, body, or substance, where the property has a magnitude that can be expressed as number and a reference.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Indicates that the entire preceding expression is henceforth considered a single object.",
                  "examples": [
                    "x plus y quantity squared equals x squared plus 2xy plus y squared."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonology) Length of sounds.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}