{
  "word": "fuck",
  "etymologies": [
    {
      "description": [
        "From Middle English *fukken, probably of Germanic origin: either from Old English *fuccian or Old Norse *fukka, both from Proto-Germanic *fukkōną, from Proto-Indo-European *pewǵ- (“to strike, punch, stab”). Compare windfucker and its debated etymology.",
        "Possibly attested in a 772 AD charter that mentions a place called Fuccerham, which may mean \"ham (“home”) of the fucker\" or \"hamm (“pasture”) of the fucker\"; a John le Fucker in a record from 1278 may just be a variant of Fulcher, like Fucher, Foker, etc. The earliest unambiguous use of the word in a clearly sexual context, in any stage of English, appears to be in court documents from Cheshire, England, which mention a man called \"Roger Fuckebythenavele\" (possibly tongue-in-cheek, or directly suggestive of a depraved sexual act) on December 8, 1310. It was first listed in a dictionary in 1598. Scots fuk/fuck is attested slightly earlier, probably reinforcing the Northern Germanic/Scandinavian origin theory. From 1500 onward, the word has been in continual use, superseding jape and sard and largely displacing swive.",
        "A range of folk-etymological backronyms, such as \"fornication under consent of the king\" and \"for unlawful carnal knowledge\", are all demonstrably false.",
        "Sense 10, from related sense feck."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "fuck (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial) Used as an intensifier for the words \"yes\" and \"no\".",
                  "examples": [
                    "Synonyms: hell, god, shit, heck",
                    "Do you censor your swearing? – Fuck no."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "fuck (plural fucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial) An act of sexual intercourse.",
                  "examples": [
                    "Synonyms: see Thesaurus:copulation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial) A sexual partner, especially a casual one.",
                  "examples": [
                    "Synonyms: see Thesaurus:sexual partner"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial) A highly contemptible person.",
                  "examples": [
                    "Synonyms: dickhead; see also Thesaurus:jerk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial) The smallest amount of concern or consideration.",
                  "examples": [
                    "Synonyms: shit, damn",
                    "I don't give a fuck."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fuck (third-person singular simple present fucks, present participle fucking, simple past and past participle fucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial, intransitive) To have sexual intercourse; to copulate.",
                  "examples": [
                    "Synonyms: bang, do it, eff, have sex, hump, screw, shag; see also Thesaurus:copulate",
                    "Fighting for peace is like fucking for virginity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial, transitive) To have sexual intercourse with.",
                  "examples": [
                    "Synonyms: bang, eff, give someone one, hump, ream, screw, shag; see also Thesaurus:copulate with"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial, transitive) To insert one's penis, a dildo, or other object, into a person or a specified orifice or cleft sexually; to penetrate.",
                  "examples": [
                    "We decided to switch things around and have him fuck me tonight.",
                    "fuck me in the ass, really fuck my ass",
                    "A skinny, boyish-looking guy getting fucked by a huge muscle man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial) To put in an extremely difficult or impossible situation.",
                  "examples": [
                    "I'm afraid they're gonna fuck you on this one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial) To defraud, deface, or otherwise treat badly.",
                  "examples": [
                    "I got fucked at the used car lot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial, often derogatory) Used to express great displeasure with, or contemptuous dismissal of, someone or something.",
                  "examples": [
                    "Synonyms: bugger, eff, to hell with, screw",
                    "Fuck those jerks, and fuck their stupid rules!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial, usually followed by up) To break, to destroy.",
                  "examples": [
                    "Synonyms: annihilate, obliterate, ruin; see also Thesaurus:destroy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, colloquial) Used in a phrasal verb: fuck with (“to play with, to tinker”).",
                  "examples": [
                    "Synonyms: mess, toy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, transitive, comedy) To make a joke at one's expense; to make fun of in an embarrassing manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, vulgar, transitive, Ireland, Britain, Scotland) To throw, to lob something. (angrily)",
                  "examples": [
                    "Synonym: feck",
                    "He fucked the dirty cloth out the window.",
                    "She fucked her mobile at his head in anger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Singapore, vulgar, military slang) To scold.",
                  "examples": [
                    "The sergeant fucked me upside down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, vulgar, intransitive) To be very good, to rule, go hard.",
                  "examples": [
                    "Yo dude, did you check out their new album? Shit fucks bro."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}