{
  "word": "fosterage",
  "etymologies": [
    {
      "description": [
        "foster +‎ -age"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fosterage (countable and uncountable, plural fosterages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of fostering another's child as if it were one's own.",
                  "examples": [
                    "[…]  it was worthy of extraordinary note, how that upstart family of the Kings of Pergamus had raised it selfe to marvellous greatnesse, in very short space, from the condition of meere slavery: whereof a principall cause was, the brotherly love maintained by them, with singular commendation of their pietie. Neither was Philip ignorant of these examples; but is said to have propounded the last of them, to his owne children, as a patterne for them to imitate. Certainely hee had reason so to doe: not more in regard of the benefit which his enemies reaped by their concord, than in remembrance of the tender fosterage, wherewith King Antigonus his Tutor had faithfully cherished him in his minoritie."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of caring for another human being or animal.",
                  "examples": [
                    "I do acknowledg my self not to be a little beholding to the Italian and Spanish Treatises; though without my fosterage, and bringing up under the Generosities and Bounties of my Noble Patrons and Masters, I could never have arrived to this Experience."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The condition of being the foster child.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of promoting or encouraging something.",
                  "examples": [
                    "The effect of a duelling spirit, on the heart that nourishes it, is of a most deplorable character. This self-vindicating spirit, gradually destroys a man’s confidence in the integrity, intelligence, and enlightened impartiality of those around him.  […]  he will heed as little the lofty generous enterprises that kindle upon the moral world, as a caverned bear the luminous expanse of the glittering heaven. The spirit which he fosters has this tendency, and if the fosterage is persevered in, will have this effect."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}