{
  "word": "haul",
  "etymologies": [
    {
      "description": [
        "From Middle English hālen, hailen, haulen, halien (“to drag, pull; to draw up”), from Old French haler (“to haul, pull”), from Frankish *halōn (“to drag, fetch, haul”) or Middle Dutch halen (“to drag, fetch, haul”), possibly merging with Old English *halian (“to haul, drag”); all from Proto-Germanic *halōną, *halēną, *hulōną (“to call, fetch, summon”), from Proto-Indo-European *kelh₁- (“to call, cry, summon”). The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "haul (plural hauls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of hauling or pulling, particularly with force; a (violent) pull or tug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The distance over which something is hauled or transported, especially if long.",
                  "examples": [
                    "Getting to his place was a real haul.",
                    "I find long-haul travel by airplane tiring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amount of something that has been taken, especially of fish, illegal loot, or items purchased on a shopping trip.",
                  "examples": [
                    "The robber’s haul was over thirty items.",
                    "The trawler landed a ten-ton haul."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) Short for haul video (“video posted on the Internet consisting of someone showing and talking about recently purchased items”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ropemaking) A bundle of many threads to be tarred.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, soccer) Four goals scored by one player in a game.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "haul (third-person singular simple present hauls, present participle hauling, simple past and past participle hauled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To transport by drawing or pulling, as with horses or oxen, or a motor vehicle.",
                  "examples": [
                    "to haul logs to a sawmill"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To draw or pull something heavy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carry or transport something, with a connotation that the item is heavy or otherwise difficult to move.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To drag, to pull, to tug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) Followed by up: to summon to be disciplined or held answerable for something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pull apart, as oxen sometimes do when yoked.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, nautical) To steer (a vessel) closer to the wind.",
                  "examples": [
                    "Antonym: veer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) Of the wind: to shift fore (more towards the bow).",
                  "examples": [
                    "Antonym: veer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, colloquial) To haul ass (“go fast”).",
                  "examples": [
                    "“How fast was he goin’?” / “I don’t know exactly, but he must’ve been haulin’, given where he landed.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}