{
  "word": "sympathize",
  "etymologies": [
    {
      "description": [
        "From French sympathiser. Displaced native Old English efnþrōwian (literally “to suffer with or together”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sympathize (third-person singular simple present sympathizes, present participle sympathizing, simple past and past participle sympathized) (Canada, US)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have, show or express sympathy; to be affected by feelings similar to those of another, in consequence of knowing the person to be thus affected.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To support, favour, have sympathy (with a political cause or movement, a side in a conflict / in an action).",
                  "examples": [
                    "‘ […]  who is to hunt up my witnesses? All of them are sailors, drafted off to other ships, except those whose evidence would go for very little, as they took part, or sympathised in the affair.  […] ’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say in an expression of sympathy.",
                  "examples": [
                    "“How much he slapped my sons—you should see their swollen faces, Panditji,” said Dukhi.  […]",
                    "“Poor children,” sympathized Pandit Lallaram."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have a common feeling, as of bodily pleasure or pain.",
                  "examples": [
                    "[…]  the mind will sympathize so much with the anguish and debility of the body, that it will be  […]  too distracted to fix itself in meditation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To share (a feeling or experience).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To agree; to be in accord; to harmonize.",
                  "examples": [
                    "Green, for example, is a pleasing Colour, which may come from a blue and a yellow mix’d together, and by consequence blue and yellow are two Colours which sympathize:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}