{
  "word": "arbiter",
  "etymologies": [
    {
      "description": [
        "From Middle English arbiter, arbytour, arbitre, from Old French arbitre, from Latin arbiter (“a witness, judge, literally one who goes to see”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "arbiter (plural arbiters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person appointed, or chosen, by parties to determine a controversy between them; an arbitrator.",
                  "examples": [
                    "In order to protect individual liberty there must be an arbiter between the governing powers and the governed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with of) A person or object having the power of judging and determining, or ordaining, without control; one whose power of deciding and governing is not limited.",
                  "examples": [
                    "Television and film, not Vogue and similar magazines, are the arbiters of fashion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A component in circuitry that allocates scarce resources.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "arbiter (third-person singular simple present arbiters, present participle arbitering, simple past and past participle arbitered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To act as arbiter.",
                  "examples": [
                    "Worse, since there was no institution to arbiter disagreements between Parliament and the government, whenever Parliament voted against the government on the smallest issues, coalitions fragmented, and governments had to be recomposed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}