{
  "word": "huddle",
  "etymologies": [
    {
      "description": [
        "From Middle English *hudelen, alteration (due to hudels, hidels (“hiding place”), see hiddle) of *huderen, hoderen (“to cover; press together; huddle”), a frequentative form of Middle English huden, hiden (“to hide”), equivalent to hide +‎ -le and/or hide +‎ -er. Compare Low German huderken (“to brood; coddle; nurse; lull children to sleep”)."
      ],
      "adjectives": [
        {
          "description": "huddle (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Huddled, confused, congested.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "huddle (plural huddles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dense and disorderly crowd.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A brief meeting of all the players from one team that are on the field with the purpose of planning the following play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge) A hesitation during play to think about one's next move.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "huddle (third-person singular simple present huddles, present participle huddling, simple past and past participle huddled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To crowd together.",
                  "examples": [
                    "The sheep huddled together seeking warmth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To curl one's legs up to the chest and keep one's arms close to the torso; to crouch; to assume a position similar to that of an embryo in the womb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To get together and discuss a topic.",
                  "examples": [
                    "George Hirsch, chairman of the board of Road Runners, said officials huddled all day Friday, hoping to devise an alternate race. They considered replacing the marathon with a race that would comprise the final 10 miles of marathon, starting at the base of the Queensboro 59th Street Bridge on the Manhattan side. But that was not deemed plausible, Mr. Hirsch said."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, American football) To form a huddle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To crowd (things) together; to mingle confusedly; to assemble without order or system.",
                  "examples": [
                    "Our adversary, huddling several suppositions together, […] makes a medley and confusion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To do, make, or put, in haste or roughly; hence, to do imperfectly; usually with a following preposition or adverb (huddle on, huddle up, huddle together).",
                  "examples": [
                    "Huddle up a peace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge, intransitive) To hesitate during play while thinking about one's next move.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}