{
  "word": "obliterate",
  "etymologies": [
    {
      "description": [
        "Learned borrowing from Latin obliterātus, oblitterātus (“having been blotted out, effaced, erased; having been forgotten”) + English -ate (suffix meaning ‘to act in [the specified manner]’ forming verbs, and ‘characterized by [the specified thing]’ forming adjectives). Obliterātus and oblitterātus are respectively the perfect passive participles of obliterō and oblitterō (“to blot out, efface, erase, obliterate; to cause to be forgotten”), probably either:"
      ],
      "adjectives": [
        {
          "description": "obliterate (comparative more obliterate, superlative most obliterate) (obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(except poetic) Completely destroyed or erased; effaced, obliterated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology, rare) Of markings on an insect: difficult to distinguish from the background; faint, indistinct.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "obliterate (third-person singular simple present obliterates, present participle obliterating, simple past and past participle obliterated)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To destroy (someone or something) completely, leaving no trace; to annihilate, to wipe out.",
                  "examples": [
                    "Synonyms: bedash, do away with, eradicate, extirpate, raze, uproot; see also Thesaurus:destroy"
                  ]
                },
                {
                  "meaning": "To hide (something) by covering it; to conceal, to obscure.",
                  "examples": [
                    "The rainclouds oblierated the sun as they swept across the sky."
                  ]
                },
                {
                  "meaning": "(also figuratively) To make (a drawing, text which is printed or written, etc.) indecipherable, either by erasing or obscuring it; to blot out, to efface, to delete.",
                  "examples": []
                },
                {
                  "meaning": "(biology, pathology, chiefly passive) To close up or fill (a body cavity, vessel, etc.) with tissue.",
                  "examples": []
                },
                {
                  "meaning": "(philately) To cancel (a postage stamp) with a postmark so it cannot be reused.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To destroy completely, leaving no trace.",
                  "examples": []
                },
                {
                  "meaning": "(biology, pathology) Of a body cavity, vessel, etc.: to close up or fill with tissue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}