{
  "word": "determine",
  "etymologies": [
    {
      "description": [
        "From Middle English determinen, from Old French determiner, French déterminer, from Latin determināre (“to bound, limit, prescribe, fix, determine”), from de + termināre (“to limit”), from terminus (“bound, limit, end”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "determine (third-person singular simple present determines, present participle determining, simple past and past participle determined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To set the boundaries or limits of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To ascertain definitely; to figure out, find out, or conclude by analyzing, calculating, or investigating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fix the form or character of; to shape; to prescribe imperatively; to regulate; to settle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fix the course of; to impel and direct; with a remoter object preceded by to.",
                  "examples": [
                    "The news of his father's illness determined him to depart immediately."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bring to a conclusion, as a question or controversy; to settle authoritative or judicial sentence; to decide.",
                  "examples": [
                    "The court has determined the cause."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To resolve (to do something); to establish a fixed intention; to cause (something) to come to a conclusion or decision; to lead.",
                  "examples": [
                    "I determined to go home at once."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) To define or limit by adding a differentia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, otherwise obsolete) To bring to an end; to finish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}