{
  "word": "advice",
  "etymologies": [
    {
      "description": [
        "From Middle English avys, from Old French avis, from the phrase ce m'est a vis (\"in my view\"), where vis is from Latin visus, past participle of videre (“to see”). See vision, and compare avise, advise. The unhistoric -d- was introduced in English 15c. Doublet of aviso.",
        "Displaced native Old English rǣd."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "advice (countable and uncountable, plural advices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) An opinion offered to guide behavior in an effort to be helpful.",
                  "examples": [
                    "She was offered various pieces of advice on what to do with her new-found wealth.",
                    "On the advice of her doctor, Mary cut down on her carbohydrates.",
                    "I have some useful advice to give you.",
                    "Sushil never took the advice of his parents, but still became rich."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Deliberate consideration; knowledge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, commonly in plural) Information or news given; intelligence",
                  "examples": [
                    "late advices from France"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) In language about financial transactions executed by formal documents, an advisory  document.",
                  "examples": [
                    "An advice of an incoming settlement payment order may be given to an off-line receiving bank."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) In commercial language, information communicated by letter; used chiefly in reference to drafts or bills of exchange",
                  "examples": [
                    "a letter of advice"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, law) A communication providing information, such as how an uncertain area of law might apply to possible future actions",
                  "examples": [
                    "An advice issued by a Monitoring Committee could be applicable in a Dutch court"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, law) Counseling to perform a specific legal act.",
                  "examples": [
                    "An honest oath taken under advice of counsel, therefore, is not perjury"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, law) Counseling to perform a specific illegal act.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, programming) In aspect-oriented programming, the code whose execution is triggered when a join point is reached.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "advice",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of advise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}