{
  "word": "cross",
  "etymologies": [
    {
      "description": [
        "From Middle English cross, cros, from Old English cros (“rood, cross”), from Old Norse kross (“cross”), perhaps from Old Irish cros (compare Welsh croes, Irish crois), from Latin crux (cruci). Cognate with Icelandic kross (“cross”), Faroese krossur (“cross”), Danish kors (“cross”), Swedish kors (“cross”), German Kreuz (“cross”), Dutch kruis (“cross”). In this sense displaced native Middle English rood, from Old English rōd; see rood.\nThe sense of \"two intersecting lines drawn or cut on a surface; two lines intersecting at right angles\" without regard to religious signification develops from the late 14th century."
      ],
      "adjectives": [
        {
          "description": "cross (comparative crosser, superlative crossest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Transverse; lying across the main direction.",
                  "examples": [
                    "At the end of each row were cross benches which linked the rows."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Opposite, opposed to.",
                  "examples": [
                    "His actions were perversely cross to his own happiness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Opposing, adverse; being contrary to what one would hope or wish for.",
                  "examples": [
                    "As a fat body is more subject to diseases, so are rich men to absurdities and fooleries, to many casualties and cross inconveniences."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) Bad-tempered, angry, annoyed.",
                  "examples": [
                    "She was rather cross about missing her train on the first day of the job.",
                    "Please don't get cross at me. (or) Please don't get cross with me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made in an opposite direction, or an inverse relation; mutually inverse; interchanged.",
                  "examples": [
                    "cross interrogatories",
                    "cross marriages, as when a brother and sister marry persons standing in the same relation to each other"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Of the sea, having two wave systems traveling at oblique angles, due to the wind over shifting direction or the waves of two storm systems meeting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cross (plural crosses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A geometrical figure consisting of two straight lines or bars intersecting each other such that at least one of them is bisected by the other.",
                  "examples": [
                    "Put a cross for a wrong answer and a tick for a right one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) Any geometric figure having this or a similar shape, such as a cross of Lorraine or a Maltese cross.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden post with a perpendicular beam attached and used (especially in the Roman Empire) to execute criminals (by crucifixion).",
                  "examples": [
                    "Criminals were commonly executed on a wooden cross."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) Usually with the: the cross on which Christ was crucified.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A hand gesture made in imitation of the shape of the Cross.",
                  "examples": [
                    "She made the cross after swearing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A modified representation of the crucifixion stake, worn as jewellery or displayed as a symbol of religious devotion.",
                  "examples": [
                    "She was wearing a cross on her necklace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, from Christ's bearing of the cross) A difficult situation that must be endured.",
                  "examples": [
                    "It's a cross I must bear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of going across; the act of passing from one side to the other",
                  "examples": [
                    "A quick cross of the road."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) An animal or plant produced by crossbreeding or cross-fertilization.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A hybrid of any kind.",
                  "examples": [
                    "Toning down the ancient Viking into a sort of a cross between Paul Jones and Jeremy Diddler"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing) A hook thrown over the opponent's punch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) A pass in which the ball is kicked from a side of the pitch to a position close to the opponent’s goal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where roads intersect and lead off in four directions; a crossroad (common in UK and Irish place names such as Gerrards Cross).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A monument that marks such a place. (Also common in UK or Irish place names such as Charing Cross)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A coin stamped with the figure of a cross, or that side of such a piece on which the cross is stamped; hence, money in general.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Ireland) Church lands.",
                  "examples": [
                    "the church-lands lying within the same, which were called the Cross"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A line drawn across or through another line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surveying) An instrument for laying of offsets perpendicular to the main course.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pipe-fitting with four branches whose axes usually form a right angle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Rubik's Cube) Four edge cubies of one side that are in their right places, forming the shape of a cross.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) The thirty-sixth Lenormand card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) crossfire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [
        {
          "description": "cross",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) across",
                  "examples": [
                    "She walked cross the mountains."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "cross product of the previous vector and the following vector.",
                  "examples": [
                    "The Lorentz force is q times v cross B."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [
        {
          "description": "cross (third-person singular simple present crosses, present participle crossing, simple past and past participle crossed)",
          "definitionGroups": [
            {
              "group": "To make or form a cross.",
              "entries": [
                {
                  "meaning": "To place across or athwart; to cause to intersect.",
                  "examples": [
                    "She frowned and crossed her arms."
                  ]
                },
                {
                  "meaning": "To lay or draw something across, such as a line.",
                  "examples": [
                    "to cross the letter t"
                  ]
                },
                {
                  "meaning": "To mark with an X.",
                  "examples": [
                    "Cross the box which applies to you."
                  ]
                },
                {
                  "meaning": "To write lines of text at right angles to and over the top of one another in order to save paper.W",
                  "examples": []
                },
                {
                  "meaning": "(reflexive, to cross oneself) To make the sign of the cross over oneself.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To make the sign of the cross over (something or someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": "To move relatively.",
              "entries": [
                {
                  "meaning": "(transitive) To go from one side of (something) to the other.",
                  "examples": [
                    "Why did the chicken cross the road?",
                    "You need to cross the street at the lights."
                  ]
                },
                {
                  "meaning": "(intransitive) To travel in a direction or path that will intersect with that of another.",
                  "examples": [
                    "Ships crossing from starboard have right-of-way."
                  ]
                },
                {
                  "meaning": "(transitive) To pass, as objects going in an opposite direction at the same time.",
                  "examples": [
                    "Your kind letter crossed mine."
                  ]
                },
                {
                  "meaning": "(sports) Relative movement by a player or of players.",
                  "examples": [
                    "He crossed the ball into the penalty area."
                  ]
                },
                {
                  "meaning": "(cricket, reciprocally) Of both batsmen, to pass each other when running between the wickets in order to score runs.",
                  "examples": []
                },
                {
                  "meaning": "(soccer) To pass the ball from one side of the pitch to the other side.",
                  "examples": [
                    "He crossed the ball into the penalty area."
                  ]
                },
                {
                  "meaning": "(rugby) To score a try.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(social) To oppose.",
              "entries": [
                {
                  "meaning": "(transitive) To contradict (another) or frustrate the plans of.",
                  "examples": [
                    "\"You'll rue the day you tried to cross me, Tom Hero!\" bellowed the villain."
                  ]
                },
                {
                  "meaning": "(transitive, obsolete) To interfere and cut off ; to debar.",
                  "examples": []
                },
                {
                  "meaning": "(law) To conduct a cross examination; to question a hostile witness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) To cross-fertilize or crossbreed.",
                  "examples": [
                    "They managed to cross a sheep with a goat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stamp or mark (a cheque) in such a way as to prevent it being cashed, thus requiring it to be deposited into a bank account.",
                  "examples": [
                    "The English practice of crossing checks so that payment may be made to the bank account or to order is prevalent."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}