{
  "word": "libel",
  "etymologies": [
    {
      "description": [
        "From Middle English libel, from Old French libelle, from Latin libellus (“petition; literally, booklet”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "libel (countable and uncountable, plural libels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A written or pictorial false statement which unjustly seeks to damage someone's reputation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act or tort of displaying such a statement publicly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any defamatory writing; a lampoon; a satire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, countable) A written declaration or statement by the plaintiff of their cause of action, and of the relief they seek.",
                  "examples": [
                    "These provisions of law being in force, the steamer Rio Grande, owned, as was alleged, by persons in Mexico, being in the port of Mobile, in the Southern District of Alabama, certain materialmen, on the 26th of November, 1867, filed separate libels against her in the district court for the said district."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A brief writing of any kind, especially a declaration, bill, certificate, request, supplication, etc.",
                  "examples": [
                    "a libel of forsaking [divorcement]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "libel (third-person singular simple present libels, present participle (UK) libelling or (US) libeling, simple past and past participle (UK) libelled or (US) libeled) (transitive, law)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To defame (someone), especially in a manner that meets the legal definition of libel.",
                  "examples": [
                    "Synonyms: see Thesaurus:defame",
                    "He libelled her when he published that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To proceed against (goods, a ship, etc.) by filing a libel claim.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}